{
  "table_name": "PLACES_DISTRICT_OF_COLUMBIA",
  "table_fullname": "GEO_OPENSTREETMAP_CENSUS_PLACES.GEO_US_CENSUS_PLACES.PLACES_DISTRICT_OF_COLUMBIA",
  "column_names": [
    "ville_principale_msa",
    "code_gnis_lieu",
    "geometrie_interne_point",
    "longitude_interne_point",
    "statut_fonctionnel",
    "code_lsad",
    "surface_eau_meters",
    "latitude_interne_point",
    "code_fips_lieu",
    "surface_terre_meters",
    "nom_lsad",
    "nom_lieu",
    "code_fips_etat",
    "geometrie_lieu",
    "id_lieu",
    "ville_principale_ne",
    "code_classe_fips"
  ],
  "column_types": [
    "BOOLEAN",
    "TEXT",
    "BINARY",
    "FLOAT",
    "TEXT",
    "TEXT",
    "NUMBER",
    "FLOAT",
    "TEXT",
    "NUMBER",
    "TEXT",
    "TEXT",
    "TEXT",
    "BINARY",
    "TEXT",
    "BOOLEAN",
    "TEXT"
  ],
  "description": [
    "Indique si un lieu est la ville principale d'une zone statistique métropolitaine ou micropolitaine. Les polygones définissant les zones statistiques métropolitaines et micropolitaines sont disponibles dans `bigquery-public-data.geo_us_boundaries.us_msa`",
    "Code GNIS actuel du lieu",
    "Représentation géographique du point interne de l'État, qui est le point situé à ou le plus proche du centre géographique de l'État",
    "Longitude du point interne du lieu, qui est le point situé à ou le plus proche du centre géographique du lieu",
    "Code de statut fonctionnel actuel. Une liste complète des résultats possibles peut être trouvée : https://www.census.gov/geo/reference/funcstat.html",
    "Code de description de zone légale/statistique actuel pour chaque lieu. Cela aide à différencier les lieux désignés par le recensement (CDP), qui sont des entités statistiques, et les lieux incorporés, qui sont des entités légales, entre autres différences. Les codes LSAD du recensement et leurs descriptions peuvent être trouvés dans `bigquery-public-data.census_lsad_codes.lsad_codes`",
    "Superficie du lieu qui consiste en eau, en mètres carrés",
    "Latitude du point interne du lieu, qui est le point situé à ou le plus proche du centre géographique du lieu",
    "Code FIPS à cinq chiffres pour le lieu donné",
    "Superficie du lieu qui consiste en terre, en mètres carrés",
    "Nom actuel et description légale/statistique traduite pour le lieu",
    "Nom complet du lieu",
    "Code FIPS à deux chiffres qui identifie de manière unique chaque État. Les noms d'États et leurs codes FIPS correspondants sont disponibles en tant que jeu de données public BigQuery : `bigquery-public-data.census_fips_codes.states_2016`",
    "Représentation géographique du polygone qui définit le périmètre de chaque lieu. Cette colonne doit être utilisée comme la colonne GEO pour la visualisation dans BigQuery Geo Viz",
    "Identifiant unique pour chaque lieu. Il s'agit d'une concaténation du code FIPS actuel de l'État et du code FIPS du lieu",
    "Indique si un lieu est la ville principale d'une zone de ville et de ville de la Nouvelle-Angleterre",
    "Code de classe FIPS actuel"
  ],
  "sample_rows": []
}