{
  "table_name": "txt",
  "table_fullname": "bigquery-public-data.sec_quarterly_financials.txt",
  "column_names": [
    "numero_de_submissao",
    "etiqueta_de_medida",
    "versao",
    "data_de_fim_do_periodo",
    "num_quarters",
    "iprx",
    "linguagem",
    "linguagem_decimal",
    "duracao_fracao",
    "data_fracao",
    "hash_de_dimensao",
    "num_dimensoes",
    "coregistrante",
    "escapado",
    "comprimento_da_fonte",
    "comprimento_do_texto",
    "nota_de_roda_pe",
    "comprimento_da_nota_de_roda_pe",
    "contexto",
    "valor",
    "_PARTITIONTIME"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "TIMESTAMP"
  ],
  "nested_column_names": [
    "numero_de_submissao",
    "etiqueta_de_medida",
    "versao",
    "data_de_fim_do_periodo",
    "num_quartos",
    "iprx",
    "linguagem",
    "linguagem_decimal",
    "fracao_de_duracao",
    "fracao_de_data",
    "hash_de_dimensao",
    "num_dimensoes",
    "coregistrante",
    "escapado",
    "comprimento_da_fonte",
    "comprimento_do_texto",
    "nota_de_roda_pe",
    "comprimento_da_nota_de_roda_pe",
    "contexto",
    "valor"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING"
  ],
  "description": [
    "Número de Acesso. A string de 20 caracteres formada pelo número de 18 dígitos atribuído pela Comissão a cada envio do EDGAR. submission_number: [adsh]",
    "O identificador único (nome) para uma tag em uma versão específica de taxonomia. measure_tag: [tag]",
    "Para uma tag padrão, um identificador para a taxonomia; caso contrário, o número de acesso onde a tag foi definida. Por exemplo, \\\"invest/2013\\\" indica que a tag é definida na taxonomia INVEST de 2013.",
    "A data de fim para o valor de dados, arredondada para o fim do mês mais próximo. period_end_date:[ddate]",
    "A contagem do número de trimestres representados pelo valor de dados, arredondada para o número inteiro mais próximo. Um valor de ponto no tempo é representado por 0. num_quarters:[qtrs]",
    "Um inteiro positivo para distinguir fatos relatados diferentes que, de outra forma, teriam a mesma chave primária. Para a maioria dos propósitos, os dados com iprx maior que 1 não são necessários. A prioridade para o fato com base na precisão mais alta, proximidade da data de fim com o fim do mês e proximidade da duração com um múltiplo de três meses. Veja os campos dcml, durp e datp abaixo.",
    "O código de idioma ISO do conteúdo do fato. language:[lang]",
    "O valor do atributo \\\"xml:lang\\\" do fato, en-US representado por 32767, outros dialetos \\\"en\\\" com valores mais baixos e outros idiomas com valores ainda mais baixos. language_decimal: [dcml]",
    "A diferença entre a duração do fato relatado e a duração do trimestre (qtrs), expressa como uma fração de 1. Por exemplo, um fato com duração de 120 dias arredondada para um trimestre de 91 dias tem um valor de durp de 29/91 = +0,3187. duration_fraction: [durp]",
    "A diferença entre a data do fato relatado e a data de fim do mês arredondada (ddate), expressa como uma fração de 1. Por exemplo, um fato relatado para 29/dez, com ddate arredondada para 31/dez, tem um valor de datp de menos 2/31 = -0,0645. date_fraction: [datp]",
    "A chave hexadecimal de 32 bytes para as informações dimensionais no conjunto de dados DIM. dimension_hash: [dimh]",
    "Um pequeno inteiro que representa o número de dimensões, útil para ordenação. Note que esse valor é uma função dos segmentos de dimensão. num_dimensions: [dimn]",
    "Se especificado, indica um co-registrante específico, a empresa-mãe ou outra entidade (por exemplo, garantidor). NULL indica a entidade consolidada. Note que esse valor é uma função dos segmentos de dimensão. coregistrant: [coreg]",
    "Indicador de que o valor teve tags removidas.",
    "Número de bytes no valor original, não processado. Zero indica um valor NULL. source_length: [srclen]",
    "O comprimento original do valor normalizado de espaço em branco, que pode ter sido maior que 8192. text_length: [txtlen]",
    "O texto simples de qualquer nota de rodapé superscripta no valor, como mostrado na página, truncado em 512 caracteres, ou se não houver nota de rodapé, então esse campo será em branco.",
    "Número de bytes no texto simples da nota de rodapé antes da truncagem. footnote_length: [footlen]",
    "O valor do atributo contextRef no documento XBRL de origem, que pode ser usado para recuperar a marcação HTML original, se desejado.",
    "O valor, com todo o espaço em branco normalizado, ou seja, todas as sequências de quebras de linha, retornos de carro, tabs, espaços não quebrados e espaços tendo sido reduzidas a um único espaço, e sem espaços em branco no início ou no fim. O XML escapado que aparece nas tags de \\\"Bloco de Texto\\\" do EDGAR é processado para remover toda a marcação (comentários, instruções de processamento, elementos, atributos). O valor é truncado em um número máximo de bytes. O texto resultante não é destinado a ser exibido para o usuário final, mas apenas para aplicações de análise de texto."
  ],
  "sample_rows": [
    {
      "numero_de_submissao": "0001193125-16-628942",
      "etiqueta_de_medida": "AcquisitionRelatedOtherExpensesPolicy",
      "versao": "0001193125-16-628942",
      "data_de_fim_do_periodo": 20160531,
      "num_quartos": 4,
      "iprx": 0,
      "linguagem": "en-US",
      "linguagem_decimal": 32767,
      "fracao_de_duracao": 0.0,
      "fracao_de_data": 0.0,
      "hash_de_dimensao": "0x00000000",
      "num_dimensoes": 0,
      "coregistrante": null,
      "escapado": true,
      "comprimento_da_fonte": 46908,
      "comprimento_do_texto": 1392,
      "nota_de_roda_pe": null,
      "comprimento_da_nota_de_roda_pe": 0,
      "contexto": "D-FY2016",
      "valor": "Acquisition Related and Other Expenses Acquisition related and other expenses consist of personnel related costs for transitional and certain other employees, stock-based compensation expenses, integration related professional services, certain business combination adjustments including certain adjustments after the measurement period has ended and certain other operating items, net. Stock-based compensation expenses included in acquisition related and other expenses resulted from unvested stock options and restricted stock -based awards assumed from acquisitions whereby vesting was accelerated upon termination of the employees pursuant to the original terms of those stock options and restricted stock -based awards. Year Ended May 31, (in millions) 2016 2015 2014 Transitional and other employee related costs $ 45 $ 57 $ 27 Stock-based compensation 3 5 10 Professional fees and other, net 10 (35) 20 Business combination adjustments, net (16) 184 (16) Total acquisition related and other expenses $ 42 $ 211 $ 41 Included in acquisition related and other expenses for fiscal 2016 and 2015 were an acquisition related benefit of $19 million and a litigation related benefit of $53 million, respectively. Further, acquisition related and other expenses for fiscal 2015 included a loss of $186 million related to goodwill impairment (refer to Note 7 below for additional information)."
    },
    {
      "numero_de_submissao": "0001409375-16-000039",
      "etiqueta_de_medida": "OtherLongTermAssetsPolicyTextBlock",
      "versao": "0001409375-16-000039",
      "data_de_fim_do_periodo": 20160331,
      "num_quartos": 4,
      "iprx": 0,
      "linguagem": "en-US",
      "linguagem_decimal": 32767,
      "fracao_de_duracao": 0.0,
      "fracao_de_data": 0.0,
      "hash_de_dimensao": "0x00000000",
      "num_dimensoes": 0,
      "coregistrante": null,
      "escapado": true,
      "comprimento_da_fonte": 575,
      "comprimento_do_texto": 128,
      "nota_de_roda_pe": null,
      "comprimento_da_nota_de_roda_pe": 0,
      "contexto": "FD2015Q4YTD",
      "valor": "Deferred financing costs related to debt issuances are allocated to interest expense over the life of the debt ( 1 to 3 years )."
    },
    {
      "numero_de_submissao": "0000101830-16-000066",
      "etiqueta_de_medida": "ScheduleofSupplementalBalanceSheetDisclosureTableTextBlock",
      "versao": "0000101830-16-000066",
      "data_de_fim_do_periodo": 20160331,
      "num_quartos": 4,
      "iprx": 0,
      "linguagem": "en-US",
      "linguagem_decimal": 32767,
      "fracao_de_duracao": 0.0,
      "fracao_de_data": 0.0,
      "hash_de_dimensao": "0x00000000",
      "num_dimensoes": 0,
      "coregistrante": null,
      "escapado": true,
      "comprimento_da_fonte": 64982,
      "comprimento_do_texto": 1516,
      "nota_de_roda_pe": null,
      "comprimento_da_nota_de_roda_pe": 0,
      "contexto": "FD2015Q4YTD",
      "valor": "March 31, March 31, 2016 2015 (in millions) Accounts and notes receivable, net Trade $ 899 $ 1,037 Unbilled trade and other 239 1,457 Less allowances for doubtful accounts and deferred interest (39 ) (204 ) $ 1,099 $ 2,290 Prepaid expenses and other current assets Prepaid expenses $ 366 $ 401 Deferred purchase price for Receivables Facility 1,155 1,198 Deferred charges and other 399 291 $ 1,920 $ 1,890 Other assets Deferred purchase price for Handset Sale-Leaseback Tranche 1 $ 116 $  Unbilled trade installment receivables, net  361 Investments 187 151 Other 425 376 $ 728 $ 888 Accounts payable (1) Trade $ 2,567 $ 3,786 Accrued interconnection costs 142 198 Capital expenditures and other 190 363 $ 2,899 $ 4,347 Accrued expenses and other current liabilities Deferred revenues $ 1,456 $ 1,385 Accrued taxes 232 238 Payroll and related 339 589 Severance, lease and other exit costs 288 223 Accrued interest 532 525 Accrued capital expenditures 149 705 Other 1,378 1,628 $ 4,374 $ 5,293 Other liabilities Deferred rental income-communications towers $ 218 $ 229 Deferred rent 478 366 Asset retirement obligations 550 584 Unfavorable lease liabilities 658 856 Post-retirement benefits and other non-current employee related liabilities 994 987 Other 1,104 929 $ 4,002 $ 3,951 ______________________ (1) Includes liabilities in the amounts of $66 million and $90 million as of March 31, 2016 and 2015 , respectively, for checks issued in excess of associated bank balances but not yet presented for collection."
    },
    {
      "numero_de_submissao": "0000101830-16-000066",
      "etiqueta_de_medida": "ScheduleOfIncomeTaxExpenseBenefitAllocatedToOtherItemsTextBlock",
      "versao": "0000101830-16-000066",
      "data_de_fim_do_periodo": 20160331,
      "num_quartos": 4,
      "iprx": 0,
      "linguagem": "en-US",
      "linguagem_decimal": 32767,
      "fracao_de_duracao": 0.0,
      "fracao_de_data": 0.0,
      "hash_de_dimensao": "0x00000000",
      "num_dimensoes": 0,
      "coregistrante": null,
      "escapado": true,
      "comprimento_da_fonte": 24388,
      "comprimento_do_texto": 586,
      "nota_de_roda_pe": null,
      "comprimento_da_nota_de_roda_pe": 0,
      "contexto": "FD2015Q4YTD",
      "valor": "Income tax (expense) benefit allocated to other items was as follows: Successor Predecessor Year Ended March 31, Year Ended March 31, Three Months Ended March 31, Year Ended December 31, 191 Days Ended July 10, Three Months Ended March 31, 2016 2015 2014 2013 2013 2013 (Unaudited) (in millions) Unrecognized net periodic pension and other postretirement benefit cost (1) $  $  $  $ (58 ) $ (18 ) $ (10 ) Unrealized holding gains/losses on securities (1) $  $  $ (1 ) $ (3 ) $  $ (1 ) _______________ (1) These amounts have been recognized in accumulated other comprehensive loss."
    },
    {
      "numero_de_submissao": "0000101830-16-000066",
      "etiqueta_de_medida": "StockholdersEquityAndEarningsPerShareTextBlock",
      "versao": "0000101830-16-000066",
      "data_de_fim_do_periodo": 20160331,
      "num_quartos": 4,
      "iprx": 0,
      "linguagem": "en-US",
      "linguagem_decimal": 32767,
      "fracao_de_duracao": 0.0,
      "fracao_de_data": 0.0,
      "hash_de_dimensao": "0x00000000",
      "num_dimensoes": 0,
      "coregistrante": null,
      "escapado": true,
      "comprimento_da_fonte": 20169,
      "comprimento_do_texto": 3276,
      "nota_de_roda_pe": null,
      "comprimento_da_nota_de_roda_pe": 0,
      "contexto": "FD2015Q4YTD",
      "valor": "Stockholders' Equity and Per Share Data Our certificate of incorporation authorizes 10,020,000,000 shares of capital stock as follows:  9,000,000,000 shares of common stock, par value $0.01 per share;  1,000,000,000 shares of non-voting common stock, par value $0.01 per share; and  20,000,000 shares of preferred stock, par value $0.0001 per share. Classes of Common Stock Voting Common Stock The holders of our common stock are entitled to one vote per share on all matters submitted for action by the stockholders. There were approximately 4.0 billion shares of common stock outstanding as of March 31, 2016 . Treasury Shares Shares of common stock repurchased by us are recorded at cost as treasury shares and result in a reduction of stockholders' equity. We reissue treasury shares as part of our stockholder approved stock-based compensation programs, as well as upon conversion of outstanding securities that are convertible into common stock. When shares are reissued, we determine the cost using the FIFO method. Dividends We did not declare any dividends on our common shares for all periods presented in the consolidated financial statements. We are currently restricted from paying cash dividends by the terms of our revolving bank credit facility, EDC Agreement and all other equipment credit facilities (see Note 9. Long-Term Debt, Financing and Capital Lease Obligations) . Accumulated Other Comprehensive Loss The components of accumulated other comprehensive loss, net of tax were as follows: March 31, 2016 2015 (in millions) Unrecognized net periodic pension and postretirement benefit cost $ (407 ) $ (388 ) Unrealized net gains related to investments  1 Foreign currency translation adjustments (32 ) (21 ) Accumulated other comprehensive loss $ (439 ) $ (408 ) Per Share Data Basic net loss per common share is calculated by dividing net loss by the weighted average number of common shares outstanding during the period. Diluted net loss per common share adjusts basic net loss per common share, computed using the treas"
    }
  ]
}