{
  "table_name": "txt",
  "table_fullname": "bigquery-public-data.sec_quarterly_financials.txt",
  "column_names": [
    "numero_de_soumission",
    "balise_de_mesure",
    "version",
    "date_de_fin_de_periode",
    "num_quarters",
    "iprx",
    "langue",
    "langue_decimale",
    "duree_fraction",
    "date_fraction",
    "hash_de_dimension",
    "num_dimensions",
    "coregistrant",
    "escaped",
    "longueur_de_source",
    "longueur_de_texte",
    "footnote",
    "longueur_de_footnote",
    "contexte",
    "valeur",
    "_PARTITIONTIME"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "TIMESTAMP"
  ],
  "nested_column_names": [
    "numero_de_soumission",
    "balise_de_mesure",
    "version",
    "date_de_fin_de_periode",
    "num_quarters",
    "iprx",
    "langue",
    "langue_decimale",
    "duree_fraction",
    "date_fraction",
    "hash_de_dimension",
    "num_dimensions",
    "coregistrant",
    "escaped",
    "longueur_de_source",
    "longueur_de_texte",
    "footnote",
    "longueur_de_footnote",
    "contexte",
    "valeur"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING"
  ],
  "description": [
    "Numéro d'accès. La chaîne de 20 caractères formée à partir du numéro de 18 chiffres attribué par la Commission à chaque soumission EDGAR. submission_number: [adsh]",
    "L'identifiant unique (nom) pour un tag dans une version de taxonomie spécifique. measure_tag: [tag]",
    "Pour un tag standard, un identifiant pour la taxonomie ; sinon, le numéro d'accès où le tag a été défini. Par exemple, \\\"invest/2013\\\" indique que le tag est défini dans la taxonomie INVEST 2013.",
    "La date de fin pour la valeur de données, arrondie à la fin du mois la plus proche. period_end_date:[ddate]",
    "Le nombre de trimestres représentés par la valeur de données, arrondi au nombre entier le plus proche. Une valeur ponctuelle est représentée par 0. num_quarters:[qtrs]",
    "Un entier positif pour distinguer les faits rapportés différents qui auraient otherwise la même clé primaire. Pour la plupart des objectifs, les données avec iprx supérieur à 1 ne sont pas nécessaires. La priorité pour le fait basée sur une précision plus élevée, la proximité de la date de fin à une fin de mois, et la proximité de la durée à un multiple de trois mois. Voir les champs dcml, durp et datp ci-dessous.",
    "Le code de langue ISO du contenu du fait. language:[lang]",
    "La valeur du fait \\\"xml:lang\\\" attribute, en-US représenté par 32767, autres \\\"en\\\" dialectes ayant des valeurs inférieures, et d'autres langues encore inférieures. language_decimal: [dcml]",
    "La différence entre la durée du fait rapporté et la durée du trimestre (qtrs), exprimée comme une fraction de 1. Par exemple, un fait avec une durée de 120 jours arrondie à un trimestre de 91 jours a une valeur durp de 29/91 = +0,3187. duration_fraction: [durp]",
    "La différence entre la date du fait rapporté et la date de fin de mois arrondie (ddate), exprimée comme une fraction de 1. Par exemple, un fait rapporté pour le 29 décembre, avec ddate arrondi à 31 décembre, a une valeur datp de moins 2/31 = -0,0645. date_fraction: [datp]",
    "La clé hexadécimale de 32 octets pour les informations dimensionnelles dans l'ensemble de données DIM. dimension_hash: [dimh]",
    "Petit entier représentant le nombre de dimensions, utile pour le tri. Notez que cette valeur est une fonction des segments de dimension. num_dimensions: [dimn]",
    "Si spécifié, indique un co-registrant spécifique, la société mère, ou une autre entité (par exemple, garant). NULL indique l'entité consolidée. Notez que cette valeur est une fonction des segments de dimension. coregistrant: [coreg]",
    "Indicateur indiquant si la valeur a eu des tags supprimés.",
    "Nombre d'octets dans la valeur originale, non traitée. Zéro indique une valeur NULL. source_length: [srclen]",
    "La longueur originale de la valeur normalisée des espaces, qui peut avoir été supérieure à 8192. text_length: [txtlen]",
    "Le texte brut des notes de bas de page en exposant de la valeur, tel qu'il est affiché sur la page, tronqué à 512 caractères, ou si il n'y a pas de note de bas de page, alors ce champ sera vide.",
    "Nombre d'octets dans le texte brut de la note de bas de page avant la troncature. footnote_length: [footlen]",
    "La valeur de l'attribut contextRef dans le document XBRL source, qui peut être utilisée pour récupérer le balisage HTML original si désiré.",
    "La valeur, avec tous les espaces normalisés, c'est-à-dire toutes les séquences de sauts de ligne, de retours chariot, de tabulations, d'espaces non rompables et d'espaces ayant été condensées en un seul espace, et sans espaces de début ou de fin. Le XML échappé qui apparaît dans les balises de bloc de texte EDGAR est traité pour supprimer toutes les balises (commentaires, instructions de traitement, éléments, attributs). La valeur est tronquée à un nombre maximum d'octets. Le texte résultant n'est pas destiné à l'affichage pour les utilisateurs finals, mais uniquement pour les applications d'analyse de texte."
  ],
  "sample_rows": [
    {
      "numero_de_soumission": "0001193125-16-628942",
      "balise_de_mesure": "AcquisitionRelatedOtherExpensesPolicy",
      "version": "0001193125-16-628942",
      "date_de_fin_de_periode": 20160531,
      "num_quarters": 4,
      "iprx": 0,
      "langue": "en-US",
      "langue_decimale": 32767,
      "duree_fraction": 0.0,
      "date_fraction": 0.0,
      "hash_de_dimension": "0x00000000",
      "num_dimensions": 0,
      "coregistrant": null,
      "escaped": true,
      "longueur_de_source": 46908,
      "longueur_de_texte": 1392,
      "footnote": null,
      "longueur_de_footnote": 0,
      "contexte": "D-FY2016",
      "valeur": "Acquisition Related and Other Expenses Acquisition related and other expenses consist of personnel related costs for transitional and certain other employees, stock-based compensation expenses, integration related professional services, certain business combination adjustments including certain adjustments after the measurement period has ended and certain other operating items, net. Stock-based compensation expenses included in acquisition related and other expenses resulted from unvested stock options and restricted stock -based awards assumed from acquisitions whereby vesting was accelerated upon termination of the employees pursuant to the original terms of those stock options and restricted stock -based awards. Year Ended May 31, (in millions) 2016 2015 2014 Transitional and other employee related costs $ 45 $ 57 $ 27 Stock-based compensation 3 5 10 Professional fees and other, net 10 (35) 20 Business combination adjustments, net (16) 184 (16) Total acquisition related and other expenses $ 42 $ 211 $ 41 Included in acquisition related and other expenses for fiscal 2016 and 2015 were an acquisition related benefit of $19 million and a litigation related benefit of $53 million, respectively. Further, acquisition related and other expenses for fiscal 2015 included a loss of $186 million related to goodwill impairment (refer to Note 7 below for additional information)."
    },
    {
      "numero_de_soumission": "0001409375-16-000039",
      "balise_de_mesure": "OtherLongTermAssetsPolicyTextBlock",
      "version": "0001409375-16-000039",
      "date_de_fin_de_periode": 20160331,
      "num_quarters": 4,
      "iprx": 0,
      "langue": "en-US",
      "langue_decimale": 32767,
      "duree_fraction": 0.0,
      "date_fraction": 0.0,
      "hash_de_dimension": "0x00000000",
      "num_dimensions": 0,
      "coregistrant": null,
      "escaped": true,
      "longueur_de_source": 575,
      "longueur_de_texte": 128,
      "footnote": null,
      "longueur_de_footnote": 0,
      "contexte": "FD2015Q4YTD",
      "valeur": "Deferred financing costs related to debt issuances are allocated to interest expense over the life of the debt ( 1 to 3 years )."
    },
    {
      "numero_de_soumission": "0000101830-16-000066",
      "balise_de_mesure": "ScheduleofSupplementalBalanceSheetDisclosureTableTextBlock",
      "version": "0000101830-16-000066",
      "date_de_fin_de_periode": 20160331,
      "num_quarters": 4,
      "iprx": 0,
      "langue": "en-US",
      "langue_decimale": 32767,
      "duree_fraction": 0.0,
      "date_fraction": 0.0,
      "hash_de_dimension": "0x00000000",
      "num_dimensions": 0,
      "coregistrant": null,
      "escaped": true,
      "longueur_de_source": 64982,
      "longueur_de_texte": 1516,
      "footnote": null,
      "longueur_de_footnote": 0,
      "contexte": "FD2015Q4YTD",
      "valeur": "March 31, March 31, 2016 2015 (in millions) Accounts and notes receivable, net Trade $ 899 $ 1,037 Unbilled trade and other 239 1,457 Less allowances for doubtful accounts and deferred interest (39 ) (204 ) $ 1,099 $ 2,290 Prepaid expenses and other current assets Prepaid expenses $ 366 $ 401 Deferred purchase price for Receivables Facility 1,155 1,198 Deferred charges and other 399 291 $ 1,920 $ 1,890 Other assets Deferred purchase price for Handset Sale-Leaseback Tranche 1 $ 116 $  Unbilled trade installment receivables, net  361 Investments 187 151 Other 425 376 $ 728 $ 888 Accounts payable (1) Trade $ 2,567 $ 3,786 Accrued interconnection costs 142 198 Capital expenditures and other 190 363 $ 2,899 $ 4,347 Accrued expenses and other current liabilities Deferred revenues $ 1,456 $ 1,385 Accrued taxes 232 238 Payroll and related 339 589 Severance, lease and other exit costs 288 223 Accrued interest 532 525 Accrued capital expenditures 149 705 Other 1,378 1,628 $ 4,374 $ 5,293 Other liabilities Deferred rental income-communications towers $ 218 $ 229 Deferred rent 478 366 Asset retirement obligations 550 584 Unfavorable lease liabilities 658 856 Post-retirement benefits and other non-current employee related liabilities 994 987 Other 1,104 929 $ 4,002 $ 3,951 ______________________ (1) Includes liabilities in the amounts of $66 million and $90 million as of March 31, 2016 and 2015 , respectively, for checks issued in excess of associated bank balances but not yet presented for collection."
    },
    {
      "numero_de_soumission": "0000101830-16-000066",
      "balise_de_mesure": "ScheduleOfIncomeTaxExpenseBenefitAllocatedToOtherItemsTextBlock",
      "version": "0000101830-16-000066",
      "date_de_fin_de_periode": 20160331,
      "num_quarters": 4,
      "iprx": 0,
      "langue": "en-US",
      "langue_decimale": 32767,
      "duree_fraction": 0.0,
      "date_fraction": 0.0,
      "hash_de_dimension": "0x00000000",
      "num_dimensions": 0,
      "coregistrant": null,
      "escaped": true,
      "longueur_de_source": 24388,
      "longueur_de_texte": 586,
      "footnote": null,
      "longueur_de_footnote": 0,
      "contexte": "FD2015Q4YTD",
      "valeur": "Income tax (expense) benefit allocated to other items was as follows: Successor Predecessor Year Ended March 31, Year Ended March 31, Three Months Ended March 31, Year Ended December 31, 191 Days Ended July 10, Three Months Ended March 31, 2016 2015 2014 2013 2013 2013 (Unaudited) (in millions) Unrecognized net periodic pension and other postretirement benefit cost (1) $  $  $  $ (58 ) $ (18 ) $ (10 ) Unrealized holding gains/losses on securities (1) $  $  $ (1 ) $ (3 ) $  $ (1 ) _______________ (1) These amounts have been recognized in accumulated other comprehensive loss."
    },
    {
      "numero_de_soumission": "0000101830-16-000066",
      "balise_de_mesure": "StockholdersEquityAndEarningsPerShareTextBlock",
      "version": "0000101830-16-000066",
      "date_de_fin_de_periode": 20160331,
      "num_quarters": 4,
      "iprx": 0,
      "langue": "en-US",
      "langue_decimale": 32767,
      "duree_fraction": 0.0,
      "date_fraction": 0.0,
      "hash_de_dimension": "0x00000000",
      "num_dimensions": 0,
      "coregistrant": null,
      "escaped": true,
      "longueur_de_source": 20169,
      "longueur_de_texte": 3276,
      "footnote": null,
      "longueur_de_footnote": 0,
      "contexte": "FD2015Q4YTD",
      "valeur": "Stockholders' Equity and Per Share Data Our certificate of incorporation authorizes 10,020,000,000 shares of capital stock as follows:  9,000,000,000 shares of common stock, par value $0.01 per share;  1,000,000,000 shares of non-voting common stock, par value $0.01 per share; and  20,000,000 shares of preferred stock, par value $0.0001 per share. Classes of Common Stock Voting Common Stock The holders of our common stock are entitled to one vote per share on all matters submitted for action by the stockholders. There were approximately 4.0 billion shares of common stock outstanding as of March 31, 2016 . Treasury Shares Shares of common stock repurchased by us are recorded at cost as treasury shares and result in a reduction of stockholders' equity. We reissue treasury shares as part of our stockholder approved stock-based compensation programs, as well as upon conversion of outstanding securities that are convertible into common stock. When shares are reissued, we determine the cost using the FIFO method. Dividends We did not declare any dividends on our common shares for all periods presented in the consolidated financial statements. We are currently restricted from paying cash dividends by the terms of our revolving bank credit facility, EDC Agreement and all other equipment credit facilities (see Note 9. Long-Term Debt, Financing and Capital Lease Obligations) . Accumulated Other Comprehensive Loss The components of accumulated other comprehensive loss, net of tax were as follows: March 31, 2016 2015 (in millions) Unrecognized net periodic pension and postretirement benefit cost $ (407 ) $ (388 ) Unrealized net gains related to investments  1 Foreign currency translation adjustments (32 ) (21 ) Accumulated other comprehensive loss $ (439 ) $ (408 ) Per Share Data Basic net loss per common share is calculated by dividing net loss by the weighted average number of common shares outstanding during the period. Diluted net loss per common share adjusts basic net loss per common share, computed using the treas"
    }
  ]
}