{
  "table_name": "txt",
  "table_fullname": "bigquery-public-data.sec_quarterly_financials.txt",
  "column_names": [
    "Einreichungsnummer",
    "Messkennzeichen",
    "Version",
    "Enddatum",
    "Quartalsanzahl",
    "iprx",
    "Sprache",
    "Sprachdezimal",
    "Daueranteil",
    "Datumsanteil",
    "Dimensionshash",
    "Dimensionsanzahl",
    "Koregistrant",
    "Maskiert",
    "Quelllänge",
    "Textlänge",
    "Fußnote",
    "Fußnotentextlänge",
    "Kontext",
    "Wert",
    "_PARTITIONTIME"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "TIMESTAMP"
  ],
  "nested_column_names": [
    "Einreichungsnummer",
    "Messkennzeichen",
    "Version",
    "Periodenende",
    "Quartaleanzahl",
    "iprx",
    "Sprache",
    "Sprachdezimalwert",
    "Daueranteil",
    "Datumsanteil",
    "Dimensionshash",
    "Dimensionsanzahl",
    "Koregistrant",
    "Maskiert",
    "Quellänge",
    "Textlänge",
    "Fußnote",
    "Fußnotlänge",
    "Kontext",
    "Wert"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "STRING",
    "BOOL",
    "INT64",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING"
  ],
  "description": [
    "Zugangsnummer. Der 20-stellige String, der aus der von der Kommission jeder EDGAR-Einreichung zugewiesenen 18-stelligen Nummer gebildet wird. submission_number: [adsh]",
    "Der eindeutige Bezeichner (Name) für ein Tag in einer bestimmten Taxonomie-Veröffentlichung. measure_tag: [tag]",
    "Für ein Standard-Tag ist ein Bezeichner für die Taxonomie vorgesehen; andernfalls die Zugangsnummer, unter der das Tag definiert wurde. Zum Beispiel, \"invest/2013\" zeigt an, dass das Tag in der 2013 INVEST-Taxonomie definiert ist.",
    "Das Enddatum des Datenwerts, gerundet auf das Monatsende. period_end_date:[ddate]",
    "Die Anzahl der Quartale, die durch den Datenwert dargestellt wird, gerundet auf die nächstliegende ganze Zahl. Ein Zeitpunktwert wird durch 0 dargestellt. num_quarters:[qtrs]",
    "Eine positive Ganzzahl zur Unterscheidung verschiedener berichteter Tatsachen, die ansonsten denselben Primärschlüssel hätten. Für die meisten Zwecke sind Daten mit iprx größer als 1 nicht erforderlich. Die Priorität der Tatsache basiert auf höherer Genauigkeit, der Nähe des Enddatums zu einem Monatsende und der Nähe der Dauer zu einem Vielfachen von drei Monaten. Siehe unten die Felder dcml, durp und datp.",
    "Der ISO-Sprachcode des Faktinhalts. language:[lang]",
    "Der Wert des Attributs \\\"xml:lang\\\" des Faktinhalts, wobei en-US durch 32767 dargestellt wird, andere \\\"en\\\"-Dialekte niedrigere Werte haben und andere Sprachen noch niedrigere Werte. language_decimal: [dcml]",
    "Die Differenz zwischen der gemeldeten Faktendauer und der Quartalsdauer (qtrs), ausgedrückt als Bruchteil von 1. Zum Beispiel hat ein Fakt mit einer Dauer von 120 Tagen, gerundet auf ein 91-Tage-Quartal, einen durp-Wert von 29/91 = +0,3187. duration_fraction: [durp]",
    "Die Differenz zwischen dem gemeldeten Faktendatum und dem auf Monatsende gerundeten Datum (ddate), ausgedrückt als Bruchteil von 1. Zum Beispiel hat ein berichtetes Faktendatum vom 29./Dez., wobei ddate auf den 31./Dez. gerundet wird, einen datp-Wert von minus 2/31 = -0,0645. date_fraction: [datp]",
    "Der 32-Byte-hexadezimal-Schlüssel für die dimensionale Information im DIM-Datensatz. dimension_hash: [dimh]",
    "Kleine Ganzzahl, die die Anzahl der Dimensionen darstellt, nützlich zum Sortieren. Beachten Sie, dass dieser Wert eine Funktion der Dimensionssegmente ist. num_dimensions: [dimn]",
    "Falls angegeben, kennzeichnet es einen bestimmten Co-Registranten, das Mutterunternehmen oder eine andere Einheit (z. B. Bürge). NULL kennzeichnet die konsolidierte Einheit. Beachten Sie, dass dieser Wert eine Funktion der Dimensionssegmente ist. coregistrant: [coreg]",
    "Flagge, die angibt, ob dem Wert Tags entfernt wurden.",
    "Die Anzahl der Bytes im ursprünglichen, unbearbeiteten Wert. Null bedeutet NULL-Wert. source_length: [srclen]",
    "Die ursprüngliche Länge des whitespace-normalisierten Werts, der möglicherweise größer als 8192 war. text_length: [txtlen]",
    "Der Klartext aller hochgestellten Fußnoten zum Wert, wie auf der Seite angezeigt, auf 512 Zeichen gekürzt; falls keine Fußnote vorhanden ist, bleibt dieses Feld leer.",
    "Die Anzahl der Bytes im Klartext der Fußnote vor der Kürzung. footnote_length: [footlen]",
    "Der Wert des contextRef-Attributs im Quell-XBRL-Dokument, der verwendet werden kann, um bei Bedarf die ursprüngliche HTML-Tagging wiederherzustellen.",
    "Der Wert mit allen Whitespace normalisiert, das heißt alle Sequenzen von Zeilenumbrüchen, Wagenrückläufen, Tabs, nicht trennbaren Leerzeichen und normalen Leerzeichen zu einem einzigen Leerzeichen zusammengefasst, und keine führenden oder nachfolgenden Leerzeichen. Escaped XML, das in EDGAR \\\"Text Block\\\"-Tags erscheint, wird verarbeitet, um sämtliches Markup (Kommentare, Verarbeitungshinweise, Elemente, Attribute) zu entfernen. Der Wert ist auf eine maximale Byte-Anzahl gekürzt. Der resultierende Text ist nicht für Endbenutzeranzeige gedacht, sondern nur für Textanalyseanwendungen."
  ],
  "sample_rows": [
    {
      "Einreichungsnummer": "0001193125-16-628942",
      "Messkennzeichen": "AcquisitionRelatedOtherExpensesPolicy",
      "Version": "0001193125-16-628942",
      "Periodenende": 20160531,
      "Quartaleanzahl": 4,
      "iprx": 0,
      "Sprache": "en-US",
      "Sprachdezimalwert": 32767,
      "Daueranteil": 0.0,
      "Datumsanteil": 0.0,
      "Dimensionshash": "0x00000000",
      "Dimensionsanzahl": 0,
      "Koregistrant": null,
      "Maskiert": true,
      "Quellänge": 46908,
      "Textlänge": 1392,
      "Fußnote": null,
      "Fußnotlänge": 0,
      "Kontext": "D-FY2016",
      "Wert": "Acquisition Related and Other Expenses Acquisition related and other expenses consist of personnel related costs for transitional and certain other employees, stock-based compensation expenses, integration related professional services, certain business combination adjustments including certain adjustments after the measurement period has ended and certain other operating items, net. Stock-based compensation expenses included in acquisition related and other expenses resulted from unvested stock options and restricted stock -based awards assumed from acquisitions whereby vesting was accelerated upon termination of the employees pursuant to the original terms of those stock options and restricted stock -based awards. Year Ended May 31, (in millions) 2016 2015 2014 Transitional and other employee related costs $ 45 $ 57 $ 27 Stock-based compensation 3 5 10 Professional fees and other, net 10 (35) 20 Business combination adjustments, net (16) 184 (16) Total acquisition related and other expenses $ 42 $ 211 $ 41 Included in acquisition related and other expenses for fiscal 2016 and 2015 were an acquisition related benefit of $19 million and a litigation related benefit of $53 million, respectively. Further, acquisition related and other expenses for fiscal 2015 included a loss of $186 million related to goodwill impairment (refer to Note 7 below for additional information)."
    },
    {
      "Einreichungsnummer": "0001409375-16-000039",
      "Messkennzeichen": "OtherLongTermAssetsPolicyTextBlock",
      "Version": "0001409375-16-000039",
      "Periodenende": 20160331,
      "Quartaleanzahl": 4,
      "iprx": 0,
      "Sprache": "en-US",
      "Sprachdezimalwert": 32767,
      "Daueranteil": 0.0,
      "Datumsanteil": 0.0,
      "Dimensionshash": "0x00000000",
      "Dimensionsanzahl": 0,
      "Koregistrant": null,
      "Maskiert": true,
      "Quellänge": 575,
      "Textlänge": 128,
      "Fußnote": null,
      "Fußnotlänge": 0,
      "Kontext": "FD2015Q4YTD",
      "Wert": "Deferred financing costs related to debt issuances are allocated to interest expense over the life of the debt ( 1 to 3 years )."
    },
    {
      "Einreichungsnummer": "0000101830-16-000066",
      "Messkennzeichen": "ScheduleofSupplementalBalanceSheetDisclosureTableTextBlock",
      "Version": "0000101830-16-000066",
      "Periodenende": 20160331,
      "Quartaleanzahl": 4,
      "iprx": 0,
      "Sprache": "en-US",
      "Sprachdezimalwert": 32767,
      "Daueranteil": 0.0,
      "Datumsanteil": 0.0,
      "Dimensionshash": "0x00000000",
      "Dimensionsanzahl": 0,
      "Koregistrant": null,
      "Maskiert": true,
      "Quellänge": 64982,
      "Textlänge": 1516,
      "Fußnote": null,
      "Fußnotlänge": 0,
      "Kontext": "FD2015Q4YTD",
      "Wert": "March 31, March 31, 2016 2015 (in millions) Accounts and notes receivable, net Trade $ 899 $ 1,037 Unbilled trade and other 239 1,457 Less allowances for doubtful accounts and deferred interest (39 ) (204 ) $ 1,099 $ 2,290 Prepaid expenses and other current assets Prepaid expenses $ 366 $ 401 Deferred purchase price for Receivables Facility 1,155 1,198 Deferred charges and other 399 291 $ 1,920 $ 1,890 Other assets Deferred purchase price for Handset Sale-Leaseback Tranche 1 $ 116 $  Unbilled trade installment receivables, net  361 Investments 187 151 Other 425 376 $ 728 $ 888 Accounts payable (1) Trade $ 2,567 $ 3,786 Accrued interconnection costs 142 198 Capital expenditures and other 190 363 $ 2,899 $ 4,347 Accrued expenses and other current liabilities Deferred revenues $ 1,456 $ 1,385 Accrued taxes 232 238 Payroll and related 339 589 Severance, lease and other exit costs 288 223 Accrued interest 532 525 Accrued capital expenditures 149 705 Other 1,378 1,628 $ 4,374 $ 5,293 Other liabilities Deferred rental income-communications towers $ 218 $ 229 Deferred rent 478 366 Asset retirement obligations 550 584 Unfavorable lease liabilities 658 856 Post-retirement benefits and other non-current employee related liabilities 994 987 Other 1,104 929 $ 4,002 $ 3,951 ______________________ (1) Includes liabilities in the amounts of $66 million and $90 million as of March 31, 2016 and 2015 , respectively, for checks issued in excess of associated bank balances but not yet presented for collection."
    },
    {
      "Einreichungsnummer": "0000101830-16-000066",
      "Messkennzeichen": "ScheduleOfIncomeTaxExpenseBenefitAllocatedToOtherItemsTextBlock",
      "Version": "0000101830-16-000066",
      "Periodenende": 20160331,
      "Quartaleanzahl": 4,
      "iprx": 0,
      "Sprache": "en-US",
      "Sprachdezimalwert": 32767,
      "Daueranteil": 0.0,
      "Datumsanteil": 0.0,
      "Dimensionshash": "0x00000000",
      "Dimensionsanzahl": 0,
      "Koregistrant": null,
      "Maskiert": true,
      "Quellänge": 24388,
      "Textlänge": 586,
      "Fußnote": null,
      "Fußnotlänge": 0,
      "Kontext": "FD2015Q4YTD",
      "Wert": "Income tax (expense) benefit allocated to other items was as follows: Successor Predecessor Year Ended March 31, Year Ended March 31, Three Months Ended March 31, Year Ended December 31, 191 Days Ended July 10, Three Months Ended March 31, 2016 2015 2014 2013 2013 2013 (Unaudited) (in millions) Unrecognized net periodic pension and other postretirement benefit cost (1) $  $  $  $ (58 ) $ (18 ) $ (10 ) Unrealized holding gains/losses on securities (1) $  $  $ (1 ) $ (3 ) $  $ (1 ) _______________ (1) These amounts have been recognized in accumulated other comprehensive loss."
    },
    {
      "Einreichungsnummer": "0000101830-16-000066",
      "Messkennzeichen": "StockholdersEquityAndEarningsPerShareTextBlock",
      "Version": "0000101830-16-000066",
      "Periodenende": 20160331,
      "Quartaleanzahl": 4,
      "iprx": 0,
      "Sprache": "en-US",
      "Sprachdezimalwert": 32767,
      "Daueranteil": 0.0,
      "Datumsanteil": 0.0,
      "Dimensionshash": "0x00000000",
      "Dimensionsanzahl": 0,
      "Koregistrant": null,
      "Maskiert": true,
      "Quellänge": 20169,
      "Textlänge": 3276,
      "Fußnote": null,
      "Fußnotlänge": 0,
      "Kontext": "FD2015Q4YTD",
      "Wert": "Stockholders' Equity and Per Share Data Our certificate of incorporation authorizes 10,020,000,000 shares of capital stock as follows:  9,000,000,000 shares of common stock, par value $0.01 per share;  1,000,000,000 shares of non-voting common stock, par value $0.01 per share; and  20,000,000 shares of preferred stock, par value $0.0001 per share. Classes of Common Stock Voting Common Stock The holders of our common stock are entitled to one vote per share on all matters submitted for action by the stockholders. There were approximately 4.0 billion shares of common stock outstanding as of March 31, 2016 . Treasury Shares Shares of common stock repurchased by us are recorded at cost as treasury shares and result in a reduction of stockholders' equity. We reissue treasury shares as part of our stockholder approved stock-based compensation programs, as well as upon conversion of outstanding securities that are convertible into common stock. When shares are reissued, we determine the cost using the FIFO method. Dividends We did not declare any dividends on our common shares for all periods presented in the consolidated financial statements. We are currently restricted from paying cash dividends by the terms of our revolving bank credit facility, EDC Agreement and all other equipment credit facilities (see Note 9. Long-Term Debt, Financing and Capital Lease Obligations) . Accumulated Other Comprehensive Loss The components of accumulated other comprehensive loss, net of tax were as follows: March 31, 2016 2015 (in millions) Unrecognized net periodic pension and postretirement benefit cost $ (407 ) $ (388 ) Unrealized net gains related to investments  1 Foreign currency translation adjustments (32 ) (21 ) Accumulated other comprehensive loss $ (439 ) $ (408 ) Per Share Data Basic net loss per common share is calculated by dividing net loss by the weighted average number of common shares outstanding during the period. Diluted net loss per common share adjusts basic net loss per common share, computed using the treas"
    }
  ]
}