{
  "table_name": "referring_durable_medical_equip_2013",
  "table_fullname": "bigquery-public-data.cms_medicare.referring_durable_medical_equip_2013",
  "column_names": [
    "NPI des verweisenden Anbieters",
    "Organisationsname des verweisenden Anbieters",
    "Vorname des verweisenden Anbieters",
    "Initial des zweiten Vornamens",
    "Qualifikationen des verweisenden Anbieters",
    "Geschlecht des verweisenden Anbieters",
    "Einheitencode des verweisenden Anbieters",
    "Straße 1 des verweisenden Anbieters",
    "Straße 2 des verweisenden Anbieters",
    "Stadt des verweisenden Anbieters",
    "Bundesland des verweisenden Anbieters",
    "Postleitzahl des verweisenden Anbieters",
    "Land des verweisenden Anbieters",
    "Anbietertyp des verweisenden Anbieters",
    "Kennzeichen des verweisenden Anbietertyps",
    "Anzahl der Anbieter",
    "Anzahl der HCPCS-Codes der Anbieter",
    "Anzahl der Leistungsempfänger des Anbieters",
    "Anzahl der Leistungsansprüche des Anbieters",
    "Anzahl der Leistungen des Anbieters",
    "Vom Anbieter eingereichte Gebühren",
    "Medicare-zulässiger Betrag des Anbieters",
    "Vom Medicare gezahlter Betrag des Anbieters",
    "Indikator zur Unterdrückung langlebiger medizinischer Ausrüstung",
    "Anzahl der Lieferanten langlebiger medizinischer Ausrüstung",
    "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung",
    "Anzahl der Leistungsempfänger langlebiger medizinischer Ausrüstung",
    "Anzahl der Leistungsansprüche langlebiger medizinischer Ausrüstung",
    "Anzahl der Dienstleistungen langlebiger medizinischer Ausrüstung",
    "Vom Anbieter eingereichte Gebühren für langlebige medizinische Ausrüstung",
    "Medicare-zulässiger Betrag für langlebige medizinische Ausrüstung",
    "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung",
    "Indikator zur Unterdrückung von Prothesen und Orthesen",
    "Anzahl der Lieferanten von Prothesen und Orthesen",
    "Anzahl der HCPCS-Codes für Prothetik und Orthotik",
    "Anzahl der Leistungsempfänger von Prothesen und Orthesen",
    "Anzahl der Leistungsansprüche für Prothetik und Orthotik",
    "Anzahl der Dienstleistungen für Prothetik und Orthotik",
    "Vom Anbieter eingereichte Gebühren für Prothetik und Orthotik",
    "Medicare-zulässiger Betrag für Prothetik und Orthotik",
    "Medicare-Zahlbetrag für Prothetik und Orthotik",
    "Indikator zur Unterdrückung von Arzneimitteln und Nahrungsergänzungsprodukten",
    "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten",
    "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte",
    "Anzahl der Leistungsempfänger von Arzneimitteln und Nahrungsergänzungsprodukten",
    "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte",
    "Anzahl der Leistungen für Arzneimittel und Nahrungsergänzungsprodukte",
    "Vom Anbieter eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte",
    "Medicare-zulässiger Betrag für Arzneimittel und Nahrungsergänzungsprodukte",
    "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64"
  ],
  "nested_column_names": [
    "NPI des verweisenden Anbieters",
    "Nachname des verweisenden Anbieters Organisationsname",
    "Vorname des verweisenden Anbieters",
    "Mittelinitial des verweisenden Anbieters",
    "Qualifikationen des verweisenden Anbieters",
    "Geschlecht des verweisenden Anbieters",
    "Unternehmenskennzeichen des verweisenden Anbieters",
    "Straße des verweisenden Anbieters",
    "Adresszeile 2 des verweisenden Anbieters",
    "Stadt des verweisenden Anbieters",
    "Bundesstaat des verweisenden Anbieters",
    "Postleitzahl des verweisenden Anbieters",
    "Land des verweisenden Anbieters",
    "Typ des verweisenden Anbieters",
    "Typkennzeichen des verweisenden Anbieters",
    "Anzahl der Lieferanten",
    "Anzahl der HCPCS-Codes der Lieferanten",
    "Anzahl der Begünstigten der Lieferanten",
    "Anzahl der Lieferantenansprüche",
    "Anzahl der Lieferantendienstleistungen",
    "Vom Lieferanten eingereichte Gebühren",
    "Vom Medicare genehmigter Betrag des Lieferanten",
    "Medicare-Zahlbetrag an den Lieferanten",
    "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung",
    "Anzahl der Lieferanten für langlebige medizinische Ausrüstung",
    "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung",
    "Anzahl der Begünstigten für langlebige medizinische Ausrüstung",
    "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung",
    "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung",
    "Eingereichte Gebühren für langlebige medizinische Ausrüstung",
    "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung",
    "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung",
    "Unterdrückungskennzeichen für Prothesen und Orthesen",
    "Anzahl der Lieferanten von Prothesen und Orthesen",
    "Anzahl der HCPCS-Codes für Prothesen und Orthesen",
    "Anzahl der Begünstigten für Prothesen und Orthesen",
    "Anzahl der Ansprüche für Prothesen und Orthesen",
    "Anzahl der Dienstleistungen für Prothesen und Orthesen",
    "Eingereichte Gebühren für Prothesen und Orthesen",
    "Vom Medicare genehmigter Betrag für Prothesen und Orthesen",
    "Medicare-Zahlbetrag für Prothesen und Orthesen",
    "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte",
    "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten",
    "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte",
    "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten",
    "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte",
    "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte",
    "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte",
    "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte",
    "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "FLOAT64"
  ],
  "description": [
    "NPI für den verweisenden Anbieter auf dem DMEPOS-Anspruch.",
    "Wenn der verweisende Anbieter in NPPES als Einzelperson registriert ist (Entitätstypcode=’I’), ist dies der Nachname des verweisenden Anbieters. Wenn der verweisende Anbieter als Organisation registriert ist (Entitätstypcode = ‘O’), ist dies der Name der Organisation.",
    "Wenn der verweisende Anbieter in NPPES als Einzelperson registriert ist (Entitätstypcode=’I’), ist dies der Vorname des verweisenden Anbieters. Wenn der verweisende Anbieter als Organisation registriert ist (Entitätstypcode = ‘O’), bleibt dies leer.",
    "Wenn der verweisende Anbieter in NPPES als Einzelperson registriert ist (Entitätstypcode=’I’), ist dies der mittlere Initial des verweisenden Anbieters. Wenn der verweisende Anbieter als Organisation registriert ist (Entitätstypcode = ‘O’), bleibt dies leer.",
    "Wenn der verweisende Anbieter in NPPES als Einzelperson registriert ist (Entitätstypcode=’I’), sind dies die Qualifikationen des verweisenden Anbieters. Wenn der verweisende Anbieter als Organisation registriert ist (Entitätstypcode = ‘O’), bleibt dies leer.",
    "Art der in NPPES gemeldeten Einheit. Ein Code der Entität ‘I’ kennzeichnet verweisende Anbieter, die als Einzelpersonen registriert sind, und ein Entitätstypcode von ‘O’ kennzeichnet verweisende Anbieter, die als Organisationen registriert sind.",
    "Die erste Zeile der Straßenadresse des verweisenden Anbieters, wie in NPPES gemeldet.",
    "Die zweite Zeile der Straßenadresse des verweisenden Anbieters, wie in NPPES gemeldet.",
    "Die Stadt, in der sich der verweisende Anbieter befindet, wie in NPPES gemeldet.",
    "Der Staat, in dem sich der verweisende Anbieter befindet, wie in NPPES gemeldet. Die fünfzig US-Bundesstaaten und der District of Columbia werden durch das staatliche Abkürzungskennzeichen gemeldet. Die folgenden Werte werden für andere Gebiete verwendet: 'XX' = 'Unknown' 'AA' = 'Armed Forces Central/South America' 'AE' = 'Armed Forces Europe' 'AP' = 'Armed Forces Pacific' 'AS' = 'American Samoa' 'GU' = 'Guam' 'MP' = 'North Mariana Islands' 'PR' = 'Puerto Rico' 'VI' = 'Virgin Islands' 'ZZ' = 'Foreign Country'",
    "Die Postleitzahl des verweisenden Anbieters, wie in NPPES gemeldet.",
    "Das Land, in dem sich der verweisende Anbieter befindet, wie in NPPES gemeldet. Der Ländercode wird für jeden Staat oder US-Besitz durch 'US' angegeben. Für Auslandsländer (d. h. Staatwerte von ‘ZZ’), umfassen die Anbieterlandwerte Folgendes: ‘AE’ = ‘United Arab Emirates’; ‘IL’= Israel’; ‘AR’= ‘Argentina’; ‘IN’= India’; ‘AU’= ‘Australia’; ‘IS’= Iceland; ‘BR’= ‘Brazil’; ‘IT’= Italy’; ‘CA’= ‘Canada’; ‘JP’= Japan’; ‘CH’= Switzerland’; ‘KR’= ‘Korea’; ‘CN’= China’; ‘NL’= ‘Netherlands’; ‘CO’= Colombia’; ‘PK’= ‘Pakistan’; ‘DE’= ‘Germany’; ‘SA’= ‘Saudi Arabia’; ‘ES’= ‘Spain’; ‘SY’= ‘Syria’; ‘FR’= France’; ‘TR’= ‘Turkey’; ‘GB’= Great Britain’; ‘VE’= ‘Venezuela’; ‘HU’= Hungary’",
    "Aus dem Medicare-Anbieter-/Lieferanten-Spezialitätencode, der auf allen Part-B-nicht-Institutionellen Ansprüchen (DMEPOS & nicht-DMEPOS) gemeldet ist. Für verweisende Anbieter, die mehr als einen Medicare-Spezialitätencode in ihren Ansprüchen gemeldet haben, wurde der mit der größten Anzahl von Serviceleistungen verknüpfte Medicare-Spezialitätencode verwendet. Falls die NPI eines Verordners keinen zugehörigen Part-B-Anspruch hatte, wurde der dem NPI in NPPES zugeordnete Taxonomy-Code mithilfe eines externen Crosswalks hier veröffentlicht: http://www.cms.gov/Medicare/Provider-Enrollment-and-Certification/MedicareProviderSupEnroll/Taxonomy.html. Für alle Taxonomy-Codes, die nicht in einen Medicare-Spezialitätencode abgebildet werden konnten, wurde die Taxonomy-Klassifikationsbeschreibung verwendet.",
    "Eine Flag-Variable, die die Quelle des Typs des verweisenden Anbieters angibt: \"S\" = Medicare Specialty Code description \"T\" = Taxonomy Code Classification description",
    "Anzahl der Lieferanten, die Produkte/Dienstleistungen über DMEPOS-MACs abrechnen.",
    "Gesamtanzahl der eindeutigen DMEPOS-Produkt-/Dienstleistungs-HCPCS-Codes, die von Lieferanten abgerechnet und vom verweisenden Anbieter bestellt wurden.",
    "Gesamtzahl der eindeutigen Begünstigten, die mit DMEPOS-Ansprüchen verbunden sind, die von Lieferanten eingereicht und vom verweisenden Anbieter bestellt wurden. Begünstigtenzahlen unter 11 wurden zum Schutz der Privatsphäre der Medicare-Begünstigten unterdrückt.",
    "Gesamtzahl der DMEPOS-Ansprüche, die von Lieferanten eingereicht wurden und Produkte/Dienstleistungen, die vom verweisenden Anbieter bestellt wurden, widerspiegeln.",
    "Gesamtanzahl der DMEPOS-Produkte/Dienstleistungen, die von Lieferanten erbracht und vom verweisenden Anbieter bestellt wurden.",
    "Die Gesamtkosten, die Lieferanten für alle DMEPOS-Produkte/Dienstleistungen erhoben haben, die vom verweisenden Anbieter bestellt wurden.",
    "Der von Medicare zulässige Betrag für alle DMEPOS-Produkte/Dienstleistungen, die vom verweisenden Anbieter bestellt wurden. Diese Zahl ist die Summe aus dem von Medicare gezahlten Betrag, dem Selbstbehalt und der Zuzahlung, für die der Begünstigte verantwortlich ist, und allen Beträgen, die von einem Dritten zu zahlen sind.",
    "Der von Medicare gezahlte Betrag, nachdem Selbstbehalt und Zuzahlungen von allen DMEPOS-Positionen des Lieferanten abgezogen wurden, die vom verweisenden Anbieter bestellt wurden.",
    "Ein 1-Byte-Wert, der bei Bedarf die Unterdrückung der Nutzungs-, Abrechnungs- und Zahlungsinformationen im Zusammenhang mit Prothese- und Orthesen-HCPCS-Codes definiert. Ein Wert von '*' bedeutet, dass die unterdrückten Informationen auf einer prothetisch- und orthotisch-spezifischen Anspruchszahl von 1 bis 10 basieren. Ein Wert von '#' bedeutet, dass die prothetisch- und orthotisch-spezifischen Informationen gegengeunterdrückt wurden. Gegenunterdrückung ist erforderlich, wenn die Anzeige der prothetisch- und orthotisch-spezifischen Daten verwendet werden könnte, um unterdrückte Werte in nicht-prothetisch- und orthotisch-spezifischen Spalten neu zu berechnen.",
    "Anzahl der Lieferanten, die prothetische und orthotische Produkte/Dienstleistungen liefern.",
    "Gesamtanzahl der eindeutigen prothetischen und orthotischen HCPCS-Codes, die von Lieferanten abgerechnet und vom verweisenden Anbieter bestellt wurden.",
    "Gesamtzahl der eindeutigen Begünstigten, die mit prothetischen und orthotischen Ansprüchen verbunden sind, die von Lieferanten eingereicht und vom verweisenden Anbieter bestellt wurden. Begünstigtenzahlen unter 11 wurden zum Schutz der Privatsphäre der Medicare-Begünstigten unterdrückt.",
    "Gesamtanzahl der Prothese- und Orthese-Ansprüche, die von Lieferanten eingereicht wurden und die vom verweisenden Anbieter bestellten Produkte/Dienstleistungen widerspiegeln.",
    "Gesamtanzahl der Prothese- und Orthese-Produkte/Dienstleistungen, die von Lieferanten erbracht und vom verweisenden Anbieter bestellt wurden.",
    "Die Gesamtkosten, die Lieferanten für alle Prothese- und Orthese-Produkte/Dienstleistungen erhoben haben, die vom verweisenden Anbieter bestellt wurden.",
    "Der von Medicare zulässige Betrag für alle Prothese- und Orthese-Produkte/Dienstleistungen, die vom verweisenden Anbieter bestellt wurden. Diese Summe setzt sich aus dem von Medicare gezahlten Betrag, dem Selbstbehalt und der Zuzahlung, die der Begünstigte zu zahlen hat, sowie allen Beträgen, die von einem Dritten zu zahlen sind, zusammen.",
    "Der von Medicare gezahlte Betrag an Lieferanten, nachdem Selbstbehalt und Zuzahlungen von den Prothese- und Orthese-Positionen abgezogen wurden, die vom verweisenden Anbieter bestellt wurden.",
    "Ein 1-Byte-Wert, der bei Bedarf die Unterdrückung der Nutzungs-, Abrechnungs- und Zahlungsinformationen im Zusammenhang mit Arzneimittel- und Ernährungs-HCPCS-Codes definiert. Ein Wert von '*' bedeutet, dass die unterdrückten Informationen auf einer arzneimittel- und ernährungs-spezifischen Anspruchszahl von 1 bis 10 basieren. Ein Wert von '#' bedeutet, dass die arzneimittel- und ernährungs-spezifischen Informationen gegengeunterdrückt wurden. Gegenunterdrückung ist erforderlich, wenn die Anzeige der arzneimittel- und ernährungs-spezifischen Daten verwendet werden könnte, um unterdrückte Werte in nicht-arzneimittel- und ernährungs-spezifischen Spalten neu zu berechnen.",
    "Anzahl der Lieferanten, die Arzneimittel- und Ernährungsprodukte/Dienstleistungen liefern.",
    "Gesamtanzahl der eindeutigen Arzneimittel- und Ernährungs-HCPCS-Codes, die von Lieferanten abgerechnet und vom verweisenden Anbieter bestellt wurden.",
    "Gesamtzahl der eindeutigen Begünstigten, die mit Arzneimittel- und Ernährungsprodukt-Ansprüchen verbunden sind, die von Lieferanten eingereicht und vom verweisenden Anbieter bestellt wurden. Die Begünstigten unter 11 wurden zum Schutz der Privatsphäre der Medicare-Begünstigten unterdrückt.",
    "Gesamtzahl der Arzneimittel- und Ernährungsprodukt-Ansprüche, die von Lieferanten eingereicht wurden, und die vom verweisenden Anbieter bestellten Dienstleistungen widerspiegeln.",
    "Gesamtanzahl der Arzneimittel- und Ernährungsprodukte/Dienstleistungen, die von Lieferanten erbracht und vom verweisenden Anbieter bestellt wurden.",
    "Die Gesamtkosten, die Lieferanten für alle Arzneimittel- und Ernährungsprodukte/Dienstleistungen erhoben haben, die vom verweisenden Anbieter bestellt wurden.",
    "Der von Medicare zulässige Betrag für Arzneimittel- und Ernährungsprodukte/Dienstleistungen, die vom verweisenden Anbieter bestellt wurden. Diese Summe setzt sich aus dem von Medicare gezahlten Betrag, dem Selbstbehalt und der Zuzahlung, die der Begünstigte zu zahlen hat, und allen Beträgen, die von einem Dritten zu zahlen sind.",
    "Der von Medicare gezahlte Betrag an Lieferanten, nachdem Selbstbehalt und Zuzahlungen von den Arzneimittel- und Ernährungs-Positionen abgezogen wurden, die vom verweisenden Anbieter bestellt wurden.",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "sample_rows": [
    {
      "NPI des verweisenden Anbieters": "1255456794",
      "Nachname des verweisenden Anbieters Organisationsname": "GOSHEN MEDICAL CENTER INCORPORATED",
      "Vorname des verweisenden Anbieters": null,
      "Mittelinitial des verweisenden Anbieters": null,
      "Qualifikationen des verweisenden Anbieters": null,
      "Geschlecht des verweisenden Anbieters": null,
      "Unternehmenskennzeichen des verweisenden Anbieters": "O",
      "Straße des verweisenden Anbieters": "2701 MEDICAL OFFICE PL",
      "Adresszeile 2 des verweisenden Anbieters": null,
      "Stadt des verweisenden Anbieters": "GOLDSBORO",
      "Bundesstaat des verweisenden Anbieters": "NC",
      "Postleitzahl des verweisenden Anbieters": "275349458",
      "Land des verweisenden Anbieters": "US",
      "Typ des verweisenden Anbieters": "Rehabilitation Agency",
      "Typkennzeichen des verweisenden Anbieters": "S",
      "Anzahl der Lieferanten": 4,
      "Anzahl der HCPCS-Codes der Lieferanten": 22,
      "Anzahl der Begünstigten der Lieferanten": 22,
      "Anzahl der Lieferantenansprüche": 71,
      "Anzahl der Lieferantendienstleistungen": 6145,
      "Vom Lieferanten eingereichte Gebühren": 18224.89,
      "Vom Medicare genehmigter Betrag des Lieferanten": 9951.73,
      "Medicare-Zahlbetrag an den Lieferanten": 7331.7,
      "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung": null,
      "Anzahl der Lieferanten für langlebige medizinische Ausrüstung": 3,
      "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung": 17,
      "Anzahl der Begünstigten für langlebige medizinische Ausrüstung": 15,
      "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung": 55,
      "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung": 4651,
      "Eingereichte Gebühren für langlebige medizinische Ausrüstung": 12967.25,
      "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung": 5447.63,
      "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung": 4043.63,
      "Unterdrückungskennzeichen für Prothesen und Orthesen": null,
      "Anzahl der Lieferanten von Prothesen und Orthesen": 2,
      "Anzahl der HCPCS-Codes für Prothesen und Orthesen": 4,
      "Anzahl der Begünstigten für Prothesen und Orthesen": null,
      "Anzahl der Ansprüche für Prothesen und Orthesen": 16,
      "Anzahl der Dienstleistungen für Prothesen und Orthesen": 1474,
      "Eingereichte Gebühren für Prothesen und Orthesen": 4597.64,
      "Vom Medicare genehmigter Betrag für Prothesen und Orthesen": 3844.1,
      "Medicare-Zahlbetrag für Prothesen und Orthesen": 2792.83,
      "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte": null,
      "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten": 1,
      "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte": 1,
      "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten": null,
      "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte": 20,
      "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte": 20,
      "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte": 660.0,
      "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte": 660.0,
      "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte": 495.24
    },
    {
      "NPI des verweisenden Anbieters": "1689798449",
      "Nachname des verweisenden Anbieters Organisationsname": "P. REDDY TUKIVAKALA, M.D., P.A.",
      "Vorname des verweisenden Anbieters": null,
      "Mittelinitial des verweisenden Anbieters": null,
      "Qualifikationen des verweisenden Anbieters": null,
      "Geschlecht des verweisenden Anbieters": null,
      "Unternehmenskennzeichen des verweisenden Anbieters": "O",
      "Straße des verweisenden Anbieters": "810 NEWMAN DR # A",
      "Adresszeile 2 des verweisenden Anbieters": null,
      "Stadt des verweisenden Anbieters": "HELENA",
      "Bundesstaat des verweisenden Anbieters": "AR",
      "Postleitzahl des verweisenden Anbieters": "723428950",
      "Land des verweisenden Anbieters": "US",
      "Typ des verweisenden Anbieters": "Clinic/Center",
      "Typkennzeichen des verweisenden Anbieters": "T",
      "Anzahl der Lieferanten": 14,
      "Anzahl der HCPCS-Codes der Lieferanten": 24,
      "Anzahl der Begünstigten der Lieferanten": 27,
      "Anzahl der Lieferantenansprüche": 113,
      "Anzahl der Lieferantendienstleistungen": 2267,
      "Vom Lieferanten eingereichte Gebühren": 32554.57,
      "Vom Medicare genehmigter Betrag des Lieferanten": 12920.41,
      "Medicare-Zahlbetrag an den Lieferanten": 9711.29,
      "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung": null,
      "Anzahl der Lieferanten für langlebige medizinische Ausrüstung": 13,
      "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung": 20,
      "Anzahl der Begünstigten für langlebige medizinische Ausrüstung": 25,
      "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung": 102,
      "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung": 2046,
      "Eingereichte Gebühren für langlebige medizinische Ausrüstung": 28700.57,
      "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung": 9946.36,
      "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung": 7400.22,
      "Unterdrückungskennzeichen für Prothesen und Orthesen": null,
      "Anzahl der Lieferanten von Prothesen und Orthesen": 2,
      "Anzahl der HCPCS-Codes für Prothesen und Orthesen": 3,
      "Anzahl der Begünstigten für Prothesen und Orthesen": null,
      "Anzahl der Ansprüche für Prothesen und Orthesen": 11,
      "Anzahl der Dienstleistungen für Prothesen und Orthesen": 203,
      "Eingereichte Gebühren für Prothesen und Orthesen": 2450.0,
      "Vom Medicare genehmigter Betrag für Prothesen und Orthesen": 2380.05,
      "Medicare-Zahlbetrag für Prothesen und Orthesen": 1869.16,
      "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte": null,
      "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten": 1,
      "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte": 1,
      "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten": null,
      "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte": 18,
      "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte": 18,
      "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte": 1404.0,
      "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte": 594.0,
      "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte": 441.91
    },
    {
      "NPI des verweisenden Anbieters": "1871521807",
      "Nachname des verweisenden Anbieters Organisationsname": "DUKE UNIVERSITY AFFILIATED PHYSICIANS, INC.",
      "Vorname des verweisenden Anbieters": null,
      "Mittelinitial des verweisenden Anbieters": null,
      "Qualifikationen des verweisenden Anbieters": null,
      "Geschlecht des verweisenden Anbieters": null,
      "Unternehmenskennzeichen des verweisenden Anbieters": "O",
      "Straße des verweisenden Anbieters": "2503 E LYON STATION RD",
      "Adresszeile 2 des verweisenden Anbieters": null,
      "Stadt des verweisenden Anbieters": "CREEDMOOR",
      "Bundesstaat des verweisenden Anbieters": "NC",
      "Postleitzahl des verweisenden Anbieters": "275229112",
      "Land des verweisenden Anbieters": "US",
      "Typ des verweisenden Anbieters": "Multispecialty Clinic/Group Practice",
      "Typkennzeichen des verweisenden Anbieters": "S",
      "Anzahl der Lieferanten": 6,
      "Anzahl der HCPCS-Codes der Lieferanten": 19,
      "Anzahl der Begünstigten der Lieferanten": null,
      "Anzahl der Lieferantenansprüche": 42,
      "Anzahl der Lieferantendienstleistungen": 5689,
      "Vom Lieferanten eingereichte Gebühren": 16178.1,
      "Vom Medicare genehmigter Betrag des Lieferanten": 9841.86,
      "Medicare-Zahlbetrag an den Lieferanten": 7522.34,
      "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung": null,
      "Anzahl der Lieferanten für langlebige medizinische Ausrüstung": 3,
      "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung": 7,
      "Anzahl der Begünstigten für langlebige medizinische Ausrüstung": null,
      "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung": 14,
      "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung": 114,
      "Eingereichte Gebühren für langlebige medizinische Ausrüstung": 4531.74,
      "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung": 3306.57,
      "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung": 2555.47,
      "Unterdrückungskennzeichen für Prothesen und Orthesen": null,
      "Anzahl der Lieferanten von Prothesen und Orthesen": 3,
      "Anzahl der HCPCS-Codes für Prothesen und Orthesen": 10,
      "Anzahl der Begünstigten für Prothesen und Orthesen": null,
      "Anzahl der Ansprüche für Prothesen und Orthesen": 17,
      "Anzahl der Dienstleistungen für Prothesen und Orthesen": 618,
      "Eingereichte Gebühren für Prothesen und Orthesen": 5209.5,
      "Vom Medicare genehmigter Betrag für Prothesen und Orthesen": 2419.16,
      "Medicare-Zahlbetrag für Prothesen und Orthesen": 1832.42,
      "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte": null,
      "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten": 1,
      "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte": 2,
      "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten": null,
      "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte": 12,
      "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte": 4957,
      "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte": 6436.86,
      "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte": 4116.13,
      "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte": 3134.45
    },
    {
      "NPI des verweisenden Anbieters": "1912966656",
      "Nachname des verweisenden Anbieters Organisationsname": "HENDERSONVILLE PEDIATRICS, P.A.",
      "Vorname des verweisenden Anbieters": null,
      "Mittelinitial des verweisenden Anbieters": null,
      "Qualifikationen des verweisenden Anbieters": null,
      "Geschlecht des verweisenden Anbieters": null,
      "Unternehmenskennzeichen des verweisenden Anbieters": "O",
      "Straße des verweisenden Anbieters": "600 BEVERLY HANKS CTR",
      "Adresszeile 2 des verweisenden Anbieters": null,
      "Stadt des verweisenden Anbieters": "HENDERSONVILLE",
      "Bundesstaat des verweisenden Anbieters": "NC",
      "Postleitzahl des verweisenden Anbieters": "287922305",
      "Land des verweisenden Anbieters": "US",
      "Typ des verweisenden Anbieters": "Specialist",
      "Typkennzeichen des verweisenden Anbieters": "T",
      "Anzahl der Lieferanten": 1,
      "Anzahl der HCPCS-Codes der Lieferanten": 13,
      "Anzahl der Begünstigten der Lieferanten": null,
      "Anzahl der Lieferantenansprüche": 42,
      "Anzahl der Lieferantendienstleistungen": 8332,
      "Vom Lieferanten eingereichte Gebühren": 46420.32,
      "Vom Medicare genehmigter Betrag des Lieferanten": 29044.83,
      "Medicare-Zahlbetrag an den Lieferanten": 22802.89,
      "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung": null,
      "Anzahl der Lieferanten für langlebige medizinische Ausrüstung": 1,
      "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung": 7,
      "Anzahl der Begünstigten für langlebige medizinische Ausrüstung": null,
      "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung": 34,
      "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung": 2558,
      "Eingereichte Gebühren für langlebige medizinische Ausrüstung": 32205.11,
      "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung": 19704.71,
      "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung": 15419.16,
      "Unterdrückungskennzeichen für Prothesen und Orthesen": null,
      "Anzahl der Lieferanten von Prothesen und Orthesen": 1,
      "Anzahl der HCPCS-Codes für Prothesen und Orthesen": 3,
      "Anzahl der Begünstigten für Prothesen und Orthesen": null,
      "Anzahl der Ansprüche für Prothesen und Orthesen": 14,
      "Anzahl der Dienstleistungen für Prothesen und Orthesen": 215,
      "Eingereichte Gebühren für Prothesen und Orthesen": 4524.0,
      "Vom Medicare genehmigter Betrag für Prothesen und Orthesen": 2427.13,
      "Medicare-Zahlbetrag für Prothesen und Orthesen": 1920.41,
      "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte": null,
      "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten": 1,
      "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte": 3,
      "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten": null,
      "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte": 21,
      "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte": 5559,
      "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte": 9691.21,
      "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte": 6912.99,
      "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte": 5463.32
    },
    {
      "NPI des verweisenden Anbieters": "1235149949",
      "Nachname des verweisenden Anbieters Organisationsname": "BASCOM CLARENCE RANEY",
      "Vorname des verweisenden Anbieters": null,
      "Mittelinitial des verweisenden Anbieters": null,
      "Qualifikationen des verweisenden Anbieters": null,
      "Geschlecht des verweisenden Anbieters": null,
      "Unternehmenskennzeichen des verweisenden Anbieters": "O",
      "Straße des verweisenden Anbieters": "8401 N CENTURY BLVD",
      "Adresszeile 2 des verweisenden Anbieters": null,
      "Stadt des verweisenden Anbieters": "CENTURY",
      "Bundesstaat des verweisenden Anbieters": "FL",
      "Postleitzahl des verweisenden Anbieters": "325351631",
      "Land des verweisenden Anbieters": "US",
      "Typ des verweisenden Anbieters": "Rehabilitation Agency",
      "Typkennzeichen des verweisenden Anbieters": "S",
      "Anzahl der Lieferanten": 3,
      "Anzahl der HCPCS-Codes der Lieferanten": 40,
      "Anzahl der Begünstigten der Lieferanten": 53,
      "Anzahl der Lieferantenansprüche": 217,
      "Anzahl der Lieferantendienstleistungen": 4578,
      "Vom Lieferanten eingereichte Gebühren": 56853.12,
      "Vom Medicare genehmigter Betrag des Lieferanten": 35104.21,
      "Medicare-Zahlbetrag an den Lieferanten": 26930.8,
      "Unterdrückungskennzeichen für langlebige medizinische Ausrüstung": null,
      "Anzahl der Lieferanten für langlebige medizinische Ausrüstung": 3,
      "Anzahl der HCPCS-Codes für langlebige medizinische Ausrüstung": 33,
      "Anzahl der Begünstigten für langlebige medizinische Ausrüstung": 43,
      "Anzahl der Abrechnungen für langlebige medizinische Ausrüstung": 198,
      "Anzahl der Dienstleistungen für langlebige medizinische Ausrüstung": 4323,
      "Eingereichte Gebühren für langlebige medizinische Ausrüstung": 47845.12,
      "Vom Medicare genehmigter Betrag für langlebige medizinische Ausrüstung": 27517.19,
      "Medicare-Zahlbetrag für langlebige medizinische Ausrüstung": 21166.19,
      "Unterdrückungskennzeichen für Prothesen und Orthesen": null,
      "Anzahl der Lieferanten von Prothesen und Orthesen": 2,
      "Anzahl der HCPCS-Codes für Prothesen und Orthesen": 4,
      "Anzahl der Begünstigten für Prothesen und Orthesen": 17,
      "Anzahl der Ansprüche für Prothesen und Orthesen": 17,
      "Anzahl der Dienstleistungen für Prothesen und Orthesen": 115,
      "Eingereichte Gebühren für Prothesen und Orthesen": 5873.0,
      "Vom Medicare genehmigter Betrag für Prothesen und Orthesen": 4761.27,
      "Medicare-Zahlbetrag für Prothesen und Orthesen": 3628.94,
      "Unterdrückungskennzeichen für Arzneimittel und Nahrungsergänzungsprodukte": null,
      "Anzahl der Lieferanten von Arzneimitteln und Nahrungsergänzungsprodukten": 2,
      "Anzahl der HCPCS-Codes für Arzneimittel und Nahrungsergänzungsprodukte": 3,
      "Anzahl der Begünstigten von Arzneimitteln und Nahrungsergänzungsprodukten": null,
      "Anzahl der Ansprüche für Arzneimittel und Nahrungsergänzungsprodukte": 21,
      "Anzahl der Dienstleistungen für Arzneimittel und Nahrungsergänzungsprodukte": 140,
      "Eingereichte Gebühren für Arzneimittel und Nahrungsergänzungsprodukte": 3135.0,
      "Vom Medicare genehmigter Betrag für Arzneimittel und Nahrungsergänzungsprodukte": 2825.75,
      "Medicare-Zahlbetrag für Arzneimittel und Nahrungsergänzungsprodukte": 2135.67
    }
  ]
}