{"instance_id":"bq011","db":"ga4","question":"Wie viele eindeutige Pseudo-Benutzer hatten positive Engagementzeit im 7-Tage-Zeitraum, der am January 7, 2021 at 23:59:59 endet, und keine positive Engagementzeit im 2-Tage-Zeitraum, der am selben Datum endet (January 7, 2021 at 23:59:59)?","external_knowledge":"ga4_obfuscated_sample_ecommerce.events.md"}
{"instance_id":"bq010","db":"ga360","question":"Finde das am besten verkaufte Produkt unter den Kunden, die im Juli 2017 'Youtube Men’s Vintage Henley' gekauft haben, wobei dieses ausgeschlossen wird.","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq009","db":"ga360","question":"Welche Traffic-Quelle hat den höchsten Gesamtumsatz aus Transaktionen im Jahr 2017, und wie groß ist die Differenz in Millionen (auf zwei Dezimalstellen gerundet) zwischen dem höchsten und dem niedrigsten monatlichen Gesamtumsatz aus Transaktionen für diese Traffic-Quelle?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq001","db":"ga360","question":"Für jeden Besucher, der im Februar 2017 mindestens eine Transaktion getätigt hat, wie viele Tage verstrichen sind zwischen dem Datum seines ersten Besuchs im Februar und dem Datum seiner ersten Transaktion im Februar, und auf welchem Gerät hat er diese erste Transaktion getätigt?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq002","db":"ga360","question":"Im ersten Halbjahr 2017, mit Fokus auf den Hits-Produktumsatz, welche Traffic-Quelle den höchsten Gesamtumsatz aus Produkten erzielte, und wie hoch waren die maximalen täglichen, wöchentlichen und monatlichen Produktumsätze (in Millionen) für diese leistungsstärkste Quelle über diesen Zeitraum?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq003","db":"ga360","question":"Zwischen April 1 und July 31 2017 verwenden Sie die hits product revenue data zusammen mit den totals transactions, um Sessions als purchase (transactions ≥ 1 and productRevenue not null) oder non-purchase (transactions null and productRevenue null) zu klassifizieren, vergleichen Sie die durchschnittlichen Seitenaufrufe pro Besucher für jede Gruppe nach Monat","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq004","db":"ga360","question":"Im Juli 2017, unter allen Besuchern, die ein YouTube-bezogenes Produkt gekauft haben, welches einzelne Produkt – ausgenommen solche, die ‘YouTube’ im Produktnamen enthalten – die höchste Gesamtmenge an gekauften Einheiten hatte?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq008","db":"ga360","question":"Im Januar 2017, unter Besuchern, deren Kampagnenname 'Data Share' enthält und die auf eine Seite zugegriffen haben, die mit '/home' beginnt, welche Seite haben sie als nächste am häufigsten besucht, und wie viel Zeit (in Sekunden) sie auf der '/home'-Seite verbracht haben, bevor sie weiterzogen?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq269","db":"ga360","question":"Zwischen dem 1. Juni 2017 und dem 31. Juli 2017 berücksichtigen Sie nur Sitzungen, die nicht NULL-Seitenaufrufe haben. Klassifizieren Sie jede Sitzung als ‘purchase’, falls sie mindestens eine Transaktion hat, oder ‘non_purchase’ andernfalls. Für jeden Monat summieren Sie die Gesamtseitenaufrufe pro Besucher unter jeder Klassifikation, dann berechnen Sie den durchschnittlichen Seitenaufruf pro Besucher sowohl für die purchase- als auch die non_purchase-Gruppen in jedem Monat, und präsentieren Sie die Ergebnisse nebeneinander.","external_knowledge":null}
{"instance_id":"bq268","db":"ga360","question":"Bestimme die längste Anzahl von Tagen zwischen dem ersten Besuch und dem letzten protokollierten Ereignis (entweder dem letzten Besuch oder der ersten Transaktion) für einen Benutzer, wobei das zuletzt aufgezeichnete Ereignis mit einem mobilen Gerät verbunden ist. Das zuletzt aufgezeichnete Ereignis könnte entweder der letzte Besuch oder die erste Transaktion sein, und du solltest dich auf Benutzer konzentrieren, deren zuletzt aufgezeichnetes Ereignis auf einem mobilen Gerät aufgetreten ist.","external_knowledge":null}
{"instance_id":"bq270","db":"ga360","question":"Wie hoch waren die monatlichen Add-to-Cart- und Kauf-Konversionsraten, berechnet als Prozentsatz der Seitenaufrufe auf Produktdetailseiten, von Januar bis März 2017?","external_knowledge":"ga360_hits.eCommerceAction.action_type.md"}
{"instance_id":"bq275","db":"ga360","question":"Welche Besucher-IDs gehören zu Nutzern, deren erste Transaktion auf einem Gerät stattfand, das explizit als 'mobile' gekennzeichnet ist, zu einem späteren Datum als ihr erster Besuch?","external_knowledge":null}
{"instance_id":"bq374","db":"ga360","question":"Berechnet den Prozentsatz der neuen Benutzer, die zwischen August 1, 2016 und April 30, 2017 sowohl während ihres ersten Besuchs länger als 5 Minuten auf der Website blieben als auch bei einem späteren Besuch einen Kauf tätigten, relativ zur Gesamtzahl der neuen Benutzer im selben Zeitraum.","external_knowledge":null}
{"instance_id":"sf_bq029","db":"PATENTS","question":"Ermitteln Sie den Durchschnitt der Erfinder pro Patent und die Gesamtanzahl der Patentanmeldungen in Kanada (CA) für jeden 5-Jahres-Zeitraum von 1960 bis 2020, basierend auf den Veröffentlichungsdaten. Berücksichtigen Sie nur Patente, bei denen mindestens ein Erfinder aufgeführt ist, und gruppieren Sie die Ergebnisse nach 5-Jahres-Intervallen (1960-1964, 1965-1969 usw.).","external_knowledge":null}
{"instance_id":"sf_bq026","db":"PATENTS","question":"Für den Patentinhaber, der in der Patentkategorie 'A61' am aktivsten war, möchte ich die fünf Patentjurisdiktionen-Codes erfahren, in denen er während seines geschäftigsten Jahres die meisten Patente angemeldet hat, durch Kommas getrennt.","external_knowledge":null}
{"instance_id":"sf_bq091","db":"PATENTS","question":"In welchem Jahr hat der Rechteinhaber mit den meisten Anmeldungen in der Patentkategorie 'A61' die größte Anzahl von Anmeldungen eingereicht?","external_knowledge":null}
{"instance_id":"sf_bq099","db":"PATENTS","question":"Für die Patentsklasse A01B3 möchte ich die Informationen der drei größten Inhaber basierend auf der Gesamtzahl der Anmeldungen analysieren. Bitte liefern Sie die folgenden fünf Informationen: der Name dieses Inhabers, die Gesamtzahl der Anmeldungen, das Jahr mit den meisten Anmeldungen, die Anzahl der Anmeldungen in diesem Jahr und der Ländercode mit den meisten Anmeldungen in diesem Jahr.","external_knowledge":null}
{"instance_id":"sf_bq033","db":"PATENTS","question":"Wie viele Veröffentlichungen aus den USA zum Thema IoT (bei denen der Abstract die Phrase 'internet of things' enthält) wurden von 2008 bis 2022 jeweils monatlich eingereicht, einschließlich Monate, in denen es keine Einreichungen gab?","external_knowledge":null}
{"instance_id":"sf_bq209","db":"PATENTS","question":"Kannst du die Anzahl der Nutzpatente berechnen, die im Jahr 2010 erteilt wurden und genau eine Forward-Zitation innerhalb eines 10-Jahres-Fensters nach dem Anmelde-/Einreichungsdatum haben? Für diese Analyse sollten Forward-Zitationen als unterschiedliche zitierende Anmeldungsnummern gezählt werden, die das Patent innerhalb von 10 Jahren nach dem eigenen Anmelde-/Einreichungsdatum zitiert haben.","external_knowledge":null}
{"instance_id":"sf_bq027","db":"PATENTS","question":"Für Patente, die zwischen 2010 und 2018 erteilt wurden, geben Sie die Publikationsnummer jedes Patents sowie die Anzahl der Rückwärtszitate an, die es in der SEA-Kategorie erhalten hat.","external_knowledge":null}
{"instance_id":"sf_bq210","db":"PATENTS","question":"Wie viele US-B2-Patente, die zwischen 2008 und 2018 erteilt wurden, enthalten Ansprüche, die nicht das Wort 'claim' enthalten?","external_knowledge":null}
{"instance_id":"sf_bq211","db":"PATENTS","question":"Unter Patenten, die zwischen 2010 und 2023 in CN vergeben wurden, wie viele davon gehören zu Familien, die insgesamt mehr als eine unterschiedliche Anmeldung haben?","external_knowledge":null}
{"instance_id":"sf_bq213","db":"PATENTS","question":"Was ist der häufigste 4-stellige IPC-Code unter den US-B2-Gebrauchspatenten, die zwischen Juni und August 2022 erteilt wurden?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq212","db":"PATENTS","question":"Für Utility-Patente der Vereinigten Staaten unter der B2-Klassifikation, die zwischen Juni und September 2022 erteilt wurden, identifizieren Sie den am häufigsten vorkommenden 4-stelligen IPC-Code für jedes Patent. Dann listen Sie die Publikationsnummern und IPC4-Codes der Patente auf, bei denen dieser Code 10 oder mehr Mal vorkommt.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq214","db":"PATENTS_GOOGLE","question":"Für US-Utility-Patente der B2-Klassifikation, die zwischen 2010 und 2014 erteilt wurden, finden Sie das Patent mit den meisten Vorwärtszitierungen innerhalb eines Monats nach dem Anmeldedatum, und identifizieren Sie das dem gleichen Einreichungsjahr entsprechenden Patent, unabhängig von seinem Typ.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq216","db":"PATENTS_GOOGLE","question":"Identifizieren Sie die fünf Patente, die im selben Jahr wie `US-9741766-B2` eingereicht wurden und die ihm am ähnlichsten sind, basierend auf technologischen Ähnlichkeiten. Bitte geben Sie die Veröffentlichungsnummern an.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq247","db":"PATENTS_GOOGLE","question":"Aus dem Publikationen-Datensatz zunächst die sechs Familien mit den meisten Publikationen identifizieren, deren family_id nicht '-1' ist. Anschließend die Tabelle abs_and_emb (verknüpft über publication_number) verwenden, um die IDs jeder dieser Familien zusammen mit jedem nicht-leeren Abstract auszugeben, der ihren Publikationen zugeordnet ist.","external_knowledge":null}
{"instance_id":"sf_bq127","db":"PATENTS_GOOGLE","question":"Für jede Publikationsfamilie, deren früheste Veröffentlichung im Januar 2015 erstmals veröffentlicht wurde, geben Sie bitte das früheste Veröffentlichungsdatum, die eindeutigen Veröffentlichungsnummern, deren Ländercodes, die eindeutigen CPC- und IPC-Codes, eindeutige Familien (nämlich die IDs), die diese Publikationsfamilie zitieren und von ihr zitiert werden. Bitte stellen Sie alle Listen als durch Kommas getrennte Werte dar, alphabetisch sortiert.","external_knowledge":null}
{"instance_id":"sf_bq215","db":"PATENTS","question":"Welches US-Patent (mit dem B2-Kind-Code und einem Erteilungsdatum zwischen 2015 und 2018) hat den höchsten Originalitätsscore, der berechnet wird als 1 - (die Summe der quadrierten Vorkommen verschiedener 4-stelliger IPC-Codes in seinen Rückverweisen geteilt durch das Quadrat der Gesamtvorkommen dieser 4-stelligen IPC-Codes)?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq222","db":"PATENTS","question":"Finde die CPC-Technologiebereiche in Deutschland, die den höchsten exponentiell geglätteten Durchschnitt (Glättungsfaktor 0.1) der Patentanmeldungen pro Jahr hatten, und zwar speziell für Patente, die December 2016 erteilt wurden. Für jede CPC-Gruppe der Ebene 4 zeige den vollständigen Titel, die CPC-Gruppe und das Jahr mit dem höchsten exponentiell geglätteten Durchschnitt der Patentanmeldungen.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq221","db":"PATENTS","question":"Identifizieren Sie die CPC-Technologiebereiche mit dem höchsten exponentiellen gleitenden Durchschnitt der Patentanmeldungen pro Jahr (mit einem Glättungsfaktor von 0.2), wobei nur der erste CPC-Code für jedes Patent berücksichtigt wird, das ein gültiges Einreichungsdatum und eine nicht leere Anmeldenummer hat, und berichten Sie den vollständigen CPC-Titel zusammen mit dem besten Jahr, das mit dem höchsten exponentiellen gleitenden Durchschnitt für jede CPC-Gruppe auf Ebene 5 verbunden ist.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq223","db":"PATENTS","question":"Welche Patentinhaber, ausgenommen DENSO CORP selbst, haben Patente zitiert, die DENSO CORP zugeordnet sind, und wie lauten die Titel der primären CPC-Unterklassen, die mit diesen Zitaten verbunden sind? Geben Sie den Namen jedes zitierenden Patentinhabers (ausgenommen DENSO CORP) an, den vollständigen Titel der primären CPC-Unterklasse (basierend auf dem ersten CPC-Code) und die Anzahl der Zitierungen, aufgeteilt nach dem zitierenden Patentinhaber und dem CPC-Unterklassen-Titel. Stellen Sie sicher, dass nur Zitierungen von Patenten mit gültigen Einreichungsdaten berücksichtigt werden, und konzentrieren Sie sich auf den ersten CPC-Code für jedes zitierenden Patent. Die Ergebnisse sollten DENSO CORP ausdrücklich als zitierenden Patentinhaber ausschließen.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq420","db":"PATENTS_USPTO","question":"Können Sie die fünf wichtigsten Patente identifizieren, die zunächst gemäß Abschnitt 101 abgelehnt wurden und keine zulässigen Ansprüche hatten, basierend auf der Länge ihrer erteilten Ansprüche? Die Patente sollten in den USA zwischen 2010 und 2023 erteilt worden sein. Zusätzlich stellen Sie sicher, dass für jede Anmeldung das erste Office Action-Datum ausgewählt wird. Bitte listen Sie ihre ersten Veröffentlichungsnummern zusammen mit ihren ersten Veröffentlichungsdaten, der Länge der eingereichten Ansprüche und den Erteilungsdaten auf.","external_knowledge":null}
{"instance_id":"sf_bq207","db":"PATENTS_USPTO","question":"Könnten Sie die frühesten Veröffentlichungsnummern, entsprechenden Anmeldungsnummern, Anspruchsnummern und Wortanzahlen für die Top-100 unabhängigen Patentansprüche bereitstellen, basierend auf der höchsten Wortanzahl, abgerufen aus den Claim-Statistiken innerhalb von uspto_oce_claims (gefiltert nach ind_flg='1'), verknüpft mit ihren Veröffentlichungsnummern aus uspto_oce_claims match, und weiter mit Patentenveröffentlichungen verbunden, um sicherzustellen, dass nur die früheste Veröffentlichung für jede Anmeldung enthalten ist, sortiert nach absteigender Wortanzahl, und auf die Top-100-Ergebnisse beschränkt?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq128","db":"PATENTSVIEW","question":"Rufen Sie die folgenden Informationen zu U.S. Patenten ab, die zwischen January 1, 2014 und February 1, 2014 eingereicht wurden. Der Patenttitel und das Abstract. Das Veröffentlichungsdatum des Patents. Die Anzahl der Rückwärtszitationen für jedes Patent (d. h. die Anzahl der Patente, die vom aktuellen Patent vor seinem Anmeldedatum zitiert wurden). Die Anzahl der Vorwärtszitationen für jedes Patent innerhalb der ersten 5 Jahre nach seiner Veröffentlichung (d. h. die Anzahl der Patente, die das aktuelle Patent innerhalb von 5 Jahren nach seiner Veröffentlichung zitiert haben). Für jedes Patent sicherstellen, dass die Vorwärtszitationen nur Zitationen innerhalb der 5 Jahre nach dem Veröffentlichungsdatum zählen, und die Rückwärtszitationen vor dem Anmeldedatum gezählt werden.","external_knowledge":"forward_backward_citation.md"}
{"instance_id":"sf_bq246","db":"PATENTSVIEW","question":"Rufen Sie US-Patente mit der Anzahl von Vorwärtszitationen innerhalb der ersten 3 Jahre nach dem Patentanmeldungsdatum ab (d. h. Patente, die das aktuelle Patent innerhalb von 3 Jahren zitieren). Berücksichtigen Sie nur Patente, die sowohl Rückwärtszitationen innerhalb von 1 Jahr vor dem Patentanmeldungsdatum als auch Vorwärtszitationen innerhalb von 1 Jahr nach dem Patentanmeldungsdatum aufweisen. Die Abfrage sollte sich auf bestimmte CPC-Kategorien konzentrieren, Ergebnisse nach Rückwärtszitationen in absteigender Reihenfolge sortieren und das Patent mit den meisten Rückwärtszitationen zurückgeben, wobei die Ergebnisse auf genau ein Resultat begrenzt werden.","external_knowledge":null}
{"instance_id":"sf_bq052","db":"PATENTSVIEW","question":"Rufen Sie die folgenden Informationen zu US-Patenten ab: Patent-ID, Titel und Anmeldedatum. Die Anzahl der Rückwärtszitate innerhalb von 1 Monat vor dem Anmeldedatum (d. h. Patente, die das aktuelle Patent vor seiner Anmeldung zitiert haben). Die Anzahl der Vorwärtszitate innerhalb von 1 Monat nach dem Anmeldedatum (d. h. Patente, die das aktuelle Patent nach seiner Anmeldung zitiert haben). Der Text der Zusammenfassung des Patents. Einschließen Sie nur Patente, die bestimmten CPC-Kategorien angehören, wie zum Beispiel der Unterabschnitt 'C05' oder der Gruppe 'A01G'. Die Abfrage soll Patente filtern, um nur diejenigen einzuschließen, die mindestens eine Rückwärtszitation oder eine Vorwärtszitation im angegebenen 1-Monatszeitraum haben. Sortieren Sie die Ergebnisse nach dem Anmeldedatum und geben Sie alle übereinstimmenden Datensätze zurück.","external_knowledge":null}
{"instance_id":"sf_bq036","db":"GITHUB_REPOS","question":"Was war die durchschnittliche Anzahl von GitHub-Commits pro Monat im Jahr 2016 für Repositories, die Python-Code enthalten?","external_knowledge":null}
{"instance_id":"sf_bq100","db":"GITHUB_REPOS","question":"Wie können wir die am häufigsten verwendeten Top-10-Pakete in den Inhalten des GitHub-Repositories identifizieren, indem wir nach Import-Anweisungen suchen, die in Klammern eingeschlossen sind, mehrzeilige Importe durch Zeilenumbrüche aufteilen, Paketnamen extrahieren, die in doppelten Anführungszeichen erscheinen, zählen, wie oft diese Pakete vorkommen, Nullergebnisse ignorieren und sie schließlich in absteigender Reihenfolge ihrer Häufigkeit sortieren? Die endgültige Antwort sollte die Anführungszeichen entfernen.","external_knowledge":null}
{"instance_id":"sf_bq101","db":"GITHUB_REPOS","question":"Aus dem Inhalt von GitHub-Repositories, wie können wir die 10 am häufigsten importierten Paketnamen in Java-Quellcodedateien identifizieren, indem wir den Inhalt jeder Datei in Zeilen aufteilen, nach gültigen Import-Anweisungen filtern, nur den Paketteil mit einem geeigneten Regex extrahieren, nach diesen extrahierten Paketnamen gruppieren, deren Vorkommen zählen und schließlich die 10 Pakete zurückgeben, die am häufigsten erscheinen, in absteigender Reihenfolge der Häufigkeit?","external_knowledge":null}
{"instance_id":"sf_bq182","db":"GITHUB_REPOS_DATE","question":"Welche primären Programmiersprachen, die durch die höchste Byteanzahl in jedem Repository bestimmt wurden, hatten mindestens 5 PullRequestEvents am 18. Januar 2023 über alle ihre Repositorien hinweg?","external_knowledge":null}
{"instance_id":"sf_bq217","db":"GITHUB_REPOS_DATE","question":"Am 18. Januar 2023, wie viele Pull-Request-Erstellungsereignisse traten in GitHub-Repositories auf, die JavaScript als eine ihrer Programmiersprachen enthalten? Verwenden Sie Daten aus der githubarchive-Tabelle für die Ereignisse und aus der languages-Tabelle für Informationen zur Programmiersprache des Repositories.","external_knowledge":null}
{"instance_id":"sf_bq191","db":"GITHUB_REPOS_DATE","question":"Aus den 2017 GitHub WatchEvent-Daten finden Sie die beiden Repositories mit mehr als 300 eindeutigen Beobachtern, wobei sichergestellt wird, dass die Ergebnisse mit der Tabelle 'sample_files' verknüpft werden, sodass wir den Namen jedes Repositories zusammen mit seiner eindeutigen Beobachteranzahl zurückgeben, und die Ausgabe auf die zwei Repositories mit der höchsten Beobachteranzahl beschränken.","external_knowledge":null}
{"instance_id":"sf_bq224","db":"GITHUB_REPOS_DATE","question":"Welches Repository mit einer genehmigten Lizenz in `licenses.md` hatte im April 2022 die höchste kombinierte Summe aus Forks, Issues und Watches?","external_knowledge":null}
{"instance_id":"sf_bq192","db":"GITHUB_REPOS_DATE","question":"Finde das aktivste Python-Repository auf GitHub basierend auf der count distinct Watcher-Anzahl, Issues und Forks. Die Abfrage sollte `select` Repositories mit bestimmten Open-Source-Lizenzen (`artistic-2.0`, `isc`, `mit`, `apache-2.0`) auswählen, count distinct Watchers, issue events und forks für jedes Repository im April 2022, und einschließen nur diejenigen mit `.py`-Dateien auf dem `master`-Branch. Join die Lizenzdaten mit Watch counts, issue events und fork counts, dann `sort` nach einer kombinierten Metrik aus Forks, Issues und Watches, returning den Namen und die Count des aktivsten Repository.","external_knowledge":null}
{"instance_id":"sf_bq225","db":"GITHUB_REPOS","question":"Aus den GitHub-Repository-Dateien in 'github_repos.sample_files', zusammen mit 'github_repos.sample_contents', welche 10 Programmiersprachen am häufigsten vorkommen (basierend auf erkannten Dateierweiterungen) in Dateien mit nicht leerem Inhalt, geordnet nach der Anzahl ihrer Dateien in absteigender Reihenfolge?","external_knowledge":"lang_and_ext.md"}
{"instance_id":"sf_bq180","db":"GITHUB_REPOS","question":"Hole die Top-5 der am häufigsten verwendeten Modulnamen aus Python (`.py`) und R (`.r`) Skripten, indem du die Vorkommen von Modulen in `import`- und `from`-Anweisungen für Python sowie in `library()`-Aufrufen für R zählst. Die Abfrage soll nur Python- und R-Dateien berücksichtigen, nach Modulname gruppieren und die Top-5-Module nach Häufigkeit sortiert zurückgeben.","external_knowledge":null}
{"instance_id":"sf_bq233","db":"GITHUB_REPOS","question":"Kannst du die zusammengeführten Daten aus den Dateien der GitHub-Repositories und den Inhalten von github_repos analysieren, wobei du dich nur auf Dateien konzentrierst, die mit '.py' oder '.r' enden, dann Python-Module aus Zeilen mit 'import' oder 'from ... import' extrahieren und R-Bibliotheken aus Zeilen mit 'library(...)' extrahieren, deren Vorkommen zählen und schließlich die Ergebnisse sortiert nach Sprache und nach der Anzahl der Vorkommen in absteigender Reihenfolge auflisten?","external_knowledge":null}
{"instance_id":"sf_bq248","db":"GITHUB_REPOS","question":"Unter allen Repositorien, die keine Programmiersprache verwenden, deren Name (unabhängig von der Groß-/Kleinschreibung) die Teilzeichenfolge \"python,\" enthält, wie groß ist der Anteil der Dateien, deren Pfade \"readme.md\" enthalten und deren Inhalte die Phrase \"Copyright (c)\" enthalten?","external_knowledge":null}
{"instance_id":"sf_bq193","db":"GITHUB_REPOS","question":"Rufen Sie alle nicht-leeren, nicht kommentierten Zeilen aus `README.md`-Dateien in GitHub-Repositorien ab, wobei Zeilen ausgeschlossen werden, die Kommentare sind (entweder beginnend mit `#` für Markdown oder `//` für Code-Kommentare). Für jede Zeile berechnen Sie, wie oft jede eindeutige Zeile über alle Repositorien hinweg erscheint, und geben Sie eine durch Kommas getrennte Liste der in jedem Repository verwendeten Programmiersprachen zurück, die diese Zeile enthalten, alphabetisch sortiert, wobei die Ergebnisse nach der Häufigkeit des Auftretens absteigend sortiert sind.","external_knowledge":null}
{"instance_id":"sf_bq295","db":"GITHUB_REPOS_DATE","question":"Unter Verwendung der 2017er GitHub Archive-Daten zu Watch-Ereignissen: Welche drei Repositories enthalten mindestens eine Python-Datei (.py), die kleiner als 15.000 Byte ist und die Zeichenkette \"def \" in ihrem Inhalt enthält, und weisen die höchste Gesamtzahl an Watch-Ereignissen für dieses Jahr auf?","external_knowledge":null}
{"instance_id":"sf_bq249","db":"GITHUB_REPOS","question":"Bitte erstellen Sie einen Bericht über die Anzahl der Vorkommen bestimmter Zeilentypen in Dateien aus dem GitHub-Repository. Kategorisieren Sie eine Zeile als 'trailing', wenn sie mit einem Leerzeichen endet, als 'Space', wenn sie mit einem Leerzeichen beginnt, und als 'Other', wenn keines der beiden Kriteri­en erfüllt ist. Der Bericht sollte die Gesamtanzahl der Vorkommen für jede Kategorie enthalten, wobei alle Zeilen in allen Dateien berücksichtigt werden.","external_knowledge":null}
{"instance_id":"sf_bq375","db":"GITHUB_REPOS","question":"Bestimmen Sie, welcher Dateityp unter Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java) und JavaScript (.js) im GitHub-Codebasis die meisten Dateien mit einer Verzeichnistiefe größer als 10 hat, und geben Sie die Dateianzahl an.","external_knowledge":null}
{"instance_id":"sf_bq255","db":"GITHUB_REPOS","question":"Wie viele Commit-Nachrichten gibt es in Repositorien, die die Programmiersprache 'Shell' verwenden und unter der Lizenz 'apache-2.0' stehen, wobei die Länge der Commit-Nachrichten mehr als 5 Zeichen, aber weniger als 10.000 Zeichen beträgt, und die Nachrichten nicht mit dem Wort 'merge', 'update' oder 'test' beginnen?","external_knowledge":null}
{"instance_id":"sf_bq194","db":"GITHUB_REPOS","question":"Unter allen Python-Dateien (*.py), R-Dateien (*.r, *.R, *.Rmd, *.rmd) und IPython-Notebook-Dateien (*.ipynb) im GitHub-Beispieldatensatz wird anhand der extrahierten Import-Anweisungen ermittelt, welche Bibliothek oder welches Modul als zweithäufigst importiert oder geladen identifiziert wird?","external_knowledge":null}
{"instance_id":"sf_bq377","db":"GITHUB_REPOS","question":"Extrahiere und zähle die Häufigkeit aller Paketnamen, die im require-Abschnitt des JSON-formatierten Inhalts aufgeführt sind","external_knowledge":null}
{"instance_id":"sf_bq359","db":"GITHUB_REPOS","question":"Listen Sie die Repository-Namen und Commit-Zahlen der beiden GitHub-Repositories auf, die JavaScript als Primärsprache verwenden und die höchste Anzahl an Commits aufweisen.","external_knowledge":null}
{"instance_id":"sf_bq252","db":"GITHUB_REPOS","question":"Könnten Sie bitte den Namen des Repositorys finden, das die am häufigsten kopierte nicht-binäre Swift-Datei im Datensatz enthält, wobei jede Datei eindeutig durch ihre ID identifiziert wird?","external_knowledge":null}
{"instance_id":"sf_bq251","db":"PYPI","question":"Ich möchte die GitHub-Projekt-URLs der Top-3 der am meisten heruntergeladenen PyPI-Pakete basierend auf der Download-Anzahl kennen. Zuerst extrahieren Sie PyPI-Paket-Metadaten, einschließlich Name, Version und Projekt-URLs. Filtern Sie diese URLs so, dass nur solche enthalten sind, die zu GitHub-Repositories führen. Verwenden Sie einen regulären Ausdruck, um die GitHub-URLs zu bereinigen, indem unnötige Teile wie 'issues', 'pull', 'blob' und 'tree'-Pfade entfernt werden, wobei nur die Haupt-Repository-URL verbleibt. Bei Paketen mit mehreren Versionen verwenden Sie nur die neueste Version basierend auf dem Upload-Zeitpunkt. Verknüpfen Sie diese Daten mit den Download-Metriken, um die am häufigsten heruntergeladenen Pakete zu ermitteln. Geben Sie nur die bereinigten GitHub-Repository-URLs (ohne Anführungszeichen) für die Top-3-Pakete nach der Gesamt-Download-Anzahl zurück, wobei sichergestellt wird, dass nur Pakete mit gültigen GitHub-URLs in den Ergebnissen enthalten sind.","external_knowledge":null}
{"instance_id":"bq019","db":"cms_data","question":"In den Daten zu stationären Abrechnungen von CMS Medicare aus dem Jahr 2014, welche DRG-Definition hat die höchste Gesamtzahl der Entlassungen, und unter den drei Städten mit den meisten Entlassungen für diese DRG-Definition, wie hoch sind ihre jeweiligen gewichteten Durchschnittszahlungen (gewichtet nach der Gesamtzahl der Entlassungen)?","external_knowledge":null}
{"instance_id":"bq234","db":"cms_data","question":"Welches ist das am häufigsten verschriebene Medikament in jedem Staat im Jahr 2014?","external_knowledge":null}
{"instance_id":"bq235","db":"cms_data","question":"Welcher Gesundheitsdienstleister verursacht im Jahr 2014 die höchsten kombinierten durchschnittlichen Kosten für ambulante und stationäre Leistungen?","external_knowledge":null}
{"instance_id":"bq172","db":"cms_data","question":"Für das Medikament mit der höchsten Gesamtzahl der Verschreibungen im Bundesstaat New York im Jahr 2014 könnten Sie die fünf Bundesstaaten mit der höchsten Gesamtzahl der Ansprüche für dieses Medikament auflisten? Bitte nennen Sie auch deren Gesamtzahl der Ansprüche und die Gesamtkosten des Medikaments.","external_knowledge":null}
{"instance_id":"bq177","db":"cms_data","question":"Für den Anbieter, dessen gesamte stationäre Medicare-Kosten von 2011 bis 2015 am höchsten sind (berechnet als die Summe von average_medicare_payments multipliziert mit total_discharges), bitte listen Sie die jährlichen durchschnittlichen stationären Kosten dieses Anbieters sowie die jährlichen durchschnittlichen ambulanten Kosten für jedes Kalenderjahr in diesem Zeitraum auf, wobei die stationären Kosten als der Durchschnitt von (average_medicare_payments × total_discharges) berechnet werden und die ambulanten Kosten als der Durchschnitt von (average_total_payments × outpatient_services) berechnet werden.","external_knowledge":null}
{"instance_id":"bq354","db":"cms_data","question":"Könnten Sie bitte den Prozentsatz der Teilnehmer für Standard-Akne, atopische Dermatitis, Psoriasis und Vitiligo liefern, wie sie durch die International Classification of Diseases 10-CM (ICD-10-CM) definiert sind, einschließlich ihrer Unterkategorien? Bitte schließen Sie alle mit dem Standard-ICD-10-CM-Codes verknüpften Konzepte ein (L70 für Akne, L20 für atopische Dermatitis, L40 für Psoriasis und L80 für Vitiligo), indem Sie Konzeptbeziehungen nutzen, einschließlich abgeleiteter Konzepte. Der Prozentsatz sollte auf der Gesamtzahl der Teilnehmer basieren, wobei nur die Standardkonzepte und ihre verwandten abgeleiteten Konzepte berücksichtigt werden.","external_knowledge":null}
{"instance_id":"bq355","db":"cms_data","question":"Bitte teilen Sie mir den Prozentsatz der Teilnehmer mit, die Quinapril und verwandte Medikamente nicht verwenden (Quinapril RxCUI: 35208).","external_knowledge":null}
{"instance_id":"bq032","db":"noaa_data","question":"Können Sie die Geografische Breite der Endkoordinaten des Hurrikans angeben, der im Nordatlantik im Jahr 2020 die zweitlängste Distanz zurückgelegt hat?","external_knowledge":"functions_st_distance.md"}
{"instance_id":"bq119","db":"noaa_data","question":"Bitte zeigen Sie Informationen über den Hurrikan mit der drittlängsten Gesamtstrecke der Reise im Nordatlantik im Jahr 2020, einschließlich seiner Reisekoordinaten, der kumulativen Reisedistanz (in Kilometern) an jedem Punkt und der maximalen anhaltenden Windgeschwindigkeit zu diesen Zeiten.","external_knowledge":"functions_st_distance.md"}
{"instance_id":"sf_bq117","db":"NOAA_DATA","question":"Wie hoch ist die Gesamtzahl der schweren Sturmereignisse, die im am stärksten betroffenen Monat in den letzten 15 Jahren gemäß NOAA-Aufzeichnungen aufgetreten sind, wenn nur die Top-100-Sturmereignisse mit dem höchsten Sachschaden berücksichtigt werden?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq419","db":"noaa_data","question":"Welche 5 Staaten hatten von 1980 bis 1995 die meisten Sturmereignisse, wobei pro Jahr nur die Top-1000-Staaten mit den höchsten Ereigniszahlen berücksichtigt werden? Bitte verwenden Sie die Abkürzungen der Bundesstaaten.","external_knowledge":null}
{"instance_id":"sf_bq071","db":"NOAA_DATA_PLUS","question":"Können Sie die Anzahl der Hurrikane und eine Liste der Hurrikannamen bereitstellen (alphabetisch sortiert und durch Kommas getrennt) für jede Stadt und ihre zugehörige Postleitzahl, wobei die Hurrikane innerhalb der Grenzen der Postleitzahlen liegen? Bitte schließen Sie unbenannte Hurrikane aus und sortieren Sie die Ergebnisse nach der Anzahl der Hurrikane in absteigender Reihenfolge. Die Ausgabe sollte die folgenden Spalten umfassen: Stadt, Postleitzahl, Bundesland, Anzahl der Hurrikane und die Liste der Hurrikane.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq236","db":"NOAA_DATA_PLUS","question":"Was sind die Top-5-Postleitzahlen der Gebiete in den Vereinigten Staaten, die in den letzten 10 Jahren die meisten Hagelsturm-Ereignisse erlebt haben? Verwenden Sie keine Daten aus der Hagelberichte-Tabelle.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq356","db":"noaa_data","question":"Unter allen NOAA GSOD-Wetterstationen, die im Jahr 2019 gültige tägliche Temperaturdaten aufgezeichnet haben (nicht fehlende Temperaturwerte, Max- und Min-Temperaturen) und deren Aufzeichnungszeitraum am oder vor dem 1. Januar 2000 begann und sich mindestens bis zum 30. Juni 2019 erstreckte, wie viele dieser Stationen erreichten 90 % oder mehr der maximal möglichen Anzahl gültiger Temperaturaufzeichnungstage im Jahr 2019?","external_knowledge":null}
{"instance_id":"bq042","db":"noaa_data","question":"Kannst du mir helfen, die durchschnittliche Temperatur, die durchschnittliche Windgeschwindigkeit und den Niederschlag für den LaGuardia Airport in NYC am 12. Juni für jedes Jahr von 2011 bis 2020 zu ermitteln, wobei explizit die Stations-ID 725030 verwendet wird?","external_knowledge":null}
{"instance_id":"bq394","db":"noaa_data","question":"Was sind die drei Monate zwischen 2010 und 2014 mit der kleinsten Summe der absoluten Differenzen zwischen der durchschnittlichen Lufttemperatur, der Feuchtkugeltemperatur, der Taupunkttemperatur und der Meeresoberflächentemperatur, einschließlich der jeweiligen Jahre und der Summe der Differenzen? Bitte geben Sie Jahr und Monat im numerischen Format an.","external_knowledge":null}
{"instance_id":"bq357","db":"noaa_data","question":"Was sind die Breitengrad- und Längengradkoordinaten sowie Daten zwischen 2005 und 2015 mit den Top 5 höchsten täglichen Durchschnittswindgeschwindigkeiten, wobei Datensätze mit fehlenden Windgeschwindigkeitswerten ausgeschlossen werden? Verwenden Sie Daten aus Tabellen mit dem Präfix \"icoads_core\".","external_knowledge":null}
{"instance_id":"bq181","db":"noaa_data","question":"Welcher Anteil der Wetterstationen hat gültige Temperaturdaten aufgezeichnet (ohne fehlende oder ungültige Werte) für mindestens 90% der Tage im Jahr 2022, wobei die Temperatur-, Höchst- und Tiefstwerte weder NULL noch gleich 9999.9 sind, und die Station eine gültige Kennung besitzt (USAF code ungleich '999999'), aus allen verfügbaren Stationen in der NOAA GSOD-Datenbank?","external_knowledge":null}
{"instance_id":"bq045","db":"noaa_data","question":"Welche Wetterstationen im Bundesstaat Washington verzeichneten mehr als 150 Regentage im Jahr 2023, aber weniger Regentage als 2022? Definiert einen „Regen-Tag“ als einen Tag mit Niederschlag größer als 0 Millimeter und ungleich 99.99. Nur Stationen mit gültigen Niederschlagsdaten berücksichtigen.","external_knowledge":null}
{"instance_id":"sf_bq358","db":"NEW_YORK_CITIBIKE_1","question":"Können Sie mir sagen, welche Radtour in New York City am 15. Juli 2015 begonnen hat und in Postleitzahlgebieten mit der höchsten Durchschnittstemperatur für diesen Tag endete, gemessen von der Wetterstation Central Park (WBAN '94728')? Falls es mehr als eine Reise gibt, die diese Kriterien erfüllt, möchte ich von derjenigen erfahren, die in der kleinsten Postleitzahl beginnt und in der größten endet. Bitte geben Sie die Start- und End-Postleitzahlen dieser Reise zurück.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq290","db":"noaa_data","question":"Können Sie die Differenz zwischen der Maximaltemperatur, der Minimaltemperatur und der Durchschnittstemperatur zwischen Wetterstationen der USA und des Vereinigten Königreichs für jeden Tag im Oktober 2023 berechnen, unter Verwendung des Datumsfeldes, und Datensätze mit fehlenden oder ungültigen Temperaturwerten ausschließen?","external_knowledge":null}
{"instance_id":"bq031","db":"noaa_data","question":"Stellen Sie die täglichen Wetterdaten für Rochester vom 1. Januar bis 31. März 2019 bereit, einschließlich Temperatur (in Celsius), Niederschlag (in Zentimetern) und Windgeschwindigkeit (in Metern pro Sekunde). Für jede Variable berechnen Sie den 8-Tage-Durchschnitt (einschließlich des aktuellen Tages und der vorherigen 7 Tage). Außerdem berechnen Sie die Differenz zwischen dem gleitenden Durchschnitt an jedem Tag und den gleitenden Durchschnitten der vorherigen 1 bis 8 Tage (d. h. lag1 bis lag8). Das Ergebnis sollte Folgendes umfassen: Die täglichen Werte für Temperatur, Niederschlag und Windgeschwindigkeit, die 8-Tage-Durchschnitte für jede Variable und die Unterschiede zwischen den gleitenden Durchschnitten für jeden der vorherigen 1 bis 8 Tage (z. B. der Unterschied zwischen dem heutigen gleitenden Durchschnitt und dem gleitenden Durchschnitt von vor 1 Tag, vor 2 Tagen usw.). Runden Sie alle Werte auf eine Nachkommastelle. Die Daten sollten nach Datum geordnet sein, beginnend mit dem 9. Januar 2019.","external_knowledge":null}
{"instance_id":"bq392","db":"noaa_gsod","question":"Was sind die drei Datumsangaben im Oktober 2009 mit der höchsten Durchschnittstemperatur für die Stationsnummer 723758, im Format YYYY-MM-DD?","external_knowledge":null}
{"instance_id":"sf_bq050","db":"NEW_YORK_CITIBIKE_1","question":"Ich möchte Fahrradfahrten in New York City für 2014 analysieren, indem ich Fahrtdaten mit Wetterinformationen verknüpfe, um zu verstehen, wie Wetterbedingungen (Temperatur, Windgeschwindigkeit und Niederschlag) Fahrradfahrten zwischen Stadtvierteln beeinflussen. Für jede Kombination aus Start- und Ziel-Stadtvierteln benötige ich Folgendes: 1. Die Gesamtzahl der Fahrradfahrten zwischen den Vierteln. 2. Die durchschnittliche Fahrtdauer in Minuten (auf 1 Dezimalstelle gerundet). 3. Die durchschnittliche Temperatur zum Start der Fahrt (auf 1 Dezimalstelle gerundet). 4. Die durchschnittliche Windgeschwindigkeit zum Start der Fahrt (in Metern pro Sekunde, auf 1 Dezimalstelle gerundet). 5. Die durchschnittliche Niederschlagsmenge zum Start der Fahrt (in Zentimetern, auf 1 Dezimalstelle gerundet). 6. Der Monat mit den meisten Fahrten (z. B. `4` für April). Die Daten sollten nach Start- und Zielviertel gruppiert werden, wobei `zip_codes` in `geo_us_boundaries` verwendet werden, um die Standorte der Fahrradfahrten basierend auf Breitengrad und Längengrad zuzuordnen. `zip_codes` in `cyclistic` verwendet werden, um die Bezirk- und Stadtviertelnamen abzurufen. Unter Verwendung von Wetterdaten von der Central Park-Station für das Reisedatum, die alle Fahrten im Jahr 2014 abdecken.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq426","db":"NEW_YORK_CITIBIKE_1","question":"Welcher Benutzertyp verzeichnete die höchste Durchschnittstemperatur bei Fahrten, die in der Postleitzahl 10019 von New York City beginnen und enden, im Jahr 2018? Geben Sie den durchschnittlichen Niederschlag, die Windgeschwindigkeit und die Temperatur für diesen Benutzertyp basierend auf Wetterdaten von der New York Central Park Station an.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq291","db":"NOAA_GLOBAL_FORECAST_SYSTEM","question":"Kannst du eine tägliche Wetterzusammenfassung für Juli 2019 innerhalb eines 5-km-Radius von Breitengrad 26.75 und Längengrad 51.5 bereitstellen? Ich benötige die Höchst-, Tiefst- und Durchschnittstemperaturen; die Gesamtniederschlagsmenge; die durchschnittliche Wolkenbedeckung zwischen 10:00 und 17:00 Uhr; den Gesamtschnee (wenn die Durchschnittstemperatur unter 32°F liegt); und den Gesamtregen (wenn die Durchschnittstemperatur 32°F oder höher ist) für jedes Vorhersagedatum. Die Daten sollten den Vorhersagen entsprechen, die im Juli 2019 für den folgenden Tag erstellt wurden.","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq208","db":"new_york_noaa","question":"Können Sie Wetterstationen im Umkreis von 20 Meilen um Chappaqua, New York (Breitengrad: 41.197, Längengrad: -73.764) bereitstellen und mir die Anzahl der gültigen Temperaturbeobachtungen nennen, die sie von 2011 bis 2020 aufgezeichnet haben, wobei ungültige oder fehlende Temperaturdaten ausgeschlossen werden?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq047","db":"new_york_noaa","question":"Könnten Sie die Beziehung zwischen jeder Beschwerdeart und der täglichen Temperatur in New York City analysieren, wobei speziell Temperaturdaten von LaGuardia (STN=725030) und JFK (STN=744860) Flughäfen für die zehn Jahre ab 2008 verwendet werden, und dann bestimmen, für jede Beschwerdeart, die mehr als 5000 Gesamtvorkommnisse hat und eine starke Korrelation (absoluter Wert > 0,5) mit der Temperatur zeigt, die Gesamtanzahl der Beschwerden, die Gesamtzahl der Tage mit gültigen Temperaturaufzeichnungen und die Pearson-Korrelationskoeffizienten (auf vier Nachkommastellen gerundet) zwischen der Temperatur und sowohl der täglichen Beschwerdezahl als auch dem täglichen Prozentsatz der Gesamtbeschwerden, wobei Tage mit fehlenden oder ungültigen Temperaturdaten (wie 9999.9) ausgeschlossen werden?","external_knowledge":null}
{"instance_id":"bq048","db":"new_york_noaa","question":"Welche Beschwerdearten mit insgesamt mehr als 3000 Anfragen von 2011 bis 2020 zeigen die stärksten positiven und negativen Pearson-Korrelationen mit der täglichen durchschnittlichen Windgeschwindigkeit gemessen an der Messstation 744860 (JFK-Flughafen), basierend auf den täglichen Beschwerdeanteilen (das Verhältnis der typspezifischen Beschwerden zu den täglichen Gesamtbeschwerden)? Bitte geben Sie die Beschwerdetypen und ihre Korrelationskoeffizienten an, gerundet auf vier Nachkommastellen.","external_knowledge":null}
{"instance_id":"bq293","db":"new_york_geo","question":"Ich möchte die New York City Yellow-Taxi-Fahrtdaten speziell für den 1. Januar 2015 analysieren, unter Verwendung des Datensatzes bigquery-public-data.new_york.tlc_yellow_trips_2015. Ich muss dies mit der Tabelle geo_us_boundaries.zip_codes verknüpfen, um jede Fahrt basierend auf den Abholkoordinaten der jeweiligen NYC-Postleitzahl zuzuordnen. Die Analyse sollte eine vollständige stundenweise Aufschlüsselung für alle Postleitzahlen erstellen, indem DISTINCT Postleitzahlen mit DISTINCT Stunden durch ein CROSS JOIN verknüpft werden, einschließlich Stunden mit null Fahrten. Für jede Postleitzahl und jede Stundenkombination berechnen Sie die Gesamtanzahl der Fahrten sowie die folgenden zeitbasierten Kennzahlen: Anzahl der Fahrten von vor 1 Stunde, vor 1 Tag (24 Stunden), vor 7 Tagen (168 Stunden) und vor 14 Tagen (336 Stunden). Zusätzlich berechnen Sie die 14-tägigen und 21-tägigen gleitenden Durchschnitte der Fahrtenanzahl sowie die Standardabweichungen, wobei die aktuelle Stunde ausgeschlossen wird. Nur Fahrten mit gültigen Breitengraden und Längengraden berücksichtigen. Die Endergebnisse sollten nach der höchsten Fahrtenanzahl sortiert werden und nur die Top-5-Gruppen mit den meisten Fahrten anzeigen.","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq017","db":"GEO_OPENSTREETMAP","question":"Was sind die fünf längsten Straßentypen innerhalb der Multipolygon-Grenze Dänemarks (definiert durch Wikidata-ID 'Q35') nach Gesamtlänge, analysiert anhand von Planet Features?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq131","db":"GEO_OPENSTREETMAP","question":"Wie viele Haltestellen hat das Busnetz mit den meisten Haltestellen innerhalb der Multipolygon-Grenze von Dänemark (wie durch die Wikidata-ID 'Q35' definiert), analysiert mithilfe von Planet-Features?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq349","db":"GEO_OPENSTREETMAP","question":"Welche OpenStreetMap ID aus der planet features table entspricht einer Verwaltungsgrenze, dargestellt als Multipolygone, deren Gesamtsumme der 'amenity'-getaggten Points of Interest (POIs), wie aus der planet nodes table abgeleitet, dem Medianwert der Anzahl solcher Grenzen am nächsten kommt?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq007","db":"CENSUS_BUREAU_ACS_2","question":"Identifizieren Sie die zehn US-Bundesstaaten mit der größten verwundbaren Bevölkerung, berechnet anhand einer gewichteten Summe der Beschäftigungssektoren unter Verwendung der 2017 ACS 5-Jahres-Daten, und bestimmen Sie deren durchschnittliche Veränderung des Median-Einkommens von 2015 bis 2018 anhand von Postleitzahlendaten.","external_knowledge":"total_vulnerable_weights.md"}
{"instance_id":"sf_bq429","db":"CENSUS_BUREAU_ACS_2","question":"Welche sind die fünf Bundesstaaten mit dem größten durchschnittlichen Unterschied beim Median-Einkommen zwischen 2015 und 2018 auf ZIP-Code-Ebene, und wie lautet die entsprechende durchschnittliche Anzahl gefährdeter Beschäftigter in den Branchen Großhandel, Natürliche Ressourcen und Bauwesen, Kunst und Unterhaltung, Information und Einzelhandel im Jahr 2017 gemäß den ACS Five-Year Estimates und den ZIP-Code-Grenzen-Daten?","external_knowledge":"avg_vulnerable_weights.md"}
{"instance_id":"sf_bq073","db":"CENSUS_BUREAU_ACS_2","question":"Unter Verwendung von Daten zu den auf ZIP-Ebene gemessenen Einkommensunterschieden zwischen 2015 und 2018, zusammen mit den Beschäftigungszahlen der ACS 2017, listen Sie jeden Staat in absteigender Reihenfolge der Gesamtzahl verwundbarer Arbeitnehmer auf, wobei „verwundbar“ definiert ist als 38% der Beschäftigten im Großhandel und 41% der Beschäftigten in der Fertigung im Jahr 2017. Ihre Ergebnisse sollten den Staatsnamen, die Zahl der verwundbaren Beschäftigten im Großhandel, die Zahl der verwundbaren Beschäftigten in der Fertigung und die Gesamtsumme dieser verwundbaren Beschäftigten enthalten.","external_knowledge":null}
{"instance_id":"sf_bq410","db":"CENSUS_BUREAU_ACS_2","question":"Finde die Top-3-Staaten mit der kleinsten angepassten Nicht-Arbeitskräfte-Bevölkerung unter Verwendung der 2017 ACS Trakt-Level-Daten. Berechne die angepasste Nicht-Arbeitskräfte-Bevölkerung als (unemployed_pop + not_in_labor_force - group_quarters), wobei negative Werte auf Null beschränkt werden. Für jeden dieser Staaten zeige die Staatsabkürzung, die gesamte Median-Einkommensänderung zwischen 2015 und 2018 über alle Trakte, die gesamte angepasste Nicht-Arbeitskräfte-Bevölkerung und den durchschnittlichen bevölkerungsangepassten Anteil (berechnet als das Verhältnis von angepasster Nicht-Arbeitskräfte zur Gesamtbevölkerung auf Traktebene). Verbinde Trakt-Daten mit Staaten anhand von FIPS-Code-Präfixen, schließe Trakte mit Null-Einkommensunterschieden aus und sortiere die Ergebnisse nach der angepassten Nicht-Arbeitskräfte-Bevölkerung in aufsteigender Reihenfolge.","external_knowledge":null}
{"instance_id":"sf_bq348","db":"GEO_OPENSTREETMAP","question":"Welche drei Top-Benutzernamen befinden sich innerhalb des durch die geogpoints definierten rechteckigen Bereichs (31.1798246, 18.4519921), (54.3798246, 18.4519921), (54.3798246, 33.6519921) und (31.1798246, 33.6519921), die für die höchste Anzahl historischer Knoten verantwortlich sind und ursprünglich mit den Annehmlichkeiten ‘Krankenhaus’, ‘Klinik’ oder ‘Ärzte’ gekennzeichnet waren, die im aktuellen planet_nodes-Datensatz nicht mehr erscheinen?","external_knowledge":"functions_st_intersects_polygon_line.md"}
{"instance_id":"sf_bq253","db":"GEO_OPENSTREETMAP","question":"Finde den Namen der OpenStreetMap-Relation, die sich im selben geografischen Gebiet wie das Multipolygon befindet, das mit dem Wikidata-Eintrag 'Q1095' gekennzeichnet ist, und die die meisten Merkmale umfasst. Die Relation sollte einen angegebenen Namen haben und kein 'wikidata'-Tag besitzen, und mindestens eines der enthaltenen Merkmale muss ein 'wikidata'-Tag besitzen. Die Analyse sollte mit der Tabelle planet_features durchgeführt werden. Geben Sie den Namen dieser Relation zurück.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq254","db":"GEO_OPENSTREETMAP","question":"Unter allen Multipolygonen, die sich im gleichen geografischen Gebiet befinden wie das mit dem Wikidata-Eintrag Q191 verknüpfte Multipolygon, aber selbst keinen 'wikidata'-Tag tragen, welche zwei belegen die höchsten Plätze nach der Anzahl der Punkte, die innerhalb ihrer Grenzen liegen, und wie heißen sie?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq056","db":"GEO_OPENSTREETMAP_BOUNDARIES","question":"Wie viele verschiedene Paare von Straßen, die in Kalifornien als Autobahn, Trunk, Primärstraße, Sekundärstraße oder Wohnstraße klassifiziert sind, überlappen sich gegenseitig, ohne gemeinsame Knoten zu teilen, und keine Brücken-Tags haben, wobei diese Straßen mit 'highway' gekennzeichnet sind, analysiert durch planet ways","external_knowledge":"functions_st_intersects.md"}
{"instance_id":"sf_bq289","db":"GEO_OPENSTREETMAP_CENSUS_PLACES","question":"Kannst du die kürzeste Entfernung zwischen zwei Einrichtungen finden (entweder eine Bibliothek, eine Gottesdienststätte oder ein Gemeindezentrum), die sich in Philadelphia befinden und anhand der pennsylvania table und planet features points analysiert werden?","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq250","db":"GEO_OPENSTREETMAP_WORLDPOP","question":"Basierend auf den neuesten 1km-Bevölkerungs-Gitterdaten in Singapur vor Januar 2023, unter Verwendung von ST_CONVEXHULL, um alle Zentren der Bevölkerungs-Gitter zu einem Begrenzungsbereich zu aggregieren, und ST_INTERSECTS, um Krankenhäuser aus dem OpenStreetMap’s planet layer (layer_code in (2110, 2120)) zu identifizieren, die in diesem Bereich liegen, und dann die Entfernung von jeder Gitterzelle zu ihrem nächstgelegenen Krankenhaus zu berechnen, wie groß ist die Gesamtbevölkerung der Gitterzelle, die am weitesten von jedem Krankenhaus entfernt ist?","external_knowledge":"OpenStreetMap_data_in_layered_GIS_format.md"}
{"instance_id":"sf_bq083","db":"CRYPTO","question":"Kannst du die tägliche Veränderung des Marktwerts der USDC-Token (Adresse `0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48`) für das Jahr 2023 berechnen, basierend auf Ethereum-Transaktionen? Die Veränderung sollte aus Minting (Input-Muster `0x40c10f19%`) und Burning (Input-Muster `0x42966c68%`) Vorgängen berechnet werden. Für jede Transaktion sollte Minting positiv und Burning negativ sein. Extrahiere den relevanten Betrag aus dem 'input'-Feld als Hexadezimalzahl, konvertiere ihn in Millionen und weise ihn im USD-Format aus. Fasse die Ergebnisse nach Datum zusammen und sortiere sie in absteigender Reihenfolge.","external_knowledge":"Total_Market_Value_Change.md"}
{"instance_id":"sf_bq184","db":"CRYPTO","question":"Nur anhand der Spuren können Sie tägliche kumulative Zählungen von Smart Contracts berechnen, die von externen Adressen erstellt wurden (wobei trace_address NULL ist) im Vergleich zu jenen, die von anderen Verträgen erstellt wurden (wobei trace_address NOT NULL ist) für jedes Datum vom 2017-01-01 bis 2021-12-31, wobei sichergestellt wird, dass alle Kalendertage in diesem Zeitraum eingeschlossen sind, auch wenn an einigen Tagen keine neuen Verträge erstellt wurden, und monotone steigende kumulative Gesamtsummen für beide Kategorien anzeigen?","external_knowledge":null}
{"instance_id":"sf_bq195","db":"CRYPTO","question":"Was sind die Top-10-Ethereum-Adressen nach dem Guthaben, wobei sowohl Werttransaktionen als auch Gasgebühren berücksichtigt werden, vor dem 1. September 2021? Nur erfolgreiche Transaktionen berücksichtigen, bei denen kein Aufruftyp vorhanden ist oder bei dem Aufruftyp 'call' lautet.","external_knowledge":null}
{"instance_id":"sf_bq256","db":"CRYPTO","question":"Bestimmen Sie das endgültige Ether-Guthaben der Ethereum-Adresse, die vor September 1, 2021 (UTC) die höchste Anzahl erfolgreicher Transaktionen initiiert hat, wobei Anrufe des Typs delegatecall, callcode oder staticcall ausgeschlossen werden und alle relevanten eingehenden und ausgehenden Transfers, Miner-Belohnungen sowie Abzüge von Gasgebühren einbezogen werden, wobei das endgültige Ether-Guthaben in Ether nach der Umrechnung aus der nativen Einheit dargestellt wird.","external_knowledge":null}
{"instance_id":"sf_bq080","db":"CRYPTO","question":"Nur die Ethereum-Traces-Tabelle verwenden; können Sie eine tägliche kumulative Zählung der von externen Benutzern erstellten Smart Contracts (wo trace_address null ist) gegenüber den von anderen Smart Contracts erstellten Smart Contracts (wo trace_address nicht null ist) zwischen dem 30. August 2018 und dem 30. September 2018 bereitstellen? Stellen Sie sicher, dass die Ergebnisse jeden Tag in diesem Zeitraum enthalten, auch wenn keine neuen Smart Contracts erstellt wurden, und zeigen Sie streng zunehmende kumulative Summen an.","external_knowledge":null}
{"instance_id":"sf_bq342","db":"CRYPTO","question":"Was ist der Unterschied zwischen den durchschnittlichen stündlichen Änderungen der Transaktionswerte für das Ethereum-Token 0x68e54af74b22acaccffa04ccaad13be16ed14eac, wobei ausschließlich Transaktionen berücksichtigt werden, bei denen die Adresse 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d der Absender war oder die Adresse 0xfbd6c6b112214d949dcdfb1217153bc0a742862f der Empfänger war, zwischen dem 1. Januar 2019 und dem 31. Dezember 2020, wenn man 2019 mit 2020 vergleicht?","external_knowledge":null}
{"instance_id":"sf_bq341","db":"CRYPTO","question":"Welche Ethereum-Adresse hat die drei kleinsten positiven Guthabenbeträge aus Transaktionen, die den Token mit der Adresse \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\" betreffen?","external_knowledge":null}
{"instance_id":"sf_bq444","db":"CRYPTO","question":"Kannst du den Zeitstempel der Blockchain, die Blocknummer und den Transaktions-Hash für die ersten fünf Mint- und Burn-Ereignisse aus den Ethereum-Logs für die Adresse '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8' abrufen? Bitte schließe Mint-Ereignisse ein, die durch das Topic '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' identifiziert sind, sowie Burn-Ereignisse durch '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c' identifiziert, und ordne sie nach dem Blockzeitstempel vom ältesten zum neuesten.","external_knowledge":"ethereum_logs_and_events_overview.md"}
{"instance_id":"sf_bq340","db":"CRYPTO","question":"Welche sechs Ethereum-Adressen, ausgenommen '0x0000000000000000000000000000000000000000', weisen die größten absoluten Differenzen zwischen ihren vorherigen und aktuellen Balancen der Token an den Adressen '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' und '0x1e15c05cbad367f044cbfbafda3d9a1510db5513' auf?","external_knowledge":null}
{"instance_id":"sf_bq005","db":"CRYPTO","question":"Berechnen Sie den täglichen Durchschnitt des Bitcoin-Blockabstands (in Sekunden) für 2023, indem Sie aufeinanderfolgende Blöcke über zeilennummerierte Selbstverknüpfungen verbinden (einschließlich tagübergreifender Intervalle), schließen Sie den Genesis-Block aus, und listen Sie die ersten 10 Datumsangaben mit ihren unbereinigten Durchschnittswerten auf.","external_knowledge":null}
{"instance_id":"sf_bq334","db":"CRYPTO","question":"Berechne die jährlichen Unterschiede bei den durchschnittlichen Bitcoin-Ausgabewerten zwischen zwei Methoden: Merged input/output records: Kombiniere die Tabellen inputs und outputs, filtere nur Ausgabedatensätze und berechne jährliche Durchschnitte. Transactions table: Verwende direkt das output_value-Feld aus der transactions table für die jährlichen Durchschnitte. Zeige die Differenz (merged outputs average minus transactions average) nur für Jahre, in denen Daten in beiden Methoden vorliegen.","external_knowledge":null}
{"instance_id":"sf_bq335","db":"CRYPTO","question":"Unter allen Bitcoin-Adressen, die mindestens eine Transaktion im Oktober 2017 hatten (unter Berücksichtigung beider Eingaben und Ausgaben), welche Adresse hat ihre letzte Transaktion am spätesten Datum dieses Monats durchgeführt, und unter allen Adressen, die dasselbe späteste Datum teilen, welche von ihnen hat die höchste Summe der Transaktionswerte?","external_knowledge":null}
{"instance_id":"sf_bq057","db":"CRYPTO","question":"Welcher Monat (z. B. 3 für März) im Jahr 2021 wies den höchsten Anteil des Bitcoin-Transaktionsvolumens auf, der in CoinJoin-Transaktionen stattfand (definiert als Transaktionen mit >2 Outputs, Ausgabewert ≤ Eingabewert und mehreren gleichwertigen Outputs)? Geben Sie außerdem den Anteil aller Bitcoin-Transaktionen an, die CoinJoins waren, den Anteil der an CoinJoin-Transaktionen beteiligten UTXOs (Durchschnitt aus Eingangs- und Ausgangsprozentsätzen) sowie den Anteil des gesamten Bitcoin-Volumens, das in CoinJoin-Transaktionen für diesen Monat stattfand. Runden Sie alle Prozentsätze auf 1 Dezimalstelle.","external_knowledge":null}
{"instance_id":"sf_bq068","db":"CRYPTO","question":"Unter Anwendung der Prinzipien der doppelten Buchführung, bei denen Transaktions-Eingänge als Soll (negative Werte) und Transaktions-Ausgänge als Haben (positive Werte) behandelt werden, für alle Bitcoin Cash-Transaktionen zwischen 2014-03-01 und 2014-04-01, wie können wir die maximalen und minimalen Endsalden gruppiert nach Adresstyp aus diesen Transaktionen berechnen?","external_knowledge":null}
{"instance_id":"sf_bq092","db":"CRYPTO","question":"Was sind im April 2023 die höchsten und niedrigsten Salden über alle Dash-Adressen, wenn der Nettosaldo für jede Adresse unter Verwendung der doppelten Buchführung berechnet wird (wobei Eingänge als Sollwerte/negative Werte und Ausgänge als Habenwerte/positive Werte behandelt werden)? Berücksichtigen Sie alle Transaktionen, die durch block_timestamp_month='2023-04-01' gefiltert werden, und wenn eine Adresse als Array in den Daten erscheint, die Array-Elemente zu einer durch Kommas getrennten Zeichenkette zusammenfügen. Für jede Adresse und Typ-Kombination summieren Sie alle Werte, um den Saldo zu bestimmen.","external_knowledge":null}
{"instance_id":"sf_bq093","db":"CRYPTO","question":"Was waren die maximalen und minimalen Nettobilanzveränderungen für Ethereum Classic-Adressen am October 14, 2016? Berechnen Sie diese, indem Sie alle Transaktionen summieren, bei denen Adressen Gelder erhalten (debits), gesendete Gelder (credits) und Gasgebühren bezahlt oder erhalten wurden. Berücksichtigen Sie nur Transaktionen mit erfolgreichem Status und schließen Sie interne Aufrufe von Typen aus. Bei den Gasgebühren berücksichtigen Sie sowohl die von Transaktionssendern gezahlten Gebühren als auch die von Minern erhaltenen Gebühren, berechnet, indem sie mit dem Gaspreis multipliziert werden, sowohl für Miner als auch für Sender.","external_knowledge":null}
{"instance_id":"sf_bq292","db":"CRYPTO","question":"Analysieren Sie Bitcoin-Transaktionen seit July 2023, um monatliche Prozentsätze von: (1) Transaktionen, die als CoinJoins klassifiziert werden (definiert durch >2 Ausgänge, Ausgabewert ≤ Eingabewert und mehrere identische Ausgabewerte), (2) UTXOs, die an CoinJoins beteiligt sind (berechnet als der Durchschnitt der CoinJoin-Eingangs-/Ausgangsverhältnisse gegenüber den gesamten Netzwerk-UTXOs), (3) Transaktionsvolumen (basierend auf dem Eingabewert), das CoinJoins zugeordnet wird. Stellen Sie die Ergebnisse in einer Tabelle mit monatlichen Kennzahlen für Transaktionen, UTXOs und Volumen bereit.","external_knowledge":null}
{"instance_id":"sf_bq135","db":"CRYPTO","question":"Welches Datum vor 2022 hatte die höchste Gesamtsumme der Transaktionen in den Zilliqa-Blockchain-Daten?","external_knowledge":null}
{"instance_id":"sf_bq136","db":"CRYPTO","question":"Finde alle genau 2-Hop-Transaktionspfade auf der Zilliqa-Blockchain zwischen der Quelladresse 'zil1jrpjd8pjuv50cfkfr7eu6yrm3rn5u8rulqhqpz' und der Zieladresse 'zil19nmxkh020jnequql9kvqkf3pkwm0j0spqtd26e', wobei sowohl reguläre Transaktionen als auch Vertragsübergänge berücksichtigt werden. Ein 2-Hop-Pfad bedeutet, dass es eine Zwischenadresse zwischen Quell- und Zieladresse geben muss. Schließe Pfade aus, bei denen eine Zwischenadresse mehr als 50 ausgehende Transaktionen hat, um Börsen und Wallets mit hoher Aktivität herauszufiltern. Stelle sicher, dass die Transaktionen in jedem Pfad chronologisch geordnet sind (zuerst frühere Transaktionszeitpunkte). Zeige Ergebnisse im Format: '<source> --(tx ABCDE..)--> <intermediate> --(tx FGHIJ..)--> <destination>' an, wobei die Transaktions-IDs auf die ersten 5 Zeichen gekürzt werden. Beziehe nur bestätigte On-Chain-Transaktionen in beiden Schritten des Pfades ein.","external_knowledge":null}
{"instance_id":"sf_bq065","db":"CRYPTO","question":"Aus der Oracle-Anfragen-Tabelle die 10 neuesten Anfragen mit Script-ID 3 abrufen. Für jede Anfrage extrahieren Sie alle Symbol-Raten-Paare, indem jedes Symbol im Array \"symbols\" mit seiner entsprechenden Rate an der gleichen Position im Array \"rates\" aus dem dekodierten Ergebnis abgeglichen wird. Passen Sie jede Rate an, indem Sie sie durch den Multiplikatorwert der Anfrage teilen. Geben Sie den Block-Zeitstempel, die Oracle-Anfrage-ID, das Symbol und die angepasste Rate für jedes Symbol-Raten-Paar zurück. Sortieren Sie die Ergebnisse chronologisch, wobei die neuesten Datensätze zuerst erscheinen.","external_knowledge":null}
{"instance_id":"sf_bq037","db":"HUMAN_GENOME_VARIANTS","question":"Über die in Phase 3 am 2015-02-20 gesammelten verfeinerten menschlichen genetischen Variationen möchte ich die minimalen und maximalen Startpositionen sowie die Anteile dieser beiden jeweils für die Referenzbasen 'AT' und 'TA' wissen.","external_knowledge":null}
{"instance_id":"sf_bq012","db":"ETHEREUM_BLOCKCHAIN","question":"Berechne das durchschnittliche Guthaben (in Quadrillionen, 10^15) der Top-10-Ethereum-Adressen nach Nettobilanz, einschließlich eingehender und ausgehender Überweisungen aus Trace-Daten (nur erfolgreiche Transaktionen und Ausschluss von Aufruftypen wie delegatecall, callcode und staticcall), Minerbelohnungen (Summe der Gasgebühren pro Block) und Abzüge der Sender-Gasgebühren. Null-Adressen ausschließen und das Ergebnis auf zwei Dezimalstellen runden.","external_knowledge":null}
{"instance_id":"sf_bq187","db":"ETHEREUM_BLOCKCHAIN","question":"Berechnen Sie den gesamten Umlaufbestand der 'BNB'-Tokens (in Einheiten, die durch 10^18 geteilt werden), indem Sie die Guthaben aller Adressen summieren, wobei das Guthaben jeder Adresse dem insgesamt empfangenen BNB minus gesendeten BNB entspricht. Transaktionen, bei denen die Nulladresse (0x000...) sowohl als Absender als auch als Empfänger beteiligt ist, ausschließen.","external_knowledge":null}
{"instance_id":"sf_bq450","db":"ETHEREUM_BLOCKCHAIN","question":"Erstellen Sie einen umfassenden Bericht über alle Ethereum-Adressen, die vor January 1, 2017 aktiv waren, und berechnen Sie ihre Nettobilanzen (unter Berücksichtigung der Transaktionsgebühren und unter Ausschluss von delegatecall/callcode/staticcall-Transaktionen), stündliche Aktivitätsmuster, aktive Tage, eingehende/ausgehende Transaktionskennzahlen (Anzahlen, eindeutige Gegenparteien, durchschnittliche ETH-Überweisungen), ERC20-Token-Interaktionen (Ein-/Aus-Anzahlen, eindeutige Tokens, Gegenparteien), Mining-Belohnungen, Häufigkeit von Vertrags-Erstellungen, Anzahlen fehlgeschlagener Transaktionen und Contract-Bytecode-Größen, wobei alle ETH-Werte in Standard-Einheiten umgerechnet (durch 10^18 geteilt) und Adressen ohne Transaktionshistorie ausgeschlossen werden.","external_knowledge":"ethereum_data_transformation.md"}
{"instance_id":"bq034","db":"ghcn_d","question":"Ich möchte die IDs und Namen von Wetterstationen wissen, die sich innerhalb einer Luftlinie von 50 km vom Zentrum von Chicago (41.8319°N, 87.6847°W) befinden.","external_knowledge":null}
{"instance_id":"bq383","db":"ghcn_d","question":"Könnten Sie die höchste aufgezeichnete Niederschlagsmenge, Tiefsttemperatur und Höchsttemperatur aus den letzten 15 Tagen jedes Jahres von 2013 bis 2016 an der Wetterstation USW00094846 bereitstellen? Stellen Sie sicher, dass jeder Wert die Spitzenmessung für diesen Zeitraum repräsentiert, mit Niederschlag in Millimetern und Temperaturen in Grad Celsius, unter Verwendung nur validierter Daten (nicht-null Werte und ohne Qualitätskennzeichen).","external_knowledge":null}
{"instance_id":"bq051","db":"new_york_ghcn","question":"Berechnen Sie die durchschnittliche tägliche Anzahl von Citibike-Fahrten in New York City im Jahr 2016, wobei Tage als regnerisch eingestuft werden, wenn der Gesamtniederschlag 5 Millimeter überschreitet (erhalten durch Teilen des Rohniederschlagswerts durch 10), und andernfalls als nicht regnerisch. Verwenden Sie Daten von der nächstgelegenen GHCN-Station, die innerhalb von 50 km von (40.7128, -74.0060) liegt und gültige, nicht gekennzeichnete Messwerte aufweist, und vergleichen Sie dann den resultierenden Durchschnitt der Citibike-Fahrten an regnerischen Tagen gegenüber nicht regnerischen Tagen.","external_knowledge":null}
{"instance_id":"bq038","db":"new_york","question":"Identifizieren Sie die Top-10-Citibike-Stationen mit dem höchsten Anteil an Gruppenausfahrten, definiert als Fahrten, die an derselben Station beginnen und enden, wobei mehrere Fahrer innerhalb desselben 2-Minuten-Zeitfensters ab- bzw. ankommen. Berechnen Sie den Anteil als die Anzahl der Fahrten, die Teil einer Gruppe sind, geteilt durch die Gesamtzahl der Fahrten, die an dieser Station enden.","external_knowledge":null}
{"instance_id":"bq053","db":"new_york","question":"Berechne die Veränderung der Anzahl der lebenden Bäume jeder Herbstfarbe in New York City von 1995 bis 2015, indem du für jede Baumart die Differenz zwischen der Anzahl der Bäume, die im Jahr 1995 nicht als tot markiert sind, und der Anzahl der Bäume, die 2015 leben, berechnest, wobei Arten durch die Großbuchstabenform ihrer wissenschaftlichen Namen aus der Tabelle tree_species abgeglichen werden. Dann ordne die Arten nach ihrer Herbstfarbe und summiere diese Differenzen, um die Gesamtveränderung der Baumzahl für jede Herbstfarbe zu bestimmen.","external_knowledge":null}
{"instance_id":"bq054","db":"new_york","question":"Bitte liefern Sie die Top-10-Baumarten in New York, wobei Sie ihre in Großbuchstaben geschriebenen lateinischen Namen verwenden, sofern der lateinische Name nicht leer ist, und ihre Trivialnamen einschließen; zeigen Sie die Gesamtzahl der Bäume, die Anzahl lebender und toter Bäume für jedes Jahr sowie das entsprechende Wachstum dieser Werte von 1995 bis 2015, und ordnen Sie anschließend nach der Differenz der Gesamtbaumzahlen zwischen diesen Jahren.","external_knowledge":null}
{"instance_id":"bq021","db":"new_york","question":"Für die Top-20-Citi-Bike-Routen im Jahr 2016: Welche Route ist schneller als gelbe Taxis, und welche von diesen hat die längste durchschnittliche Fahrraddauer? Bitte geben Sie den Namen der Startstation dieser Route an. Die Koordinaten sind auf drei Nachkommastellen gerundet.","external_knowledge":null}
{"instance_id":"bq202","db":"new_york_plus","question":"Für die Station, die im Jahr 2018 die höchste Anzahl an Citibike-Fahrten hatte, welcher numerische Wochentag und welche Stunde des Tages hatten laut Startzeit dieser Fahrten die größte Anzahl an Fahrten?","external_knowledge":null}
{"instance_id":"bq185","db":"new_york_plus","question":"Was ist die durchschnittliche Fahrtdauer in Minuten für alle gültigen Yellow taxi-Fahrten, die zwischen dem 1. Februar 2016 und dem 7. Februar 2016 (einschließlich) stattfanden, mit einer positiven Fahrtdauer, mehr als drei Passagieren und einer Fahrstrecke von mindestens zehn Meilen, wobei sowohl der Abhol- als auch der Zielort sich in Brooklyn befinden?","external_knowledge":null}
{"instance_id":"bq040","db":"new_york_plus","question":"Für NYC-Gelbtaxi-Fahrten vom 1. Januar 2016 bis zum 7. Januar 2016, ausgenommen Fahrten, die in ‘EWR’ oder ‘Staten Island’ aufgenommen wurden, bestimmen Sie den Anteil der Fahrten, die in jede Trinkgeldkategorie in jedem Abholbezirk fallen. Nur Fahrten berücksichtigen, bei denen die Abgabezeit nach der Abholzeit liegt, die Passagieranzahl größer als Null ist, und trip_distance, tip_amount, tolls_amount, mta_tax, fare_amount und total_amount alle nicht negativ sind. Klassifizieren Sie den Trinkgeldprozentsatz wie folgt: 0% (kein Trinkgeld), bis 5%, 5% bis 10%, 10% bis 15%, 15% bis 20%, 20% bis 25%, und mehr als 25%.","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq098","db":"new_york_plus","question":"Für Fahrten mit NYC gelben Taxis, bei denen sowohl pickup als auch dropoff zwischen dem 1. Januar 2016 und dem 7. Januar 2016 liegen (einschließlich), berechnen Sie den Prozentsatz der Fahrten ohne Trinkgeld in jedem Abholbezirk, wobei sichergestellt wird, dass nur Fahrten eingeschlossen werden, bei denen der dropoff nach dem pickup erfolgt, die Passagieranzahl größer als Null ist und die Fahrdistanz, tip_amount, tolls amount, MTA-Steuer, fare_amount und total_amount nicht negativ sind; definieren Sie Fahrten mit \"kein Trinkgeld\" als solche, bei denen der Trinkgeldsatz Null ist, wobei der Trinkgeldsatz berechnet wird als (tip_amount × 100) geteilt durch total_amount (und als Null angesehen wird, wenn total_amount Null ist).","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq039","db":"new_york_plus","question":"Finde die Top-10-Taxifahrten in New York City zwischen July 1 und July 7, 2016 (wobei sowohl Abholzeitpunkt als auch Abgabezeitpunkt innerhalb dieses Zeitraums liegen) bei denen die Passagieranzahl größer als fünf ist, die Fahrstrecke mindestens zehn Meilen beträgt, und es keine negativen fahrpreisbezogenen Beträge gibt (einschließlich Trinkgeld, Mautgebühren, MTA-Steuer, Fahrpreis und Gesamtbeträge). Schließe alle Fahrten aus, bei denen die Abgabzeit nicht strikt nach der Abholzeit liegt, sortiere dann die Ergebnisse nach dem Gesamtfahrpreis in absteigender Reihenfolge. Schließlich zeige die Abholzone jeder Fahrt, die Abgabezone, die Fahrtdauer in Sekunden, die Fahrgeschwindigkeit in Meilen pro Stunde und den Trinkgeldsatz als Prozentsatz des Gesamtfahrbetrags an.","external_knowledge":null}
{"instance_id":"bq203","db":"new_york_plus","question":"Für jeden Bezirk von New York City, wie viele U-Bahn-Stationen es insgesamt gibt, wie viele davon mindestens einen Eingang haben, der sowohl als tatsächlicher Eingang als auch als ADA-konform gekennzeichnet ist, und welchen Prozentsatz der Gesamtstationen in jedem Bezirk dies darstellt, wobei die Bezirke nach dem höchsten zum niedrigsten Prozentsatz aufgelistet werden?","external_knowledge":null}
{"instance_id":"bq035","db":"san_francisco","question":"Wie groß ist die insgesamt von jedem Fahrrad im San Francisco Bikeshare-Programm zurückgelegte Distanz, gemessen in Metern? Verwenden Sie Daten aus Bikeshare-Fahrten und Stationen, um dies zu berechnen.","external_knowledge":null}
{"instance_id":"bq186","db":"san_francisco","question":"Bitte finden Sie für jede Jahr-Monat-Kombination (im Format YYYYMM), die sich aus dem Startdatum der Bike-Share-Fahrten in San Francisco ableitet, die erste Fahrtdauer in Minuten, die letzte Fahrtdauer in Minuten, die höchste Fahrtdauer in Minuten und die niedrigste Fahrtdauer in Minuten, wobei ‘erste’ und ‘letzte’ durch die chronologische Reihenfolge des Startdatums der Fahrt bestimmt werden, dann gruppieren Sie Ihre Ergebnisse nach diesem Jahr-Monat-Schlüssel und sortieren Sie sie nach demselben Jahr-Monat-Schlüssel.","external_knowledge":null}
{"instance_id":"bq081","db":"san_francisco_plus","question":"Finde die neuesten Fahrtdaten für jede Region im Zeitraum von 2014 bis 2017. Ich möchte den Namen jeder Region, die Trip-ID dieser Fahrt, die Fahrtdauer, die Startzeit, die Startstation und das Geschlecht des Fahrers bzw. der Fahrerin erfahren.","external_knowledge":null}
{"instance_id":"sf_bq294","db":"SAN_FRANCISCO_PLUS","question":"Könnten Sie die Details der Top-5 längsten Bike-Share-Fahrten bereitstellen, die zwischen July 1, 2017 und December 31, 2017 begonnen haben, einschließlich der Fahrten-ID, der Dauer in Sekunden, des Startdatums, des Namens der Startstation, der Route (abgeleitet vom Namen der Startstation zum Namen der Endstation), der Fahrradnummer, des Abonnententyp, des Geburtsjahres des Mitglieds, des aktuellen Alters des Mitglieds (berechnet anhand des aktuellen Jahres), einer Altersklassifikation basierend darauf, ob das Mitglied jünger als 40, zwischen 40 und 60 oder älter als 60 ist, des Geschlechts des Mitglieds und des Namens der Region der Startstation? Bitte schließen Sie Fahrten aus, bei denen der Name der Startstation, das Geburtsjahr des Mitglieds oder das Geschlecht des Mitglieds nicht angegeben sind.","temporal":"Yes","external_knowledge":"trip_info.md"}
{"instance_id":"bq339","db":"san_francisco_plus","question":"Welcher Monat im Jahr 2017 hatte die größte absolute Differenz zwischen den kumulierten Nutzungsminuten des Fahrrads für Kunden und Abonnenten?\tWelcher Monat (in Zahl) im Jahr 2017 hatte die größte absolute Differenz zwischen den kumulierten Nutzungsminuten des Fahrrads (in Tausend) für Kunden und Abonnenten, basierend auf den Enddaten der Fahrten in den San Francisco Bikeshare-Daten?","external_knowledge":null}
{"instance_id":"bq400","db":"san_francisco_plus","question":"Für Fahrten, bei denen 'Clay St & Drumm St' in der Haltestellenreihenfolge (nur in einer Richtung) vor 'Sacramento St & Davis St' liegt, wie lauten die frühesten Abfahrtszeiten von 'Clay St & Drumm St' und die spätesten Ankunftszeiten an 'Sacramento St & Davis St' im Format HH:MM:SS? Bitte geben Sie das Fahrtziel jeder Route an.","external_knowledge":null}
{"instance_id":"bq059","db":"san_francisco_plus","question":"Was ist die höchste durchschnittliche Geschwindigkeit (auf 1 Dezimalstelle gerundet, in m/s (metrisch)) für Fahrradfahrten in Berkeley mit einer Fahrstrecke von mehr als 1000 Metern?","external_knowledge":null}
{"instance_id":"bq376","db":"san_francisco_plus","question":"Für jedes Stadtviertel in San Francisco, in dem sich mindestens eine Bike-Share-Station und mindestens ein Kriminalvorfall befinden, geben Sie den Namen des Viertels zusammen mit der Gesamtzahl der Bike-Share-Stationen und der Gesamtzahl der Kriminalvorfälle in diesem Viertel an.","external_knowledge":null}
{"instance_id":"sf_bq014","db":"THELOOK_ECOMMERCE","question":"Kannst du mir helfen, den Umsatz der Produktkategorie zu ermitteln, die die höchste Anzahl von Kunden hat, die in ihrer ersten Bestellung einen Kauf tätigen und deren Bestellung weder storniert noch zurückgegeben wurde?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq188","db":"THELOOK_ECOMMERCE","question":"Unter allen Produktkategorien im Datensatz identifizieren Sie die Kategorie mit der höchsten Gesamtmenge an Käufen (basierend auf der order_items table), und für diese spezifische Kategorie, wie groß ist die durchschnittliche Verweildauer in Minuten pro Produktseitenbesuch? Die durchschnittliche Zeit sollte als Differenz zwischen dem Zeitstempel, zu dem ein Benutzer eine Produktseite ansieht, und dem Zeitstempel des nächsten Ereignisses innerhalb derselben Sitzung berechnet werden.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq258","db":"THELOOK_ECOMMERCE","question":"Generieren Sie einen monatlichen Bericht für jede Produktkategorie, wobei jede Zeile Bestellungen entspricht, die einen Status von 'Complete' haben und vor dem Jahr 2022 geliefert wurden, gruppiert nach dem Monat und Jahr der Lieferung. Für jede Kategorie berechnen Sie den Gesamtumsatz (die Summe von sale_price), die Gesamtzahl der abgeschlossenen Bestellungen, und berechnen das Monat-zu-Monat-Prozentwachstum sowohl für Umsatz als auch für Bestellungen, indem Sie die Summen jedes Monats mit dem vorherigen Monat vergleichen. Dann, für dieselben Bestellungen, aggregieren Sie und zeigen die Gesamtkosten (aus den Produktkosten), den Gesamtgewinn (Umsatz minus Gesamtkosten) und schließlich das Gewinn-zu-Kosten-Verhältnis für jeden Monat.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq259","db":"THELOOK_ECOMMERCE","question":"Unter Verwendung von Daten bis Ende 2022 und sortiert nach dem Monat des ersten Kaufs jedes Nutzers, können Sie den Prozentsatz der Nutzer angeben, die in jedem der ersten, zweiten, dritten und vierten Monate seit ihrem ersten Kauf einen Kauf getätigt haben, wobei sich der „erste Monat“ auf den Monat ihres ersten Kaufs bezieht?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq189","db":"THELOOK_ECOMMERCE","question":"Ausschließlich anhand abgeschlossener Bestellungen berechnen Sie die durchschnittliche monatliche prozentuale Wachstumsrate der Anzahl eindeutiger Bestellungen (unter Berücksichtigung unterschiedlicher Bestell-IDs) für jede Produktkategorie, indem Sie die monatliche Anzahl mit der des vorherigen Monats innerhalb derselben Kategorie vergleichen. Bestimmen Sie die Produktkategorie mit dem höchsten Durchschnitt dieser monatlichen Bestellwachstumsraten. Dann berechnen Sie für diese spezifische Produktkategorie die durchschnittliche monatliche Umsatzwachstumsrate, indem Sie die prozentuale Veränderung des Gesamtumsatzes (Summe der Verkaufspreise) von Monat zu Monat berechnen und diese Werte über den gesamten Zeitraum mitteln.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq260","db":"THELOOK_ECOMMERCE","question":"Vom January 1, 2019, bis April 30, 2022, wie viele Benutzer befinden sich im jüngsten Alter und wie viele Benutzer befinden sich im ältesten Alter für jedes Geschlecht in der E-Commerce-Plattform, wobei sowohl die jüngsten als auch die ältesten Benutzer jeweils getrennt nach Geschlecht gezählt werden?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq261","db":"THELOOK_ECOMMERCE","question":"Für jeden Monat vor Januar 2024 identifizieren Sie das Produkt, das den höchsten Gesamtgewinn erzielt hat (berechnet als die Summe aus sale_price minus die Kosten des Produkts) über alle Bestellpositionen hinweg, und berichten Sie dann die Gesamtkosten und den Gesamtgewinn für dieses Top-Produkt pro Monat, einschließlich aller Bestellpositionen unabhängig von ihrem Status, und präsentieren Sie die Ergebnisse chronologisch nach Monat.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq262","db":"THELOOK_ECOMMERCE","question":"Generieren Sie einen monatlichen Analysebericht zum E-Commerce-Umsatz von Juni 2019 bis Dezember 2019, der für jede Produktkategorie und jeden Monat die Gesamtanzahl der Bestellungen, den Gesamtumsatz und den Gesamtgewinn sowie deren Monat-zu-Monat-Wachstumsraten enthält, wobei die Daten von Juni 2019 als Basis für die Berechnung des Wachstums ab Juli 2019 verwendet werden. Stellen Sie sicher, dass alle Bestellungen unabhängig von ihrem Status eingeschlossen werden, und präsentieren Sie die Ergebnisse sortiert in aufsteigender Reihenfolge nach Monat (im Format \"2019-07\") und dann nach Produktkategorie. Juni 2019 aus der endgültigen Ausgabe ausnehmen, aber für die Wachstumsberechnungen verwenden.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq190","db":"THELOOK_ECOMMERCE","question":"Bestimme die Anzahl der Benutzer, die für jedes Geschlecht (männlich und weiblich) separat zu den jüngsten und ältesten gehören, unter denjenigen, die sich zwischen January 1, 2019, und April 30, 2022 registriert haben. Für jedes Geschlecht identifiziere das minimale und maximale Alter innerhalb dieses Datumsbereichs und zähle, wie viele Benutzer in diese jeweiligen Altersgruppen fallen.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq263","db":"THELOOK_ECOMMERCE","question":"Bitte erstellen Sie einen Monatsbericht für das Jahr 2023, der sich auf die Kategorie 'Sleep & Lounge' konzentriert und für jeden Monat die Gesamterlöse, Gesamtkosten, die Anzahl der vollständigen Bestellungen, den Gesamtgewinn und das Verhältnis Gewinn zu Kosten anzeigt, wobei der Auftrag als 'Complete' markiert ist, das Erstellungsdatum zwischen dem 1. Januar 2023 und dem 31. Dezember 2023 liegt und die Kostendaten durch die Bestellpositionen dem entsprechenden Produkt korrekt zugeordnet sind.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq264","db":"THELOOK_ECOMMERCE","question":"Bestimmen Sie den Unterschied in der Anzahl der ältesten und der jüngsten registrierten Benutzer zwischen January 1, 2019, und April 30, 2022 aus den Daten unserer E-Commerce-Plattform.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq197","db":"THELOOK_ECOMMERCE","question":"Für jeden Monat vor Juli 2024 identifizieren Sie das jeweils meistverkaufte Produkt (bestimmt durch das höchste Verkaufsvolumen; bei Gleichstand gilt der Gesamtumsatz als Entscheidungskriterium) unter allen Bestellungen mit einem 'Complete'-Status und Produkten mit Marken, die nicht NULL sind. Geben Sie einen Bericht aus, der den Monat, Produktname, Marke, Kategorie, Gesamtabsatz, gerundeten Gesamtumsatz und Bestellstatus für diese monatlichen Spitzenreiter enthält.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq265","db":"THELOOK_ECOMMERCE","question":"Kannst du die E-Mail-Adressen der Top-10-Benutzer auflisten, die sich im Jahr 2019 registriert haben und im Jahr 2019 Einkäufe getätigt haben, und diese nach ihrem höchsten durchschnittlichen Bestellwert sortieren, wobei der durchschnittliche Bestellwert berechnet wird, indem die Anzahl der Artikel in jeder Bestellung mit dem Verkaufspreis multipliziert wird, diese Gesamtsumme über alle Bestellungen für jeden Benutzer summiert wird und dann durch die Gesamtzahl der Bestellungen geteilt wird?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq266","db":"THELOOK_ECOMMERCE","question":"Bitte nennen Sie die Namen der Produkte, die in jedem Monat des Jahres 2020 Verkäufe verzeichneten und den niedrigsten Gewinn aufwiesen, berechnet als die Differenz zwischen ihrem Einzelhandelspreis und den Kosten aus den Produktdaten. Schließen Sie Monate aus, für die diese Daten nicht verfügbar sind. Bitte listen Sie die Produkte in chronologischer Reihenfolge nach dem Monat auf.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq333","db":"THELOOK_ECOMMERCE","question":"Welche drei Browser weisen die kürzeste durchschnittliche Sitzungsdauer auf — berechnet durch die Differenz in Sekunden zwischen dem frühesten und dem spätesten Zeitstempel jeder Benutzersitzung — wobei nur Browser eingeschlossen werden, die mehr als 10 Gesamtsitzungen haben, und wie lauten ihre jeweiligen durchschnittlichen Sitzungsdauern?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq361","db":"THELOOK_ECOMMERCE","question":"Für die Benutzerkohorte mit einem ersten Kaufdatum im Januar 2020, welcher Anteil der Benutzer in den folgenden Monaten des Jahres 2020 zurückkehrte?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq271","db":"THELOOK_ECOMMERCE","question":"Bitte erstellen Sie einen Bericht, der für jeden Monat des Jahres 2021 die Anzahl der Bestellungen, die Anzahl der eindeutigen Käufer und den Gewinn bereitstellt (berechnet als die Summe der Einzelhandelspreise der Produkte minus die Summe der Produktkosten), wobei die Bestellungen im Jahr 2021 von Nutzern getätigt wurden, die sich im Jahr 2021 registriert haben, für Inventarartikel, die im Jahr 2021 erstellt wurden, und die Ergebnisse nach dem Land der Nutzer, der Produktabteilung und der Produktkategorie zu gruppieren.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq272","db":"THELOOK_ECOMMERCE","question":"Bitte geben Sie die Namen der drei profitabelsten Produkte für jeden Monat von Januar 2019 bis August 2022 an, ausgenommen Produkte, die mit stornierten oder zurückgegebenen Bestellungen verbunden sind. Für jedes Produkt in jedem Monat sollte der Gewinn als Summe der Verkaufspreise aller Bestellpositionen abzüglich der Summe der Kosten der in diesem Monat verkauften Positionen berechnet werden.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq273","db":"THELOOK_ECOMMERCE","question":"Können Sie die fünf Monate von August 2022 bis November 2023 auflisten, in denen der Gewinn aus Facebook-stammenden abgeschlossenen Bestellungen den größten monatlichen Anstieg zeigte? Berechnen Sie den Gewinn als Umsatz minus Kosten, gruppieren Sie nach Liefermonat und schließen Sie nur Bestellungen ein, die zwischen August 2022 und November 2023 erstellt wurden. Vergleichen Sie den Gewinn eines jeden Monats mit dem des vorherigen Monats, um die größten Zuwächse zu ermitteln.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq020","db":"GENOMICS_CANNABIS","question":"Wie lautet der Name der Referenzsequenz mit der höchsten Variantendichte im gegebenen Cannabis-Genom-Datensatz?","external_knowledge":null}
{"instance_id":"sf_bq107","db":"GENOMICS_CANNABIS","question":"Wie hoch ist die Varianzdichte der Cannabis-Referenz mit der längsten Referenzlänge? Beachten Sie, dass eine Variante vorhanden ist, wenn es mindestens einen Variant-Aufruf mit einem Genotyp größer als 0 gibt.","external_knowledge":null}
{"instance_id":"bq025","db":"census_bureau_international","question":"Stellen Sie eine Liste der Top-10-Länder für das Jahr 2020 zusammen, geordnet nach dem höchsten Anteil der Bevölkerung unter 20 Jahren. Für jedes Land geben Sie die Gesamtbevölkerung unter 20 Jahren, die Bevölkerung zur Jahresmitte und den Anteil der Bevölkerung, der unter 20 Jahre alt ist.","external_knowledge":null}
{"instance_id":"bq115","db":"census_bureau_international","question":"Welches Land hat den höchsten Anteil der Bevölkerung unter 25 Jahren im Jahr 2017?","external_knowledge":null}
{"instance_id":"bq030","db":"covid19_open_data","question":"Stand: May 10, 2020, unter allen Ländern, die mehr als 50,000 bestätigte COVID-19-Fälle hatten, welche drei Länder die höchsten Genesungsquoten hatten, basierend auf der Gesamtzahl der genesenen Fälle im Verhältnis zu ihren insgesamt bestätigten Fällen, und wie hoch waren ihre jeweiligen Genesungsquoten in Prozent ausgedrückt?","external_knowledge":null}
{"instance_id":"bq018","db":"covid19_open_data","question":"Welcher Tag im März und im April hatte die höchste Wachstumsrate der bestätigten COVID-19-Fälle in den Vereinigten Staaten? Das Format ist MM-DD.","external_knowledge":null}
{"instance_id":"bq086","db":"covid19_open_world_bank","question":"Sie müssen den Prozentsatz der Bevölkerung jedes Landes berechnen, der bis zum 30. Juni 2020 als COVID-19 bestätigt wurde. Die Bevölkerungsdaten für 2018 finden sich im World Bank-Datensatz, und die kumulativen COVID-19-Bestätigungsfalldaten stehen im COVID-19 Open Data-Datensatz zur Verfügung. Berechnen Sie den Prozentsatz der Bevölkerung jedes Landes, bei dem kumulativ COVID-19 bestätigt wurde.","external_knowledge":null}
{"instance_id":"bq085","db":"covid19_jhu_world_bank","question":"Könnten Sie für die Vereinigten Staaten, Frankreich, China, Italien, Spanien, Deutschland und Iran die Gesamtzahl der bestätigten COVID-19-Fälle Stand April 20, 2020 bereitstellen, zusammen mit der Zahl der Fälle pro 100,000 Einwohner basierend auf deren Gesamtbevölkerung 2020, berechnet durch die Summe aller relevanten Bevölkerungsangaben aus den Daten der Weltbank.","external_knowledge":null}
{"instance_id":"bq130","db":"covid19_nyt","question":"Analysieren Sie die täglich gemeldeten COVID-19-Fallzahlen von März bis Mai 2020 und identifizieren Sie die fünf Bundesstaaten mit den größten täglichen Zuwächsen. Bitte erstellen Sie eine Rangliste darüber, wie oft jeder Bundesstaat in diesen täglichen Top-Fünfen erscheint. Untersuchen Sie anschließend den Bundesstaat, der insgesamt den vierten Rang belegt, und identifizieren Sie seine fünf Top-Kreise basierend darauf, wie oft er in den täglichen Top-Fünf der neuen Fallzahlen erscheint.","external_knowledge":null}
{"instance_id":"bq087","db":"covid19_symptom_search","question":"Bitte berechnen Sie die gesamte prozentuale Veränderung der durchschnittlichen wöchentlichen Suchhäufigkeit für das Symptom 'Anosmie' in den fünf Bezirken der Stadt New York—Bronx County, Queens County, Kings County, New York County und Richmond County—indem Sie die kombinierten Daten vom 1. Januar 2019 bis 31. Dezember 2019 mit den kombinierten Daten vom 1. Januar 2020 bis 31. Dezember 2020 vergleichen.","external_knowledge":null}
{"instance_id":"bq088","db":"covid19_symptom_search","question":"Bitte berechnen Sie die durchschnittlichen Niveaus von Angst- und Depressionssymptomen aus den wöchentlichen Länderdaten für die Vereinigten Staaten in den Zeiträumen vom January 1, 2019 bis January 1, 2020 und vom January 1, 2020 bis January 1, 2021. Dann berechnen Sie die prozentuale Steigerung dieser durchschnittlichen Symptomwerte vom Zeitraum 2019 zum Zeitraum 2020.","external_knowledge":null}
{"instance_id":"bq089","db":"covid19_usa","question":"Angesichts der neuesten Bevölkerungsschätzungen aus der 2018er Fünfjahres-Schätzung des American Community Survey, wie viele Impfstandorte pro 1000 Einwohner gibt es in den Landkreisen Kaliforniens?","external_knowledge":null}
{"instance_id":"bq407","db":"covid19_usa","question":"Finden Sie die drei Landkreise mit einer Bevölkerung von über 50.000, unter Verwendung der 2020er 5-Jahres-Zensusdaten, die am 27. August 2020 die höchsten COVID-19-Fallsterblichkeitsraten aufwiesen. Für diese Landkreise geben Sie den Namen, das Bundesland, das Medianalter, die Gesamtbevölkerung, die Anzahl bestätigter COVID-19-Fälle pro 100.000 Einwohner, die Anzahl der Todesfälle pro 100.000 Einwohner und die Fallsterblichkeitsrate in Prozent an.","external_knowledge":null}
{"instance_id":"bq137","db":"census_bureau_usa","question":"Bitte finden Sie alle Postleitzahlengebiete, die sich innerhalb von 10 Kilometern der Koordinaten (-122.3321, 47.6062) befinden, indem Sie die Bevölkerungsdaten der Volkszählung 2010 (nur männliche und weibliche Bevölkerung ohne Altersbeschränkungen summieren) mit den Informationen zu den Postleitzahlgebieten verknüpfen, und geben Sie das Polygon jedes Gebiets, die Land- und Wasserfläche in Metern, Breitengrad und Längengrad, den Staatencode, den Staatsnamen, die Stadt, den Kreis und die Gesamtbevölkerung zurück.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq060","db":"census_bureau_international","question":"Welche drei Länder hatten im Jahr 2017 die höchste Nettozuwanderung unter den Ländern mit einer Fläche von mehr als 500 Quadratkilometern? Und wie hoch sind ihre Migrationsraten?","external_knowledge":null}
{"instance_id":"bq338","db":"census_bureau_acs_1","question":"Können Sie die Zensusbezirke im Gebiet 36047 finden, die zu den Top-20 gehören bei den größten prozentualen Zuwächsen der Bevölkerung von 2011 bis 2018, die zudem zu den Top-20 gehören bei den größten absoluten Zuwächsen beim Median-Einkommen im selben Zeitraum, und in jedem dieser Jahre mehr als 1.000 Einwohner hatten?","external_knowledge":null}
{"instance_id":"bq061","db":"census_bureau_acs_1","question":"Welcher Zensus-Trakt hat zwischen 2015 und 2018 den größten Anstieg des mittleren Einkommens in Kalifornien verzeichnet? Geben Sie mir den Traktcode an.","external_knowledge":null}
{"instance_id":"bq064","db":"census_bureau_acs_1","question":"Unter Verwendung der 2017 U.S. Census-Tracts-Daten aus den BigQuery-öffentlichen Datensätzen müssen Sie die Bevölkerung und das Einkommen jedes Census-Tracts proportional auf die Postleitzahlen verteilen, basierend auf dem sich überschneidenden Bereich ihrer geografischen Grenzen. Anschließend filtern Sie die Ergebnisse so, dass nur Postleitzahlen berücksichtigt werden, die sich innerhalb eines 5-Meilen-Radius um einen bestimmten Punkt im Bundesstaat Washington befinden, mit Koordinaten Breitengrad 47.685833°N und Längengrad -122.191667°W. Schließlich berechnen Sie die Gesamtbevölkerung und das durchschnittliche Einkommen pro Kopf jeder Postleitzahl (auf eine Nachkommastelle gerundet) und sortieren die Ergebnisse nach dem durchschnittlichen Einkommen pro Kopf in absteigender Reihenfolge.","external_knowledge":"functions_st_intersects_area.md"}
{"instance_id":"bq461","db":"ncaa_basketball","question":"Bitte geben Sie eine chronologische Zusammenfassung aller Scoring-Plays aus dem Spiel der Saison 2014, bei dem die Wildcats das Heimteam und die Fighting Irish das Auswärtsteam waren. Führen Sie für jedes Scoring-Ereignis die Spieluhr, die kumulierten Punktestände beider Teams (Wildcats und Fighting Irish), das scorende Team und eine Beschreibung des Ereignisses auf.","external_knowledge":null}
{"instance_id":"bq198","db":"ncaa_basketball","question":"Listen Sie die Top-5-Universitäten auf, die die meisten Saisons hatten, in denen sie in ihren jeweiligen NCAA-Basketball-Saisons zwischen 1900 und 2000 die maximale Anzahl Siege erzielten, und geben Sie die Gesamtzahl solcher Spitzen-Saisons jeder Mannschaft an, wobei Einträge mit fehlenden Teamnamen ausgeschlossen werden.","external_knowledge":null}
{"instance_id":"bq462","db":"ncaa_basketball","question":"Bitte erstellen Sie eine Tabelle aus dem NCAA-Basketball-Datensatz, die die Top-5-Rekorde in jeder dieser vier Kategorien auflistet: (1) Top-Veranstaltungsorte – die größten Spielstätten nach Sitzkapazität mit Datum, das als 'N/A' angezeigt wird; (2) Größte Margin der Meisterschaft – Nationalmeisterschaftsspiele seit der Saison 2016 (Saison > 2015) mit dem größten Punktedifferenz; (3) punktreichste Spiele – Spiele seit der Saison 2011 (Saison > 2010) mit der höchsten Gesamtpunktzahl beider Mannschaften; und (4) Gesamt-Dreier – Spiele seit der Saison 2011 (Saison > 2010) mit der höchsten Gesamtanzahl an Dreiern, die von beiden Mannschaften zusammen erzielt wurden. Die endgültige Tabelle sollte Spalten enthalten: Kategorie, Datum, Aufeinandertreffen bzw. Spielstätte, und Schlüsselkennzahl, wobei jede Kategorie ihre 5 Datensätze in absteigender Reihenfolge ihrer Schlüsselkennzahl präsentiert.","external_knowledge":null}
{"instance_id":"bq427","db":"ncaa_basketball","question":"Könnten Sie für jede Schussart die durchschnittlichen x- und y-Koordinaten (angepasst, um Konsistenz bezüglich des linken oder rechten Korbs sicherzustellen), die durchschnittliche Anzahl der Wurfversuche und die durchschnittliche Anzahl erfolgreicher Würfe bestimmen, wobei nur Würfe berücksichtigt werden, die vor dem 15. März 2018 aufgenommen wurden, ausgenommen jene mit NULL-Schussarten oder Koordinaten, und sicherstellen, dass die Würfe sich auf der richtigen Seite des Spielfelds befinden, basierend auf dem Korb des Teams.","external_knowledge":"basketball.md"}
{"instance_id":"bq428","db":"ncaa_basketball","question":"Für die fünf größten Teammärkte mit der höchsten Anzahl eindeutiger Spieler, die während der zweiten Periode der Spiele zwischen 2010 und 2018 mindestens 15 Punkte erzielt haben, liefern Sie Details zu jedem Spiel, das sie in NCAA-Basketball-Historien-Turnierbegegnungen im selben Zeitraum gespielt haben, wie im Datenmodell-Dokument angegeben.","external_knowledge":"ncaa_data_model.md"}
{"instance_id":"bq144","db":"ncaa_insights","question":"Erstellen Sie einen Datensatz, indem Sie Ergebnisse des NCAA-Herren-Basketballturniers ab der Saison 2014 zusammenführen, einschließlich sowohl der historischen Turnierspiele als auch der Ergebnisse des Turniers 2018, mit den entsprechenden Pace- und Effizienzleistungskennzahlen für jedes Team und dessen Gegner aus den feature_engineering-Daten. Der Datensatz sollte die Saison, Spielausgangskennzeichen (Sieg oder Niederlage), Team- und Gegner-Seeds, Schulnamen, Pace- und Effizienzrankings, statistische Werte sowie die Unterschiede zwischen den Metriken des Teams und des Gegners enthalten, um eine umfassende Analyse der Dynamik von Team und Gegnern zu ermöglichen.","external_knowledge":"NCAA_Basketball_Tournament_SQL_Query_Variable_Guide.md"}
{"instance_id":"bq113","db":"bls","question":"Welcher Landkreis in Utah verzeichnete von 2000 bis 2018 den größten prozentualen Anstieg der Beschäftigung im Baugewerbe, berechnet durch den Durchschnitt der Beschäftigungsniveaus im dritten Monat jedes Quartals in diesen Jahren? Wie groß ist der entsprechende Anstieg in Prozent?","external_knowledge":null}
{"instance_id":"bq112","db":"bls","question":"Zwischen 1998 und 2017, für den Allegheny County im Großraum Pittsburgh, blieben die durchschnittlichen Jahreslöhne aller Branchen im Gleichschritt mit der Inflation aller Konsumgüter, und wie hoch waren in diesem Zeitraum die jeweiligen prozentualen Wachstumsraten (auf zwei Nachkommastellen) für Löhne und den Verbraucherpreisindex (VPI)?","external_knowledge":null}
{"instance_id":"bq055","db":"google_dei","question":"Könnten Sie die drei größten Rassen mit den größten prozentualen Unterschieden zwischen Googles 2021 Gesamt-Einstellungsdaten aus dar non intersectional hiring und den durchschnittlichen Prozentsätzen in den 2021 BLS-Daten für die Technologie-Sektoren, die speziell definiert sind als 'Internet publishing and broadcasting and web search portals,' 'Software publishers,' 'Data processing, hosting, and related services,' oder der Branchengruppe 'Computer systems design and related services,' zusammen mit ihren jeweiligen Differenzen bereitstellen?","external_knowledge":null}
{"instance_id":"bq075","db":"google_dei","question":"Könnten Sie einen kombinierten Bericht für 2021 bereitstellen, der die Verteilung nach Rasse (Asiaten, Schwarze, Hispanic/Latinx, Weiße) und nach Geschlecht (US-Frauen, US-Männer) über Googles Gesamtbelegschaft beim Einstellungsprozess, Googles Gesamtbelegschaftsrepräsentation und die BLS-Daten speziell für die Technologiebranchen – definiert als Internet-Publishing und Broadcasting sowie Web-Suchportale oder Computersystemdesign und verwandte Dienstleistungen – vergleicht?","external_knowledge":null}
{"instance_id":"bq406","db":"google_dei","question":"Bitte berechnen Sie die Wachstumsraten für Asiaten, Schwarze Menschen, Latinx-Menschen, Ureinwohner Amerikas, Weiße Menschen, US-Frauen, US-Männer, globale Frauen und globale Männer im Zeitraum von 2014 bis 2024 in Bezug auf die Gesamtbelegschaft.","external_knowledge":null}
{"instance_id":"sf_bq084","db":"GOOG_BLOCKCHAIN","question":"Für jeden Monat des Jahres 2023, wie viele Transaktionen insgesamt aufgetreten sind (alle Transaktionsdatensätze zählen, ohne Duplikate von Transaktions-Hashes zu entfernen), und wie viele Transaktionen pro Sekunde in jedem Monat verarbeitet wurden, wobei der Wert der Transaktionen pro Sekunde berechnet wird, indem die monatliche Gesamtzahl durch die genaue Anzahl der Sekunden in diesem Monat geteilt wird, einschließlich der korrekten Schaltjahreslogik, falls zutreffend basierend auf dem aus dem Transaktionszeitstempel extrahierten Jahr? Zeigen Sie die monatliche Transaktionsanzahl, die berechneten Transaktionen pro Sekunde, das Jahr und den Monat, und geben Sie die Zeilen in absteigender Reihenfolge der monatlichen Transaktionsanzahl aus.","external_knowledge":null}
{"instance_id":"sf_bq058","db":"GOOG_BLOCKCHAIN","question":"Alle finalisierten Einzahlungen in Optimism bei Block 29815485 abrufen, unter Verwendung der Optimism Standard Bridge, einschließlich Transaktions-Hash, eines Etherscan-Links (der vollständigen URL), L1- und L2-Token-Adressen, Absender- und Empfängeradressen (mit führenden Nullen entfernt) und dem eingezahlten Betrag (aus Hexadezimal in Dezimal umgerechnet). Stellen Sie sicher, dass die Daten gemäß den Adress- und Token-Standards von Optimism korrekt formatiert und geparst werden, und entfernen Sie das Präfix '0x' außer dem Transaktions-Hash. Hinweis: Der Keccak-256-Hash der Ethereum-Ereignissignatur für DepositFinalized lautet \"0x3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".","external_knowledge":"optimism_standard_bridge_contract.md"}
{"instance_id":"sf_bq416","db":"GOOG_BLOCKCHAIN","question":"Könnten Sie die drei größten USDT-Transfers auf der TRON-Blockchain abrufen, indem Sie die Blocknummern, Absenderadressen, Empfängeradressen (im TronLink-Format) und Transferbeträge auflisten, wobei die USDT-Vertragsadresse '0xa614f803b6fd780986a42c78ec9c7f77e6ded13c' und die Transfer-Event-Signatur '0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef' verwendet werden, den rohen Transferwert durch 1,000,000 zu teilen, um die endgültige USDT-Menge zu erhalten, und die Ergebnisse dann nach den größten transferierten Beträgen zuerst zu ordnen?","external_knowledge":"blockchain_data_transformations.md"}
{"instance_id":"sf_bq226","db":"GOOG_BLOCKCHAIN","question":"Welche Absenderadresse, dargestellt als vollständige URL unter https://cronoscan.com, wurde auf der Cronos-Blockchain in Transaktionen mit nicht-null Feldern 'to_address' am häufigsten verwendet, innerhalb von Blöcken größer als 4096 Bytes, seit dem 1. Januar 2023?","external_knowledge":null}
{"instance_id":"sf_bq016","db":"DEPS_DEV_V1","question":"Wenn man nur die höchsten Release-Versionen von NPM-Paketen betrachtet, welche Abhängigkeit (Paket und dessen Version) tritt am häufigsten unter den Abhängigkeiten dieser Pakete auf?","external_knowledge":null}
{"instance_id":"sf_bq062","db":"DEPS_DEV_V1","question":"Welche Lizenz wird von Paketen in jedem System am häufigsten verwendet?","external_knowledge":null}
{"instance_id":"sf_bq063","db":"DEPS_DEV_V1","question":"Finde die GitHub-URL (mit dem Linktext 'SOURCE_REPO') der neuesten veröffentlichten Version des NPM-Pakets, das die höchste Anzahl der Abhängigkeiten in seiner neuesten veröffentlichten Version hat, wobei Pakete ausgeschlossen werden, deren Namen das Zeichen '@' enthalten, und wobei nur URLs berücksichtigt werden, bei denen der Linktext 'SOURCE_REPO' ist und die URL 'github.com' enthält.","external_knowledge":null}
{"instance_id":"sf_bq028","db":"DEPS_DEV_V1","question":"Unter Berücksichtigung nur der neuesten Release-Versionen der NPM-Pakete, welche Pakete sind die acht beliebtesten basierend auf der Anzahl der GitHub-Sterne, sowie deren Versionen?","external_knowledge":null}
{"instance_id":"bq022","db":"chicago","question":"Berechnen Sie die minimale und maximale Fahrtdauer in Minuten (auf die nächste ganze Zahl gerundet), die Gesamtzahl der Fahrten und den durchschnittlichen Fahrpreis für jede der sechs gleich großen Quantilgruppen basierend auf der Fahrtdauer, wobei nur Fahrten zwischen 0 und 60 Minuten berücksichtigt werden.","external_knowledge":null}
{"instance_id":"bq362","db":"chicago","question":"Welche drei Unternehmen hatten den größten Anstieg der Fahrtenzahlen zwischen zwei aufeinanderfolgenden Monaten im Jahr 2018?","external_knowledge":null}
{"instance_id":"bq363","db":"chicago","question":"Berechnen Sie die Gesamtzahl der Fahrten und den durchschnittlichen Fahrpreis (auf zwei Dezimalstellen genau) für zehn gleichgroße Quantilgruppen. Erstellen Sie zehn Quantilgruppen, indem Sie die Dimension der Fahrtdauer (von 1–50 Minuten) in gleiche Mengen partitionieren. Jede Gruppe sollte eine ähnliche Anzahl unterschiedlicher Minutenwerte darstellen. Zeigen Sie den Zeitbereich jeder Gruppe im Format \"XXm bis XXm\" (wobei die Zahlen zweistellig mit führender Null aufgefüllt werden), die Gesamtanzahl der Fahrten und den durchschnittlichen Fahrpreis. Die Zeitbereiche sollten die Minimal- und Maximalwerte der Dauer innerhalb jedes Quantils darstellen. Sortieren Sie die Ergebnisse chronologisch nach dem Zeitbereich. Verwenden Sie NTILE(10), um die Quantile aus den geordneten Fahrtdauern zu erzeugen.","external_knowledge":null}
{"instance_id":"bq076","db":"chicago","question":"Wie hoch ist die höchste Anzahl von Autodiebstahlvorfällen, die im Jahr 2016 in einem einzelnen Monat aufgetreten ist?","external_knowledge":null}
{"instance_id":"bq077","db":"chicago","question":"Für jedes Jahr von 2010 bis 2016: Wie hoch ist die höchste Anzahl von Autodiebstählen in einem Monat?","external_knowledge":null}
{"instance_id":"sf_bq350","db":"OPEN_TARGETS_PLATFORM_1","question":"Für die detaillierten Moleküldaten zeigen Sie bitte die Arzneimittel-ID, den Arzneimitteltyp und den Auslistungsstatus für zugelassene Arzneimittel mit einer Black-Box-Warnung und mit bekanntem Arzneimitteltyp unter 'Keytruda', 'Vioxx', 'Premarin' und 'Humira'.","external_knowledge":null}
{"instance_id":"sf_bq379","db":"OPEN_TARGETS_PLATFORM_1","question":"Welches für das Target genehmigte Symbol hat die Gesamtassoziationsbewertung, die dem Durchschnittswert für Psoriasis am nächsten liegt?","external_knowledge":null}
{"instance_id":"sf_bq078","db":"OPEN_TARGETS_PLATFORM_2","question":"Ermitteln Sie das offizielle Symbol der Zielgene mit dem höchsten Gesamtscore, die mit der Erkrankung 'EFO_0000676' aus der Datenquelle 'IMPC' assoziiert sind.","external_knowledge":null}
{"instance_id":"sf_bq095","db":"OPEN_TARGETS_PLATFORM_1","question":"Erstellen Sie eine Liste von Medikamenten aus der Tabelle mit molekularen Details, die klinische Studien abgeschlossen haben, für das pankreatische endokrine Karzinom, Krankheits-ID EFO_0007416. Bitte geben Sie den Namen jedes Medikaments, das genehmigte Ziel-Symbol sowie Links zu den relevanten klinischen Studien an.","external_knowledge":null}
{"instance_id":"bq109","db":"open_targets_genetics_1","question":"Finde den Durchschnitt, die Varianz, die Max-Min-Differenz und die QTL-Quelle (rechte Studie) des Maximums von log2(h4/h3) für Daten, bei denen die rechte Gen-ID \"ENSG00000169174\" ist, h4 > 0.8, h3 < 0.02, das berichtete Merkmal umfasst \"Cholesterinwerte\", das rechte biologische Merkmal ist \"IPSC\" und die Variante ist '1_55029009_C_T'.","external_knowledge":null}
{"instance_id":"sf_bq325","db":"OPEN_TARGETS_GENETICS_2","question":"Bitte identifizieren Sie die Top-10-Gene mit den stärksten Assoziationen über alle Studien hinweg, indem Sie zunächst für jedes Gen innerhalb jeder Studie die Variante mit dem niedrigsten p-Wert auswählen, und dann alle solchen Gen–Variant-Paare ranken, um die 10 Gene mit den kleinsten p-Werten insgesamt zurückzugeben.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq090","db":"CYMBAL_INVESTMENTS","question":"Wie viel höher ist der durchschnittliche intrinsische Wert von Trades, die die feeling-lucky-Strategie verwenden, im Vergleich zu Trades, die die Momentum-Strategie verwenden, bei Long-Positionen?","external_knowledge":null}
{"instance_id":"bq442","db":"CYMBAL_INVESTMENTS","question":"Bitte sammeln Sie die Informationen der sechs Handelsberichte mit den höchsten Schlusskursen. Beziehen Sie sich auf das Dokument, um alle Informationen zu erhalten, die ich möchte.","external_knowledge":"Trade_Capture_Report_Data_List.md"}
{"instance_id":"bq079","db":"usfs_fia","question":"Unter Berücksichtigung der jeweils neuesten Auswertungsgruppe pro Bundesstaat für den Auswertungstyp 'EXPCURR' bestimmen Sie, welcher Bundesstaat die größte Gesamtfläche an Holzlandflächen hat und welcher die größte Gesamtfläche an Waldlandflächen hat. Für Holzlandflächen schließen Sie Flächen ein, bei denen der Zustandscode 1 ist, der Reservierungsstatuscode 0 ist und der Code der Standortproduktivitätsklasse zwischen 1 und 6 liegt. Für Waldlandflächen schließen Sie Flächen ein, bei denen der Zustandscode 1 ist. Berechnen Sie die Gesamtacres, indem Sie die angepassten Expansionsfaktoren für Makroplots und Subplots summieren, wobei Sie deren jeweilige Proportionsbasen ('MACR' für Makroplots und 'SUBP' für Subplots) und Anpassungsfaktoren berücksichtigen, falls diese größer als Null sind. Für jede Kategorie (Holzlandflächen und Waldlandflächen) geben Sie den Staatencode, die Auswertungsgruppe, den Staatsnamen und die Gesamtacres des Staates mit der höchsten Gesamtfläche an, wobei nur die neueste Auswertungsgruppe pro Staat berücksichtigt wird.","external_knowledge":null}
{"instance_id":"bq024","db":"usfs_fia","question":"Für das Jahr 2012: Welche Top-10-Evaluationsgruppen haben die größten Subplot-Flächen, wenn man nur die Bedingung mit den größten Subplot-Flächen innerhalb jeder Gruppe berücksichtigt? Bitte geben Sie die Evaluationsgruppe, Evaluierungstyp, Statuscode der Bedingung, Evaluierungsbeschreibung, Staatencode, Macroplot acres und subplot acres an.","external_knowledge":null}
{"instance_id":"bq220","db":"usfs_fia","question":"Basierend auf der Bedingung, plot_tree und population Tabellen in bigquery-public-data.usfs_fia, für den auf 'EXPCURR' gesetzten Evaluationstyp und condition_status_code gleich 1, welche US-Bundesstaaten hatten die größte durchschnittliche subplot-Größe und die größte durchschnittliche macroplot-Größe, jeweils, für jedes der Jahre 2015, 2016 und 2017? Bitte geben Sie den Plot-Typ (subplot oder macroplot), das jeweilige Jahr, den Staat und die entsprechende Durchschnittsgröße in Ihren Ergebnissen an.","external_knowledge":"subplot_macroplot_size.md"}
{"instance_id":"bq096","db":"gbif","question":"Bestimmen Sie, welches Jahr das früheste Datum nach Januar ist, an dem mehr als 10 Sichtungen von Sterna paradisaea nördlich des Breitengrads 40° aufgezeichnet wurden. Für jedes Jahr bestimmen Sie den ersten Tag nach Januar, an dem mehr als 10 Sichtungen dieser Art in dieser Region aufgezeichnet wurden, und ermitteln Sie das Jahr, dessen frühestes solches Datum das früheste aller Jahre ist.","external_knowledge":null}
{"instance_id":"sf_bq276","db":"NOAA_PORTS","question":"Könnten Sie eine umfassende Liste aller Häfen in Regionsnummer 6585 liefern, die innerhalb der Grenzen der US-Bundesstaaten liegen und von benannten Stürmen im Nordatlantik-Becken betroffen wurden, mit Windgeschwindigkeiten von mindestens 35 Knoten und einer Saffir-Simpson-Klassifikation von mindestens minimaler tropischer Sturmstärke, einschließlich für jeden Hafen dessen Name, der Staatsname, die unterschiedlichen Jahre, in denen Stürme auftraten, die Gesamtzahl der unterschiedlichen Stürme, die unterschiedlichen Sturmnamen, der durchschnittlichen Sturmkategorie, der durchschnittlichen Windgeschwindigkeit und der jeweiligen Geometrien sowohl für den Hafen als auch für die Gebiete der tropischen Stürme?","temporal":"Yes","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq277","db":"noaa_ports","question":"Welcher einzelne Hafen, der unter der Regionsnummer '6585' aufgeführt ist, liegt innerhalb der Grenzen eines US-Bundesstaats und kommt am häufigsten in den geografischen Gebieten benannter tropischer Stürme mit Windgeschwindigkeiten von mindestens 35 Knoten im Nordatlantik-Becken vor, ausgenommen diejenigen, die mit 'NOT_NAMED' gekennzeichnet sind?","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq278","db":"sunroof_solar","question":"Bitte liefern Sie einen detaillierten Vergleich des Solarpotenzials für jeden Bundesstaat, wobei zwischen Postleitzahl- und Zensusbezirk-Ebenen unterschieden wird. Für jeden Bundesstaat geben Sie die Gesamtzahl der Gebäude an, die für Solaranlagen verfügbar sind, den durchschnittlichen Prozentsatz der Google Maps-Fläche, die von Project Sunroof abgedeckt wird, sowie den durchschnittlichen Prozentsatz dieser Abdeckung, der für Solaranlagen geeignet ist, die Gesamtzahl potenzieller Solarmodule, die Gesamtkapazität in Kilowatt, das Energieerzeugungspotenzial, den CO2-Ausgleich, die aktuelle Anzahl der Gebäude mit Solarmodulen und die Lücke beim Installationspotenzial, berechnet durch Anpassung der insgesamt qualifizierten Gebäude gemäß den Abdeckungs- und Eignungsprozentsätzen und Abzug der aktuellen Installationen.","external_knowledge":null}
{"instance_id":"bq102","db":"gnomAD","question":"Identifizieren Sie, welche Startpositionen mit Missense-Varianten im BRCA1-Gen auf dem Chromosom 17 assoziiert sind, wobei die Referenzbase 'C' und die alternative Base 'T' ist. Unter Verwendung von Daten aus der gnomAD v2.1.1-Version.","external_knowledge":null}
{"instance_id":"bq445","db":"gnomAD","question":"Unter Verwendung der gnomAD v2.1.1-Genomdaten für Chromosom 17 ermitteln Sie die kleinste Startposition und die größte Endposition irgendeiner Variante, deren verschachtelte VEP-Anmerkungen das Symbol 'BRCA1' enthalten. Dann rufen Sie für alle Varianten, deren Positionen sich innerhalb dieses Genabschnitts befinden, die Werte von 'Protein_position' nur ab, falls der 'Consequence' 'missense_variant' enthält, sortieren Sie sie aufsteigend nach 'Protein_position' und geben Sie schließlich das erste entsprechende Ergebnis aus.","external_knowledge":null}
{"instance_id":"bq103","db":"gnomAD","question":"Erzeuge Zusammenfassungsstatistiken zu genetischen Varianten im Bereich zwischen Positionen 55039447 und 55064852 auf Chromosom 1. Dies umfasst die Anzahl der Varianten, die Gesamtanzahl der Allele, die Gesamtheit der Allele und unterschiedliche Gen-Symbole (unter Verwendung des Variant Effect Predictor, VEP, zur Genannotation). Berechnen Sie außerdem die Mutationsdichte, indem Sie die Länge des Bereichs durch die Anzahl der Varianten teilen. Daten aus der gnomAD v3-Version verwenden.","external_knowledge":null}
{"instance_id":"sf_bq104","db":"GOOGLE_TRENDS","question":"Basierend auf dem neuesten Aktualisierungsdatum identifizieren Sie den am höchsten rangierenden aufstrebenden Suchbegriff für die Woche, der genau ein Jahr vor der zuletzt verfügbaren Woche im Datensatz liegt.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq411","db":"GOOGLE_TRENDS","question":"Bitte rufen Sie die drei Top-Suchbegriffe von Google Trends (Ränge 1, 2 und 3) aus top_terms für jeden Wochentag (Montag bis Freitag) zwischen September 1, 2024, und September 14, 2024 ab, gruppiert nach der Spalte refresh_date und in absteigender Reihenfolge von refresh_date sortiert.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq105","db":"nhtsa_traffic_fatalities_plus","question":"Nach dem Bericht zu Unfällen und der Ablenkung des Fahrers aus den Jahren 2015 und 2016 und unter Ausschluss der Fälle, in denen der Ablenkungsstatus des Fahrers als 'Not Distracted', 'Unknown if Distracted' oder 'Not Reported' aufgezeichnet wurde, wie viele Verkehrsunfälle pro 100.000 Einwohner durch die Ablenkung des Fahrers in jedem US-Bundesstaat für diese beiden Jahre entstanden sind, basierend auf den Bevölkerungsdaten der Volkszählung von 2010, und welche fünf Bundesstaaten pro Jahr die höchsten Raten hatten?","external_knowledge":null}
{"instance_id":"bq108","db":"nhtsa_traffic_fatalities","question":"Im Datensatz 2015 für Unfälle, die von Januar bis August stattfanden und an denen mehr als eine eindeutige Person beteiligt war, wie hoch ist der Anteil dieser Unfälle, bei denen mehr als eine Person eine schwere Verletzung erlitten hat (Verletzungsgrad = 4)?","external_knowledge":null}
{"instance_id":"bq067","db":"nhtsa_traffic_fatalities","question":"Ich möchte einen gelabelten Datensatz aus den Verkehrstoddaten der National Highway Traffic Safety Administration (NHTSA) erstellen, der vorhersagt, ob ein Verkehrsunfall, bei dem mehr als eine eindeutige Person beteiligt ist, mehr als einen Todesfall zur Folge hat, wobei das Label 1 ist, wenn ein Unfall mehr als eine Person mit einem Verletzungsgradcode von 4 (tödliche Verletzung) hat, und 0 ansonsten. Für jeden Unfall schließen Sie die numerischen Prädiktoren ein: state_number, the vehicle body_type, the number_of_drunk_drivers, the day_of_week, the hour_of_crash, und einen binären Indikator dafür, ob der Unfall in einer Arbeitszone stattfand (1, falls es nicht „None“ ist, ansonsten 0). Außerdem erstellen Sie eine Merkmalsvariable für die durchschnittliche absolute Differenz zwischen travel_speed und speed_limit pro Unfall, wobei travel_speed bis 151 mph (ausgenommen Codes 997, 998, 999) und speed_limit bis 80 mph (ausgenommen Codes 98, 99) berücksichtigt werden, und kategorisieren Sie diese durchschnittliche Geschwindigkeitsdifferenz in Stufen von 0 bis 4 in 20 mph-Schritten, wobei untere Grenzen inklusive und obere Grenzen exklusiv sind. Schließlich schließen Sie nur Unfälle ein, an denen mehr als eine eindeutige Person beteiligt ist.","external_knowledge":"nhtsa_traffic_fatalities.md"}
{"instance_id":"bq396","db":"nhtsa_traffic_fatalities","question":"Welche drei Staaten hatten die größten Unterschiede in der Anzahl der Verkehrsunfälle zwischen regnerischem und klarem Wetter an Wochenenden im Jahr 2016? Bitte geben Sie auch die jeweiligen Unterschiede für jeden Staat an.","external_knowledge":null}
{"instance_id":"bq441","db":"nhtsa_traffic_fatalities","question":"Bitte helfen Sie mir, die kritischen Details zu Verkehrsunfällen im Jahr 2015 zusammenzustellen, wie sie im Informationsdokument aufgeführt sind.","external_knowledge":"Traffic_Fatalities_Info_List_2015.md"}
{"instance_id":"bq097","db":"sdoh","question":"Wie groß ist der Anstieg des durchschnittlichen Verdienstes pro Job zwischen den Jahren 2012 und 2017 für jede geografische Region in Massachusetts (angezeigt durch \"MA\" am Ende von GeoName)?","external_knowledge":null}
{"instance_id":"bq120","db":"sdoh","question":"Identifizieren Sie die Top-10-Regionen (Landkreise) mit der höchsten Gesamtzahl an SNAP-teilnehmenden Haushalten, basierend auf den 2017er 5-Jahres-ACS-Landkreisdaten und SNAP-Teilnahmedaten vom 1. Januar 2017, ausgenommen Regionen, bei denen die Gesamt-SNAP-Teilnahme gleich Null ist. Für jede dieser Regionen berechnen Sie das Verhältnis der Haushalte mit Einkommen unter $20,000 zur Gesamtzahl der SNAP-teilnehmenden Haushalte.","external_knowledge":null}
{"instance_id":"bq110","db":"sdoh","question":"Wie groß ist die Veränderung der Anzahl obdachloser Veteranen zwischen 2012 und 2018 für jede CoC-Region in New York, für die in beiden Jahren Daten vorliegen?","external_knowledge":null}
{"instance_id":"bq395","db":"sdoh","question":"Berechne die prozentuale Veränderung der Gesamtzahl der obdachlosen Menschen ohne Unterkunft von 2015 bis 2018 für jeden Bundesstaat, indem die Zählungen über alle Continuums of Care (CoCs) innerhalb jedes Bundesstaates summiert werden. Bestimme anschließend den nationalen Durchschnitt dieser prozentualen Veränderungen auf Bundesstaatsebene. Identifiziere die fünf Bundesstaaten, deren prozentuale Veränderung am nächsten zu diesem nationalen Durchschnittswert liegt. Bitte geben Sie die Abkürzungen der Bundesstaaten an.","external_knowledge":null}
{"instance_id":"bq352","db":"sdoh","question":"Bitte geben Sie die durchschnittliche Anzahl der Schwangerschaftswochen im Jahr 2018 für Landkreise in Wisconsin an, in denen mehr als 5% der erwerbstätigen Bevölkerung Pendelzeiten von 45-59 Minuten im Jahr 2017 hatten.","external_knowledge":null}
{"instance_id":"bq074","db":"sdoh","question":"Zähle die Anzahl der Landkreise, die von 2015 bis 2018 einen Anstieg der Arbeitslosigkeit verzeichneten, unter Verwendung von 5-Jahres-ACS-Daten, und eine Abnahme der Zahl dualberechtigter Versicherter zwischen dem 1. Dezember 2015 und dem 1. Dezember 2018.","external_knowledge":null}
{"instance_id":"bq066","db":"sdoh","question":"Könnten Sie die Beziehung zwischen den Armutsraten aus den Volkszählungsdaten des Vorjahres und dem Anteil der Geburten ohne maternale Morbidität für die Jahre 2016 bis 2018 bewerten? Verwenden Sie nur Daten für Geburten, bei denen keine maternale Morbidität gemeldet wurde, und verwenden Sie für jedes Jahr die 5-Jahres-Volkszählungsdaten des Vorjahres, um den Pearson-Korrelationskoeffizienten zu berechnen.","external_knowledge":null}
{"instance_id":"bq114","db":"openaq","question":"Welche drei Städte haben die größte Differenz zwischen ihren EPA PM2.5-Messungen aus dem Jahr 1990 (unter Verwendung von units_of_measure = 'Micrograms/cubic meter (LC)' und parameter_name = 'Acceptable PM2.5 AQI & Speciation Mass') und ihren OpenAQ PM2.5-Messungen aus dem Jahr 2020 (wobei pollutant = 'pm25' basierend auf dem im Zeitstempel extrahierten Jahr), wobei beide Datensätze anhand von Breitengrad und Längengrad, auf zwei Dezimalstellen gerundet, abgeglichen werden, und die Differenz in absteigender Reihenfolge von groß nach klein sortiert wird?","external_knowledge":null}
{"instance_id":"bq116","db":"sec_quarterly_financials","question":"Welcher US-Bundesstaat meldete den höchsten Gesamtjahresumsatz in Milliarden Dollar im Geschäftsjahr 2016, wobei Unternehmen berücksichtigt werden, die vier Quartale an Daten geliefert haben und Messwerte-Tags in ('Revenues','SalesRevenueNet','SalesRevenueGoodsNet') gemeldet haben, ausgenommen sind Einträge, bei denen das US-Bundesstaat-Feld (stprba) null oder leer ist?","external_knowledge":null}
{"instance_id":"sf_bq015","db":"STACKOVERFLOW_PLUS","question":"Identifizieren und Rangordnen der Top-10-Tags aus Stack Overflow-Fragen, die in Hacker News-Kommentaren ab dem Jahr 2014 erwähnt wurden, indem gezählt wird, wie oft jede Frage erwähnt wurde, anschließend die Tag-Strings der Fragen durch das '|'-Trennzeichen teilen und nach Tags gruppieren","external_knowledge":null}
{"instance_id":"bq041","db":"stackoverflow","question":"Berechne die monatlichen Statistiken für neue StackOverflow-Nutzer, die im Jahr 2021 erstellt wurden. Für jeden Monat gib die Gesamtzahl der neuen Nutzer an, den Prozentsatz dieser neuen Nutzer, die innerhalb von 30 Tagen nach der Anmeldung mindestens eine Frage gestellt haben, und unter jenen, die innerhalb von 30 Tagen nach ihrer ersten Frage eine Frage gestellt haben, den Prozentsatz, der dann innerhalb von 30 Tagen nach ihrer ersten Frage mindestens eine Frage beantwortet hat.","external_knowledge":null}
{"instance_id":"sf_bq121","db":"STACKOVERFLOW","question":"Wie variieren die durchschnittliche Reputation und die Anzahl der Abzeichen bei Stack Overflow-Nutzern in Abhängigkeit von der Anzahl der vollständigen Jahre ihrer Mitgliedschaft, wobei nur diejenigen berücksichtigt werden, die sich am oder vor dem 1. Oktober 2021 angemeldet haben?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq123","db":"stackoverflow","question":"Sie müssen bestimmen, welcher Wochentag den drittgröten Prozentsatz an Fragen auf Stack Overflow hat, die innerhalb einer Stunde beantwortet werden. Dazu verwenden Sie das Erstellungsdatum der Frage aus der Tabelle posts_questions und das früheste Erstellungsdatum der Antwort aus der Tabelle posts_answers. Sobald Sie den Prozentsatz der Fragen, die innerhalb einer Stunde beantwortet werden, für jeden Tag berechnet haben, identifizieren Sie den Tag mit dem drittgrößten Prozentsatz und berichten Sie diesen Prozentsatz.","external_knowledge":null}
{"instance_id":"bq280","db":"stackoverflow","question":"Bitte geben Sie den Anzeigenamen des Benutzers an, der die meisten Fragen auf Stack Overflow beantwortet hat, wobei nur Benutzer mit einer Reputation von mehr als 10 berücksichtigt werden.","external_knowledge":null}
{"instance_id":"bq300","db":"stackoverflow","question":"Was ist die höchste Anzahl von Antworten, die eine einzige Python-2-spezifische Frage auf Stack Overflow erhalten hat, wobei Diskussionen ausgeschlossen werden, die Python 3 betreffen?","external_knowledge":null}
{"instance_id":"bq301","db":"stackoverflow","question":"Details zu den akzeptierten Antworten auf Stack Overflow-Fragen abrufen, die im Januar 2016 gepostet wurden und Tags enthalten, darunter \"javascript\" sowie mindestens eines der Tags \"xss\", \"cross-site\", \"exploit\" oder \"cybersecurity\"; die Antworten selbst müssen ebenfalls im Januar 2016 gepostet worden sein. Für jede akzeptierte Antwort geben Sie die Antwort-ID, die Reputation des Antworters, die Punktzahl und die Kommentaranzahl an, zusammen mit den Tags der zugehörigen Frage, der Punktzahl, der Anzahl der Antworten, der Reputation des Fragestellers, der Aufrufe und der Kommentaranzahl.","external_knowledge":null}
{"instance_id":"bq302","db":"stackoverflow","question":"Wie groß ist der monatliche Anteil der Fragen auf Stack Overflow, die mit 'python' gekennzeichnet sind, im Jahr 2022?","external_knowledge":null}
{"instance_id":"bq303","db":"stackoverflow","question":"Vom 1. Juli 2019 bis zum 31. Dezember 2019 sollen alle Benutzer mit IDs zwischen 16712208 und 18712208 auf Stack Overflow die Benutzer-ID und die Tags der relevanten Frage für jeden ihrer Beiträge abrufen, einschließlich Kommentare zu Fragen und Antworten, aller von ihnen geposteten Antworten und aller von ihnen verfassten Fragen, wobei sichergestellt wird, dass der Kommentar oder die Antwort korrekt mit den Tags der übergeordneten Frage verknüpft wird.","external_knowledge":null}
{"instance_id":"bq304","db":"stackoverflow","question":"Rufen Sie die 50 meistgesehenen Fragen für jedes der folgenden Android-bezogenen Tags auf StackOverflow ab: 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps' und 'android-asynctask'. Jede Frage muss im Titel oder im Text das Wort 'how' enthalten und darf keines der folgenden Troubleshooting-Begriffe im Titel oder Text enthalten: 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve' oder 'trouble'. Nur Tags einschließen, die mindestens 50 Fragen erfüllen, die diesen Kriterien entsprechen, und für jedes dieser Tags wähle die Top-50-Fragen aus, sortiert nach der Anzahl der Aufrufe.","external_knowledge":null}
{"instance_id":"bq310","db":"stackoverflow","question":"Wie lautet der Titel der meistgesehenen 'how'-Frage zur Android-Entwicklung auf StackOverflow, unter den angegebenen Tags wie 'android-layout', 'android-activity', 'android-intent' und weitere","external_knowledge":null}
{"instance_id":"bq305","db":"stackoverflow","question":"Welche 10 Benutzer haben die höchsten Gesamtanzahlen an Aufrufen der Fragen, zu denen sie gehören, wobei ein Benutzer als assoziiert gilt, wenn er die Frage besitzt, oder seine oder ihre Antwort die akzeptierte Antwort ist, oder die Punktzahl seiner oder ihrer Antwort größer als 5 ist, oder die Punktzahl seiner oder ihrer Antwort mehr als 20% der Gesamtpunktzahlen der Antworten für diese Frage übersteigt (und größer als 0 ist), oder seine oder ihre Antwort zu den drei Antworten mit den höchsten Punktzahlen für diese Frage gehört?","external_knowledge":null}
{"instance_id":"bq306","db":"stackoverflow","question":"Identifizieren Sie die Top-10-Tags für den Benutzer 1908967, basierend ausschließlich auf Antworten, die vor June 7, 2018 gepostet wurden, wobei der Score jedes Tags das 10-fache der Anzahl der Upvotes (vote_type_id=2) und das 15-fache der Anzahl der akzeptierten Antworten (vote_type_id=1) beträgt. Ziehen Sie Tags aus den Fragen, die mit diesen Antworten verbunden sind, und berücksichtigen Sie nur die Upvotes und akzeptierten Antworten für diese Antworten. Geben Sie die Tags mit den höchsten Gesamtpunkten in absteigender Reihenfolge zurück, beschränkt auf 10 Tags.","external_knowledge":null}
{"instance_id":"sf_bq307","db":"STACKOVERFLOW","question":"Finde die Top-10-Goldabzeichen, die Benutzer am häufigsten als ihr erstes Goldabzeichen auf Stack Overflow verdienen. Für jedes dieser Abzeichen zeige den Namen des Abzeichens, die Anzahl der Benutzer, die es als ihr erstes Goldabzeichen verdient haben, und die durchschnittliche Anzahl von Tagen vom Erstellungsdatum des Benutzerkontos bis zum Datum, an dem sie das Abzeichen verdient haben, berechnet in Tagen, ohne Anpassungen der Datumsformate.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq308","db":"stackoverflow","question":"Zeige die Anzahl der Stack Overflow-Fragen, die an jedem Wochentag im Jahr 2021 gestellt wurden, und ermittele, wie viele davon beantwortet wurden und welcher Prozentsatz davon innerhalb einer Stunde beantwortet wurde.","external_knowledge":null}
{"instance_id":"bq309","db":"stackoverflow","question":"Rufen Sie die zehn längsten Fragen auf Stack Overflow ab, gemessen an der Länge ihres Fragetextes, wobei jede Frage entweder eine akzeptierte Antwort hat oder keine akzeptierte Antwort hat, aber mindestens eine Antwort mit einem Score-zu-Aufrufe-Verhältnis von mehr als 0,01 hat. Für jede dieser Fragen geben Sie die Reputation des Benutzers an, der die Frage gestellt hat, die Netto-Stimmen des Benutzers (berechnet als deren total up_votes minus down_votes), und die Gesamtzahl der Abzeichen, die der Benutzer verdient hat.","external_knowledge":null}
{"instance_id":"bq124","db":"fhir_synthea","question":"Unter allen Patienten, wie viele Personen sind noch am Leben (d.h. mit keinem aufgezeichneten deceased.dateTime), haben eine Diagnose von Diabetes oder Hypertonie und erhalten mindestens sieben verschiedene aktive Medikamente?","external_knowledge":null}
{"instance_id":"bq391","db":"fhir_synthea","question":"Welche acht Diagnosen haben die höchste Anzahl unterschiedlicher aktiver Medikamente, die einem einzelnen Patienten verschrieben wurden, bei lebenden Patienten, deren Nachnamen mit \"A\" beginnen und die jeweils genau eine eindeutige Diagnose haben, und wie lauten ihre entsprechenden Codes?","external_knowledge":null}
{"instance_id":"bq126","db":"the_met","question":"Welche Titel, Künstlernamen, Medien und Originalbild-URLs von Objekten mit 'Photograph' in ihren Namen aus der Abteilung 'Photographs', die nicht von einem unbekannten Künstler geschaffen wurden, mit einem Enddatum des Objekts von 1839 oder früher?","external_knowledge":null}
{"instance_id":"bq366","db":"the_met","question":"Welche drei Labels sind in jeder historischen Periode der Sammlung von The Met am häufigsten mit Kunstwerken verknüpft, wobei nur Labels berücksichtigt werden, die mit 500 oder mehr Kunstwerken verbunden sind? Geben Sie mir die Periode, das Label und die entsprechende Anzahl an.","external_knowledge":null}
{"instance_id":"bq414","db":"the_met","question":"Rufen Sie die Objekt-ID, den Titel und das formatierte Metadaten-Datum ab (als Zeichenfolge im Format 'YYYY-MM-DD') für Objekte in der Abteilung \"The Libraries\", bei denen cropConfidence größer als 0.5 ist, deren Objekttitel das Wort \"book\" enthält.","external_knowledge":null}
{"instance_id":"bq200","db":"mlb","question":"Unter Verwendung von Daten aus der regulären Saison sowie aus der Postseason ermitteln Sie für jedes Team den Pitcher mit der höchsten nicht-null Pitchgeschwindigkeit, indem Sie bestätigen, ob die ID des Pitchers in der relevanten Heim- oder Auswärts-Spielerliste für dieses Spiel erscheint, und rufen Sie dann den vollständigen Namen dieses Pitchers sowie die maximal gültige Pitchgeschwindigkeit ab, die er für dieses spezifische Team erreicht hat.","external_knowledge":null}
{"instance_id":"sf_bq458","db":"WORD_VECTORS_US","question":"Tokenisiere den Fließtext jedes Artikels in Wörter, schließe Stoppwörter aus und erhalte die entsprechenden Wortvektoren für diese Wörter aus dem GloVe-Vektor. Dann gewichtest du für jedes Wort seinen Wortvektor, indem du jede Komponente durch die 0,4te Potenz der Häufigkeit des Wortes aus den Wortfrequenzen teilst. Dann aggregierst du für jeden Artikel diese gewichteten Wortvektoren, indem du ihre Komponenten addierst, um einen Artikelvektor zu bilden. Normalisiere jeden Artikelvektor auf die Einheitslänge, indem du durch seine Norm teilst. Schließlich rufst du die ID, das Datum, den Titel und den normalisierten Artikelvektor für jeden Artikel ab.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq459","db":"WORD_VECTORS_US","question":"Bitte finden Sie die 10 relevantesten Artikel, indem Sie nur das 'body'-Feld jedes Artikels verarbeiten, wobei jedes 'body'-Feld tokenisiert wird, alle Stoppwörter entfernt werden, jeder verbleibende Token in einen GloVe-basierten Wortvektor umgewandelt und gewichtet wird, indem jede Dimension durch die 0,4te Potenz seiner Wortfrequenz geteilt wird; anschließend werden diese gewichteten Vektoren aufsummiert und normalisiert, um einen Einheitsvektor für jeden Artikel zu erhalten. Führen Sie dieselbe Gewichtung und Normalisierung auf die Abfragephrase 'Epigenetik und zerebrale Organoide: vielversprechende Richtungen bei Autismus-Spektrum-Störungen' durch und berechnen Sie die Kosinusähnlichkeit zwischen dem Abfragevektor und jedem Artikelvektor. Schließlich geben Sie die ID, das Datum, den Titel und den Kosinusähnlichkeitswert für die Top-10-Artikel mit der höchsten Ähnlichkeit zurück.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq460","db":"WORD_VECTORS_US","question":"Bitte verarbeiten Sie die Artikel aus dem 'nature' Datensatz, indem Sie zunächst den Fließtext in Wörter tokenisieren und Stoppwörter entfernen. Für jedes verbleibende Wort rufen Sie seinen Wortvektor aus der glove_vectors-Tabelle und seine Häufigkeit aus der word_frequencies-Tabelle ab, dann dividieren Sie jeden Wortvektor durch die 0.4th Potenz der Häufigkeit des Wortes, um ihn zu gewichten. Sumieren Sie die gewichteten Vektoren, um einen aggregierten Vektor für jeden Artikel zu erhalten, normalisieren Sie diesen aggregierten Vektor auf eine Einheitslänge und berechnen Sie dann die Kosinusähnlichkeitswerte zwischen diesen normalisierten Vektoren. Schließlich geben Sie die IDs, Daten, Titel und Kosinusähnlichkeitswerte der Top-10-Artikel zurück, die dem Artikel mit der ID '8a78ef2d-d5f7-4d2d-9b47-5adb25cbd373' am ähnlichsten sind.","external_knowledge":"tokenize_func.md"}
{"instance_id":"bq204","db":"eclipse_megamovie","question":"Finde den Benutzer mit der höchsten Gesamtzahl an Klicks über alle Datensätze aus allen verfügbaren Foto-Sammlungen.","external_knowledge":null}
{"instance_id":"bq389","db":"epa_historical_air_quality","question":"Bitte berechnen Sie die monatlichen Durchschnittswerte der PM10, PM2.5 FRM, PM2.5 non-FRM, flüchtige organische Emissionen, SO2 (um den Faktor 10 skaliert) und Blei (um den Faktor 100 skaliert) in Kalifornien für das Jahr 2020.","external_knowledge":null}
{"instance_id":"sf_bq345","db":"IDC","question":"Wie groß sind die DICOM-Bilddateien mit SEG- oder RTSTRUCT-Modalitäten und der SOP Class UID \"1.2.840.10008.5.1.4.1.1.66.4\", wenn sie nach Sammlung, Studie und Serien-IDs gruppiert werden und keine Verweise auf andere Serien, Bilder oder Quellen enthalten? Können Sie außerdem eine Viewer-URL im Format \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" gefolgt von der Studien-ID bereitstellen und diese Größen in Kilobyte auflisten, sortiert von der größten zur kleinsten?","external_knowledge":null}
{"instance_id":"sf_bq346","db":"IDC","question":"In öffentlich zugänglichen DICOM-Daten, in denen die Modality 'SEG' und die SOPClassUID '1.2.840.10008.5.1.4.1.1.66.4' sind, und jede Segmentierung verweist auf ihre ursprüngliche SOPInstanceUID, welche fünf Segmentierungskategorien (nach 'SegmentedPropertyCategory.CodeMeaning') am häufigsten auftreten?","external_knowledge":null}
{"instance_id":"sf_bq347","db":"IDC","question":"Aus der Vereinigung der angegebenen MR-Serie mit SeriesInstanceUID 1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147 und aller zugehörigen Segmentierungsinstanzen, welche Modalität hat insgesamt die größte Anzahl von SOP-Instanzen, und wie viele sind es?","external_knowledge":null}
{"instance_id":"sf_bq390","db":"IDC","question":"In der Sammlung \"qin_prostate_repeatability\" liefern Sie bitte die distinct StudyInstanceUIDs für Studien, die T2-gewichtete axiale MRT-Bildgebung enthalten und außerdem anatomische Struktursegmentierungen, die als \"Peripheral zone\" gekennzeichnet sind.","external_knowledge":null}
{"instance_id":"sf_bq421","db":"IDC","question":"Kannst du alle eindeutigen Paare von Einbettungsmittel- und Färbemittel-Code-Bedeutungen auflisten, zusammen mit der Anzahl der Vorkommen für jedes Paar, basierend auf eindeutigen Einbettungsmittel- und Färbemittelcodes aus dem 'SM'-Modus in den nicht verschachtelten Probenpräparationssequenzen des DICOM-Datensatzes, wobei sichergestellt wird, dass die Codes aus dem SCT-Codierungsschema stammen?","external_knowledge":null}
{"instance_id":"sf_bq422","db":"IDC","question":"Verwenden Sie die CT-Bilder der 'nlst'-Sammlung, berechnen und vergleichen Sie zwei getrennte Metriken: 1) Die durchschnittliche Seriengröße in MiB für die Top-3-Patienten mit der höchsten Slice-Intervall-Differenz-Toleranz (definiert als die Differenz zwischen dem Maximum und dem Minimum eindeutiger Slice-Intervalle über alle ihre Serien), und 2) Die durchschnittliche Seriengröße in MiB für die Top-3-Patienten mit der höchsten Expositionsdifferenz (definiert als die Differenz zwischen dem Maximum und dem Minimum eindeutiger Expositionswerte über alle ihre Serien). Für jeden Patienten berechnen Sie die Seriengröße, indem Sie die Instanzgrößen aller Bilder in dieser Serie addieren und in MiB umrechnen. Geben Sie die Ergebnisse als zwei separate Gruppen aus, beschriftet mit 'Top-3 nach Slice-Intervall' und 'Top-3 nach maximaler Exposition', mit ihren jeweiligen durchschnittlichen Seriengrößen.","external_knowledge":null}
{"instance_id":"sf_bq069","db":"IDC","question":"Könnten Sie mir helfen, einen Bericht über CT-Bildserien aus der Tabelle dicom_all zu erstellen, sodass alle Serien aus der NLST-Sammlung ausgeschlossen werden, alle Lokalisator- oder JPEG-komprimierten Serien (Transfer-Syntaxen 1.2.840.10008.1.2.4.70 oder 1.2.840.10008.1.2.4.51) übersprungen werden, und nur diejenigen, die bestimmte Geometrieprüfungen bestehen — nämlich eine einzige Orientierung, identischen Pixelabstand, übereinstimmende SOP-Instanz- und Positionsanzahlen, gleichmäßige Pixelreihen und Pixelspalten sowie ein dem Wert nahe bei Eins liegendes Skalarprodukt der Bildorientierungsvektoren — enthalten, während außerdem die Unterschiede der Slice-Intervalle, Belichtungsunterschiede und die ungefähre Seriengröße in MB für jede qualifizierte Serie berechnet werden?","external_knowledge":"nonNlstCohort.md"}
{"instance_id":"sf_bq219","db":"IOWA_LIQUOR_SALES","question":"Im Iowa Liquor Sales-Datensatz, vom 1. Januar 2022 bis zum letzten vollständig abgeschlossenen Monat, welche zwei Spirituosenkategorien, von denen jede im Durchschnitt mindestens 1% des monatlichen Verkaufsvolumens über mindestens 24 Monate verfügbare Daten beisteuert, weisen den niedrigsten Pearson-Korrelationskoeffizienten auf, wenn man ihre monatlichen Anteile am Gesamtumsatz von Spirituosen über diese Monate vergleicht, und wie lauten ihre Namen?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq199","db":"iowa_liquor_sales","question":"Identifizieren Sie die Top-10-Spirituosenkategorien in Iowa im Jahr 2021, indem Sie für jede Kategorie den Durchschnitt der Einzelhandelspreise pro Liter über alle VerkaufsTransaktionen in dieser Kategorie im Jahr 2021 berechnen. Für diese Top-Kategorien geben Sie deren durchschnittliche Einzelhandelspreise pro Liter an, berechnet auf dieselbe Weise auch für die Jahre 2019, 2020 und 2021.","external_knowledge":null}
{"instance_id":"bq218","db":"iowa_liquor_sales","question":"Welche sind die Top-5-Artikel mit der höchsten Jahr-zu-Jahr-Wachstumsrate des Gesamtumsatzes im Jahr 2023?","external_knowledge":null}
{"instance_id":"bq049","db":"iowa_liquor_sales_plus","question":"Bitte zeigen Sie die monatlichen Pro-Kopf-Verkäufe von Bourbon Whiskey im Jahr 2022 im Dubuque County für die Postleitzahl, die den dritten Rang bei den Gesamtverkäufen von Bourbon Whiskey belegt, wobei nur die Bevölkerung ab 21 Jahren berücksichtigt wird.","external_knowledge":null}
{"instance_id":"bq360","db":"nppes","question":"Unter Gesundheitsdienstleistern, deren Praxisstandort sich in Mountain View, CA befindet, und die eine angegebene Spezialisierung im Bereich Taxonomie der Gesundheitsdienstleister haben, identifizieren Sie die Top-10 der am häufigsten vorkommenden Spezialisierungen basierend auf der Anzahl eindeutiger NPIs. Bestimmen Sie dann, welche dieser Top-10 eine Anzahl eindeutiger NPIs hat, die dem Durchschnitt der Anzahl eindeutiger NPIs über diese 10 Spezialisierungen am nächsten liegt.","external_knowledge":null}
{"instance_id":"bq286","db":"usa_names","question":"Können Sie mir den Namen des beliebtesten weiblichen Babys in Wyoming für das Jahr 2021 nennen, basierend auf dem Anteil der Neugeborenen mit diesem Namen im Vergleich zur Gesamtzahl der Neugeborenen desselben Namens in allen Bundesstaaten?","external_knowledge":null}
{"instance_id":"sf_bq044","db":"TCGA","question":"Für Blasenkrebs-Patienten, die Mutationen im Gen CDKN2A (Cyclin-abhängiger Kinase-Inhibitor 2A) aufweisen, unter Verwendung klinischer Daten aus Genomic Data Commons Release 39, welche Arten von Mutationen liegen vor, welches Geschlecht, Vitalstatus und Tage bis zum Tod haben sie – und für vier nachgelagerte Gene (MDM2 (MDM2 Proto-Onkogen), TP53 (Tumorprotein p53), CDKN1A (Cyclin-abhängiger Kinase-Inhibitor 1A) und CCNE1 (Cyclin E1)), wie lauten die Genexpressionswerte für jeden Patienten?","external_knowledge":"TCGA_Study_Abbreviations.md"}
{"instance_id":"sf_bq043","db":"TCGA","question":"Was sind die RNA-Expressionsniveaus der Gene MDM2, TP53, CDKN1A und CCNE1, zusammen mit zugehörigen klinischen Informationen, bei Blasenkarzinom-Patienten mit CDKN2A-Mutationen im Projekt 'TCGA-BLCA'? Verwenden Sie klinische Daten aus dem Genomic Data Commons Release 39, Daten zu somatischen Mutationen, abgeleitet von der hg19-Humangenom-Referenz im Februar 2017.","external_knowledge":null}
{"instance_id":"bq143","db":"CPTAC_PDC","question":"Verwenden Sie CPTAC-Proteomik- und RNA-Seq-Daten für ein klarzelliges Nierenzellkarzinom, um 'Primary Tumor' und 'Solid Tissue Normal'-Proben auszuwählen. Verbinden Sie die Datensätze anhand der Sample-Submitter-IDs und der Gen-Symbole. Berechnen Sie die Korrelation zwischen Proteinabundanz (log2-Verhältnis) und Genexpressionsniveaus (log-transformiert+1 FPKM) für jedes Gen und jeden Probentyp. Filtern Sie Korrelationen mit einem Absolutwert größer als 0.5 heraus und berechnen Sie die durchschnittliche Korrelation für jeden Probentyp.","external_knowledge":null}
{"instance_id":"sf_bq147","db":"TCGA","question":"Kannst du die TCGA-Brustkrebsfälle aus der RNA-Sequenzierung `hg38 r35` identifizieren, bei denen das protein_coding-Gen und das Projekt TCGA-BRCA vorhanden sind und die RNA-Sequenzierungsproben mehrerer Gewebetypen—einschließlich \"Solid Tissue Normal\"—innerhalb desselben Falls enthalten sind?","external_knowledge":null}
{"instance_id":"sf_bq148","db":"TCGA","question":"Könnten Sie die fünf proteinkodierenden Gene identifizieren, die die höchste Varianz in ihren Expressionsniveaus aufweisen (gemessen als fpkm_uq_unstranded) speziell innerhalb der 'Solid Tissue Normal'-Proben? Bitte beschränken Sie die Analyse auf Fälle des TCGA-BRCA-Projekts, die mindestens eine 'Solid Tissue Normal'-Probenart umfassen.","external_knowledge":null}
{"instance_id":"sf_bq175","db":"TCGA_MITELMAN","question":"Identifizieren Sie Zytoband-Namen auf Chromosom 1 im TCGA-KIRC Segment-Alleldatensatz, bei denen die Häufigkeiten von Amplifikationen, Zuwächsen und heterozygoten Deletionen jeweils in den Top-11 rangieren. Berechnen Sie diese Rangfolgen basierend auf der maximalen Kopienzahl, die in verschiedenen genomischen Studien zum Nierenkrebs beobachtet wurde, um die Schwere der genetischen Veränderungen widerzuspiegeln.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"sf_bq176","db":"TCGA_MITELMAN","question":"Identifizieren Sie die Fall-Barcodes der TCGA-LAML-Studie mit der höchsten gewichteten Durchschnittskopienzahl im Zytoband 15q11 auf dem Chromosom 15, unter Verwendung von Segmentdaten und Zytobandüberlappungen aus den genomischen Datenbanken von TCGA und Mitelman.","external_knowledge":null}
{"instance_id":"sf_bq170","db":"TCGA_MITELMAN","question":"Für Brustkrebsfälle (TCGA-BRCA) aus Release 23 des aktiven GDC-Archivs identifizieren und kategorisieren Sie Kopienzahlvariationen (CNVs) über alle Zytobanden auf jedem Chromosom. Für jedes Zytoband und jeden Fall bestimmen Sie den Überlapp zwischen der Zytobanden-Region und den Kopienzahlsegmenten des Falls und berechnen den überlappungsgewichteten Durchschnitt der Kopienzahl für dieses Zytoband im Fall, gerundet auf die nächste Ganzzahl. Klassifizieren Sie die gerundete Kopienzahl in CNV-Typen wie folgt: homozygote Deletionen (0), heterozygote Deletionen (1), normaler diploider Zustand (2), Verstärkungen (3) und Amplifikationen (größer als 3). Für jedes Zytoband geben Sie seinen Namen und Start-/Endpositionen an und berechnen die Häufigkeit jedes CNV-Typs über alle Fälle hinweg als Prozentsatz der Gesamtzahl der Fälle, gerundet auf zwei Dezimalstellen.","external_knowledge":"copy_number_variations.md"}
{"instance_id":"sf_bq150","db":"TCGA_HG19_DATA_V0","question":"Prüfen Sie, ob verschiedene genetische Varianten die log10-transformierten TP53-Expressionsniveaus in TCGA-BRCA-Proben unter Verwendung von Sequenzierungs- und Mutationsdaten beeinflussen. Geben Sie die Gesamtzahl der Proben, die Anzahl der Mutationstypen, das mittlere Quadrat zwischen den Gruppen, das mittlere Quadrat innerhalb der Gruppen und die F-Statistik an.","external_knowledge":"TCGA_F_Score.md"}
{"instance_id":"sf_bq152","db":"TCGA_HG38_DATA_V0","question":"Für Brustkrebsfälle (TCGA-BRCA) aus Release 23 des aktiven GDC-Archivs identifizieren und kategorisieren Sie Copy-Number-Variationen (CNVs) über alle Zytobanden auf jedem Chromosom. Für jedes Zytoband und jeden Fall bestimmen Sie die Überlappung zwischen dem Zytobandbereich und den Kopienzahlsegmenten des Falls und berechnen Sie die überlappungsgewichtete durchschnittliche Kopienzahl für dieses Zytoband im Fall, gerundet auf die nächstgelegene ganze Zahl. Klassifizieren Sie die gerundete Kopienzahl in CNV-Typen wie folgt: homozygote Deletionen (0), heterozygote Deletionen (1), normaler diploider Zustand (2), Zuwächse (3) und Amplifikationen (größer als 3). Für jedes Zytoband geben Sie dessen Namen sowie Start- und Endpositionen an und berechnen Sie die Häufigkeit jedes CNV-Typs über alle Fälle als Prozentsatz der Gesamtzahl der Fälle, gerundet auf zwei Dezimalstellen.","external_knowledge":null}
{"instance_id":"sf_bq155","db":"TCGA_HG38_DATA_V0","question":"In der TCGA-BRCA-Kohorte von Patienten, die bei der Diagnose 80 Jahre oder jünger sind und ein pathologisches Stadium von Stadium I, Stadium II oder Stadium IIA aufweisen, berechnen Sie die t-Statistik, die sich aus der Pearson-Korrelation ableitet, zwischen den log10-transformierten durchschnittlichen RNA-Seq-Expressionsniveaus (unter Verwendung von HTSeq__Counts + 1) des Gens SNORA31 und den durchschnittlichen MikroRNA-Seq-Expressionsniveaus aller eindeutigen MikroRNAs, wobei nur Paare mit mehr als 25 Proben berücksichtigt werden und deren absoluter Pearson-Korrelationskoeffizient zwischen 0.3 und 1.0 liegt.","external_knowledge":null}
{"instance_id":"sf_bq141","db":"TCGA_HG38_DATA_V0","question":"Mit dem TCGA-KIRP-Datensatz wählen Sie Patienten aus der Tabelle 'TCGA_bioclin_v0.Clinical' aus, die einen nicht-null clinical_stage besitzen und einen disease_code von 'KIRP' aufweisen. Rufen Sie ihre Genexpressionsdaten aus der Tabelle 'TCGA_hg38_data_v0.RNAseq_Gene_Expression' für die Gene 'MT-CO3,' 'MT-CO1,' und 'MT-CO2' ab, und teilen Sie die Patienten zufällig in einen Trainingssatz (90%) und einen Testsatz (10%) basierend auf ihrem case_barcode mittels der FARM_FINGERPRINT-Methode auf. Für jeden clinical_stage im Trainingssatz berechnen Sie den stadien-spezifischen Durchschnitt der HTSeq__FPKM_UQ-Expression der drei Gene. Für jeden Patienten im Testsatz berechnen Sie den euklidischen Abstand zwischen den Expressionswerten des Patienten und den stadien-spezifischen Durchschnitten, und ordnen Sie diesen Patienten dem clinical_stage zu, dessen Durchschnitt am nächsten liegt. Schließlich geben Sie case_barcode und die vorhergesagte clinical_stage aus.","external_knowledge":null}
{"instance_id":"bq046","db":"TCGA_bioclin_v0","question":"Finde Fall-Barcodes und deren entsprechende GDC-Datei-URLs für weibliche Patientinnen im Alter von 30 Jahren oder jünger, die mit Brustkrebs (BRCA) in der TCGA-Datenbank diagnostiziert wurden. Die Abfrage soll zunächst Patienten aus der Annotations-Tabelle identifizieren, bei denen entity_type = \"Patient\" ist und entweder category = \"History of unacceptable prior treatment related to a prior/other malignancy\" oder classification = \"Redaction\". Identifiziere außerdem Patienten aus der Clinical-Tabelle mit disease_code = \"BRCA\", age_at_diagnosis <= 30, und gender = \"FEMALE\". Führe einen FULL JOIN zwischen diesen beiden Mengen durch, aber behalte nur Patienten, bei denen sowohl categoryName als auch classificationName im Endergebnis NULL sind. Verwende GDC-Metadaten aus dem Archiv-Release 14 (insbesondere die Tabellen rel14_caseData, rel14_fileData_current und rel14_GDCfileID_to_GCSurl_NEW), um die entsprechenden Datei-URLs abzurufen.","external_knowledge":null}
{"instance_id":"sf_bq153","db":"PANCANCER_ATLAS_1","question":"Berechnen Sie für jeden Histologietyp, der im Feld 'icd_o_3_histology' angegeben ist (ausgenommen diejenigen, die in eckigen Klammern stehen), den Mittelwert der pro-Patienten gemessenen log10(normalized_count + 1) Expressionsniveaus des IGF2-Gens bei LGG-Patienten mit gültigen IGF2-Expressionsdaten. Stimmen Sie Genexpressions- und klinische Daten mithilfe des Felds ParticipantBarcode ab.","external_knowledge":null}
{"instance_id":"sf_bq154","db":"PANCANCER_ATLAS_1","question":"Berechnen Sie den Kruskal-Wallis-H-Wert unter Gruppen von LGG-Patienten für die IGF2-Genexpression, wobei die IGF2-Expression jedes Patienten bestimmt wird, indem log10(normalized_count + 1) angewendet wird und dann über Proben gemittelt wird. Gruppieren Sie die Patienten nach ICD-O-3 Histologie-Codes, schließen Sie Codes aus, die vollständig in eckigen Klammern stehen, berücksichtigen Sie nur Gruppen mit mehr als einem Patienten und stellen Sie sicher, dass normalized_count nicht null ist. Schließlich geben Sie die Gesamtzahl der Gruppen, die Gesamtzahl der Proben und den Kruskal-Wallis-H-Wert in absteigender Reihenfolge zurück.","external_knowledge":"Regulome_Explorer_Kruskal-Wallis_test_for_numerical_and_categorical_data.md"}
{"instance_id":"sf_bq156","db":"PANCANCER_ATLAS_1","question":"Berechne den t-Wert (auf 2 Dezimalstellen gerundet), um den Unterschied der durchschnittlichen Expressionsniveaus des Gens DRG2 zwischen zwei Gruppen zu vergleichen (TP53-mutiert vs. nicht-mutiert) in der Studie zu Gliomen niedrigen Grades (LGG), wobei die Expressionsniveaus als Durchschnitt von log10(normalized_count + 1) pro Teilnehmer berechnet werden, und nur Proben mit TP53-Mutationen berücksichtigt werden, die einen 'FILTER'-Status von 'PASS' in den Mutationsdaten haben, Gruppen mit weniger als 10 Proben oder mit Nullvarianz ignoriert werden; siehe `t_score.md` für die Methode zur Berechnung des t-Werts.","external_knowledge":"t_score.md"}
{"instance_id":"sf_bq157","db":"PANCANCER_ATLAS_1","question":"Bitte berechnen Sie den T-Wert (T-Score), um den statistischen Unterschied in der Expression des DRG2-Gens zwischen LGG-Patienten mit und ohne TP53-Mutation zu bestimmen: Für jeden Patienten berechnen Sie den Durchschnitt von log10(normalized_count + 1) der DRG2-Expression über alle seine Proben, wobei nur Proben verwendet werden, die in der `MC3_MAF_V5_one_per_tumor_sample`-Tabelle für die LGG-Studie vorhanden sind; identifizieren Sie Patienten mit TP53-Mutationen aus dieser Tabelle, bei denen `Hugo_Symbol` 'TP53' und `FILTER` 'PASS' ist; dann führen Sie einen T-Test durch, der den mittleren, logarithmisch transformierten DRG2-Expression zwischen Patienten mit und ohne TP53-Mutation vergleicht.","external_knowledge":"Regulome_Explorer_T_test_for_numerical_and_binary_data.md"}
{"instance_id":"sf_bq158","db":"PANCANCER_ATLAS_1","question":"Welche fünf histologische Typen von Brustkrebs (BRCA) im PanCancer Atlas weisen den höchsten Prozentsatz an CDH1-Genmutationen auf?","external_knowledge":null}
{"instance_id":"sf_bq159","db":"PANCANCER_ATLAS_1","question":"Berechne den Chi-Quadrat-Wert, um die Assoziation zwischen histologischen Typen und dem Vorhandensein von CDH1-Genmutationen bei BRCA-Patienten unter Verwendung von Daten aus dem PanCancer Atlas zu beurteilen. Konzentriere dich auf Patienten mit bekannten histologischen Typen und berücksichtige nur zuverlässige Mutationseinträge. Schließe alle histologischen Typen oder Mutationsstatus mit Randtotalen kleiner oder gleich 10 aus. Stimme klinische und Mutationsdaten anhand von ParticipantBarcode ab.","external_knowledge":null}
{"instance_id":"bq161","db":"pancancer_atlas_2","question":"Berechnen Sie den Nettounterschied zwischen der Anzahl der PAAD-Patienten im TCGA-Datensatz, bei denen bestätigt wurde, dass sie Mutationen in beiden Genen KRAS und TP53 aufweisen, und jenen ohne Mutationen in beiden Genen. Verwenden Sie klinische Daten der Patienten sowie Verlaufsdaten zusammen mit genomischen Mutationsdetails aus TCGA’s Krebsgenomdatenbank, wobei der Fokus speziell auf PAAD-Studien liegt, in denen die Mutationen die Qualitätsfilter bestanden haben.","external_knowledge":null}
{"instance_id":"bq151","db":"pancancer_atlas_2","question":"Mit dem TCGA-Datensatz berechnen Sie die Chi-Quadrat-Statistik, um die Assoziation zwischen den Genmutationen KRAS und TP53 bei Patienten mit Pankreaskarzinom (PAAD) zu bewerten. Integrieren Sie klinische Verlaufsdaten und hochwertige Mutationsannotationen, um die Häufigkeit von Patienten mit gleichzeitigen KRAS- und TP53-Mutationen im Vergleich zu Patienten mit jeweils einer Mutation, die unabhängig voneinander auftreten, genau zu bestimmen. Stellen Sie sicher, dass Patientendatensätze anhand eindeutiger Identifikatoren sorgfältig abgeglichen werden, um die Datenintegrität zu wahren. Ziel dieser Analyse ist es, potenzielle Korrelationen zwischen KRAS- und TP53-Genveränderungen innerhalb der PAAD-Patientenpopulation zu identifizieren und zu quantifizieren.","external_knowledge":null}
{"instance_id":"bq162","db":"HTAN_1","question":"Basierend auf der fünften Revision (r5) der HTAN-Daten listen Sie die bildgebenden Assaytypen auf, die am HTAN-WUSTL-Zentrum verfügbar sind und Level2-Daten sowie alle zugehörigen höheren Datenebenen (Level3, Level4) besitzen, die daraus durch 'entityId'-Beziehungen in der 'id_provenance_r5'-Tabelle abgeleitet werden; Ausschließen Sie Datensätze, bei denen das 'Component' NULL ist oder 'Auxiliary' oder 'OtherAssay' enthält; Für jeden bildgebenden Assaytyp geben Sie die verfügbaren Datenebenen (Level2, Level3, Level4) an und schließen Sie Level1-Daten oder Elektronenmikroskopie-Assaytypen aus.","external_knowledge":null}
{"instance_id":"sf_bq163","db":"HTAN_2","question":"Welche 20 Gene im HTAN scRNAseq MSK-SCLC kombinierten Proben-Datensatz zeigen den größten Unterschied im durchschnittlichen X_value-Ausdruck zwischen weiblichen und männlichen epithelialen Zellen, speziell im Cluster 41 von 74-jährigen menschlichen Stadium-Patienten? Bitte berechnen Sie den Unterschied, indem Sie den männlichen X_value-Durchschnittsausdruck vom weiblichen X_value-Durchschnittsausdruck für jedes Gen subtrahieren.","external_knowledge":null}
{"instance_id":"sf_bq164","db":"HTAN_2","question":"Konsolidieren Sie Metadaten aus räumlichen Transkriptomik- und scRNAseq-Datensätzen—einschließlich der Ebenen 1 bis 4 und Hilfsdateien—für die Run ID 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test'. Enthalten: Filename, HTAN Parent Biospecimen ID, Component, File Format, Entity ID und Run ID.","external_knowledge":null}
{"instance_id":"sf_bq166","db":"TCGA_MITELMAN","question":"Unter Verwendung von Segmentebenen-Kopienzahldaten aus dem Datensatz copy_number_segment_allelic_hg38_gdc_r23, das auf die 'TCGA-KIRC'-Proben beschränkt ist, werden diese Segmente mit den zytogenetischen Banddefinitionen in 'CytoBands_hg38' zusammengeführt, um die maximale Kopienzahl jeder Probe pro Zytoband zu identifizieren. Klassifizieren Sie diese maximalen Kopienzahlen in Amplifikationen (>3), Vermehrungen (=3), homozygote Deletionen (=0), heterozygote Deletionen (=1) oder Normal (=2), berechnen Sie dann die Häufigkeit jeder Untergruppe relativ zur Gesamtzahl der eindeutigen Fälle, und präsentieren Sie schließlich diese Häufigkeiten als Prozentsätze, sortiert nach Chromosomen und Zytobanden.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"bq165","db":"mitelman","question":"Können Sie die genomischen Koordinaten von CytoConverter verwenden, um die Häufigkeit chromosomaler Zuwächse und Verluste über eine Kohorte von Brustkrebs (morphology='3111') und Adenokarzinom (topology='0401') Proben zu berechnen? Konkret geben Sie bitte die Anzahl und Häufigkeit (2 Nachkommastellen in Prozent) von Amplifikationen (Gewinne von mehr als 1 Kopie), Zuwächsen (1 zusätzliche Kopie), Verlusten (1 Kopie) und homozygoten Deletionen (Verlust von 2 Kopien) für jedes Chromosomenband an. Und sortieren Sie das Ergebnis nach der Ordnungszahl jedes Chromosoms und der Start- und Endposition jedes Chromosomenbands in aufsteigender Reihenfolge.","external_knowledge":null}
{"instance_id":"bq169","db":"mitelman","question":"Rufen Sie eindeutige Fallverweise, Fallnummern, Untersuchungsnummern und Kloninformationen ab, wenn ein einzelner Klon gleichzeitig alle drei der folgenden genetischen Veränderungen aufweist: (1) ein Verlust auf Chromosom 13 zwischen Positionen 48,303,751 und 48,481,890, (2) ein Verlust auf Chromosom 17 zwischen Positionen 7,668,421 und 7,687,490, und (3) eine Zunahme auf Chromosom 11 zwischen Positionen 108,223,067 und 108,369,102. Für jeden passenden Klon zeigen Sie die chromosomalen Details für jede dieser drei Regionen (einschließlich der Chromosomennummer, dargestellt durch ChrOrd, Startposition und Endposition) und die entsprechende kurze Beschreibung des Karyotyps aus der KaryClone-Tabelle. Verwenden Sie CytoConverted und KaryClone.","external_knowledge":null}
{"instance_id":"bq111","db":"mitelman","question":"Könnten Sie je Chromosom die Pearson-Korrelation zwischen der Häufigkeit von Kopienzahlaberrationen (einschließlich Amplifikationen, Zuwächsen, Verlusten und Deletionen) aus der Mitelman-Datenbank für Fälle mit morph = 3111 und topo = 0401 berechnen und mit den aus TCGA-Daten berechneten vergleichen, wobei für jeden Aberrationstyp Korrelationskoeffizienten und entsprechende p-Werte zurückgegeben werden sollen, und sicherstellen, dass nur Ergebnisse mit mindestens fünf übereinstimmenden Datensätzen angezeigt werden.","external_knowledge":"Correlations_between_Mitelman_and_TCGA_datasets.md"}
{"instance_id":"sf_bq451","db":"_1000_GENOMES","question":"Extrahieren Sie Genotypdaten für Einzelnukleotid-Polymorphismen (SNPs) auf dem Chromosom X, ausgenommen Positionen, bei denen der `start`-Wert zwischen 59999 und 2699519 oder zwischen 154931042 und 155260559 liegt. Für jede Probe identifizieren Sie Genotyp-Aufrufe, bei denen das Genotyp-Array mindestens ein Allel besitzt. Klassifizieren Sie jeden Genotyp-Aufruf in eine der folgenden Kategorien: homozygot Referenzallele (beide Allele sind 0), homozygot alternatives Allele (beide Allele sind gleich und größer als 0) oder heterozygote Allele (Allele sind verschieden, oder irgendein Allel ist null, und mindestens ein Allel ist größer als 0). Berechnen Sie die Gesamtzahl der aufrufbaren Stellen (die Summe aller drei Genotyp-Kategorien), die Anzahl der homozygoten Referenz-, homozygoten alternativen- und heterozygoten Genotyp-Aufrufe, die Gesamtzahl der Einzel-Nukleotid-Varianten (SNVs) als Summe von homozygoten alternativen und heterozygoten Genotyp-Aufrufen, den Prozentsatz der heterozygoten Genotyp-Aufrufe unter allen SNVs, und den Prozentsatz der homozygoten alternativen Genotyp-Aufrufe unter allen SNVs. Geben Sie die Proben-ID zusammen mit diesen berechneten Zählwerten und Prozentsätzen aus, und ordnen Sie die Ergebnisse nach dem Prozentsatz der heterozygoten Genotyp-Aufrufe unter SNVs in absteigender Reihenfolge, dann nach der Proben-ID.","external_knowledge":"1000_genomes_alleles_type.md"}
{"instance_id":"sf_bq452","db":"_1000_GENOMES","question":"Identifizieren Sie Varianten auf dem Chromosom 12 und berechnen Sie für jede Variante den Chi-Quadrat-Wert unter Verwendung der Allelzählungen bei Fällen und Kontrollen, wobei Fälle Individuen aus der 'EAS'-Superpopulation und Kontrollen Individuen aus allen anderen Superpopulationen sind. Wenden Sie Yates' Kontinuitätskorrektur bei der Chi-Quadrat-Berechnung an und stellen Sie sicher, dass die erwarteten Häufigkeiten für jedes Allel in beiden Gruppen mindestens 5 betragen. Geben Sie die Startposition, Endposition und den Chi-Quadrat-Wert der Top-Varianten zurück, bei denen der Chi-Quadrat-Wert nicht kleiner als 29.71679 ist.","external_knowledge":null}
{"instance_id":"sf_bq453","db":"_1000_GENOMES","question":"Auf Chromosom 17 zwischen den Positionen 41196311 und 41277499, was sind die Referenznamen, Start- und Endpositionen, Referenzbasen, unterschiedliche alternative Basen, Variantentypen und die Chi-Quadrat-Werte (berechnet aus dem Hardy-Weinberg-Gleichgewicht) sowie die Gesamtzahl der Genotypen, ihre beobachteten und erwarteten Anzahlen für homozygot-referenz, heterozygot und homozygot-alternativ Genotypen, sowie Allelfrequenzen (einschließlich derjenigen aus 1KG) für jede Variante?","external_knowledge":null}
{"instance_id":"sf_bq454","db":"_1000_GENOMES","question":"Für den 1000 Genomes-Datensatz analysieren Sie gemeinsame autosomale Varianten (die eine Allelfrequenz von mindestens 0.05 aufweisen) über verschiedene Superpopulationen hinweg. Für jede Superpopulation ermitteln Sie, wie viele Varianten von jeder konkreten Anzahl von Proben innerhalb dieser Superpopulation gemeinsam vorkommen. Beziehen Sie in Ihre Ergebnisse die Gesamtpopulationgröße jeder Superpopulation ein, ob die Variante häufig ist (Allelfrequenz ≥ 0.05), die Anzahl der Proben, die jede Variante aufweist, und die Gesamtanzahl der Varianten, die von dieser Anzahl an Proben gemeinsam vorkommen. Schließen Sie ausschließlich autosomale Varianten ein, indem Sie ausdrücklich die Geschlechtschromosomen (X, Y) und mitochondriale DNA (MT) aus der Analyse ausschließen. Berücksichtigen Sie nur Proben, die für die Variante mindestens ein alternatives Allel (nicht-Referenz) besitzen.","external_knowledge":null}
{"instance_id":"sf_bq415","db":"HUMAN_GENOME_VARIANTS","question":"Listen Sie die Top-10-Proben in den Genomdaten auf, die die höchste Anzahl an Positionen aufweisen, bei denen genau ein alternatives Allel vorhanden ist und der Genotyp der Probe homozygot für das Referenzallel ist (beide Allele sind 0). Ordnen Sie die Ergebnisse in absteigender Reihenfolge nach diesen Zählwerten.","external_knowledge":"Homozygous_Reference_Genotype.md"}
{"instance_id":"bq279","db":"austin","question":"Können Sie die Anzahl der eindeutigen aktiven und geschlossenen Bike-Sharing-Stationen für die Jahre 2013 und 2014 bereitstellen?","external_knowledge":null}
{"instance_id":"bq281","db":"austin","question":"Wie hoch ist die höchste Anzahl von E-Bike-Fahrten, die von Abonnenten mit 'Student Membership' an einem einzigen Tag unternommen wurden und die länger als 10 Minuten dauerten, wobei Fahrten ausgeschlossen sind, die an 'Mobile Station' oder 'Repair Shop' beginnen oder enden?","external_knowledge":null}
{"instance_id":"bq282","db":"austin","question":"Können Sie mir den numerischen Wert des aktiven Ratsbezirks in Austin nennen, der die höchste Anzahl von Fahrradfahrten hat, die innerhalb desselben Bezirks beginnen und enden, aber nicht an derselben Station?","external_knowledge":null}
{"instance_id":"bq006","db":"austin","question":"Welches Datum hat den zweit höchsten Z-Wert für die täglichen Fallzahlen von 'PUBLIC INTOXICATION'-Vorfällen in Austin im Jahr 2016? Gib das Datum im Format '2016-xx-xx' an.","external_knowledge":null}
{"instance_id":"sf_bq283","db":"AUSTIN","question":"Unter allen Stationen, die aktuell aktiv sind, identifizieren Sie diejenigen, die sich basierend auf der Gesamtzahl der Startfahrten an jeder Station in die Top-15-Ränge (einschließlich Gleichständen) einordnen. Für jede dieser Stationen geben Sie die Stations-ID, die Gesamtzahl der Startfahrten, den Anteil dieser Fahrten an der Gesamtzahl der von aktiven Stationen gestarteten Fahrten sowie die durchschnittliche Fahrtdauer in Minuten an. Sortieren Sie die Ergebnisse nach dem Rang der Station.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq284","db":"bbc","question":"Kannst du eine Aufschlüsselung der Gesamtzahl der Artikel nach Kategorien geben und den Anteil der Artikel, die in jeder Kategorie 'Bildung' erwähnen, von BBC News?","external_knowledge":null}
{"instance_id":"bq413","db":"dimensions_ai_covid19","question":"Rufen Sie die Titel der Veranstaltungsorte der Publikationen ab, die ein `date_inserted` aus dem Jahr 2021 oder später besitzen und mit einem Grid verbunden sind, dessen Adressstadt 'Qianjiang' ist. Für jede Publikation priorisieren Sie den Veranstaltungsort-Titel, indem Sie zuerst den Journal-Titel auswählen, falls dieser existiert; falls nicht, dann den Proceedings-Titel; falls das auch nicht verfügbar ist, den Buchtitel; und schließlich, falls keines davon verfügbar ist, den Titel der Buchreihe.","external_knowledge":null}
{"instance_id":"bq425","db":"ebi_chembl","question":"Unter Verwendung der Daten aus ChEMBL Release 23 rufen Sie alle eindeutigen Moleküle ab, die mit dem Unternehmen 'SanofiAventis' verbunden sind, und listen Sie für jedes Molekül den Handelsnamen sowie das jeweils jüngste Zulassungsdatum auf. Stellen Sie sicher, dass pro Molekül nur das neueste Zulassungsdatum beibehalten wird, und dass das Unternehmensfeld exakt mit 'SanofiAventis' übereinstimmt, ohne sich auf andere Felder zu verlassen.","external_knowledge":null}
{"instance_id":"bq430","db":"ebi_chembl","question":"Finde Paare unterschiedlicher Moleküle, die im selben Assay und demselben Standardtyp getestet wurden, wobei beide 10–15 schwere Atome besitzen, weniger als 5 Aktivitäten in diesem Assay, weniger als 2 Duplikataktivitäten, nicht-null Standardwerte und pChEMBL-Werte über 10 aufweisen. Für jedes Paar berichte die maximale Anzahl schwerer Atome, das neueste Publikationsdatum (berechnet basierend auf dem Rang des Dokuments innerhalb desselben Journals und Jahres und auf einen synthetischen Monat und Tag abzubilden), die höchste Dokument-ID, klassifiziere die Veränderung der Standardwerte basierend auf ihren Werten und Relationen als 'Anstieg', 'Rückgang' oder 'keine Veränderung' und generiere UUIDs aus ihren Aktivitäts-IDs und kanonischen SMILES.","external_knowledge":"chembl.md"}
{"instance_id":"bq023","db":"fec","question":"Verwenden Sie die 2018 5-Jahres American Community Survey (ACS) für Medianverdienste auf Ebene des Census-Tracts und den 2020 Federal Election Commission (FEC) Datensatz zu Einzelspenden, gefiltert nach Spendern in New York, der über eine ZIP-Code-zu-Census-Tract-Kreuztabelle mit Geografien der Census-Tracts abgeglichen wird, berechnen und listen Sie den durchschnittlichen Betrag politischer Spenden und das Median-Einkommen für jeden Census-Trakt in Kings County (Brooklyn), New York.","external_knowledge":null}
{"instance_id":"bq094","db":"fec","question":"Bitte liefern Sie eine Liste aller 2016er-Komitees, die mindestens einen Kandidaten unterstützt haben und eine Gesamtsumme der einzelnen Spenden zwischen $0 und $200 erhalten haben (einschließlich Spenden > $0 und < $200), wobei sich diese Spenden kleiner Beträge insgesamt auf mehr als $0 belaufen. Für jedes qualifizierte Komitee geben Sie dessen Namen, die Anzahl der von ihm unterstützten einzigartigen Kandidaten, die Namen der Kandidaten in alphabetischer Reihenfolge (durch Kommas getrennt) sowie die Gesamtsumme dieser Spenden kleiner Beträge, die dem Komitee zugeflossen sind.","external_knowledge":null}
{"instance_id":"bq287","db":"fda","question":"Unter allen ZIP-Codes in Utah, wie hoch ist die Beschäftigungsquote der Bevölkerung im Alter von 16 Jahren oder älter gemäß der 2017 American Community Survey im ZIP-Code, der die wenigsten FDIC-versicherten Bankstandorte hat?","external_knowledge":null}
{"instance_id":"bq432","db":"fda","question":"Bitte liefern Sie die Daten zu Lebensmittel-Ereignissen, bei denen sowohl \"date_created\" als auch \"date_started\" zwischen January 1 und January 31, 2015 liegen, und wenden Sie die folgenden Schritte der Datenbereinigung an: Teilen Sie die Felder reactions und outcomes durch Kommas in Arrays auf, behandeln Sie spezielle numerische Muster im Feld products_brand_name (wo eine Ziffer von einem Komma gefolgt wird und eine weitere Ziffer folgt) durch Beibehaltung dieser numerischen Muster, während andere \", \" durch \" -- \" ersetzt werden, ersetzen Sie \", \" durch \" -- \" in den Feldern products_industry_code, products_role und products_industry_name, und berechnen Sie industry_code_length und brand_name_length als die Array-Längen nach dem Aufteilen.","external_knowledge":"Food_Event_Cleansing_Logic.md"}
{"instance_id":"bq285","db":"fda","question":"Könnten Sie mir die Postleitzahl des Standorts nennen, der die höchste Anzahl von Banken in Florida hat?","external_knowledge":null}
{"instance_id":"bq288","db":"fda","question":"Wie hoch ist die Gesamtzahl aller Kreditinstitute im Bundesstaat, der die höchste Summe der Vermögenswerte der Banken aufweist, die zwischen January 1, 1900, und December 31, 2000 gegründet wurden und deren Institutsnamen mit 'Bank' beginnen?","external_knowledge":null}
{"instance_id":"sf_bq412","db":"GOOGLE_ADS","question":"Bitte rufen Sie die Seiten-URLs, die erste angezeigte Zeit, die zuletzt angezeigte Zeit, den Entfernungsgrund, die Verstoßkategorie sowie die unteren und oberen Grenzen der angezeigten Zeiten für die fünf zuletzt entfernten Anzeigen in der Kroatien-Region (Regionscode 'HR') ab, wobei das angezeigte Verfügbarkeitsdatum Null ist, die untere Grenze der angezeigten Zeiten 10,000 überschreitet, die obere Grenze der angezeigten Zeiten unter 25,000 liegt, und die Anzeigen mindestens einen bislang nicht verwendeten Zielgruppenauswahl-Ansatz unter Demografie, geografischer Lage, kontextuellen Signalen, Kundenlisten oder Interessengebieten verwendet haben, sortieren Sie die resultierenden Anzeigen nach ihrer zuletzt angezeigten Zeit in absteigender Reihenfolge.","external_knowledge":null}
{"instance_id":"sf_bq423","db":"GOOGLE_ADS","question":"Zwischen dem 1. Januar 2023 und dem 1. Januar 2024, welche Bildtyp-Werbung zum Thema Gesundheit, veröffentlicht von einem verifizierten Werbetreibenden mit Sitz in Zypern, in Kroatien ausgespielt wurde, hat times_shown_availability_date den Wert NULL (was bedeutet, dass die times_shown-Daten verfügbar sind), hat demografische Informationen, Geolokations-Targeting, kontextuelle Signale, Kundendateien und Interessengebiete genutzt, ohne dass eine dieser Auswahlmethoden ungenutzt bleibt, und zusätzlich ein erstes Erscheinungsdatum der Anzeige, das strikt nach dem 1. Januar 2023 liegt, sowie ein letztes Erscheinungsdatum der Anzeige, das strikt vor dem 1. Januar 2024 liegt? Unter solchen Anzeigen geben Sie die Seiten-URL derjenigen mit dem höchsten oberen Grenzwert von times_shown an.","external_knowledge":null}
{"instance_id":"sf_bq070","db":"IDC","question":"Könnten Sie aus der Tabelle dicom_all einen sauberen, strukturierten Datensatz bereitstellen, der nur SM-Bilder enthält, die als VOLUME markiert sind, aus den TCGA-LUAD- und TCGA-LUSC-Sammlungen, alle Folien mit dem Kompressionstyp “other” ausschließen, wobei der Probenvorbereitungs-Schritt explizit “Embedding medium” auf “Tissue freezing medium” festlegt, und sicherstellen, dass der Gewebetyp nur “normal” oder “tumor” ist und der Krebssubtyp entsprechend gemeldet wird?","external_knowledge":"dicom_dataset_selection.md"}
{"instance_id":"sf_bq320","db":"IDC","question":"In der dicom_pivot-Tabelle, wie viele eindeutige StudyInstanceUID-Werte genau mit der SegmentedPropertyTypeCodeSequence von \"15825003\" übereinstimmen (Groß-/Kleinschreibung ignorieren) und außerdem eine collection_id von entweder \"Community\" oder \"nsclc_radiomics\" haben?","external_knowledge":null}
{"instance_id":"sf_bq321","db":"IDC","question":"Wie viele eindeutige StudyInstanceUIDs gibt es aus den DWI-, T2 Weighted Axial-, Apparent Diffusion Coefficient-Serien und den T2 Weighted Axial Segmentierungen in der 'qin_prostate_repeatability' Sammlung?","external_knowledge":null}
{"instance_id":"sf_bq323","db":"IDC","question":"Innerhalb der Sammlung 'prostatex', für MRI-Sequenzen, bei denen die Modalität 'MR' ist, weisen Sie das Label 't2w_prostateX' Sequenzen zu, deren SeriesDescription 't2_tse_tra' enthält, und 'adc_prostateX' Sequenzen zu Sequenzen, deren SeriesDescription 'ADC' enthält. Für alle Sequenzen, die als 't2w_prostateX' oder 'adc_prostateX' gekennzeichnet sind, berechnen Sie die durchschnittliche Repetitionszeit, die durchschnittliche Echozeit und die durchschnittliche Schichtdicke, und berechnen Sie dann die Summe dieser Mittelwerte, um den kombinierten Gesamtmittelwert zu erhalten.","external_knowledge":null}
{"instance_id":"sf_bq417","db":"IDC","question":"Bitte geben Sie Identifikationsdaten, Studien- und Serieninformationen, Speicherort und die Gesamtgröße in MB für die medizinischen Bilder an, die von männlichen Patienten stammen, die genau 18 Jahre alt sind, basierend auf dem numerischen Teil des Feldes PatientAge, wobei BodyPartExamined auf 'MEDIASTINUM' gesetzt ist und das Studiendatum strikt nach September 1, 2014 liegt.","external_knowledge":"IDC_data_model.md"}
{"instance_id":"sf_bq455","db":"IDC","question":"Identifizieren Sie die fünf größten CT-Scan-Serien nach Größe (in MiB), einschließlich ihrer SeriesInstanceUID, Seriennummer, Patienten-ID und Seriengröße. Diese Serien müssen aus der CT-Modalität stammen und nicht Teil der 'nlst'-Sammlung sein. Schließen Sie alle Serien aus, bei denen der ImageType als 'LOCALIZER' klassifiziert ist oder bei denen die TransferSyntaxUID entweder '1.2.840.10008.1.2.4.70' oder '1.2.840.10008.1.2.4.51' ist (d.h. JPEG-komprimiert). Die ausgewählten Serien müssen konsistente Schichtabstände, Belichtungsniveaus, Bildorientierung (mit nur einem eindeutigen ImageOrientationPatient-Wert), Pixelabstände, Bildpositionen (sowohl in der Z-Achse als auch in den XY-Positionen) und Pixelabmessungen (Zeilen und Spalten) aufweisen. Stellen Sie sicher, dass die Anzahl der Bilder der Anzahl der eindeutigen Z-Achsen-Positionen entspricht, was keine Duplikats-Schnitte bedeutet. Zusätzlich muss die Z-Achsenkomponente des Kreuzprodukts der x- und y-Richtungscosinus aus ImageOrientationPatient einen Absolutwert zwischen 0,99 und 1,01 haben, um eine Ausrichtung mit der erwarteten Bildebene sicherzustellen. Schließlich ordnen Sie die Ergebnisse nach der Seriengröße in absteigender Reihenfolge und begrenzen Sie die Ausgabe auf die fünf Serien, die diese Bedingungen erfüllen.","external_knowledge":null}
{"instance_id":"sf_bq456","db":"IDC","question":"Bitte rufen Sie aus der Tabelle dicom_all jeweils PatientID, StudyInstanceUID, StudyDate und die CodeMeaning des FindingSite für Patienten ab, deren StudyDate im Jahr 2001 liegt, zusammen mit den Maximalwerten jeder der folgenden Messungen, die durch ihren CodeMeaning identifiziert werden (Elongation, Flatness, Least Axis in 3D Length, Major Axis in 3D Length, Maximum 3D Diameter of a Mesh, Minor Axis in 3D Length, Sphericity, Surface Area of Mesh, Surface to Volume Ratio, Volume from Voxel Summation, and Volume of Mesh), wobei sichergestellt wird, dass die Tabelle quantitative_measurements über segmentationInstanceUID mit der SOPInstanceUID in dicom_all verbunden ist, und Gruppierung nach PatientID, StudyInstanceUID, StudyDate und FindingSite CodeMeaning.","external_knowledge":null}
{"instance_id":"sf_bq324","db":"IDC","question":"Wie viele Frames insgesamt in allen Whole-Slide-Mikroskopie-Bildern aus der TCGA-BRCA-Sammlung vorhanden sind, die die SM-Modalität verwenden und in ihrer SpecimenPreparationSequence einen eosinbasierten Färbeschritt enthalten?","external_knowledge":null}
{"instance_id":"bq418","db":"targetome_reactome","question":"Bestimmen Sie, welche drei untersten Ebenen der Reactome-Wege (mit TAS-Evidenz) die höchsten Chi-Quadrat-Werte aufweisen, wobei nur Homo sapiens-Ziele berücksichtigt werden, die mit Sorafenib assoziiert sind, unter der Bedingung, dass der mediane Assaywert ≤ 100 ist und sowohl niedrige als auch hohe Assaywerte ≤ 100 oder Null sind. Für jeden dieser drei Wege, wie viele dieser Ziele und Nicht-Ziele liegen innerhalb des Weges und außerhalb davon?","external_knowledge":null}
{"instance_id":"bq330","db":"fda","question":"Welche Postleitzahl in Colorado hat die höchste Konzentration von Bankstandorten pro Blockgruppe, basierend auf der Überlappung zwischen Postleitzahlen und Blockgruppen?","external_knowledge":"overlap_ratio.md"}
{"instance_id":"bq398","db":"world_bank","question":"Welche sind die drei wichtigsten Schuldenkennzahlen für Russland, basierend auf den höchsten Schuldenwerten?","external_knowledge":null}
{"instance_id":"bq399","db":"world_bank","question":"Welche Länder mit hohem Einkommen hatten in jeder Region jeweils die höchste durchschnittliche Brutto-Geburtenrate, und wie hoch waren deren jeweilige durchschnittliche Geburtenraten in den 1980er-Jahren?","external_knowledge":null}
{"instance_id":"bq457","db":"libraries_io","question":"Erhalte Details zu Repositories, die bestimmte Feature-Toggle-Bibliotheken verwenden. Für jedes Repository geben Sie den vollständigen Namen mit Besitzer, Typ der Hosting-Plattform, Größe in Bytes, primäre Programmiersprache, Namen der Fork-Quelle (falls vorhanden), Zeitstempel der letzten Aktualisierung, die Artefakt- und Bibliotheksnamen der verwendeten Feature-Toggle sowie die Programmiersprachen der Bibliothek an. Beziehen Sie Repositories ein, die von den angegebenen Feature-Toggle-Bibliotheken abhängen, definiert durch deren Artefakt-Namen, Bibliotheksnamen, Plattformen und Sprachen.","external_knowledge":"feature_toggle_libraries.md"}
{"instance_id":"bq227","db":"london","question":"Könnten Sie die jährlichen prozentualen Anteile der Top-5 der geringfügigen Straftaten aus dem Jahr 2008 an Londons Gesamtkriminalität bereitstellen, wobei jedes Jahr in einer Zeile angezeigt wird und die Werte auf zwei Dezimalstellen gerundet sind?","external_knowledge":null}
{"instance_id":"bq232","db":"london","question":"Könnten Sie die Gesamtzahl der Vorfälle von 'Other Theft' innerhalb der Kategorie 'Theft and Handling' für jedes Jahr im Westminster-Bezirk bereitstellen?","external_knowledge":null}
{"instance_id":"bq228","db":"london","question":"Bitte erstellen Sie eine Liste der drei wichtigsten Straftatenkategorien im Bezirk Barking and Dagenham, zusammen mit der Anzahl der Vorfälle in jeder Kategorie.","external_knowledge":null}
{"instance_id":"bq229","db":"open_images","question":"Unter Verwendung des Datensatzes bigquery-public-data.open_images können Sie eine Zählung angeben, wie viele eindeutige Bild-URLs als 'cat' kategorisiert sind (wobei das Bild das Label '/m/01yrx' mit confidence=1 hat) und wie viele eindeutige Bild-URLs als 'other' kategorisiert sind (was bedeutet, dass sie überhaupt kein 'cat'-Label '/m/01yrx' haben)?","external_knowledge":null}
{"instance_id":"bq230","db":"usda_nass_agriculture","question":"Verwenden Sie den crops-Datensatz, um die Gesamtproduktion für 2022 zu ermitteln, gemessen in bushels, für Mais aus der Kategorie 'FIELD CROPS' und Pilze aus der Gruppe 'HORTICULTURE' für jeden Bundesstaat der USA. Schließen Sie nur Datenzeilen ein, bei denen 'statisticcat_desc' 'PRODUCTION' ist, 'agg_level_desc' 'STATE' ist, 'value' nicht NULL ist, und stellen Sie sicher, dass für Mais der 'unit_desc' 'BU' ist. Kombinieren Sie beide Ergebnisse so, dass die 2022-Mais- und Pilzsummen jedes Bundesstaates präsentiert werden.","external_knowledge":null}
{"instance_id":"bq326","db":"world_bank","question":"Basierend auf dem globalen Bevölkerungsdatensatz der Weltbank und dem Datensatz der Weltbank zur Gesundheit, Ernährung und Bevölkerung, wie viele Länder verzeichneten eine Zunahme von mehr als 1% gegenüber dem Vorjahr bis 2018 sowohl in ihrer Gesamtbevölkerung als auch bei den aktuellen Gesundheitsausgaben pro Kopf (PPP)?","external_knowledge":null}
{"instance_id":"bq424","db":"world_bank","question":"Listen Sie die Top-10-Länder mit dem höchsten Gesamtbetrag der langfristigen Außenverschuldung in absteigender Reihenfolge auf, ausgenommen diejenigen, bei denen keine Region angegeben ist.","external_knowledge":null}
{"instance_id":"bq327","db":"world_bank","question":"Wie viele Verschuldungsindikatoren für Russland haben einen Wert von 0, unter Ausschluss von NULL-Werten?","external_knowledge":null}
{"instance_id":"bq328","db":"world_bank","question":"Welche Region hat den höchsten Medianwert des BIP (in konstanten 2015 US$)?","external_knowledge":null}
{"instance_id":"sf_bq331","db":"META_KAGGLE","question":"Bestimmen Sie die drei Benutzer, die den ersten Beitrag in Forumsthemen verfasst haben, sortiert in absteigender Reihenfolge nach ihrem Beitragswert, wobei ein Beitragswert definiert ist als die Anzahl der unterschiedlichen Benutzer, die auf diesen Beitrag gestimmt haben. Für jeden dieser Benutzer geben Sie deren Benutzernamen und die absolute Differenz zwischen ihrem Beitragswert und dem durchschnittlichen Beitragswert aller ersten Beiträge in Forumsthemen an.","external_knowledge":null}
{"instance_id":"sf_bq380","db":"META_KAGGLE","question":"Unter Verwendung der Daten aus den Tabellen Forum Message Votes und Users identifizieren Sie die drei Benutzer mit den meisten eindeutigen Upvotes im Kaggle-Forum. Für jeden dieser Benutzer listen Sie ihren Benutzernamen, die Gesamtzahl der eindeutigen Upvotes, die sie erhalten haben (basierend auf dem Feld ToUserId), und die Gesamtzahl der eindeutigen Upvotes, die sie gegeben haben (basierend auf dem Feld FromUserId). Sortieren Sie nach der Anzahl der erhaltenen Upvotes in absteigender Reihenfolge und beschränken Sie sich dabei auf die Top-3-Ergebnisse.","external_knowledge":null}
{"instance_id":"sf_bq370","db":"WIDE_WORLD_IMPORTERS","question":"Wie viele Kunden haben Bestellungen und Rechnungen, die auf der Positionsebene übereinstimmen und sich, aggregiert, dahingehend auswirken, dass jeder Kunde eine gleiche Anzahl von Bestellungen und Rechnungen sowie einen identischen Gesamtwert für die Bestellungen und Rechnungen hat?","external_knowledge":null}
{"instance_id":"sf_bq371","db":"WIDE_WORLD_IMPORTERS","question":"Im Jahr 2013, wobei der Gesamtwert jeder Rechnung als Produkt aus Stückpreis und Menge zu betrachten ist und nach dem Quartal (Q1, Q2, Q3, Q4) gruppiert wird, in dem das Rechnungsdatum liegt, wie groß ist die Differenz zwischen dem höchsten und dem niedrigsten durchschnittlichen Rechnungswert über diese Quartale?","external_knowledge":null}
{"instance_id":"sf_bq372","db":"WIDE_WORLD_IMPORTERS","question":"Unter allen Bestellungen, die nicht in der invoice table erscheinen, berechnen Sie für jedes Kundensegment den maximalen verlorenen Bestellwert und bestimmen Sie anschließend, welches Kundensegment den maximalen verlorenen Bestellwert besitzt, der dem Gesamtmittelwert dieser maximalen verlorenen Bestellwerte über alle Kategorien am nächsten kommt?","external_knowledge":null}
{"instance_id":"sf_bq373","db":"WIDE_WORLD_IMPORTERS","question":"Unter Verwendung des Rechnungsdatums, um jeden Monat des Jahres 2014 zu bestimmen, und die Gesamtbeträge der Rechnungszeilen für jeden Kunden über diese Monate hinweg zu summieren, was ist der Median des daraus resultierenden durchschnittlichen monatlichen Ausgabenbetrags über alle Kunden hinweg?","external_knowledge":null}
{"instance_id":"bq393","db":"hacker_news","question":"Ich möchte Benutzer identifizieren, die Aktivität gezeigt haben und danach Inaktivität aufweisen. Konkret finde ich die Benutzer-ID und deren entsprechende Monatsnummer (gezählt ab dem ersten Aktivitätsmonat) für den Benutzer mit der höchsten Monatsnummer, der nach seinem zuletzt aufgezeichneten Aktivitätsmonat inaktiv wurde (keine Aktivität aufgezeichnet). Für diese Analyse betrachte nur Daten bis zum 10. September 2024 und stelle sicher, dass die Monatsnummer die Anzahl der Monate seit der ersten Aktivität des Benutzers darstellt. Der Benutzer sollte mindestens einen Monat haben, in dem erwartet wurde, dass er aktiv ist (innerhalb seines Aktivitätszeitraums), aber tatsächlich keine Aufzeichnungen vorliegen.","external_knowledge":null}
{"instance_id":"bq403","db":"irs_990","question":"Welche drei Jahre in 2012-2017 haben den kleinsten absoluten Unterschied zwischen dem Median des Umsatzes und dem Median der funktionalen Aufwendungen bei Organisationen, die IRS-990-Formulare einreichen? Bitte geben Sie drei Jahre und die jeweiligen Unterschiede aus.","external_knowledge":null}
{"instance_id":"bq397","db":"ecommerce","question":"Nachdem Sie alle doppelten Datensätze aus dem rev_transactions-Datensatz entfernt haben, identifizieren Sie jede Kanalgruppe, die Transaktionen aus mehr als einem Land aufweist. Für jede solche Kanalgruppe ermitteln Sie das Land mit der höchsten Gesamtzahl der Transaktionen und berichten Sie sowohl den Namen des Landes als auch die Summe der Transaktionen für diese Kanalgruppe.","external_knowledge":null}
{"instance_id":"bq402","db":"ecommerce","question":"Berechnen Sie die Konversionsrate von eindeutigen Besuchern zu Käufern, indem Sie ausschließlich Daten aus der `web_analytics`-Tabelle im Datensatz `data-to-insights.ecommerce` verwenden. Ein Besucher wird definiert als eine eindeutige `fullVisitorId`, die in der Tabelle vorhanden ist, während ein Käufer ein Besucher ist, der mindestens eine Transaktion aufgezeichnet hat (`totals.transactions` ist nicht null). Die Konversionsrate wird berechnet, indem die Anzahl der eindeutigen Käufer durch die Gesamtzahl der eindeutigen Besucher geteilt wird. Zusätzlich berechnen Sie die durchschnittliche Anzahl von Transaktionen pro Käufer, wobei nur Besucher berücksichtigt werden, die mindestens eine Transaktion aufgezeichnet haben.","external_knowledge":null}
{"instance_id":"sf_bq160","db":"META_KAGGLE","question":"Bitte liefern Sie das Erstellungsdatum, den Titel, den Titel des übergeordneten Forums, die Anzahl der Antworten, die Anzahl der eindeutigen Benutzerantworten, die Gesamtanzahl der Upvotes und die Gesamtanzahl der Aufrufe für die frühesten fünf Forumsthemen, die zu einem Unterforum gehören, das dem übergeordneten Forum mit dem Titel \"General\" untergeordnet ist. Die Antwortanzahl sollte als die Gesamtzahl der mit jedem Thema verbundenen Nachrichten berechnet werden, und die Anzahl der eindeutigen Benutzerantworten sollte die Anzahl der eindeutigen Benutzer sein, die Nachrichten im Thema gepostet haben. Die Upvotes sollten als die Gesamtzahl der Upvotes aller Nachrichten innerhalb jedes Themas berechnet werden. Falls Werte fehlen oder None sind, behandeln Sie sie bitte als Null.","external_knowledge":null}
{"instance_id":"sf_bq167","db":"META_KAGGLE","question":"Identifizieren Sie das Paar von Kaggle-Nutzern, das in ForumMessageVotes beteiligt ist, sodass einer der Benutzer dem anderen die größte eindeutige Anzahl von Upvotes gegeben hat; zeigen Sie außerdem, wie viele Upvotes der Empfänger zurückgegeben hat. Geben Sie die Benutzernamen beider Benutzer an, die insgesamt eindeutigen Upvotes, die einer vom anderen erhalten hat, sowie die Upvotes, die sie zurückgegeben haben; sortieren Sie nach der höchsten Anzahl empfangener Upvotes und dann nach der höchsten Anzahl gegebener Upvotes, und zeigen Sie nur das oberste Ergebnis an.","external_knowledge":null}
{"instance_id":"sf_bq171","db":"META_KAGGLE","question":"Wessen Upvotes von Forenbeiträgen liegen dem Durchschnitt im Jahr 2019 am nächsten? Falls es einen Gleichstand gibt, nenne mir denjenigen mit dem alphabetisch ersten Benutzernamen.","external_knowledge":null}
{"instance_id":"sf_bq118","db":"DEATH","question":"Unter den als weiß identifizierten Personen, wie viel höher ist die durchschnittliche Anzahl der Todesfälle durch ICD-10-Codes, deren Beschreibungen das Wort “discharge” enthalten (wobei ausdrücklich ausgeschlossen wird: “Urethral discharge,” “Discharge of firework,” und “Legal intervention involving firearm discharge”), im Vergleich zur durchschnittlichen Anzahl der Todesfälle aus ICD-10-Codes, deren Beschreibungen das Wort “vehicle” enthalten, wenn nach Altersgruppen aggregiert wird?","external_knowledge":null}
{"instance_id":"sf_bq072","db":"DEATH","question":"Bitte geben Sie für jedes Alter von 12 bis 18 (einschließlich) die Gesamtzahl der Todesfälle und die Anzahl der Todesfälle von Personen an, die als Black identifiziert wurden (basierend auf Rassenbeschreibungen, die das Wort ‘black’ enthalten), insbesondere für Todesfälle, die mit ICD-10-Codes verbunden sind, deren Beschreibungen das Wort ‘vehicle’ enthalten, und für Todesfälle, die mit ICD-10-Codes verbunden sind, deren Beschreibungen das Wort ‘firearm’ enthalten. Verwenden Sie die EntityAxisConditions-Tabelle, um festzustellen, welche ICD-10-Codes an jedem Todesfall beteiligt waren, anstatt ICD-10-Code-Informationen direkt in den Todesaufzeichnungen zu verknüpfen.","external_knowledge":null}
{"instance_id":"ga001","db":"ga4","question":"Ich möchte die Vorlieben der Kunden kennen, die das Google Navy Speckled Tee im December 2020 gekauft haben. Welches andere Produkt wurde zusammen mit diesem Artikel in der höchsten Gesamtmenge gekauft?","external_knowledge":null}
{"instance_id":"ga002","db":"ga4","question":"Nenne mir die meistverkauften anderen Produkte und deren Mengen von Kunden, die das Google Red Speckled Tee jeden Monat gekauft haben, für die drei Monate beginnend mit November 2020.","external_knowledge":null}
{"instance_id":"ga003","db":"firebase","question":"Ich versuche herauszufinden, welche Bretttypen am 15. September 2018 am effektivsten waren. Können Sie die durchschnittlichen Punktzahlen für jeden Bretttyp aus den Durchläufen im Schnellspielmodus an diesem Tag ermitteln?","external_knowledge":null}
{"instance_id":"ga004","db":"ga4","question":"Können Sie den durchschnittlichen Unterschied der Seitenaufrufe zwischen Nutzern, die etwas gekauft haben, und denen, die nichts gekauft haben, im Dezember 2020 herausfinden? Bezeichnen Sie einfach jeden, der an Kaufvorgängen beteiligt war, als Käufer.","external_knowledge":null}
{"instance_id":"ga008","db":"ga4","question":"Könnten Sie die Gesamtzahl der Seitenaufrufe für jeden Tag im November 2020 sowie die durchschnittliche Anzahl der Seitenaufrufe pro Benutzer an diesen Tagen bereitstellen, eingeschränkt auf Benutzer, die im November 2020 mindestens einen Kauf getätigt haben?","external_knowledge":null}
{"instance_id":"ga017","db":"ga4","question":"Wie viele eindeutige Benutzer haben im Januar 2021 die am häufigsten besuchte Seite angesehen?","external_knowledge":null}
{"instance_id":"ga007","db":"ga4","question":"Bitte ermitteln Sie, welcher Prozentsatz der Seitenaufrufe am January 2, 2021 für PDP-Typenseiten war.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga013","db":"ga4","question":"Ich möchte alle Seiten wissen, die von Benutzer 1402138.5184246691 on January 2, 2021 besucht wurden. Bitte zeigen Sie die Namen dieser Seiten und passen Sie die Namen ggf. an PDP oder PLP an.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga018","db":"ga4","question":"Am 2. Januar 2021 möchte ich den Prozentsatz der Fälle bestimmen, in denen Benutzer innerhalb derselben Sitzung von einer PLP-Ansicht zu einer PDP-Ansicht wechseln, wobei nur page_view-Ereignisse verwendet werden. Könnten Sie berechnen, wie viele PLP-Ansichten letztendlich zu einer PDP-Ansicht in derselben Sitzung an diesem Datum geführt haben, und anschließend den resultierenden Prozentsatz der PLP-zu-PDP-Übergänge angeben?","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga032","db":"ga4","question":"Können Sie den Navigationsfluss für den Benutzer mit der pseudo_id '1362228.4966015575' am 28. Januar 2021 erzeugen, der nur die page_view-Ereignisse zeigt? Bitte verbinden Sie die Seitentitel mit '>>' zwischen jedem Schritt, konvertieren Sie Produktdetailseiten zu 'PDP' und Produktlistenseiten zu 'PLP' basierend auf der URL-Struktur, und führen Sie benachbarte identische Seiten zusammen, sodass sie nur einmal in der Sequenz erscheinen. Ich muss verstehen, wie dieser spezielle Benutzer an diesem Tag durch unsere Website navigierte.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga031","db":"ga4","question":"Ich möchte die Konversionsrate der Benutzersitzung am 2. Januar 2021 wissen, wobei ausschließlich 'page_view'-Ereignisse verwendet werden. Die Konversionsrate sollte als Prozentsatz der Benutzerbesuche berechnet werden, bei denen in einer einzigen Sitzung sowohl die Startseite als auch die Bestellbestätigungsseite erreicht wurden, relativ zu denen, die auf der Startseite gelandet sind.","external_knowledge":null}
{"instance_id":"ga006","db":"ga4","question":"Für den Zeitraum vom 1. bis 30. November 2020 können Sie jeden user_pseudo_id und seinen durchschnittlichen Kaufumsatz in USD pro Sitzung abrufen, für Benutzer, die mehr als eine Kauf-Sitzung hatten, wobei nur Events mit event_name='purchase' und einem NOT NULL-Wert von ecommerce.purchase_revenue_in_usd berücksichtigt werden, und die Sitzungen nach dem ga_session_id aus event_params gruppieren.","external_knowledge":null}
{"instance_id":"ga009","db":"ga4","question":"Könnten Sie mir bitte die durchschnittliche Anzahl der engagierten Sitzungen pro Benutzer für Dezember 2020 mitteilen, wobei nur Sitzungen gezählt werden, bei denen der Ereignisparameter 'session_engaged' gleich '1' ist, und wobei 'user_pseudo_id' in Kombination mit dem 'ga_session_id' verwendet wird, um eindeutige Sitzungen zu identifizieren?","external_knowledge":null}
{"instance_id":"ga010","db":"ga4","question":"Kannst du mir einen Überblick über unseren Website-Traffic für Dezember 2020 geben? Mich interessiert insbesondere der Kanal mit der viertgrößten Anzahl von Sitzungen.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga014","db":"ga4","question":"Können Sie die Gesamtzahl der Sitzungen für jeden Traffic-Kanal im Dezember 2020 unter Verwendung der Informationen aus 'event_params' bereitstellen?","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga011","db":"ga4","question":"Welche Seite hat die zweitgrößte Gesamtanzahl an Seitenaufrufen, nachdem ihre URL bereinigt wurde (durch das Entfernen zusätzlicher Schrägstriche) und der korrekte Seitenpfad extrahiert wurde, auf der Website 'shop.googlemerchandisestore.com' im Dezember 2020?","external_knowledge":null}
{"instance_id":"ga012","db":"ga4","question":"Am 30. November 2020 identifizieren Sie die Artikelkategorie mit dem höchsten Steuersatz, indem Sie den Steuerwert in usd durch den Kaufumsatz in usd für Kaufvorgänge dividieren, und rufen Sie anschließend die Transaktions-IDs, die Gesamtmengen der Artikel und sowohl den Kaufumsatz in usd als auch den Kaufumsatz für diese Kaufvorgänge in der Kategorie mit dem höchsten Steuersatz ab.","external_knowledge":null}
{"instance_id":"ga019","db":"firebase","question":"Könnten Sie feststellen, welcher Prozentsatz der Benutzer entweder unsere App nicht innerhalb von sieben Tagen deinstalliert hat oder nach der Installation während August und September 2018 nie deinstalliert hat?","external_knowledge":null}
{"instance_id":"ga030","db":"firebase","question":"Können Sie Benutzer nach der Woche gruppieren, in der ihre erste Sitzung begann, beginnend mit July 2, 2018? Für jede Gruppe berechnen Sie die Retentionsrate in der vierten Woche (d. h. der Prozentsatz der Benutzer aus der Originalgruppe, die in der vierten Woche nach ihrer ersten Sitzung zurückkehrten). Bitte identifizieren Sie die Kohorte mit der höchsten Retentionsrate in der vierten Woche, und benennen Sie die Gruppe nach dem Montagdatum der ersten Sitzungswoche der Kohorte. Geben Sie das Ergebnis im Format \"YYYY-MM-DD\" zurück.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga005","db":"firebase","question":"Führen Sie eine wöchentliche Kohortenanalyse zur Benutzerbindung durch, beginnend am July 9, 2018 und endend am October 2, 2018. Gruppieren Sie Benutzer nach der Woche ihres ersten session_start-Ereignisses (Woche beginnt am Montag), und identifizieren Sie neue Benutzer als diejenigen, bei denen event_date dem Datum ihres user_first_touch_timestamp entspricht. Berechnen Sie die Week-2-Retention-Rate für jede wöchentliche Kohorte, definiert als der Prozentsatz der Benutzer, die genau 2 Wochen nach ihrer ersten Woche ein session_start-Ereignis hatten. Nur Kohorten von July 9, 2018 bis September 17, 2018 berücksichtigen (die letzte Kohorte, die basierend auf den verfügbaren Daten für eine 2-Wochen-Retention analysiert werden kann). Stellen Sie die Ergebnisse mit jeder wöchentlichen Kohorte und ihrer entsprechenden Week-2-Retention-Rate dar, geordnet nach dem Kohorten-Datum.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga028","db":"firebase","question":"Bitte führen Sie eine 7-Tage-Retentionanalyse für Benutzer durch, deren erster Sitzungsstart in der App in der Woche erfolgt, die am 2. Juli 2018 beginnt. Für jede Woche von Week 0 (der Woche der ersten Sitzung) bis Week 4 geben Sie die Gesamtzahl der neuen Benutzer in Week 0 und die Anzahl der verbleibenden Benutzer für jede nachfolgende Woche an. Stellen Sie sicher, dass Sie Ereignisse nur bis zum 2. Oktober 2018 zählen und die Daten nach montags beginnenden Wochen gruppieren.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga020","db":"firebase","question":"Welcher Quickplay-Ereignistyp hatte die niedrigste Benutzerbindungsrate in der zweiten Woche nach ihrem ersten Engagement, für Benutzer, die sich zwischen dem 1. August und dem 15. August 2018 erstmals engagiert haben, gemessen anhand der Anwesenheit von session_start-Ereignissen??","external_knowledge":"retention_rate.md"}
{"instance_id":"ga021","db":"firebase","question":"Wie hoch ist die Beibehaltungsrate der Benutzer zwei Wochen nach ihrem ersten Quickplay-Ereignis, berechnet separat nach jedem Quickplay-Ereignistyp, im Zeitraum vom 2. Juli 2018 bis zum 16. Juli 2018? Bitte konzentrieren Sie sich auf Benutzer, die in diesem Zeitraum eine Sitzung gestartet haben (session_start).","external_knowledge":"retention_rate.md"}
{"instance_id":"ga022","db":"firebase","question":"Könnten Sie mir bitte helfen, die wöchentliche Kundenbindungsrate im September 2018 für Neukunden zu ermitteln, die unsere App erstmals verwendet haben (first_open event) und zwar innerhalb der ersten Woche, die am 1. September 2018 beginnt (Zeitzone in Shanghai)? Die Bindungsraten sollten die folgenden Wochen 1, 2 und 3 nach dem ersten Gebrauch abdecken und sie in Spaltenformat anzeigen.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga025","db":"firebase","question":"Für alle Benutzer, die die App erstmals im September 2018 geöffnet und danach innerhalb von sieben Tagen deinstalliert haben, möchte ich wissen, welcher Anteil von ihnen einen App-Absturz (app_exception) erlebt hat. Die Berechnung sollte erfolgen, indem die Zeitstempel zuerst in Datumswerte umgewandelt werden und dann die Tage bis zur Deinstallation basierend auf den Daten berechnet werden. Nur Benutzer, die innerhalb von sieben Tagen deinstalliert haben und einen Absturz erlebt haben, sollten im endgültigen Prozentsatz berücksichtigt werden.","external_knowledge":null}
{"instance_id":"local002","db":"E_commerce","question":"Kannst du den 5-Tage-symmetrischen gleitenden Durchschnitt des prognostizierten Spielzeugabsatzes für den Zeitraum vom 5. bis 8. Dezember 2018 berechnen, wobei tägliche Verkaufsdaten vom 1. Januar 2017 bis zum 29. August 2018 verwendet werden, mit einem einfachen linearen Regressionsmodell? Schließlich gib die Summe dieser vier 5-Tage-Durchschnittswerte an.","external_knowledge":null}
{"instance_id":"local003","db":"E_commerce","question":"Gemäß dem RFM-Definitionsdokument berechnen Sie den durchschnittlichen Umsatz pro Bestellung für jeden Kunden innerhalb unterschiedlicher RFM-Segmente, wobei nur Bestellungen mit dem Status 'geliefert' berücksichtigt werden. Verwenden Sie die eindeutige Kunden-ID. Definieren Sie eindeutig, wie Recency basierend auf dem neuesten Kaufzeitstempel berechnet wird, und geben Sie die Kriterien an, anhand derer die RFM-Segmente klassifiziert werden. Der durchschnittliche Umsatz sollte als Gesamtumsatz geteilt durch die Gesamtanzahl der Bestellungen berechnet werden. Bitte analysieren und berichten Sie die Unterschiede im durchschnittlichen Umsatz zwischen den RFM-Segmenten","external_knowledge":"RFM.md"}
{"instance_id":"local004","db":"E_commerce","question":"Könnten Sie mir die Anzahl der Bestellungen, den durchschnittlichen Betrag pro Bestellung und die Kundenlebensdauer in Wochen der 3 Kunden mit dem höchsten durchschnittlichen Betrag pro Bestellung nennen, wobei die Lebensdauer berechnet wird, indem das früheste Kaufdatum vom spätesten Kaufdatum in Tagen subtrahiert wird, durch 7 geteilt wird, und wenn das Ergebnis weniger als 7 Tage beträgt, auf 1.0 gesetzt wird?","external_knowledge":null}
{"instance_id":"local007","db":"Baseball","question":"Könnten Sie mir helfen, die durchschnittliche Einzelkarriere-Dauer in Jahren für alle Baseball-Spieler zu berechnen? Bitte geben Sie das Ergebnis als Fließkommazahl an. Zuerst berechnen Sie die Differenz in Jahren, Monaten und Tagen zwischen dem Debüt- und dem letzten Spieltermin. Für jeden Spieler wird die Karriere-Dauer berechnet als die Summe der absoluten Anzahl von Jahren, der absoluten Anzahl von Monaten geteilt durch 12 und der absoluten Anzahl von Tagen geteilt durch 365. Runden Sie jeden Teil vor dem Addieren auf zwei Dezimalstellen. Schließlich bilden Sie den Durchschnitt der Karriere-Dauern und runden das Ergebnis auf eine Fließkommazahl.","external_knowledge":null}
{"instance_id":"local008","db":"Baseball","question":"Ich möchte die Vornamen der Baseballspieler erfahren, die den höchsten Wert bei gespielten Spielen, Läufen, Hits und Home Runs erreicht haben, zusammen mit ihren entsprechenden Punktwerten.","external_knowledge":null}
{"instance_id":"local009","db":"Airlines","question":"Wie groß ist die Entfernung der längsten Route, bei der Abakan entweder Abfahrts- oder Zielstadt ist (in Kilometern)?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local010","db":"Airlines","question":"Verteile alle eindeutigen Stadtpaare in die Distanzbereiche 0, 1000, 2000, 3000, 4000, 5000 und 6000+, basierend auf ihrer durchschnittlichen Distanz aller Routen zwischen ihnen. Wie viele Paare gibt es dann in dem Distanzbereich mit den wenigsten eindeutigen Stadtpaaren?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local015","db":"California_Traffic_Collision","question":"Bitte berechnen Sie die Todesfallrate bei Motorradkollisionen, getrennt nach Helmgebrauch. Konkret berechnen Sie zwei Prozentsätze: 1) den Anteil der Todesfälle von Motorradfahrern in Kollisionen, bei denen die Beteiligten (Fahrer oder Beifahrer) Helme trugen, und 2) den Anteil der Todesfälle von Motorradfahrern in Kollisionen, bei denen die Beteiligten keine Helme trugen. Für jede Gruppe berechnen Sie dies, indem Sie die Gesamtzahl der Todesfälle von Motorradfahrern durch die Gesamtzahl der Kollisionen teilen, an denen diese Gruppe beteiligt war. Verwenden Sie die parties table, um den Helmgebrauch zu bestimmen (aus den Feldern party_safety_equipment).","external_knowledge":null}
{"instance_id":"local017","db":"California_Traffic_Collision","question":"In welchem Jahr waren die beiden häufigsten Ursachen von Verkehrsunfällen anders als in anderen Jahren?","external_knowledge":null}
{"instance_id":"local018","db":"California_Traffic_Collision","question":"Für die Kategorie des primären Kollisionsfaktors, die die häufigste Ursache für Verkehrsunfälle im Jahr 2021 war, um wie viele Prozentpunkte hat ihr Anteil an den jährlichen Verkehrsunfällen im Jahr 2021 im Vergleich zu seinem Anteil im Jahr 2011 abgenommen?","external_knowledge":null}
{"instance_id":"local019","db":"WWE","question":"Für den NXT-Titel, der die kürzeste Begegnung hatte (ausgenommen Titel mit \"title change\"), wie hießen die Namen der beiden beteiligten Wrestler?","external_knowledge":null}
{"instance_id":"local026","db":"IPL","question":"Bitte hilf mir dabei, die drei besten Bowler zu identifizieren, die in den Overs, in denen in jedem Match die meisten Runs vergeben wurden, die höchste Anzahl an Runs in einem einzelnen Over über alle Spiele hinweg zuließen. Für jeden dieser Bowler gib das Spiel an, in dem sie diese maximalen Runs zugelassen haben. Berücksichtige nur Overs, in denen die meisten Runs innerhalb ihrer jeweiligen Matches zugelassen wurden, und bestimme unter diesen, welche Bowler die meisten Runs in einem einzelnen Over insgesamt zugelassen haben.","external_knowledge":null}
{"instance_id":"local020","db":"IPL","question":"Welcher Bowler hat den niedrigsten Bowling-Durchschnitt pro Wicket?","external_knowledge":null}
{"instance_id":"local021","db":"IPL","question":"Könnten Sie den Durchschnitt der insgesamt von allen Batsmen erzielten Runs berechnen, die in irgendeinem einzelnen Match mehr als 50 Runs erzielt haben?","external_knowledge":null}
{"instance_id":"local022","db":"IPL","question":"Ermitteln Sie die Namen der Spieler, die in einem Match mindestens 100 Läufe erzielt haben, während sie für das Team spielten, das das Match verloren hat.","external_knowledge":null}
{"instance_id":"local023","db":"IPL","question":"Bitte helfen Sie mir, die Namen der Top-5-Spieler mit dem höchsten Durchschnitt an erzielten Runs pro Spiel in der Saison 5 zu finden, zusammen mit ihren Batting-Durchschnitten.","external_knowledge":null}
{"instance_id":"local024","db":"IPL","question":"Kannst du mir helfen, die Top-5-Länder zu finden, deren Spieler den höchsten Durchschnitt ihrer individuellen Runs pro Spiel über alle Saisons hinweg haben? Konkret: Für jeden Spieler berechne seinen Durchschnitt an Runs pro Spiel über alle Spiele, die er gespielt hat, und berechne dann den Durchschnitt dieser Spieler-Durchschnitte pro Land, und füge diese landesweiten Batting-Durchschnitte dem Ergebnis hinzu.","external_knowledge":null}
{"instance_id":"local025","db":"IPL","question":"Für jedes Spiel, unter Berücksichtigung aller Innings, bitte die von beiden Batsmen erzielten Läufe sowie die Extras pro Over addieren, dann das Over mit der höchsten Gesamtsumme der Läufe ermitteln, den Bowler für dieses Over aus der Ball-by-Ball-Tabelle abrufen und den Durchschnitt dieser höchsten Over-Gesamtsummen über alle Spiele berechnen, wobei sichergestellt wird, dass alle Läufe-Details und Bowler-Details genau wiedergegeben werden.","external_knowledge":null}
{"instance_id":"local028","db":"Brazilian_E_Commerce","question":"Könnten Sie einen Bericht erstellen, der die Anzahl der gelieferten Bestellungen für jeden Monat in den Jahren 2016, 2017 und 2018 zeigt? Jede Spalte repräsentiert ein Jahr, und jede Zeile repräsentiert einen Monat","external_knowledge":null}
{"instance_id":"local031","db":"Brazilian_E_Commerce","question":"Was ist das höchste monatliche Volumen an gelieferten Bestellungen in dem Jahr mit dem niedrigsten jährlichen Volumen an gelieferten Bestellungen unter 2016, 2017 und 2018?","external_knowledge":null}
{"instance_id":"local029","db":"Brazilian_E_Commerce","question":"Bitte identifizieren Sie die drei führenden Kunden, basierend auf ihrer customer_unique_id, die die höchste Anzahl gelieferter Bestellungen haben, und geben Sie den durchschnittlichen Zahlungsbetrag, die Stadt und den Bundesstaat für jeden dieser Kunden an.","external_knowledge":null}
{"instance_id":"local030","db":"Brazilian_E_Commerce","question":"Unter allen Städten mit ausgelieferten Bestellungen suchen Sie die fünf Städte, deren Gesamtzahlungen am niedrigsten sind, und berechnen Sie dann den Durchschnitt ihrer Gesamtzahlungen sowie den Durchschnitt der Gesamtanzahl gelieferter Bestellungen.","external_knowledge":null}
{"instance_id":"local032","db":"Brazilian_E_Commerce","question":"Könnten Sie mir helfen, die Verkäufer zu finden, die in den folgenden Kategorien herausragen, wobei nur gelieferte Bestellungen berücksichtigt werden: der Verkäufer mit der höchsten Anzahl eindeutiger Kunden-IDs, der Verkäufer mit dem höchsten Gewinn (berechnet als Preis abzüglich Frachtwert), der Verkäufer mit der höchsten Anzahl eindeutiger Bestellungen und der Verkäufer mit den meisten 5-Sterne-Bewertungen? Für jede Kategorie geben Sie bitte die Verkäufer-ID und den entsprechenden Wert an und kennzeichnen Sie jede Zeile mit einer Beschreibung der Errungenschaft.","external_knowledge":null}
{"instance_id":"local034","db":"Brazilian_E_Commerce","question":"Könnten Sie mir helfen, den Durchschnitt der Gesamtzahl der Zahlungen zu berechnen, die mit der jeweils bevorzugten Zahlungsmethode für jede Produktkategorie getätigt wurden, wobei die bevorzugteste Zahlungsmethode in einer Kategorie jene ist, die die höchste Anzahl von Zahlungen aufweist?","external_knowledge":null}
{"instance_id":"local037","db":"Brazilian_E_Commerce","question":"Identifizieren Sie die drei Produktkategorien, deren am häufigsten verwendete Zahlungsmethode die höchste Anzahl von Zahlungen über alle Kategorien hinweg aufweist, und geben Sie die Anzahl der Zahlungen an, die in jeder Kategorie mit dieser Zahlungsmethode getätigt wurden.","external_knowledge":null}
{"instance_id":"local035","db":"Brazilian_E_Commerce","question":"In der “olist_geolocation” table, bitte bestimmen Sie, welche zwei aufeinanderfolgenden Städte sortiert nach geolocation_state, geolocation_city, geolocation_zip_code_prefix, geolocation_lat und geolocation_lng die größte Entfernung zueinander haben, basierend auf dem Unterschied der Entfernungen, die zwischen jeder Stadt und ihrem unmittelbaren Vorgänger in dieser Sortierung berechnet wurden.","external_knowledge":"spherical_law.md"}
{"instance_id":"local038","db":"Pagila","question":"Könnten Sie mir helfen herauszufinden, welcher Schauspieler am häufigsten in englischsprachigen Kinderfilmen auftrat, die mit G oder PG bewertet wurden, eine Laufzeit von 120 Minuten oder weniger hatten und zwischen 2000 und 2010 veröffentlicht wurden? Bitte nennen Sie den vollständigen Namen des Schauspielers.","external_knowledge":null}
{"instance_id":"local039","db":"Pagila","question":"Bitte helfen Sie mir, die Filmkategorie mit der höchsten Gesamtmietdauer in Städten zu finden, deren Name entweder mit \"A\" beginnt oder einen Bindestrich enthält.","external_knowledge":null}
{"instance_id":"local040","db":"modern_data","question":"Im kombinierten Datensatz, der die Baumdaten mit den Einkommensdaten nach ZIP-Code zusammenführt und bei Bedarf fehlende ZIP-Werte auffüllt, welche drei Bezirke — eingeschränkt auf Datensätze, bei denen sowohl Median- als auch Durchschnittseinkommen größer als Null sind und der Bezirksname gültig ist — die höchste Anzahl von Bäumen enthalten, und wie hoch ist das durchschnittliche Durchschnittseinkommen für jeden dieser drei Bezirke?","external_knowledge":null}
{"instance_id":"local041","db":"modern_data","question":"Wie hoch ist der Anteil der Bäume in der Bronx, die einen Gesundheitszustand von Gut haben?","external_knowledge":null}
{"instance_id":"local049","db":"modern_data","question":"Kannst du mir helfen, die durchschnittliche Anzahl neuer Einhorn-Unternehmen pro Jahr in der führenden Branche von 2019 bis 2021 zu berechnen?","external_knowledge":null}
{"instance_id":"local054","db":"chinook","question":"Könnten Sie mir die Vornamen der Kunden nennen, die weniger als $1 für Alben des meistverkauften Künstlers ausgegeben haben, zusammen mit den Beträgen, die sie ausgegeben haben?","external_knowledge":null}
{"instance_id":"local055","db":"chinook","question":"Identifizieren Sie den Künstler mit dem höchsten Gesamtumsatz an Alben (Gleichstand wird nach alphabetischer Reihenfolge aufgelöst) und den Künstler mit dem niedrigsten Gesamtumsatz an Alben (Gleichstand wird nach alphabetischer Reihenfolge aufgelöst); berechnen Sie dann den Betrag, den jeder Kunde speziell für die Alben dieser beiden Künstler ausgegeben hat. Als Nächstes berechnen Sie die Durchschnittsausgaben der Kunden, die Alben des meistverkauften Künstlers gekauft haben, sowie die Durchschnittsausgaben der Kunden, die Alben des am niedrigsten verkauften Künstlers gekauft haben, und schließlich geben Sie die absolute Differenz zwischen diesen beiden Durchschnittswerten zurück.","external_knowledge":null}
{"instance_id":"local198","db":"chinook","question":"Unter Verwendung der Verkaufsdaten, wie hoch ist der Median des Gesamtumsatzes in Ländern, in denen die Anzahl der Kunden größer als 4 ist?","external_knowledge":null}
{"instance_id":"local056","db":"sqlite-sakila","question":"Welcher Kunde hat die höchste durchschnittliche monatliche Veränderung der Zahlungsbeträge? Geben Sie den vollständigen Namen des Kunden an.","external_knowledge":null}
{"instance_id":"local058","db":"education_business","question":"Können Sie eine Liste der Hardware-Produktsegmente zusammen mit ihren einzigartigen Produktanzahlen für 2020 in der Ausgabe bereitstellen, sortiert nach dem höchsten prozentualen Anstieg der eindeutigen Fakt-Verkaufsprodukte von 2020 bis 2021?","external_knowledge":null}
{"instance_id":"local059","db":"education_business","question":"Für das Kalenderjahr 2021, wie groß ist die insgesamt durchschnittliche Verkaufsmenge der drei meistverkauften Hardwareprodukte (nach Gesamtverkaufsmenge) in jeder Division?","external_knowledge":null}
{"instance_id":"local060","db":"complex_oracle","question":"In den Vereinigten Staaten, für Q4 2019 und Q4 2020, wählen Sie zunächst nur jene Städte aus, in denen der Gesamtumsatz (ohne Werbeaktionen) um mindestens 20 % von Q4 2019 auf Q4 2020 gestiegen ist. Unter diesen Städten ordnen Sie die Produkte nach ihrem Gesamtumsatz (weiterhin ohne Werbeaktionen) in diesen Quartalen und wählen Sie die 20 % der führenden Produkte. Dann berechnen Sie den Anteil jedes dieser Top-Produkte am Gesamtumsatz in Q4 2019 und Q4 2020 und ermitteln Sie die Differenz dieses Anteils von Q4 2019 zu Q4 2020, wobei die Ergebnisse in absteigender Reihenfolge der Veränderung dieses Anteils zurückgegeben werden.","external_knowledge":null}
{"instance_id":"local063","db":"complex_oracle","question":"Unter allen in den Vereinigten Staaten verkauften Produkten mit promo_id=999, wobei nur jene Städte berücksichtigt werden, deren Umsatz von Q4 2019 (calendar_quarter_id=1772) bis Q4 2020 (calendar_quarter_id=1776) um mindestens 20% gestiegen ist, welches Produkt, das zu den Top-20% des Gesamtumsatzes gehört, weist die geringste Veränderung seines Anteils am Gesamtumsatz in Prozentpunkten zwischen diesen beiden Quartalen auf?","external_knowledge":null}
{"instance_id":"local061","db":"complex_oracle","question":"Wie hoch ist der durchschnittlich prognostizierte monatliche Umsatz in USD für Frankreich im Jahr 2021, wobei nur Produktverkäufe mit Aktionen berücksichtigt werden, bei denen promo_total_id = 1 und Kanäle, bei denen channel_total_id = 1, indem die monatlichen Umsätze jedes Produkts aus 2019 und 2020 herangezogen werden, die Wachstumsrate von 2019 bis 2020 für dasselbe Produkt und denselben Monat berechnet wird, diese Wachstumsrate angewendet wird, um die prognostizierten monatlichen Umsätze für 2021 zu ermitteln, alle prognostizierten Beträge für 2021 mit den Wechselkursen von 2021 in USD umgerechnet werden und schließlich nach Monat gemittelt und aufgelistet werden?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local050","db":"complex_oracle","question":"Was ist der Median der durchschnittlich monatlich prognostizierten Umsätze in USD für Frankreich im Jahr 2021, berechnet, indem die monatlichen Umsatzdaten aus 2019 und 2020 verwendet werden (promo_total_id=1 and channel_total_id=1), der Wachstumsrate von 2019 auf 2020 angewendet wird, um 2021 zu prognostizieren, in USD gemäß der Währungstabelle umgerechnet wird und dann die monatlichen Durchschnittswerte bestimmt werden, bevor der Median dieser Werte ermittelt wird?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local062","db":"complex_oracle","question":"Bitte gruppieren Sie alle italienischen Kunden für Dezember 2021 in zehn Klassen, indem Sie deren Gewinn aus allen gekauften Produkten summieren (wobei Gewinn wie folgt berechnet wird: quantity_sold multipliziert mit der Differenz zwischen unit_price und unit_cost), und dann den gesamten Bereich der monatlichen Gesamtgewinne in zehn gleiche Intervalle unterteilen. Für jede Klasse geben Sie die Anzahl der Kunden an und ermitteln Sie den minimalen und maximalen Gesamtgewinn innerhalb dieser Klasse.","external_knowledge":null}
{"instance_id":"local067","db":"complex_oracle","question":"Können Sie die höchsten und niedrigsten Gewinne für italienische Kunden bereitstellen, die in zehn gleichmäßig verteilte Stufen segmentiert sind, basierend auf ihren Verkaufsgewinnen im Dezember 2021?","external_knowledge":null}
{"instance_id":"local070","db":"city_legislation","question":"Bitte prüfen Sie unsere Datenbankaufzeichnungen für chinesische Städte (country_code_2 = 'cn') im Juli 2021 und identifizieren Sie sowohl die kürzesten als auch die längsten Sequenzen aufeinanderfolgender Datumseinträge. Für jedes Datum in diesen Sequenzen geben Sie bitte genau einen Datensatz pro Datum zusammen mit dem entsprechenden Stadtnamen zurück. In Ihrer Ausgabe stellen Sie bitte sicher, dass der erste Buchstabe jedes Stadtnamens groß und der Rest kleingeschrieben ist. Geben Sie die Datumsangaben und Stadtnamen sowohl für die kürzesten als auch für die längsten Sequenzen aufeinanderfolgender Datumsangaben aus, sortiert nach Datum.","external_knowledge":null}
{"instance_id":"local071","db":"city_legislation","question":"Könnten Sie unsere Aufzeichnungen im Juni 2022 überprüfen und feststellen, welche Länder die längste Serie aufeinanderfolgender eingefügter Stadt-Daten haben? Bitte listen Sie die Ländercodes mit zwei Buchstaben dieser Länder auf.","external_knowledge":null}
{"instance_id":"local072","db":"city_legislation","question":"Identifiziere das Land, dessen Daten an neun verschiedenen Tagen im Januar 2022 eingefügt wurden. Bestimme anschließend den längsten aufeinanderfolgenden Zeitraum mit Dateneinfügungen für dieses Land im Januar 2022 und berechne den Anteil der Einträge, die aus seiner Hauptstadt stammen, innerhalb dieses längsten zusammenhängenden Einfügezeitraums.","external_knowledge":null}
{"instance_id":"local068","db":"city_legislation","question":"Berechne die Anzahl der neu hinzugefügten Städte in April, Mai und Juni für jedes Jahr von 2021 bis 2023. Für jeden Monat berechne die kumulative Summe der in diesem Monat über die Jahre hinweg bis einschließlich des jeweiligen Jahres hinzugefügten Städte (d. h. summiere die Zählungen dieses Monats über die Jahre hinweg). Zusätzlich berechne die Jahr-zu-Jahr-Wachstumsraten sowohl für die monatliche Gesamtzahl der hinzugefügten Städte als auch für die kumulative Gesamtzahl für jeden Monat, wobei jedes Jahr mit dem Vorjahr verglichen wird. Gib die Ergebnisse nur für 2022 und 2023 aus, indem du das Jahr, den Monat, die Gesamtzahl der in diesem Monat hinzugefügten Städte, die kumulative Summe für diesen Monat sowie die Jahr-zu-Jahr-Wachstumsraten sowohl für die monatliche Gesamtzahl als auch für die kumulative Gesamtzahl auflistest. Verwende die Daten von 2021 ausschließlich als Basislinie zur Berechnung der Wachstumsraten, und schließe sie aus dem Endergebnis aus.","external_knowledge":null}
{"instance_id":"local073","db":"modern_data","question":"Für jede Pizzabestellung liefern Sie eine einzige Ergebnisszeile mit der Zeilen-ID, Bestell-ID, Kunden-ID, dem Pizza-Name und der endgültigen Zutatenliste. Die endgültigen Zutaten ergeben sich, indem man mit den Standardbelägen aus dem Rezept der Pizza beginnt, alle ausgeschlossenen Beläge entfernt und alle zusätzlichen Beläge hinzufügt. Geben Sie die Zutaten in einer Zeichenkette aus, die mit dem Pizzanamen beginnt und darauf ': ' folgt, wobei die Zutaten in alphabetischer Reihenfolge aufgeführt sind. Zutaten, die mehrfach vorkommen (z. B. aus Standard- und zusätzlichen Belägen), sollten mit '2x' vorangestellt und zuerst aufgeführt werden, gefolgt von Zutaten mit Einzelvorkommen, ebenfalls in alphabetischer Reihenfolge. Gruppieren Sie nach der Zeilen-ID, der Bestell-ID, dem Pizza-Name und der Bestellzeit, um sicherzustellen, dass jede Bestellung nur einmal erscheint. Sortieren Sie die Ergebnisse nach der Zeilen-ID in aufsteigender Reihenfolge. Weisen Sie pizza_id 1 Pizzen mit dem Namen 'Meatlovers' zu und pizza_id 2 allen anderen.","external_knowledge":null}
{"instance_id":"local066","db":"modern_data","question":"Basierend auf unseren Kundendaten zu Pizza-Bestellungen fassen Sie die Gesamtmenge jeder Zutat zusammen, die in den von uns gelieferten Pizzen verwendet wurde. Geben Sie den Namen und die Menge jeder Zutat aus.","external_knowledge":null}
{"instance_id":"local065","db":"modern_data","question":"Berechnen Sie den Gesamtumsatz aus Meat Lovers-Pizzen, die $12 kosten, und Vegetarian-Pizzen, die $10 kosten. Berücksichtigen Sie alle zusätzlichen Beläge, die jeweils $1 kosten. Stellen Sie sicher, dass stornierte Bestellungen herausgefiltert werden. Wie viel Geld hat Pizza Runner insgesamt verdient?","external_knowledge":null}
{"instance_id":"local074","db":"bank_sales_trading","question":"Bitte erstellen Sie eine Zusammenfassung der Schlussbestände zum Monatsende für die Transaktionen jedes Kunden, zeigen Sie die monatlichen Veränderungen und die monatlich kumulierten Bankkontostände. Stellen Sie sicher, dass auch dann, wenn ein Kunde in einem bestimmten Monat keine Kontobewegungen hat, der Saldo dieses Monats dennoch in der Ausgabe enthalten ist.","external_knowledge":null}
{"instance_id":"local064","db":"bank_sales_trading","question":"Für jeden Kunden und jeden Monat des Jahres 2020 berechnen Sie zunächst den Monatsendsaldo, indem Sie alle Einzahlungsbeträge addieren und alle Abhebungsbeträge, die in diesem Monat erfolgt sind, abziehen. Bestimmen Sie anschließend, welcher Monat im Jahr 2020 die höchste Anzahl von Kunden mit einem positiven Monatsendsaldo hat und welcher Monat die niedrigste Anzahl hat. Für jeden dieser beiden Monate berechnen Sie den durchschnittlichen Monatsendsaldo über alle Kunden und geben Sie die Differenz zwischen diesen beiden Durchschnitten an.","external_knowledge":null}
{"instance_id":"local297","db":"bank_sales_trading","question":"Für jeden Kunden gruppieren Sie alle Einzahlungen und Abhebungen nach dem ersten Tag jedes Monats, um einen monatlichen Nettobetrag zu erhalten; dann berechnen Sie den Abschlussbestand jedes Monats durch kumulatives Aufaddieren dieser monatlichen Nettobeträge. Als Nächstes bestimmen Sie die Wachstumsrate des jüngsten Monats, indem Sie den Abschlussbestand dieses Monats mit dem des vorangegangenen Monats vergleichen, wobei Einzahlungen positiv und Abhebungen negativ gezählt werden; ist der Saldo des vorherigen Monats Null, entspricht die Wachstumsrate dem aktuellen Monatsbestand mal 100. Schließlich berechnen Sie den Prozentsatz der Kunden, bei denen der jüngste Monat eine Wachstumsrate von mehr als 5% zeigt.","external_knowledge":null}
{"instance_id":"local298","db":"bank_sales_trading","question":"Für jeden Monat berechnen Sie den Gesamtsaldo aller Benutzer für den vorherigen Monat (Stand am 1. eines jeden Monats), wobei negative Salden durch Null ersetzt werden. Stellen Sie sicher, dass Daten aus dem ersten Monat nur als Basis für die Berechnung des vorherigen Gesamtsaldos verwendet werden und schließen Sie sie von der endgültigen Ausgabe aus. Sortieren Sie die Ergebnisse in aufsteigender Reihenfolge nach Monat.","external_knowledge":null}
{"instance_id":"local299","db":"bank_sales_trading","question":"Für eine Bankdatenbank mit Kundentransaktionen berechnen Sie den täglichen laufenden Kontostand (wobei Einzahlungen den Kontostand erhöhen und andere Transaktionstypen verringern). Für jeden Kunden und jeden Tag berechnen Sie den 30-Tage-gleitenden Durchschnitt des Kontostands (nur nachdem 30 Tage Daten vorliegen und negative Durchschnitte als Null behandeln). Dann gruppieren Sie diese täglichen Durchschnitte nach Monat und ermitteln für jeden Kunden den höchsten 30-Tage-Durchschnitt des Kontostands innerhalb jedes Monats. Summieren Sie diese Höchstwerte über alle Kunden pro Monat. Betrachten Sie den ersten Monat der Transaktionshistorie jedes Kunden als Basiszeitraum und schließen Sie ihn von den endgültigen Ergebnissen aus; präsentieren Sie stattdessen monatliche Totale dieser summierten maximalen 30-Tage-Durchschnitte des Kontostands.","external_knowledge":null}
{"instance_id":"local300","db":"bank_sales_trading","question":"Berechnen Sie für jeden Kunden die täglichen Salden für jeden Tag zwischen dem frühesten und dem spätesten Transaktionsdatum, einschließlich Tage ohne Transaktionen, indem Sie den Saldo des vorherigen Tages fortführen. Behandeln Sie negative tägliche Salden als Null. Ermitteln Sie dann für jeden Monat den höchsten täglichen Saldo, den jeder Kunde in diesem Monat hatte. Schließlich summieren Sie diese maximalen täglichen Salden über alle Kunden hinweg für jeden Monat, um eine monatliche Summe zu erhalten.","external_knowledge":null}
{"instance_id":"local075","db":"bank_sales_trading","question":"Kannst du eine Aufschlüsselung geben, wie oft jedes Produkt angesehen wurde, wie oft es dem Einkaufswagen hinzugefügt wurde und wie oft es im Warenkorb belassen wurde, ohne gekauft zu werden? Gib außerdem die Anzahl der tatsächlichen Käufe für jedes Produkt an. Stelle sicher, dass Produkte mit einer Seiten-ID in (1, 2, 12, 13) herausgefiltert werden.","external_knowledge":null}
{"instance_id":"local077","db":"bank_sales_trading","question":"Bitte analysieren Sie unsere Interessendaten von September 2018 bis August 2019. Für jeden Monat berechnen Sie die durchschnittliche Zusammensetzung für jedes Interesse, indem Sie die Zusammensetzung durch den Indexwert teilen. Identifizieren Sie das Interesse mit dem höchsten durchschnittlichen Zusammensetzungswert in jedem Monat und berichten Sie seine durchschnittliche Zusammensetzung als die maximale Indexzusammensetzung für diesen Monat. Berechnen Sie den dreimonatigen gleitenden Durchschnitt dieser monatlichen maximalen Indexzusammensetzungen. Stellen Sie sicher, dass die Ausgabe das Datum, den Namen des Interesses, die maximale Indexzusammensetzung für diesen Monat, den gleitenden Durchschnitt sowie die Namen und maximalen Indexzusammensetzungen der Top-Interessen von vor einem Monat und vor zwei Monaten enthält.","external_knowledge":null}
{"instance_id":"local078","db":"bank_sales_trading","question":"Bestimme die Top-10- und Bottom-10-Interessenkategorien basierend auf ihren höchsten Zusammensetzungswerten über alle Monate hinweg. Für jede Kategorie zeige die Zeit (MM-YYYY), den Interessenamen und den Zusammensetzungswert.","external_knowledge":null}
{"instance_id":"local081","db":"northwind","question":"Nur die Kunden berücksichtigen, die im Jahr 1998 Bestellungen aufgegeben haben: Berechnen Sie den Gesamtbetrag, den jeder Kunde ausgegeben hat, indem Sie den Stückpreis mit der Menge aller Produkte in seinen Bestellungen multiplizieren und diese Werte aufsummieren, abzüglich jeglicher Rabatte. Weisen Sie jedem Kunden eine Ausgabengruppe basierend auf den Schwellenwerten der Kundengruppen zu und bestimmen Sie, wie viele Kunden sich in jeder Ausgabengruppe befinden und welchen Prozentsatz der Gesamtzahl der Kunden, die im Jahr 1998 Bestellungen aufgegeben haben, jede Gruppe repräsentiert.","external_knowledge":null}
{"instance_id":"local085","db":"northwind","question":"Unter Mitarbeitenden, die mehr als 50 Gesamtaufträge haben, welche drei den höchsten Prozentsatz verspäteter Bestellungen aufweisen, wobei eine Bestellung als verspätet gilt, wenn das Versanddatum am oder nach dem erforderlichen Datum liegt? Bitte listen Sie die ID jedes Mitarbeiters, die Anzahl der verspäteten Bestellungen und den entsprechenden Prozentsatz verspäteter Bestellungen auf.","external_knowledge":null}
{"instance_id":"local096","db":"Db-IMDB","question":"Für jedes Jahr berechnen Sie den Anteil der Filme, die ausschließlich weibliche Schauspieler hatten (das bedeutet, keine männlichen Schauspieler und keine Schauspieler mit unbekanntem/unspezifiziertem Geschlecht). Berücksichtigen Sie Schauspieler mit dem Geschlecht, das mit 'Male' oder 'None' gekennzeichnet ist, als nicht weiblich. Für die Ergebnisse geben Sie das Jahr, die Gesamtzahl der Filme in diesem Jahr und den Prozentsatz der Filme mit ausschließlich weiblichen Schauspielern an. Extrahieren Sie das Jahr aus dem Feld Movie.year, indem Sie die letzten 4 Zeichen nehmen und in eine Zahl umwandeln.","external_knowledge":null}
{"instance_id":"local097","db":"Db-IMDB","question":"Könnten Sie unsere Daten analysieren und identifizieren, welcher Zehnjahreszeitraum, beginnend bei jedem im Datensatz vorhandenen Filmveröffentlichungsjahr, die größte Anzahl von Filmen aufweist, wenn man aufeinanderfolgende Zehnjahreszeiträume berücksichtigt, die bei jedem eindeutigen Jahr beginnen? Geben Sie nur das Startjahr und die Gesamtzahl für diesen speziellen Zeitraum aus.","external_knowledge":null}
{"instance_id":"local098","db":"Db-IMDB","question":"Vom ersten Jahr, in dem jeder Schauspieler in einem Film auftrat, bis zum letzten, wie viele Schauspieler in der Datenbank hatten nie eine Lücke, die länger als drei aufeinanderfolgende Jahre andauerte, ohne dass mindestens eine neue Filmbeteiligung erschien, was bedeutet, dass es keinen vierjährigen Zeitraum irgendwo in ihrer aktiven Karriere gibt, in dem es keine einzige Filmbeteiligung gab.","external_knowledge":null}
{"instance_id":"local099","db":"Db-IMDB","question":"Ich möchte, dass du die Schauspieler-Kollaborationen untersuchst und mir sagst, wie viele Schauspieler mehr Filme mit Yash Chopra gemacht haben als mit jedem anderen Regisseur. Das wird uns helfen, seinen Einfluss auf die Branche besser zu verstehen.","external_knowledge":null}
{"instance_id":"local100","db":"Db-IMDB","question":"Finde heraus, wie viele Schauspieler eine 'Shahrukh number' von 2 haben. Das bedeutet, dass sie in einem Film mit jemandem mitgespielt haben, der mit Shahrukh Khan gespielt hat, aber nicht direkt mit ihm.","external_knowledge":null}
{"instance_id":"local114","db":"education_business","question":"Stellen Sie für jede Region einen detaillierten Bericht über Webverkäufe bereit, der die Anzahl der Bestellungen, den Gesamtumsatz sowie den Namen und den Verkaufsbetrag aller Vertriebsmitarbeiter umfasst, die in dieser Region den höchsten Gesamtumsatz erzielt haben (bei Gleichstand alle Vertreter einschließen).","external_knowledge":null}
{"instance_id":"local128","db":"BowlingLeague","question":"Listen Sie die Bowlers auf (einschließlich ihrer ID, Vorname und Nachname), Matchnummer, Spielnummer, Handicap-Score, Turnierdatum und Standort nur für diejenigen Bowlers, die Spiele mit einem Handicap-Score von 190 oder weniger an allen drei Standorten gewonnen haben: Thunderbird Lanes, Totem Lanes und Bolero Lanes. Schließen Sie nur die spezifischen Spielaufzeichnungen ein, bei denen sie an diesen drei Standorten mit einem Handicap-Score von 190 oder weniger gewonnen haben.","external_knowledge":null}
{"instance_id":"local130","db":"school_scheduling","question":"Könnten Sie eine Liste der Nachnamen aller Schülerinnen und Schüler bereitstellen, die Englischkurse abgeschlossen haben (wobei Abschluss als Vorliegen eines ClassStatus von 2 definiert ist), zusammen mit ihren Quintil-Rängen basierend auf ihren individuellen Noten in diesen Kursen? Das Quintil sollte bestimmt werden, indem berechnet wird, wie viele Schüler Noten haben, die größer als oder gleich der Note eines jeden Schülers sind, und diese Rangfolge durch die Gesamtzahl der Schüler, die Englischkurse abgeschlossen haben, geteilt wird. Die Quintile sollten mit \"First\" (top 20%), \"Second\" (top 21-40%), \"Third\" (top 41-60%), \"Fourth\" (top 61-80%) und \"Fifth\" (bottom 20%) bezeichnet werden. Bitte sortieren Sie die Ergebnisse von dem leistungsstärksten Quintil zum niedrigsten (First bis Fifth).","external_knowledge":null}
{"instance_id":"local131","db":"EntertainmentAgency","question":"Könnten Sie jeden Musikstil zusammen mit der Anzahl der Male auflisten, die er als erste, zweite oder dritte Präferenz hat, jeweils in einer einzigen Zeile pro Stil?","external_knowledge":null}
{"instance_id":"local133","db":"EntertainmentAgency","question":"Gegeben ist eine Datenbank von Musikstilen und Benutzerpräferenzen, wobei Musical_Preferences die Benutzer-Rankings von Musikstilen enthält (PreferenceSeq=1 für erste Wahl, PreferenceSeq=2 für zweite Wahl, PreferenceSeq=3 für dritte Wahl): Berechnen Sie eine gewichtete Punktzahl für jeden Musikstil, indem Sie 3 Punkte dafür vergeben, dass er als erste Wahl gerankt wurde, 2 Punkte für jede zweite Wahl und 1 Punkt für jede dritte Wahl. Berechnen Sie die insgesamt gewichtete Punktzahl für jeden Musikstil, der von mindestens einem Benutzer gerankt wurde. Dann berechnen Sie die absolute Differenz zwischen der Gesamtgewichtung der Punktzahl jedes Stils und dem Durchschnitt der insgesamt gewichteten Punktzahlen über alle entsprechenden Stile.","external_knowledge":null}
{"instance_id":"local132","db":"EntertainmentAgency","question":"Zeigen Sie alle Paare von Entertainern und Kunden, die jeweils bis zu drei Stilstärken oder Vorlieben haben, wobei die ersten und zweiten Stilvorlieben der Kunden mit den ersten und zweiten Stilstärken der Entertainer übereinstimmen (oder in umgekehrter Reihenfolge). Geben Sie nur den Bühnennamen des Entertainers und den Nachnamen des Kunden zurück.","external_knowledge":null}
{"instance_id":"local141","db":"AdventureWorks","question":"Wie hat sich der jährliche Gesamtumsatz jedes Vertriebsmitarbeiters im Vergleich zu seiner jährlichen Verkaufsquote entwickelt? Geben Sie die Differenz zwischen seinem Gesamtumsatz und der Verkaufsquote für jedes Jahr an, aufgeschlüsselt nach Vertriebsmitarbeiter und Jahr.","external_knowledge":null}
{"instance_id":"local152","db":"imdb_movies","question":"Könnten Sie die Top-9-Regisseure basierend auf der Anzahl der Filme liefern, einschließlich der ID, des Namens, der Anzahl der Filme, der durchschnittlichen Intervalldauer zwischen Filmen (auf die nächste Ganzzahl gerundet), der durchschnittlichen Bewertung (auf zwei Nachkommastellen gerundet), der Gesamtstimmen, der Mindest- und Höchstbewertungen sowie der Gesamtdauer der Filme? Sortieren Sie die Ausgabe zuerst nach der Anzahl der Filme in absteigender Reihenfolge und dann nach der Gesamtdauer der Filme in absteigender Reihenfolge.","external_knowledge":null}
{"instance_id":"local230","db":"imdb_movies","question":"Bestimme die drei Genres mit den meisten Filmen, die mehr als 8 bewertet wurden, und identifiziere anschließend die vier Regisseure, die in diesen Genres die meisten Filme mit einer Bewertung von mehr als 8 inszeniert haben. Liste diese Regisseure und ihre jeweiligen Filmanzahlen.","external_knowledge":null}
{"instance_id":"local156","db":"bank_sales_trading","question":"Analysieren Sie den jährlichen durchschnittlichen Kaufpreis pro Bitcoin nach Region, berechnet als der insgesamt in Dollar ausgegebene Betrag geteilt durch die insgesamt pro Jahr gekaufte Menge, wobei die Daten des ersten Jahres für jede Region ausgeschlossen werden. Dann ordnen Sie für jedes Jahr die Regionen basierend auf diesen durchschnittlichen Kaufpreisen ein und berechnen Sie die jährliche prozentuale Veränderung der Kosten für jede Region im Vergleich zum Vorjahr.","external_knowledge":null}
{"instance_id":"local157","db":"bank_sales_trading","question":"Verwenden Sie die \"bitcoin_prices\"-Tabelle, bitte berechnen Sie die tägliche prozentuale Veränderung des Handelsvolumens für jeden Ticker vom 1. August bis zum 10. August 2021, wobei darauf zu achten ist, dass jedes Volumen, das auf \"K\" oder \"M\" endet, korrekt in Tausend bzw. Millionen umgerechnet wird, jedes '-'-Volumen als Null behandelt wird, nur Nicht-Null-Volumina verwendet werden, um das Volumen des vorherigen Handelstages zu bestimmen, und die Ergebnisse nach Ticker und Datum sortiert werden.","external_knowledge":null}
{"instance_id":"local163","db":"education_business","question":"Welche Gehälter von Universitätsfakultätsmitgliedern liegen dem durchschnittlichen Gehalt ihrer jeweiligen Ränge am nächsten? Bitte geben Sie die Ränge, Vornamen, Nachnamen und salaries.university an.","external_knowledge":null}
{"instance_id":"local168","db":"city_legislation","question":"Unter Stellenangeboten, die speziell die Data Analyst-Position beinhalten und remote sind, verlangen ein nicht-null jährliches Durchschnittsgehalt; wie hoch ist der Gesamtdurchschnittslohn, wenn man nur die drei am häufigsten nachgefragten Fähigkeiten für diese Positionen berücksichtigt?","external_knowledge":null}
{"instance_id":"local169","db":"city_legislation","question":"Wie hoch ist die jährliche Verbleibsquote der Abgeordneten, die ihr erstes Mandat zwischen January 1, 1917 und December 31, 1999 begannen, gemessen als Anteil dieser Kohorte, der am December 31st noch im Amt war, für jedes der ersten 20 Jahre nach dem Beginn ihres ersten Mandats? Die Ergebnisse sollten alle 20 Zeiträume in der Reihenfolge zeigen, unabhängig davon, ob in einem bestimmten Jahr Abgeordnete im Amt verblieben waren.","external_knowledge":null}
{"instance_id":"local171","db":"city_legislation","question":"Für männliche Gesetzgeber aus Louisiana, wie viele verschiedene Gesetzgeber waren am 31. Dezember jedes Jahres aktiv im Dienst, in einem Zeitraum von mehr als 30 Jahren seit ihrem ersten Mandat bis unter 50 Jahren, wobei die Ergebnisse nach der genauen Anzahl der Jahre, die seit ihrem ersten Mandat vergangen sind, gruppiert werden?","external_knowledge":null}
{"instance_id":"local167","db":"city_legislation","question":"Basierend auf dem Staat, den jede weibliche Gesetzgeberin zuerst vertreten hat, welcher Staat hat die höchste Anzahl weiblicher Gesetzgeberinnen, deren Amtszeiten zu irgendeinem Zeitpunkt den 31. Dezember umfassten, und wie hoch ist diese Zahl? Bitte geben Sie die Abkürzung des Staates an.","external_knowledge":null}
{"instance_id":"local170","db":"city_legislation","question":"Identifizieren Sie die Staatsabkürzungen, bei denen sowohl männliche als auch weibliche Abgeordnete eine Verbleibsquote größer als Null zu den Zeitpunkten 0, 2, 4, 6, 8 und 10 Jahren nach dem Beginn ihrer ersten Amtszeit aufweisen. Ein Abgeordneter gilt als verbleibend, wenn er am 31. Dezember des jeweiligen Jahres im Amt steht. Schließen Sie nur Staaten ein, in denen beide Geschlechterkohorten bei allen sechs Zeitpunkten während des ersten Jahrzehnts der Amtszeit eine Nicht-Null-Verbleibsquote aufweisen.","external_knowledge":null}
{"instance_id":"local193","db":"sqlite-sakila","question":"Könnten Sie den durchschnittlichen Prozentsatz des gesamten LTV ermitteln, der in den ersten 7 und 30 Tagen nach dem ersten Kauf eines Kunden anfällt? Berücksichtigen Sie außerdem den durchschnittlichen gesamten Lifetime Sales (LTV). Bitte schließen Sie Kunden mit null Lifetime Sales aus. Die 7- und 30-Tage-Intervalle sollten auf der exakten Anzahl von Stunden-Minuten-Sekunden basieren, nicht auf Kalendertagen.","external_knowledge":null}
{"instance_id":"local194","db":"sqlite-sakila","question":"Bitte geben Sie eine Liste der drei umsatzstärksten Filme für jeden Schauspieler an, zusammen mit dem durchschnittlichen Umsatz pro Schauspieler in diesen Filmen, berechnet, indem die Gesamteinnahmen des Films für jeden Film gleichmäßig auf die Schauspieler aufgeteilt werden.","external_knowledge":null}
{"instance_id":"local195","db":"sqlite-sakila","question":"Bitte ermitteln Sie, wie groß die Beliebtheit unserer fünf beliebtesten Schauspieler ist. Welchen Prozentsatz unserer Kunden haben Filme gemietet, in denen diese Schauspieler auftreten?","external_knowledge":null}
{"instance_id":"local196","db":"sqlite-sakila","question":"Für jede Bewertungskategorie des ersten vom Kunden gemieteten Films—wobei der erste Film anhand des frühesten Zahlungsdatums pro Kunde identifiziert wird—bitte geben Sie den durchschnittlichen Gesamtbetrag an, der pro Kunde ausgegeben wurde, sowie die durchschnittliche Anzahl der nachfolgenden Mietvorgänge (berechnet als die Gesamtzahl der Mietvorgänge minus eins) für Kunden, deren erster gemieteter Film in diese Bewertungskategorie fällt.","external_knowledge":null}
{"instance_id":"local197","db":"sqlite-sakila","question":"Unter unseren Top-10-Zahlungskunden können Sie die größte Veränderung der Zahlungsbeträge von einem Monat zum unmittelbar folgenden Monat identifizieren? Genauer gesagt, bestimmen Sie bitte, für welchen Kunden und in welchem Monat dieser maximale Monat-zu-Monat-Unterschied aufgetreten ist, und geben Sie die Differenz auf zwei Dezimalstellen gerundet an.","external_knowledge":null}
{"instance_id":"local199","db":"sqlite-sakila","question":"Könnten Sie für jedes Geschäft das Jahr und den Monat identifizieren, in dem die von den Mitarbeitenden des Geschäfts erstellten Mietaufträge am höchsten waren? Bitte listen Sie die Store-ID, das Jahr, den Monat und die Gesamtanzahl der Mietaufträge für diese Daten auf.","external_knowledge":null}
{"instance_id":"local201","db":"modern_data","question":"Die ersten zehn Wörter, alphabetisch sortiert, die 4 bis 5 Zeichen lang sind, mit dem Anfangsbuchstaben 'r' beginnen und mindestens ein Anagramm derselben Länge besitzen, wobei Groß- und Kleinschreibung berücksichtigt wird. Geben Sie die Anzahl solcher Anagramme pro Wort an.","external_knowledge":null}
{"instance_id":"local202","db":"city_legislation","question":"Für Alien-Daten: Wie viele der Top-10-Staaten nach der Alienbevölkerung haben einen höheren Anteil freundlicher Aliens als feindliche Aliens, bei einem durchschnittlichen Alienalter von über 200?","external_knowledge":null}
{"instance_id":"local209","db":"delivery_center","question":"Im Datensatz von Bestellungen, die mit Store-Informationen verknüpft sind, welches Geschäft hat die höchste Gesamtzahl an Bestellungen, und unter den Bestellungen dieses Geschäfts, wie groß ist das Verhältnis der Bestellungen, die in der deliveries-Tabelle mit dem Status 'DELIVERED' erscheinen, zur Gesamtzahl der Bestellungen dieses Geschäfts?","external_knowledge":null}
{"instance_id":"local210","db":"delivery_center","question":"Könnten Sie die Verteilzentren identifizieren, die von Februar bis März einen Anstieg der abgeschlossenen Aufträge um mehr als 20% verzeichneten?","external_knowledge":null}
{"instance_id":"local212","db":"delivery_center","question":"Können Sie 5 Lieferfahrer mit der höchsten durchschnittlichen Anzahl täglicher Lieferungen finden?","external_knowledge":null}
{"instance_id":"local218","db":"EU_soccer","question":"Kannst du den Median der höchsten Saisontore jedes Teams berechnen?","external_knowledge":null}
{"instance_id":"local219","db":"EU_soccer","question":"In jeder Liga, unter Berücksichtigung aller Saisons, welches einzelne Team hat die wenigsten Gesamtsiege, basierend auf dem Vergleich der Heim- und Auswärtstore, einschließlich Teams mit null Siegen, wobei sichergestellt wird, dass bei Gleichstand der wenigsten Siege pro Liga nur ein Team zurückgegeben wird.","external_knowledge":null}
{"instance_id":"local221","db":"EU_soccer","question":"Nenne mir die Top-10-Teams mit den meisten Siegen in der Liga.","external_knowledge":null}
{"instance_id":"local220","db":"EU_soccer","question":"Welcher Spieler hat an der höchsten Anzahl gewonnener Spiele teilgenommen und welcher Spieler an der höchsten Anzahl verlorener Spiele, wobei nur Spiele berücksichtigt werden, bei denen sie tatsächlich gespielt haben (ausgenommen Nullwerte) und bei denen ihr Team gewonnen oder verloren hat (Unentschieden ausgeschlossen)?","external_knowledge":null}
{"instance_id":"local228","db":"IPL","question":"Für jede IPL-Saison identifizieren Sie die drei besten Batsmen mit der höchsten Gesamtzahl erzielter Läufe und die drei besten Bowler mit den meisten Wickets, wobei Ausfälle durch 'run out', 'hit wicket' und 'retired hurt' ausgeschlossen werden. Bei Gleichständen bei Runs oder Wickets wird der Gleichstand durch die kleinere Spieler-ID aufgelöst. Geben Sie dann diese sechs Spieler in passenden Positionen aus - Batsman 1 mit Bowler 1, Batsman 2 mit Bowler 2 und Batsman 3 mit Bowler 3 - in aufsteigender Reihenfolge der Saison-ID aus, zusammen mit der jeweiligen Gesamtzahl der Runs oder Wickets jedes Spielers.","external_knowledge":null}
{"instance_id":"local229","db":"IPL","question":"Finde die IDs der Spieler, die die höchste Anzahl an Partnerschaftsläufen für jedes Spiel erzielt haben. Die Ausgabe sollte die IDs von zwei Spielern enthalten, jeweils mit ihren einzelnen Läufen und der Gesamt-Partnerschaftslaufzahl. Für jedes Paar gilt: Der Spieler mit der höheren einzelnen Laufzahl sollte als Spieler 1 aufgeführt werden, und der Spieler mit der niedrigeren Laufzahl als Spieler 2. In Fällen, in denen beide Spieler dieselbe Laufzahl haben, sollte der Spieler mit der höheren ID Spieler 1 sein, und der Spieler mit der niedrigeren ID Spieler 2. Es kann mehrere Zeilen für ein einzelnes Spiel geben.","external_knowledge":null}
{"instance_id":"local244","db":"music","question":"Berechne die Dauer jedes Tracks, klassifiziere sie als kurz, mittel oder lang, gib die minimale und maximale Zeit für jede Art an (in Minuten) und den Gesamtumsatz für jede Kategorie aus, gruppiert nach der Kategorie.","external_knowledge":"music_length_type.md"}
{"instance_id":"local253","db":"education_business","question":"Unter Verwendung eines Gehalts-Datensatzes, bei dem die Gehaltswerte bereinigt werden müssen, indem nicht-numerische Zeichen entfernt und in einen numerischen Typ konvertiert werden, schreiben Sie eine detaillierte SQL-Abfrage, die die Top-5-Unternehmen nach dem Durchschnittsgehalt in jeweils Mumbai, Pune, New Delhi und Hyderabad identifiziert, und anschließend das Durchschnittsgehalt jedes Unternehmens in diesen Städten mit dem landesweiten Durchschnittsgehalt vergleicht. Das Endergebnis sollte vier Spalten anzeigen: Location, Company Name, Average Salary in State und Average Salary in Country, wobei nur die Top-5-Unternehmen in jedem der angegebenen Standorte gelistet werden.","external_knowledge":null}
{"instance_id":"local258","db":"IPL","question":"Berechne die Gesamtzahl der vom Bowler erzielten Wickets (außer Run-outs und anderen Entlassungen, die nicht dem Bowler zugeschrieben werden), seine Economy-Rate (Gesamt zugelassene Runs geteilt durch insgesamt geworfene Overs, wobei nur Runs gezählt werden, die mit dem Schläger erzielt wurden, und Extras wie Wides und No-balls ignoriert werden), seine Strike-Rate (durchschnittliche Anzahl der Bälle pro Wicket) und seine beste Bowling-Leistung in einem einzelnen Spiel (das Spiel mit den meisten vom Bowler erzielten Wickets, formatiert als \"wickets-runs\", wobei Runs die zugelassenen Runs ohne Extras sind).","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local259","db":"IPL","question":"Für jeden Spieler liste seine/ihre ID, seinen/ihren Namen, seine/ihre häufigste Rolle über alle Partien, seine/ihre Schlaghand, Bowling-Fähigkeit, insgesamt erzielte Runs, insgesamt gespielte Partien, insgesamt ausgeschiedene Male, Batting Average (insgesamt Runs geteilt durch insgesamt Dismissals), höchste Punktzahl in einem einzelnen Match, die Anzahl der Partien, in denen er/sie mindestens 30 Runs erzielt hat, mindestens 50 Runs und mindestens 100 Runs erzielt hat, insgesamt gespielte Bälle in seiner/ihrer Karriere, Strike-Rate (insgesamt Runs geteilt durch insgesamt Balls faced, multipliziert mit 100), insgesamt erzielte Wickets, Economy-Rate (Durchschnitt Runs pro Over) und seine/ihre beste Bowling-Leistung in einem einzelnen Match (die meisten Wickets in einem Match, formatiert als \"wickets taken-runs given\", wobei die beste Leistung die mit den meisten Wickets ist, und bei Gleichstand die wenigsten Runs conceded). Ignoriere die Daten zu Extra Runs.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local262","db":"stacking","question":"Welche Probleme übersteigen die Gesamtzahl der Vorkommen in der Lösungstabelle, wenn man alle Vorkommen zählt, über die Schritte 1, 2 und 3 hinweg, wobei das Maximum des Testscores eines Nicht-\"Stack\"-Modells niedriger ist als der Testscore des \"Stack\"-Modells für denselben Schritt und dieselbe Version?","external_knowledge":null}
{"instance_id":"local263","db":"stacking","question":"Bestimmen Sie das L1_model, das jedem Modell zugeordnet ist (durch Namen und Version angegeben), das für jeden Status ('starker' oder 'weicher') am häufigsten vorkommt, zusammen mit der Anzahl der Vorkommen. Ein Modell hat einen 'starken' Status, wenn für jeden seiner Schritte das maximale Testscore unter den Modellen, die kein 'Stack'-Modell sind, geringer ist als der Testscore des 'Stack'-Modells. Es hat einen 'weichen' Status, wenn das maximale Testscore unter den Nicht-'Stack'-Modellen dem Testscore des 'Stack'-Modells entspricht. Zählen Sie, wie oft jedes L1_model einem 'starken'- oder 'weichen'-Status über alle Modelle hinweg zugeordnet wird, und bestimmen Sie, welches L1_model für jeden Status die höchste Auftretenshäufigkeit hat.","external_knowledge":null}
{"instance_id":"local264","db":"stacking","question":"Welche Modellkategorie (L1_model) kommt am häufigsten vor über alle Schritte und Versionen hinweg, wenn man traditionelle Modelle mit dem Stack-Modell vergleicht, und wie hoch ist die Gesamtanzahl seiner Vorkommen?","external_knowledge":null}
{"instance_id":"local269","db":"oracle_sql","question":"Was ist die durchschnittliche Gesamtmenge über alle endgültigen Verpackungskombinationen, wobei nur die Blatt-Ebene-Artikel innerhalb jeder Kombination berücksichtigt werden, nachdem alle verschachtelten Verpackungsbeziehungen vollständig erweitert wurden?","external_knowledge":null}
{"instance_id":"local270","db":"oracle_sql","question":"Welche Top-Level-Verpackungseinheiten, das heißt solche, die in keiner anderen Verpackung enthalten sind, haben irgendeinen Artikel, bei dem die Gesamtmenge, die über alle verschachtelten Ebenen der Hierarchie hinweg aufsummiert wird, 500 überschreitet, und wie lauten die Namen sowohl dieser Verpackungseinheiten als auch der entsprechenden Artikel?","external_knowledge":null}
{"instance_id":"local272","db":"oracle_sql","question":"Bestimmen Sie für die Bestellung 423 die Produkt-IDs, Gänge und Positionen, aus denen Sie die für jede Bestellzeile benötigten exakten Mengen entnehmen, wobei sichergestellt wird, dass die insgesamt entnommene Menge für jedes Produkt mit den kumulierten Bestellmengen übereinstimmt, ohne das verfügbare Inventar in Lager 1 zu überschreiten. Berechnen Sie die aus jedem Standort zu entnehmenden Mengen, indem Sie Vorräte mit früheren Kaufdaten und geringeren Mengen priorisieren, und stellen Sie sicher, dass das Picking die Reihenfolge und die kumulierten Mengen der Bestellzeilen für Produkte mit mehreren Einträgen berücksichtigt.","external_knowledge":null}
{"instance_id":"local273","db":"oracle_sql","question":"Berechnen Sie den durchschnittlichen Pick-Prozentsatz für jeden Produktnamen, wobei ein FIFO-Ansatz verwendet wird, der aus Lagerorten basierend auf dem frühesten Kaufdatum und der kleinsten verfügbaren Menge auswählt, wobei sichergestellt wird, dass die ausgewählte Menge nur den sich überschneidenden Bereich zwischen der für jede Bestellung erforderlichen Menge und der verfügbaren Menge des Inventars widerspiegelt, und anschließend die Ergebnisse nach Produktname gruppieren und sortieren?","external_knowledge":null}
{"instance_id":"local274","db":"oracle_sql","question":"Welche Produkte wurden für die Bestellung 421 ausgewählt, und wie hoch ist die durchschnittliche Anzahl der pro Produkt entnommenen Einheiten, unter Verwendung der FIFO-Methode (First-In, First-Out)?","external_knowledge":null}
{"instance_id":"local275","db":"oracle_sql","question":"Basierend auf monatlichen Verkaufsdaten, beginnend im Januar 2016, und unter Verwendung eines zentrierten gleitenden Durchschnitts zur Anpassung an die Saisonalität, welche Produkte wiesen ein saisonal bereinigtes Verkaufsverhältnis auf, das in jedem Monat des Jahres 2017 durchgehend über 2 lag?","external_knowledge":"calculation_method.md"}
{"instance_id":"local277","db":"oracle_sql","question":"Was ist der durchschnittlich prognostizierte Jahresumsatz für die Produkte 4160 und 7790 im Jahr 2018, unter Verwendung monatlicher Verkaufsdaten beginnend mit Januar 2016 für die ersten 36 Monate, unter Anwendung saisonaler Anpassungen von Zeitstufen 7 bis 30 und Einsatz einer gewichteten Regressionsmethode zur Schätzung des Umsatzes?","external_knowledge":"calculation_method.md"}
{"instance_id":"local279","db":"oracle_sql","question":"Unter Verwendung eines rekursiven monatlichen Bestandsanpassungsmodells, das von December 2018 Inventarständen ausgeht, bei dem wir ein Produkt nachbestellen, wenn sein Endbestand unter dem minimal erforderlichen Niveau liegt, bestimmen Sie für jedes Produkt den Monat im Jahr 2019, in dem der absolute Unterschied zwischen seinem Endbestand und dem minimal erforderlichen Niveau am kleinsten ist, und geben Sie den product_id, jenen Monat und den absoluten Unterschied zurück.","external_knowledge":null}
{"instance_id":"local283","db":"EU_soccer","question":"Analysieren Sie den Fußballspiel-Datensatz, um die Meistermannschaft jeder Saison über alle Länder und Ligen hinweg zu bestimmen, wobei pro Sieg 3 Punkte, pro Unentschieden 1 Punkt und pro Niederlage 0 Punkte vergeben werden. Für jede Saison geben Sie den Namen der Meistermannschaft, die Liga, das Land und die insgesamt erzielten Punkte zurück.","external_knowledge":null}
{"instance_id":"local284","db":"bank_sales_trading","question":"Für veg whsle data, kannst du eine Zusammenfassung der Verlustquoten unserer Artikel erstellen? Berücksichtige die durchschnittliche Verlustquote und unterteile außerdem die Anzahl der Artikel, die unterhalb, oberhalb und innerhalb einer Standardabweichung von diesem Durchschnitt liegen.","external_knowledge":null}
{"instance_id":"local285","db":"bank_sales_trading","question":"Für veg whsle data, kannst du unsere finanzielle Leistung über die Jahre 2020 bis 2023 analysieren? Ich benötige Einblicke in den durchschnittlichen Großhandelspreis, den maximalen Großhandelspreis, den minimalen Großhandelspreis, die Differenz der Großhandelspreise, den Gesamtgroßhandelspreis, den Gesamtverkaufspreis, die durchschnittliche Verlustquote, den Gesamtverlust und den Gewinn für jede Kategorie innerhalb jedes Jahres. Runde alle berechneten Werte auf zwei Nachkommastellen.","external_knowledge":null}
{"instance_id":"local286","db":"electronic_sales","question":"Erstellen Sie einen umfassenden Leistungsbericht über unsere Verkäufer, der sich auf den Gesamtumsatz, den durchschnittlichen Artikelpreis, die durchschnittlichen Bewertungen und die Verpackungszeiten konzentriert. Stellen Sie sicher, dass der Bericht nur diejenigen Verkäufer umfasst, die mehr als 100 Produkte verkauft haben, und heben Sie die Produktkategorienamen in Englisch mit dem höchsten Verkaufsvolumen hervor.","external_knowledge":null}
{"instance_id":"local301","db":"bank_sales_trading","question":"Für wöchentliche Verkaufsdaten benötige ich eine Analyse unserer Verkaufsleistung rund um Mitte Juni für die Jahre 2018, 2019 und 2020. Konkret soll die prozentuale Veränderung des Umsatzes zwischen den vier Wochen vor dem 15. Juni und den vier Wochen nach dem 15. Juni für jedes Jahr berechnet werden.","external_knowledge":null}
{"instance_id":"local302","db":"bank_sales_trading","question":"Analysieren Sie die durchschnittliche prozentuale Veränderung des Umsatzes zwischen den 12 Wochen vor und nach June 15, 2020 für jeden Attributtyp: Region, Plattform, Altersgruppe, Demografie und Kundentyp. Für jeden Attributtyp berechnen Sie die durchschnittliche prozentuale Veränderung des Umsatzes über alle seine Attributwerte. Identifizieren Sie den Attributtyp mit dem größten negativen Einfluss auf den Umsatz und geben Sie dessen durchschnittliche prozentuale Veränderung des Umsatzes an.","external_knowledge":null}
{"instance_id":"local329","db":"log","question":"Wie viele eindeutige Sitzungen haben die /regist/input-Seite und danach die /regist/confirm-Seite in dieser Reihenfolge besucht?","external_knowledge":null}
{"instance_id":"local330","db":"log","question":"Unter Verwendung der Aktivitätslog-Tabelle berechnen Sie die Gesamtzahl der eindeutigen Benutzersitzungen, in denen jede Webseite entweder als Einstiegsseite (die erste in einer Sitzung anhand des Zeitstempels besuchte Seite) oder als Ausstiegsseite (die zuletzt in einer Sitzung anhand des Zeitstempels besuchte Seite) oder beides erscheint. Zählen Sie jede Sitzung pro Seite nur einmal, auch wenn die Seite für diese Sitzung sowohl als Einstiegsseite als auch als Ausstiegsseite dient.","external_knowledge":null}
{"instance_id":"local331","db":"log","question":"Welche drei unterschiedlichen Drittseitenbesuche treten am häufigsten unmittelbar nach zwei aufeinanderfolgenden Besuchen der '/detail' Seite auf, und wie oft tritt jeder dieser Drittseitenbesuche auf?","external_knowledge":null}
{"instance_id":"local358","db":"log","question":"Wie viele Benutzer gibt es in jeder Alterskategorie (20er, 30er, 40er, 50er und andere)?","external_knowledge":null}
{"instance_id":"local360","db":"log","question":"Für jede Benutzersitzung in der Aktivitätsprotokoll-Tabelle ermitteln Sie die Anzahl der Ereignisse, die vor dem ersten '/detail' Klick oder '/complete' Konversion aufgetreten sind, wobei nur Ereignisse gezählt werden, die einen nicht leeren Suchtyp haben. Finden Sie die Sitzungen mit der minimalen Anzahl solcher Vor-Klick-/Vor-Konversions-Ereignisse. Falls mehrere Sitzungen dieselbe minimale Anzahl teilen, schließen Sie alle in die Ergebnisse ein. Geben Sie jede qualifizierte Sitzung zusammen mit dem entsprechenden Pfad und Suchtyp zurück.","external_knowledge":null}
{"instance_id":"local344","db":"f1","question":"Unter Berücksichtigung aller Rennen, bei denen Boxenstoppdaten verfügbar sind, und mit Fokus auf Fälle, in denen ein Fahrer in der vorherigen Runde nicht hinter einem anderen Auto war, aber in der aktuellen Runde dahinter liegt, wie oft ist jede Art von Überholung in der Formel 1 aufgetreten?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local336","db":"f1","question":"In den ersten fünf Runden des Rennens, wie viele Überholmanöver gab es in jeder Kategorie — Ausfälle, Boxenstopps, startbezogene Überholmanöver und reguläre Überholmanöver auf der Strecke?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local335","db":"f1","question":"In Formel-1-Saisons seit 2001, wobei nur Fahrer berücksichtigt werden, die in einer Saison Punkte erzielt haben, welche fünf Konstrukteure hatten die meisten Saisons, in denen ihre Fahrer die wenigsten Gesamtpunkte unter allen punktenden Fahrern in dieser Saison erzielten?","external_knowledge":null}
{"instance_id":"local309","db":"f1","question":"Für jedes Jahr, welcher Fahrer und welcher Konstrukteur haben die meisten Punkte erzielt? Ich möchte den vollständigen Namen jedes Fahrers.","external_knowledge":null}
{"instance_id":"local310","db":"f1","question":"Verwenden Sie nur die Daten aus der ‘results’-Tabelle, ermitteln Sie die drei Jahre, in denen die Summe aus der höchsten vom Fahrer erzielten Gesamtpunktzahl und der höchsten vom Konstrukteur erzielten Gesamtpunktzahl in jenem Jahr (beide berechnet durch das Aufsummieren der Punkte aus der ‘results’-Tabelle) am kleinsten ist, und listen Sie diese drei Jahre in aufsteigender Reihenfolge der Gesamtsumme auf.","external_knowledge":null}
{"instance_id":"local311","db":"f1","question":"Welche Konstrukteure hatten die Top-3 der kombinierten Punkte ihres besten Fahrers und Teams, und in welchen Jahren haben sie diese erreicht?","external_knowledge":null}
{"instance_id":"local354","db":"f1","question":"Unter Formel-1-Fahrern, die in den 1950er-Jahren Formel-1-Rennen bestritten haben, welche Fahrer haben in jenem Jahrzehnt eine Saison beendet, in der sie sowohl im ersten als auch im letzten Rennen, an dem sie teilgenommen haben, mit dem gleichen Konstrukteur gefahren sind, und zudem an mindestens zwei unterschiedlichen Rennläufen dieser Saison teilgenommen haben?","external_knowledge":null}
{"instance_id":"local355","db":"f1","question":"Berechnen Sie den Gesamtdurchschnitt der ersten verpassten Rennen und den Gesamtdurchschnitt der letzten verpassten Rennen, die von Formel-1-Fahrern über alle Jahre verpasst wurden. Berücksichtigen Sie nur Fahrer, die in einem bestimmten Jahr weniger als drei Rennen verpasst haben und zwischen ihren Auftritten unmittelbar davor und danach die Teams gewechselt haben (d. h. die Konstruktor-ID für das Rennen unmittelbar vor ihrem ersten verpassten Rennen muss sich von der Konstruktor-ID für das Rennen unmittelbar nach ihrem letzten verpassten Rennen in jenem Jahr unterscheiden). Gruppieren Sie die Ergebnisse nicht nach Jahr; geben Sie lediglich die Gesamtdurchschnittswerte über den gesamten Datensatz zurück.","external_knowledge":null}
{"instance_id":"local356","db":"f1","question":"Geben Sie die vollständigen Namen der Fahrer an, die auf der Strecke öfter überholt wurden als sie andere auf der Strecke während Rennrunden überholt haben, ausgenommen Positionswechsel aufgrund von Boxenstopps (sowohl beim Boxeneintritt als auch beim Boxenausstieg), Ausfälle oder Positionswechsel, die während der ersten Runde eines Rennens aufgetreten sind (als Startbewegungen betrachtet).","external_knowledge":null}
{"instance_id":"sf001","db":"GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI","question":"Angenommen, heute ist April 1, 2024, möchte ich die täglichen Schneefallmengen, die größer als 6 inches sind, für jede US-Postleitzahl während der Woche wissen, die am Ende der ersten beiden vollen Wochen des Vorjahres endet. Zeigen Sie die Postleitzahl, das Datum und die Schneefallmenge.","external_knowledge":null}
{"instance_id":"sf003","db":"GLOBAL_GOVERNMENT","question":"Für jedes Jahr von 2015 bis 2020, welches Census ZIP-Code-Tabulationsgebiet die zweitgrößte jährliche Bevölkerungswachstumsrate aufwies? Schließen Sie nur Gebiete ein, die in diesem Jahr eine Bevölkerungsabschätzung von mindestens 25.000 Personen aufweisen (basierend auf den 5-Jahres-Schätzungen der American Community Survey). Für jedes Jahr geben Sie die ZIP-Code, die Staatsabkürzung und die jährliche Wachstumsrate in Prozent an.","external_knowledge":null}
{"instance_id":"sf002","db":"FINANCE__ECONOMICS","question":"Stand: 31. Dezember 2022, Listen Sie die Top-10 aktiven Banken mit Vermögenswerten von über $10 Milliarden auf, sortiert nach dem höchsten Anteil unversicherter Vermögenswerte, wobei der Prozentsatz als eins minus dem Wert der Variable '% Insured (Estimated)' aus vierteljährlichen Schätzungen berechnet wird. Geben Sie die Namen dieser Banken und deren jeweilige Anteile an unversicherten Vermögenswerten an.","external_knowledge":null}
{"instance_id":"sf044","db":"FINANCE__ECONOMICS","question":"Wie groß war die prozentuale Veränderung der nachbörslichen Schlusskurse der Magnificent 7-Technologieunternehmen vom 1. Januar bis zum 30. Juni 2024?","external_knowledge":null}
{"instance_id":"sf006","db":"FINANCE__ECONOMICS","question":"Für jeden US-Bundesstaat ermitteln Sie, wie sich die Anzahl der aktiven Finanzfilialen von March 1, 2020, bis December 31, 2021 verändert hat. Eine Einheit gilt an einem bestimmten Datum als aktiv, wenn ihr Startdatum auf oder vor diesem Datum liegt und ihr Enddatum entweder null ist oder auf oder nach diesem Datum liegt. Für jeden Staat berechnen Sie die Anzahl der aktiven Einheiten am March 1, 2020, die Anzahl der aktiven Einheiten am December 31, 2021 und die prozentuale Veränderung dieser Zählwerte.","external_knowledge":null}
{"instance_id":"sf008","db":"US_REAL_ESTATE","question":"Bestimmen Sie die prozentuale Veränderung des Bruttoeinnahmenzuflusses und des saisonbereinigten Kaufpreisindex für Immobilien, der nur Käufe berücksichtigt, für die Metropolregion Phoenix-Mesa-Scottsdale, AZ, vom 1. Januar 2023 bis zum 31. Dezember 2023. Der Bruttoeinnahmenzufluss bezieht sich auf das insgesamt bereinigte Bruttoeinkommen aller Finanzinstitute innerhalb der angegebenen Metropolregion.","external_knowledge":null}
{"instance_id":"sf010","db":"US_REAL_ESTATE","question":"Was sind die kumulativen Anteile der Hypotheken, die in Kalifornien nahe dem Ausfall stehen, für jedes aufgezeichnete Datum im Jahr 2023, einschließlich solcher, die 90 bis 180 Tage im Verzug sind, sich in Stundung befinden oder sich in Zwangsvollstreckungsverfahren, Insolvenz- oder Abtretungsverfahren befinden?","external_knowledge":null}
{"instance_id":"sf037","db":"US_REAL_ESTATE","question":"Wie können wir die kürzeste Luftlinienentfernung in Meilen zwischen jedem 'The Home Depot'-Laden und seinem nächsten 'Lowe's Home Improvement'-Standort finden? Verwenden Sie die US_REAL_ESTATE.CYBERSYN-Datenbank, verknüpfen Sie die Tabelle point_of_interest_index mit point_of_interest_addresses_relationships und us_addresses, um geografische Koordinaten zu erhalten. Für jeden 'The Home Depot'-Standort (identifiziert durch seine poi_id) berechnen Sie den Abstand zu allen 'Lowe's Home Improvement'-Filialen mithilfe der Funktionen ST_DISTANCE und ST_MAKEPOINT, konvertieren Sie den Abstand von Metern in Meilen (durch Division durch 1609), und geben Sie nur den Datensatz mit dem minimalen Abstand für jeden 'The Home Depot'-Standort zurück, unter Verwendung von QUALIFY mit ROW_NUMBER().","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf012","db":"WEATHER__ENVIRONMENT","question":"Unter Verwendung von Daten aus dem FEMA National Flood Insurance Program Claim Index, für jedes Jahr von 2010 bis 2019, wie hoch waren die gesamten Gebäudeschadensbeträge und die gesamten Inhaltschadensbeträge, die im National Flood Insurance Program für die NFIP-Gemeinde mit dem Namen 'City Of New York' gemeldet wurden, aufgeschlüsselt nach dem jeweiligen Schadenjahr?","external_knowledge":null}
{"instance_id":"sf018","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Untersuchen Sie das Nutzerengagement mit Push-Benachrichtigungen innerhalb eines festgelegten einstündigen Fensters am June 1, 2023.","temporal":"Yes","external_knowledge":"PushNotificationAnalysis.md"}
{"instance_id":"sf035","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Wie viele eindeutige Benutzer haben an jedem Tag Sitzungen innerhalb jeder App-Gruppe zwischen dem 1. Juni 2023 und dem 7. Juni 2023 gestartet? Zeigen Sie außerdem die App-Gruppe-ID und den Starttag der Sitzung an.","external_knowledge":null}
{"instance_id":"sf029","db":"AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET","question":"Generieren Sie einen täglichen detaillierten Verkaufsbericht für jedes Produkt unter der 'Manufacturing' distributor_view, der die 30 Tage leading up to February 6, 2022 abdeckt, indem die Verkaufs-, Traffic-, Bestands- und net PPM-Daten anhand von date, ASIN, program, period und distributor_view zusammengeführt werden. Der Bericht muss Folgendes enthalten: total ordered units, ordered revenue, average selling price, glance views, conversion rate, shipped units, shipped revenue, average net PPM, average procurable product OOS, total on-hand units and value, net received units and value, open purchase order quantities, unfilled customer ordered units, und average vendor confirmation rate, receive fill rate, sell-through rate, und vendor lead time.","external_knowledge":null}
{"instance_id":"sf040","db":"US_ADDRESSES__POI","question":"Finde die 10 nördlichsten Adressen im größten Postleitzahlengebiet Floridas. Was sind ihre Hausnummern, Straßennamen und Typen?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf009","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Ein Immobilienunternehmen benötigt eine detaillierte Gegenüberstellung der Gebäude in Amsterdam und Rotterdam. Es wird ein Bericht benötigt, der jede Gebäudeklasse und Unterklasse zeigt, mit der Gesamtfläche (in Quadratmetern) und der Gesamtanzahl der Gebäude für jede Klassifikationskategorie in beiden Städten. Die Daten sollten nach Gebäudeklasse und Unterklasse in aufsteigender Reihenfolge geordnet werden, wobei die Statistiken von Amsterdam und Rotterdam in parallelen Spalten dargestellt werden, um einen direkten Vergleich zu erleichtern. Können Sie diesen umfassenden Bericht zum Vergleich der Gebäudeklassen erstellen?","external_knowledge":null}
{"instance_id":"sf013","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Vergleichen Sie die Gesamtlänge der Straßen in Amsterdam und Rotterdam, indem Sie eine Gegenüberstellung beider Städte erstellen. Für jede Kombination aus Straßentyp (Klasse) und Unterklasse berechnen Sie die Gesamtlänge der Straßen (in Metern), die speziell für die QUADKEY-Segmente '12020210' und '12020211' gilt. Präsentieren Sie die Ergebnisse mit Spalten für Klasse, Unterklasse, Straßenlängen in Amsterdam und Straßenlängen in Rotterdam.","external_knowledge":null}
{"instance_id":"sf041","db":"YES_ENERGY__SAMPLE_DATA","question":"Erstellen Sie einen Bericht für ERCOT zum 1. Oktober 2022, der stündliche Daten zu Day-Ahead- und Real-Time-Preisen von Knoten-ID 10000697078, Lastprognosen (datatypeid 19060) und tatsächliche Lasten sowie Wind (forecast datatypeid 9285, actual datatypeid 16) und Solar (forecast datatypeid 662, actual datatypeid 650) Erzeugungsprognosen und -werte von Objekt-ID 10000712973 kombiniert. Dieser Bericht sollte Zeitzonenabgleiche, Spitzenklassifikationen und Netzlastberechnungen enthalten und Einblicke in die täglichen betrieblichen Dynamiken und die Effizienz liefern.","temporal":"Yes","external_knowledge":"ERCOT_Daily_Market_Dynamics_Report.md"}
{"instance_id":"sf011","db":"CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE","question":"Bestimmen Sie die Bevölkerungsverteilung innerhalb jeder Blockgruppe relativ zu ihrem Zensus-Trakt im Bundesstaat New York anhand der ACS-Daten von 2021. Geben Sie Blockgruppen-ID, Zensuswert, Trakt-ID des Staates/Kreises, Gesamtbevölkerung des Trakts und das Bevölkerungsverhältnis jeder Blockgruppe an.","external_knowledge":null}
{"instance_id":"sf014","db":"CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE","question":"Was ist der ZIP-Code des Bundesstaates New York mit der höchsten Anzahl von Pendlern, die über eine Stunde reisen, gemäß den ACS-Daten von 2021? Geben Sie den ZIP-Code, die Gesamtzahl der Pendler, den staatlichen Benchmark für diese Dauer und die Staatsbevölkerung an.","external_knowledge":null}
