{"instance_id":"bq011","db":"ga4","question":"Quantos pseudo-usuários distintos tiveram tempo de engajamento positivo no período de 7 dias encerrado em January 7, 2021 at 23:59:59, mas não tiveram tempo de engajamento positivo no período de 2 dias encerrado na mesma data (January 7, 2021 at 23:59:59)?","external_knowledge":"ga4_obfuscated_sample_ecommerce.events.md"}
{"instance_id":"bq010","db":"ga360","question":"Encontre o produto mais vendido entre os clientes que compraram 'Youtube Men’s Vintage Henley' em julho de 2017, excluindo o próprio produto.","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq009","db":"ga360","question":"Qual é a fonte de tráfego que teve a maior receita total de transações no ano de 2017, e qual é a diferença em milhões (arredondada para duas casas decimais) entre a receita total mensal mais alta e a menor para essa fonte de tráfego?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq001","db":"ga360","question":"Para cada visitante que tenha realizado pelo menos uma transação em fevereiro de 2017, quantos dias se passaram entre a data de sua primeira visita em fevereiro e a data de sua primeira transação em fevereiro, e em que tipo de dispositivo essa primeira transação foi realizada?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq002","db":"ga360","question":"Durante a primeira metade de 2017, focando na receita do produto hits, qual fonte de tráfego gerou a maior receita total do produto, e quais foram as receitas máximas diárias, semanais e mensais do produto (em milhões) para essa fonte de melhor desempenho ao longo desse período?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq003","db":"ga360","question":"Entre 1 de abril e 31 de julho de 2017, usando os dados de receita do produto hits juntamente com os totais de transações para classificar sessões como compra (transactions ≥ 1 and productRevenue not null) ou não-compra (transactions null and productRevenue null), compare a média de visualizações de página por visitante para cada grupo por mês","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq004","db":"ga360","question":"Em julho de 2017, entre todos os visitantes que compraram qualquer produto relacionado ao YouTube, qual produto distinto — excluindo aqueles que contêm 'YouTube' no nome do produto — teve a maior quantidade total comprada?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq008","db":"ga360","question":"Em janeiro de 2017, entre os visitantes cujo nome da campanha contenha 'Data Share' e que acessaram qualquer página que comece com '/home', qual página eles visitaram com mais frequência em seguida, e qual foi o tempo máximo (em segundos) que eles passaram na página '/home' antes de seguir em frente?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq269","db":"ga360","question":"Entre 1 de junho de 2017 e 31 de julho de 2017, considere apenas sessões que tenham visualizações de página não nulas. Classifique cada sessão como ‘purchase’ se possuir pelo menos uma transação, ou ‘non_purchase’ caso contrário. Para cada mês, some as visualizações de página totais de cada visitante sob cada classificação, em seguida calcule a média de visualizações de página por visitante para os grupos de purchase e non_purchase em cada mês, e apresente os resultados lado a lado.","external_knowledge":null}
{"instance_id":"bq268","db":"ga360","question":"Identifique o maior número de dias entre a primeira visita e o último evento registrado (ou a última visita ou a primeira transação) para um usuário, em que o último evento registrado está associado a um dispositivo móvel. O último evento registrado pode ser a última visita ou a primeira transação, e você deve focar nos usuários cujo último evento registrado ocorreu em um dispositivo móvel.","external_knowledge":null}
{"instance_id":"bq270","db":"ga360","question":"Quais foram as taxas mensais de adição ao carrinho e de conversão de compra, calculadas como uma porcentagem das visualizações da página de detalhes do produto, de janeiro a março de 2017?","external_knowledge":"ga360_hits.eCommerceAction.action_type.md"}
{"instance_id":"bq275","db":"ga360","question":"Quais IDs de visitante pertencem a usuários cuja primeira transação ocorreu em um dispositivo rotulado explicitamente como 'mobile' em uma data posterior à primeira visita deles?","external_knowledge":null}
{"instance_id":"bq374","db":"ga360","question":"Calcula a porcentagem de novos usuários que, entre August 1, 2016, e April 30, 2017, permaneceram no site por mais de 5 minutos durante a visita inicial e fizeram uma compra em uma visita subsequente em qualquer momento posterior, em relação ao número total de novos usuários no mesmo período.","external_knowledge":null}
{"instance_id":"sf_bq029","db":"PATENTS","question":"Obtenha a média do número de inventores por patente e a contagem total de publicações de patentes no Canadá (CA) para cada período de 5 anos de 1960 a 2020, com base nas datas de publicação. Inclua apenas patentes que tenham pelo menos um inventor listado e agrupe os resultados por intervalos de 5 anos (1960-1964, 1965-1969, etc.).","external_knowledge":null}
{"instance_id":"sf_bq026","db":"PATENTS","question":"Para o titular que foi o mais ativo na categoria de patentes 'A61', gostaria de saber os cinco códigos de jurisdição de patentes onde ele registrou mais patentes durante o seu ano de maior atividade, separados por vírgulas.","external_knowledge":null}
{"instance_id":"sf_bq091","db":"PATENTS","question":"Em que ano o titular com o maior número de pedidos na categoria de patentes 'A61' apresentou o maior número de pedidos?","external_knowledge":null}
{"instance_id":"sf_bq099","db":"PATENTS","question":"Para a classe de patentes A01B3, quero analisar as informações dos 3 principais cessionários com base no número total de pedidos. Por favor, forneça as cinco informações a seguir: o nome deste cessionário, o número total de pedidos, o ano com mais pedidos, o número de pedidos nesse ano e o código do país com o maior número de pedidos durante esse ano.","external_knowledge":null}
{"instance_id":"sf_bq033","db":"PATENTS","question":"Quantas publicações dos EUA relacionadas à IoT (em que o resumo inclua a frase 'internet of things') foram arquivadas em cada mês entre 2008 e 2022, incluindo meses sem arquivamentos?","external_knowledge":null}
{"instance_id":"sf_bq209","db":"PATENTS","question":"Você pode calcular o número de patentes de utilidade que foram concedidas em 2010 e que possuem exatamente uma citação subsequente dentro de uma janela de 10 anos após a data de depósito/entrada do pedido da própria patente? Para esta análise, as citações subsequentes devem ser contadas como números de pedidos citantes distintos que citaram a patente dentro de 10 anos após a data de depósito da própria patente.","external_knowledge":null}
{"instance_id":"sf_bq027","db":"PATENTS","question":"Para patentes concedidas entre 2010 e 2018, forneça o número de publicação de cada patente e o número de citações retroativas que ela recebeu na categoria SEA.","external_knowledge":null}
{"instance_id":"sf_bq210","db":"PATENTS","question":"Quantas patentes B2 dos EUA concedidas entre 2008 e 2018 contêm reivindicações que não incluem a palavra 'claim'?","external_knowledge":null}
{"instance_id":"sf_bq211","db":"PATENTS","question":"Entre patentes concedidas entre 2010 e 2023 em CN, quantas delas pertencem a famílias que têm um total de mais de uma solicitação distinta?","external_knowledge":null}
{"instance_id":"sf_bq213","db":"PATENTS","question":"Qual é o código IPC de 4 dígitos mais comum entre patentes de utilidade dos EUA com B2 concedidas de junho a agosto de 2022?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq212","db":"PATENTS","question":"Para patentes de utilidade dos Estados Unidos sob a classificação B2 concedidas entre junho e setembro de 2022, identifique o código IPC de 4 dígitos mais frequente para cada patente. Em seguida, liste os números de publicação e os códigos IPC4 das patentes onde esse código aparece 10 ou mais vezes.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq214","db":"PATENTS_GOOGLE","question":"Para patentes de utilidade dos Estados Unidos sob a classificação B2 concedidas entre 2010 e 2014, encontre aquela com o maior número de citações subsequentes dentro de um mês a partir da data de depósito, e identifique a patente mais semelhante do mesmo ano de depósito, independentemente do seu tipo.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq216","db":"PATENTS_GOOGLE","question":"Identifique as cinco principais patentes depositadas no mesmo ano de `US-9741766-B2` que sejam as mais semelhantes a ela com base em semelhanças tecnológicas. Por favor, forneça os números de publicação.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq247","db":"PATENTS_GOOGLE","question":"Do conjunto de dados de publicações, identifique primeiro as seis famílias com mais publicações, cujo family_id não seja '-1'. Em seguida, usando a tabela abs_and_emb (unida em publication_number), forneça os IDs de cada uma dessas famílias, juntamente com todos os resumos não vazios associados às suas publicações.","external_knowledge":null}
{"instance_id":"sf_bq127","db":"PATENTS_GOOGLE","question":"Para cada família de publicação cuja primeira publicação ocorreu em janeiro de 2015, forneça a data da primeira publicação, os números de publicação distintos, seus códigos de país, os códigos CPC e IPC distintos, as famílias distintas (ou seja, os identificadores) que citam e são citadas por essa família de publicação. Apresente todas as listas como valores separados por vírgula, ordenados alfabeticamente","external_knowledge":null}
{"instance_id":"sf_bq215","db":"PATENTS","question":"Qual patente dos EUA (com um código de tipo B2 e uma data de concessão entre 2015 e 2018) tem a maior pontuação de originalidade calculada como 1 - (a soma dos quadrados das ocorrências de códigos IPC de 4 dígitos distintos em suas citações retroativas dividida pelo quadrado do total de ocorrências desses códigos IPC de 4 dígitos)?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq222","db":"PATENTS","question":"Encontre as áreas de tecnologia CPC na Alemanha que apresentaram a maior média móvel exponencial (fator de suavização 0,1) de pedidos de patente por ano, especificamente para patentes concedidas em dezembro de 2016. Para cada grupo CPC no nível 4, mostre o título completo, o grupo CPC e o ano com a maior média móvel exponencial de pedidos de patente.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq221","db":"PATENTS","question":"Identifique as áreas de tecnologia CPC com a maior média móvel exponencial de pedidos de patente em cada ano (com um fator de suavização de 0,2), considerando apenas o primeiro código CPC para cada patente que possua uma data de depósito válida e um número de pedido não vazio, e reporte o título completo do CPC juntamente com o melhor ano associado à maior média móvel exponencial para cada grupo de CPC no nível 5.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq223","db":"PATENTS","question":"Quais cessionários, excluindo a própria DENSO CORP, citaram patentes atribuídas à DENSO CORP, e quais são os títulos das subclasses CPC primárias associadas a essas citações? Forneça o nome de cada cessionário citante (excluindo DENSO CORP), o título completo da subclasse CPC primária (com base no primeiro código CPC) e a contagem de citações agrupadas pelo cessionário citante e pelo título da subclasse CPC. Garanta que apenas citações de patentes com datas de depósito válidas sejam consideradas, e concentre-se no primeiro código CPC de cada patente citada. Os resultados devem excluir especificamente a DENSO CORP como cessionário citante.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq420","db":"PATENTS_USPTO","question":"Você pode identificar as 5 principais patentes que foram inicialmente rejeitadas sob a seção 101 sem reivindicações permitidas, com base no comprimento de suas reivindicações concedidas? As patentes devem ter sido concedidas nos EUA entre 2010 e 2023. Além disso, certifique-se de selecionar a data da primeira ação do escritório para cada pedido. Por favor, inclua seus números de primeira publicação, juntamente com suas datas de primeira publicação, o comprimento das reivindicações apresentadas e as datas de concessão.","external_knowledge":null}
{"instance_id":"sf_bq207","db":"PATENTS_USPTO","question":"Você poderia fornecer os números de publicação mais antigos, os números de aplicação correspondentes, os números de reivindicação e as contagens de palavras para as 100 principais reivindicações de patente independentes, com base na maior contagem de palavras, recuperados a partir de estatísticas de reivindicações dentro de uspto_oce_claims (filtrados por ind_flg='1'), correspondidos com seus números de publicação de uspto_oce_claims match, e ainda unidos com patents publications para garantir que apenas a publicação mais antiga para cada aplicação seja incluída, ordenados pela contagem de palavras em ordem decrescente e limitados aos resultados top 100?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq128","db":"PATENTSVIEW","question":"Recupere as seguintes informações para patentes dos EUA apresentadas entre 1 de janeiro de 2014 e 1 de fevereiro de 2014. O título da patente e o resumo. A data de publicação da patente. O número de citações retroativas para cada patente (ou seja, o número de patentes citadas pela patente atual antes de sua data de depósito). O número de citações subsequentes para cada patente dentro dos primeiros 5 anos após a sua publicação (ou seja, o número de patentes que citaram a patente atual dentro de 5 anos após a sua publicação). Para cada patente, assegure-se de que as citações subsequentes sejam contadas apenas para citações dentro de 5 anos após a data de publicação, e as citações retroativas sejam contadas para citações anteriores à data de depósito.","external_knowledge":"forward_backward_citation.md"}
{"instance_id":"sf_bq246","db":"PATENTSVIEW","question":"Recupere patentes dos EUA com o número de citações subsequentes dentro dos primeiros 3 anos após a data de depósito da patente (ou seja, patentes que citam a patente atual dentro de 3 anos). Inclua apenas patentes com citações anteriores dentro de 1 ano antes da data de depósito e citações subsequentes dentro de 1 ano após a data de depósito. A consulta deve focalizar em categorias CPC específicas, classificar os resultados por citações anteriores em ordem decrescente e retornar a patente com o maior número de citações anteriores, limitando a um resultado.","external_knowledge":null}
{"instance_id":"sf_bq052","db":"PATENTSVIEW","question":"Recupere as seguintes informações para patentes dos EUA: o ID da patente, o título e a data de depósito. O número de citações retroativas dentro de 1 mês antes da data de depósito (ou seja, patentes que citaram a patente atual antes do seu depósito). O número de citações futuras dentro de 1 mês após a data de depósito (ou seja, patentes que citaram a patente atual após o seu depósito). O texto do resumo da patente. Inclua apenas patentes que pertençam a categorias CPC específicas, como a subseção `C05` ou o grupo `A01G`. A consulta deve filtrar patentes para incluir apenas aquelas que tenham pelo menos uma citação retroativa ou uma citação futura no período de 1 mês especificado. Ordene os resultados pela data de depósito e retorne todos os registros correspondentes.","external_knowledge":null}
{"instance_id":"sf_bq036","db":"GITHUB_REPOS","question":"Qual foi o número médio de commits feitos no GitHub por mês em 2016 para repositórios que contêm código Python?","external_knowledge":null}
{"instance_id":"sf_bq100","db":"GITHUB_REPOS","question":"Como podemos identificar os 10 pacotes mais usados com maior frequência no conteúdo de repositórios do GitHub observando declarações de importação entre parênteses, dividindo importações que ocupam várias linhas, extraindo os nomes dos pacotes que aparecem entre aspas duplas, contando com que frequência esses pacotes aparecem, ignorando quaisquer resultados nulos e, por fim, ordenando-os em ordem decrescente de frequência? A resposta final deve remover as aspas.","external_knowledge":null}
{"instance_id":"sf_bq101","db":"GITHUB_REPOS","question":"Do conteúdo dos repositórios do GitHub, como podemos identificar os 10 nomes de pacotes importados com maior frequência em arquivos-fonte Java, dividindo o conteúdo de cada arquivo em linhas, filtrando por declarações de import válidas, extraindo apenas a parte do pacote usando uma expressão regular adequada, agrupando pelos nomes de pacote extraídos, contando suas ocorrências e, por fim, retornando os 10 pacotes que aparecem com mais frequência, em ordem decrescente de frequência?","external_knowledge":null}
{"instance_id":"sf_bq182","db":"GITHUB_REPOS_DATE","question":"Quais linguagens de programação principais, determinadas pelo maior número de bytes em cada repositório, tiveram pelo menos 5 PullRequestEvents em January 18, 2023, em todos os seus repositórios?","external_knowledge":null}
{"instance_id":"sf_bq217","db":"GITHUB_REPOS_DATE","question":"Em 18 de janeiro de 2023, quantos eventos de criação de pull request ocorreram em repositórios do GitHub que incluam JavaScript como uma de suas linguagens de programação? Use dados da tabela githubarchive para os eventos e da tabela languages para as informações sobre as linguagens de programação dos repositórios.","external_knowledge":null}
{"instance_id":"sf_bq191","db":"GITHUB_REPOS_DATE","question":"A partir dos dados do GitHub WatchEvent de 2017, encontre os dois principais repositórios que têm mais de 300 observadores distintos, assegurando que os resultados estejam unidos com a tabela 'sample_files' para que possamos retornar o nome de cada repositório juntamente com a sua contagem de observadores distintos, e limite a saída aos dois repositórios com as maiores contagens de observadores.","external_knowledge":null}
{"instance_id":"sf_bq224","db":"GITHUB_REPOS_DATE","question":"Qual repositório com uma licença aprovada em `licenses.md` teve o maior total combinado de forks, issues e watches em abril de 2022?","external_knowledge":null}
{"instance_id":"sf_bq192","db":"GITHUB_REPOS_DATE","question":"Encontre o repositório Python mais ativo no GitHub com base no número de observadores, issues e forks. A consulta deve selecionar repositórios com licenças de código aberto específicas (`artistic-2.0`, `isc`, `mit`, `apache-2.0`), contar observadores distintos, eventos de issues e forks para cada repositório em abril de 2022, e incluir apenas aqueles com arquivos `.py` na ramificação `master`. Join os dados de licenças com as contagens de observadores, eventos de issues e contagens de forks, then sort by a combined metric of forks, issues, and observadores, returning o nome e a contagem do repositório mais ativo.","external_knowledge":null}
{"instance_id":"sf_bq225","db":"GITHUB_REPOS","question":"A partir dos arquivos do repositório do GitHub em 'github_repos.sample_files' unidos com 'github_repos.sample_contents', quais 10 linguagens de programação ocorrem com maior frequência (com base nas extensões de arquivo reconhecidas) em arquivos que têm conteúdo não vazio, ordenadas pela contagem de arquivos em ordem decrescente?","external_knowledge":"lang_and_ext.md"}
{"instance_id":"sf_bq180","db":"GITHUB_REPOS","question":"Obtenha os 5 nomes de módulos mais usados a partir de scripts em Python (`.py`) e R (`.r`), contando ocorrências de módulos em declarações `import` e `from` para Python, e chamadas `library()` para R. A consulta deve considerar apenas arquivos Python e R, agrupando por nome do módulo e retornar os 5 módulos com maior frequência, ordenados pela frequência.","external_knowledge":null}
{"instance_id":"sf_bq233","db":"GITHUB_REPOS","question":"Você pode analisar os dados combinados dos arquivos de repositórios do GitHub e do conteúdo de github_repos, concentrando-se apenas em arquivos que terminem com '.py' ou '.r', em seguida extrair módulos Python das linhas 'import' ou 'from ... import' e bibliotecas R das linhas 'library(...)', contar suas ocorrências e, por fim, listar os resultados ordenados por idioma e pelo número de ocorrências em ordem decrescente?","external_knowledge":null}
{"instance_id":"sf_bq248","db":"GITHUB_REPOS","question":"Entre todos os repositórios que não utilizam nenhuma linguagem de programação cujo nome (ignorando maiúsculas/minúsculas) inclui a substring \"python,\" qual é a proporção de arquivos cujos caminhos incluem \"readme.md\" e cujos conteúdos contêm a frase \"Copyright (c)\"?","external_knowledge":null}
{"instance_id":"sf_bq193","db":"GITHUB_REPOS","question":"Recupere todas as linhas não vazias e não comentadas de arquivos `README.md` em repositórios do GitHub, excluindo linhas que sejam comentários (ou que comecem com `#` para Markdown ou `//` para comentários de código). Para cada linha, determine com que frequência cada linha única aparece em todos os repositórios e retorne uma lista separada por vírgulas das linguagens de programação usadas em cada repositório que contenha essa linha, ordenadas alfabeticamente, com os resultados ordenados pela frequência de ocorrência em ordem decrescente.","external_knowledge":null}
{"instance_id":"sf_bq295","db":"GITHUB_REPOS_DATE","question":"Usando os dados do GitHub Archive de 2017 para eventos de watch, quais três repositórios que incluem pelo menos um arquivo Python (com extensão .py), com menos de 15.000 bytes e que contenham a substring \"def \" em seu conteúdo têm o maior número total de eventos de watch naquele ano?","external_knowledge":null}
{"instance_id":"sf_bq249","db":"GITHUB_REPOS","question":"Por favor, forneça um relatório sobre o número de ocorrências de tipos específicos de linha em arquivos do repositório do GitHub. Classifique uma linha como 'trailing' se terminar com um caractere em branco, como 'Space' se começar com um espaço, e como 'Other' se não atender a nenhuma condição. O relatório deve incluir o total de ocorrências para cada categoria, considerando todas as linhas de todos os arquivos.","external_knowledge":null}
{"instance_id":"sf_bq375","db":"GITHUB_REPOS","question":"Determine qual tipo de arquivo entre Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java) e JavaScript (.js) no repositório GitHub tem o maior número de arquivos com profundidade de diretório maior que 10, e forneça a contagem de arquivos.","external_knowledge":null}
{"instance_id":"sf_bq255","db":"GITHUB_REPOS","question":"Quantas mensagens de commit existem em repositórios que utilizam a linguagem de programação 'Shell' e a licença 'apache-2.0', onde o comprimento da mensagem de commit é maior que 5 caracteres, mas menor que 10.000 caracteres, e as mensagens não começam com a palavra 'merge', 'update' ou 'test'?","external_knowledge":null}
{"instance_id":"sf_bq194","db":"GITHUB_REPOS","question":"Entre todos os arquivos Python (*.py), R (*.r, *.R, *.Rmd, *.rmd) e notebooks IPython (*.ipynb) no conjunto de amostras do GitHub, qual biblioteca ou módulo é identificado como o segundo mais frequentemente importado ou carregado com base nas declarações de importação extraídas?","external_knowledge":null}
{"instance_id":"sf_bq377","db":"GITHUB_REPOS","question":"Extraia e conte a frequência de todos os nomes de pacote listados na seção require do conteúdo formatado em JSON","external_knowledge":null}
{"instance_id":"sf_bq359","db":"GITHUB_REPOS","question":"Liste os nomes dos repositórios e as contagens de commits para os dois principais repositórios do GitHub com JavaScript como linguagem primária e o maior número de commits.","external_knowledge":null}
{"instance_id":"sf_bq252","db":"GITHUB_REPOS","question":"Você poderia, por favor, encontrar o nome do repositório que contém o arquivo Swift não binário mais copiado no conjunto de dados, assegurando que cada arquivo seja identificado de forma única pelo seu ID?","external_knowledge":null}
{"instance_id":"sf_bq251","db":"PYPI","question":"Quero saber os URLs de projetos do GitHub dos 3 pacotes PyPI mais baixados com base na contagem de downloads. Primeiro, extraia metadados do pacote PyPI incluindo nome, versão e URLs do projeto. Filtre essas URLs para incluir apenas aquelas que apontam para repositórios do GitHub. Use uma expressão regular para limpar as URLs do GitHub removendo partes desnecessárias como 'issues', 'pull', 'blob' e 'tree', mantendo apenas a URL principal do repositório. Para pacotes com várias versões, use apenas a versão mais recente com base no tempo de upload. Integre esses dados com métricas de download para determinar os pacotes mais baixados. Retorne apenas as URLs limpas do repositório do GitHub (sem aspas) para os 3 pacotes com maior contagem total de downloads, garantindo que apenas pacotes com URLs válidas do GitHub estejam incluídos nos resultados.","external_knowledge":null}
{"instance_id":"bq019","db":"cms_data","question":"Nos dados de encargos de internação da CMS Medicare de 2014, qual definição de DRG tem o maior número total de altas, e entre as três principais cidades com o maior número de altas para essa definição de DRG, quais são seus respectivos pagamentos totais médios ponderados (ponderados pelo total de altas)?","external_knowledge":null}
{"instance_id":"bq234","db":"cms_data","question":"Qual é o medicamento mais prescrito em cada estado em 2014?","external_knowledge":null}
{"instance_id":"bq235","db":"cms_data","question":"Você pode me dizer qual prestador de serviços de saúde tem os custos médios combinados mais altos para serviços ambulatoriais e de internação em 2014?","external_knowledge":null}
{"instance_id":"bq172","db":"cms_data","question":"Para o medicamento com o maior número total de prescrições no Estado de Nova York durante o ano de 2014, você poderia listar os cinco estados com o maior total de contagens de sinistros para este medicamento? Por favor, inclua também as contagens totais de sinistros desses estados e os custos totais do medicamento.","external_knowledge":null}
{"instance_id":"bq177","db":"cms_data","question":"Para o provedor cujo custo total de internação pelo Medicare de 2011 a 2015 é o maior (calculado como a soma de average_medicare_payments multiplicado por total_discharges), por favor liste o custo médio anual de internação desse provedor e o custo médio anual de atendimento ambulatorial para cada ano civil neste período, onde o custo de internação é calculado como a média de (average_medicare_payments multiplicado por total_discharges) e o custo ambulatorial é calculado como a média de (average_total_payments multiplicado por outpatient_services).","external_knowledge":null}
{"instance_id":"bq354","db":"cms_data","question":"Você poderia fornecer a porcentagem de participantes para acne padrão, dermatite atópica, psoríase e vitiligo conforme definido pela Classificação Internacional de Doenças 10-CM (ICD-10-CM), incluindo suas subcategorias? Por favor, inclua todos os conceitos relacionados mapeados para os códigos ICD-10-CM padrão (L70 para acne, L20 para dermatite atópica, L40 para psoríase e L80 para vitiligo) utilizando relações de conceito, incluindo conceitos descendentes. A porcentagem deve ser calculada com base no número total de participantes, considerando apenas os conceitos padrão e seus descendentes relacionados.","external_knowledge":null}
{"instance_id":"bq355","db":"cms_data","question":"Por favor, informe a porcentagem de participantes que não utilizam quinapril e medicamentos relacionados (Quinapril RxCUI: 35208).","external_knowledge":null}
{"instance_id":"bq032","db":"noaa_data","question":"Você pode fornecer a latitude das coordenadas finais para o furacão que percorreu a segunda maior distância no Atlântico Norte durante 2020?","external_knowledge":"functions_st_distance.md"}
{"instance_id":"bq119","db":"noaa_data","question":"Por favor, apresente informações sobre o furacão com a terceira maior distância total percorrida no Atlântico Norte durante 2020, incluindo suas coordenadas de viagem, a distância total percorrida cumulativa (em quilômetros) em cada ponto e a velocidade máxima de ventos sustentados nesses momentos.","external_knowledge":"functions_st_distance.md"}
{"instance_id":"sf_bq117","db":"NOAA_DATA","question":"Qual é o número total de eventos de tempestade severa que ocorreram no mês mais afetado ao longo dos últimos 15 anos, de acordo com os registros da NOAA, considerando apenas os 100 maiores eventos de tempestade com o maior dano à propriedade?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq419","db":"noaa_data","question":"Quais são os 5 estados com mais eventos de tempestade entre 1980 e 1995, considerando apenas os 1000 estados com o maior número de eventos em cada ano? Por favor, use as abreviações dos estados.","external_knowledge":null}
{"instance_id":"sf_bq071","db":"NOAA_DATA_PLUS","question":"Você pode fornecer a contagem de furacões e uma lista de nomes de furacões (ordenados alfabeticamente e separados por vírgulas) para cada cidade e seu código postal associado, onde os furacões estejam dentro dos limites dos códigos postais? Por favor, exclua quaisquer furacões sem nome e classifique os resultados pela contagem de furacões em ordem decrescente. A saída deve incluir as seguintes colunas: cidade, código postal, estado, contagem de furacões e a lista de furacões.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq236","db":"NOAA_DATA_PLUS","question":"Quais são os 5 principais códigos postais das áreas nos Estados Unidos que registraram mais eventos de granizo nos últimos 10 anos? Não utilize dados da tabela de relatórios de granizo.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq356","db":"noaa_data","question":"Entre todas as estações meteorológicas NOAA GSOD que registraram dados válidos de temperatura diários (temperatura não ausente, máx., mín.) em 2019 e cuja período de registro começou em ou antes de 1 de janeiro de 2000, e continuou até pelo menos 30 de junho de 2019, quantas dessas estações atingiram 90% ou mais do número máximo possível de dias com registro de temperatura em 2019?","external_knowledge":null}
{"instance_id":"bq042","db":"noaa_data","question":"Você pode me ajudar a obter a temperatura média, a velocidade média do vento e a precipitação para o Aeroporto LaGuardia, em Nova York, em 12 de junho, para cada ano de 2011 a 2020, usando especificamente o ID da estação 725030?","external_knowledge":null}
{"instance_id":"bq394","db":"noaa_data","question":"Quais são os três primeiros meses entre 2010 e 2014 com a menor soma das diferenças absolutas entre a temperatura média do ar, a temperatura de bulbo úmido, a temperatura do ponto de orvalho e a temperatura da superfície do mar, incluindo os respectivos anos e a soma das diferenças? Por favor, apresente o ano e o mês em formato numérico.","external_knowledge":null}
{"instance_id":"bq357","db":"noaa_data","question":"Quais são as coordenadas de latitude e longitude e as datas entre 2005 e 2015 com as 5 maiores velocidades médias diárias do vento, excluindo registros com valores de velocidade do vento ausentes? Usando dados de tabelas que começam com o prefixo \"icoads_core\".","external_knowledge":null}
{"instance_id":"bq181","db":"noaa_data","question":"Qual a porcentagem de estações meteorológicas que registraram dados de temperatura válidos (sem valores ausentes ou inválidos) por pelo menos 90% dos dias de 2022, em que os valores de temperatura, de máxima e de mínima não são NULL nem iguais a 9999.9, e a estação tem um identificador válido (código USAF não é igual a '999999'), entre todas as estações disponíveis no banco de dados NOAA GSOD?","external_knowledge":null}
{"instance_id":"bq045","db":"noaa_data","question":"Quais estações meteorológicas no estado de Washington registraram mais de 150 dias chuvosos em 2023, mas menos dias chuvosos em comparação com 2022? Definindo um “dia chuvoso” como aquele com precipitação maior que zero milímetros e diferente de 99.99. Inclua apenas estações com dados de precipitação válidos.","external_knowledge":null}
{"instance_id":"sf_bq358","db":"NEW_YORK_CITIBIKE_1","question":"Você pode me dizer qual viagem de bicicleta em Nova Iorque em 15 de julho de 2015 começou e terminou em áreas de código ZIP com a temperatura média mais alta daquele dia, conforme registrado pela estação meteorológica do Central Park (WBAN '94728')? Se houver mais de uma viagem que atenda a esses critérios, gostaria de saber aquela que começa no menor código ZIP e termina no maior código ZIP. Por favor, retorne os códigos ZIP inicial e final dessa viagem.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq290","db":"noaa_data","question":"Você pode calcular a diferença entre a temperatura máxima, a temperatura mínima e a temperatura média entre as estações meteorológicas dos EUA e do Reino Unido para cada dia de outubro de 2023, usando o campo de data, e excluindo registros com valores de temperatura ausentes ou inválidos?","external_knowledge":null}
{"instance_id":"bq031","db":"noaa_data","question":"Forneça os dados diários do tempo para Rochester de 1º de janeiro a 31 de março de 2019, incluindo temperatura (em Celsius), precipitação (em centímetros) e velocidade do vento (em metros por segundo). Para cada variável, calcule a média móvel de 8 dias (incluindo o dia atual e os 7 anteriores). Além disso, calcule a diferença entre a média móvel de cada dia e as médias móveis para os 1 a 8 dias anteriores (ou seja, lag1 a lag8). O resultado deve incluir: os valores diários de temperatura, precipitação e velocidade do vento; as médias móveis de 8 dias para cada variável; as diferenças entre as médias móveis para cada um dos 1 a 8 dias anteriores (por exemplo, a diferença entre a média móvel de hoje e a média móvel de 1 dia atrás, de 2 dias atrás, e assim por diante). Arredonde todos os valores para uma casa decimal. Os dados devem ser ordenados pela data, começando de 9 de janeiro de 2019.","external_knowledge":null}
{"instance_id":"bq392","db":"noaa_gsod","question":"Quais são as 3 datas de outubro de 2009 com a maior temperatura média para a estação número 723758, no formato YYYY-MM-DD?","external_knowledge":null}
{"instance_id":"sf_bq050","db":"NEW_YORK_CITIBIKE_1","question":"Quero analisar viagens de bicicleta em Nova York para 2014, ligando os dados das viagens com informações climáticas para entender como as condições meteorológicas (temperatura, velocidade do vento e precipitação) afetam as viagens entre bairros. Para cada combinação de bairros de origem e destino, eu preciso do seguinte: 1. Número total de viagens entre os bairros. 2. Duração média da viagem em minutos (arredondada para 1 decimal). 3. Temperatura média no início da viagem (arredondada para 1 decimal). 4. Velocidade média do vento no início (em metros por segundo, arredondada para 1 decimal). 5. Precipitação média no início (em centímetros, arredondada para 1 decimal). 6. O mês com mais viagens (p. ex., `4` para Abril). Os dados devem ser agrupados pelo bairro de origem e pelo bairro de destino, com: `zip_codes` em `geo_us_boundaries` usados para mapear as localizações das viagens com base na latitude e longitude. `zip_codes` em `cyclistic` usados para obter os nomes do distrito e do bairro. Usando dados climáticos da estação Central Park para a data da viagem, cobrindo todas as viagens em 2014.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq426","db":"NEW_YORK_CITIBIKE_1","question":"Qual tipo de usuário registrou a maior temperatura média para viagens que começam e terminam no código postal 10019 da cidade de Nova York durante 2018? Inclua a precipitação média, a velocidade do vento e a temperatura para esse tipo de usuário com base nos dados meteorológicos da estação Central Park de Nova York.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq291","db":"NOAA_GLOBAL_FORECAST_SYSTEM","question":"Você pode fornecer um resumo diário do tempo para julho de 2019 dentro de um raio de 5 km da latitude 26.75 e longitude 51.5? Preciso das temperaturas máxima, mínima e média; precipitação total; cobertura de nuvens média entre 10h e 17h; neve total (quando a temperatura média estiver abaixo de 32°F); e chuva total (quando a temperatura média for de 32°F ou superior) para cada data de previsão. Os dados devem corresponder às previsões criadas em julho de 2019 para o dia seguinte.","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq208","db":"new_york_noaa","question":"Você pode fornecer estações meteorológicas dentro de um raio de 20 milhas ao redor de Chappaqua, Nova York (Latitude: 41.197, Longitude: -73.764), e me dizer o número de observações válidas de temperatura que eles registraram de 2011 a 2020, excluindo quaisquer dados de temperatura inválidos ou ausentes?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq047","db":"new_york_noaa","question":"Você poderia analisar a relação entre cada tipo de reclamação e a temperatura diária na cidade de Nova York, especificamente usando os dados de temperatura de LaGuardia (STN=725030) e JFK (STN=744860) para os 10 anos começando em 2008, e então determinar, para cada tipo de reclamação que tenha mais de 5000 ocorrências totais e apresente uma correlação forte (valor absoluto > 0.5) com a temperatura, o total de reclamações, o total de dias com registros de temperatura válidos, e os coeficientes de correlação de Pearson (arredondados para quatro casas decimais) entre a temperatura e tanto a contagem diária de reclamações quanto a porcentagem diária do total de reclamações, excluindo quaisquer dias com dados de temperatura ausentes ou inválidos (como 9999.9)?","external_knowledge":null}
{"instance_id":"bq048","db":"new_york_noaa","question":"Quais tipos de reclamação com mais de 3000 solicitações totais de 2011 a 2020 mostram as correlações de Pearson mais fortes, positivas e negativas, com a velocidade média diária do vento medida na estação 744860 (Aeroporto JFK), com base nas proporções diárias de reclamações (a razão entre as reclamações do tipo específico e o total de reclamações diárias)? Por favor, forneça os tipos de reclamação e seus coeficientes de correlação, arredondados para quatro casas decimais.","external_knowledge":null}
{"instance_id":"bq293","db":"new_york_geo","question":"Quero analisar os dados de viagens de táxi amarelo de Nova York, especificamente para 1º de janeiro de 2015, usando o dataset bigquery-public-data.new_york.tlc_yellow_trips_2015. Preciso unir isso com a tabela geo_us_boundaries.zip_codes para mapear cada viagem ao respectivo código postal de NYC com base nas coordenadas de retirada. A análise deve criar uma divisão hora a hora completa para todos os códigos postais, cruzando códigos postais distintos com horas distintas, incluindo horários com zero viagens. Para cada combinação de código postal e hora, calcule o número total de viagens e as seguintes métricas baseadas no tempo: contagem de viagens de 1 hora atrás, 1 dia (24 horas) atrás, 7 dias (168 horas) atrás e 14 dias (336 horas) atrás. Além disso, calcule as médias móveis de 14 dias e 21 dias e os desvios padrão das contagens de viagens, excluindo a hora atual. Inclua apenas viagens com coordenadas de latitude e longitude válidas. Os resultados finais devem ser ordenados pela maior contagem de viagens, mostrando apenas os 5 grupos com mais viagens.","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq017","db":"GEO_OPENSTREETMAP","question":"Quais são os cinco tipos de rodovias mais longas dentro do limite do multipolígono da Dinamarca (conforme definido pelo ID Wikidata 'Q35') pelo comprimento total, analisado por meio de planet features?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq131","db":"GEO_OPENSTREETMAP","question":"Qual é o número de paradas de ônibus para a rede de ônibus com mais paradas dentro do limite multipolígono da Dinamarca (conforme definido pelo ID Wikidata 'Q35'), analisado por meio de recursos planetários?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq349","db":"GEO_OPENSTREETMAP","question":"Qual é o OpenStreetMap ID da planet features table que corresponde a uma fronteira administrativa, representada como multipolígonos, cujo número total de 'amenity'-tagged Pontos de Interesse (POIs), conforme obtido a partir da planet nodes table, é o mais próximo da contagem mediana entre todos esses limites?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq007","db":"CENSUS_BUREAU_ACS_2","question":"Identifique os 10 estados dos EUA com a maior população vulnerável, calculada com base em uma soma ponderada de setores de emprego usando os dados ACS 5-Year de 2017, e determine a variação média da renda mediana entre 2015 e 2018 usando dados de código postal.","external_knowledge":"total_vulnerable_weights.md"}
{"instance_id":"sf_bq429","db":"CENSUS_BUREAU_ACS_2","question":"Quais são os cinco estados com a maior diferença média na renda mediana entre 2015 e 2018 no nível de código postal, e qual é o número médio correspondente de empregados vulneráveis nos setores de comércio atacadista, recursos naturais e construção, artes e entretenimento, informação e comércio varejista em 2017, de acordo com as Estimativas de Cinco Anos da ACS e os dados de limites de códigos postais?","external_knowledge":"avg_vulnerable_weights.md"}
{"instance_id":"sf_bq073","db":"CENSUS_BUREAU_ACS_2","question":"Usando dados sobre diferenças de renda mediana em nível ZIP entre 2015 e 2018, juntamente com as informações de emprego da ACS de 2017, liste cada estado em ordem decrescente do total de trabalhadores vulneráveis, onde “vulnerável” é definido como 38% dos trabalhadores do comércio atacadista e 41% dos trabalhadores da manufatura em 2017. Seus resultados devem incluir o nome do estado, o número de trabalhadores vulneráveis do comércio atacadista, o número de trabalhadores vulneráveis da manufatura e o total combinado desses trabalhadores vulneráveis.","external_knowledge":null}
{"instance_id":"sf_bq410","db":"CENSUS_BUREAU_ACS_2","question":"Encontre os 3 estados com a menor população ajustada fora da força de trabalho usando dados da ACS de 2017 em nível de tract. Calcule a população ajustada fora da força de trabalho como (unemployed_pop + not_in_labor_force - group_quarters), truncando quaisquer valores negativos para zero. Para cada um desses estados, exiba a sigla do estado, a mudança total na renda mediana entre 2015 e 2018 em todos os tracts, a população ajustada total fora da força de trabalho e a proporção média ajustada pela população (calculada como a razão de adjusted non-labor force para total population no nível do tract). Junte os dados de tract aos estados usando prefixos de código FIPS, exclua quaisquer tracts com diferenças de renda nulas, e ordene os resultados pela população ajustada fora da força de trabalho em ordem crescente.","external_knowledge":null}
{"instance_id":"sf_bq348","db":"GEO_OPENSTREETMAP","question":"Dentro da área retangular definida pelos geopontos (31.1798246, 18.4519921), (54.3798246, 18.4519921), (54.3798246, 33.6519921) e (31.1798246, 33.6519921), quais são os três nomes de usuário com o maior número de nós históricos, originalmente marcados com as comodidades ‘hospital’, ‘clínica’ ou ‘médicos’, que não aparecem mais no conjunto de dados planet_nodes atual?","external_knowledge":"functions_st_intersects_polygon_line.md"}
{"instance_id":"sf_bq253","db":"GEO_OPENSTREETMAP","question":"Encontre o nome da relação do OpenStreetMap que abrange a maior parte das feições na mesma área geográfica que o multipolígono etiquetado com o item Wikidata 'Q1095'. A relação deve ter um nome especificado e não possuir a tag 'wikidata', e pelo menos uma das suas feições incluídas deve ter uma tag 'wikidata'. A análise deve ser conduzida usando a tabela planet_features. Retorne o nome dessa relação.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq254","db":"GEO_OPENSTREETMAP","question":"Entre todos os multipolígonos localizados dentro da mesma área geográfica que o multipolígono associado ao item Wikidata Q191, mas que não possuem a etiqueta 'wikidata' por si mesmos, quais dois ocupam as duas primeiras posições pelo número de pontos que caem dentro de seus limites, e quais são seus nomes?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq056","db":"GEO_OPENSTREETMAP_BOUNDARIES","question":"Quantos pares diferentes de estradas classificadas como motorway, trunk, primary, secondary ou residential na Califórnia se sobrepõem entre si sem compartilhar nós e não possuem a tag 'bridge', onde essas estradas estão etiquetadas com 'highway', analisados através do planet ways","external_knowledge":"functions_st_intersects.md"}
{"instance_id":"sf_bq289","db":"GEO_OPENSTREETMAP_CENSUS_PLACES","question":"Você pode encontrar a menor distância entre quaisquer duas amenidades (ou uma biblioteca, um lugar de culto ou um centro comunitário) localizadas dentro de Filadélfia, analisada através de pennsylvania table e planet features points?","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq250","db":"GEO_OPENSTREETMAP_WORLDPOP","question":"Com base nos dados de grade populacional de 1km mais recentes em Singapura antes de janeiro de 2023, usando ST_CONVEXHULL para agregar todos os centróides das grades populacionais em uma região delimitadora e ST_INTERSECTS para identificar hospitais a partir da camada planet do OpenStreetMap (layer_code in (2110, 2120)) que estejam dentro dessa região, então calculando a distância de cada célula de grade até o hospital mais próximo, qual é a população total da célula de grade que fica mais distante de qualquer hospital?","external_knowledge":"OpenStreetMap_data_in_layered_GIS_format.md"}
{"instance_id":"sf_bq083","db":"CRYPTO","question":"Você consegue calcular a variação diária no valor de mercado dos tokens USDC (endereço `0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48`) para 2023, com base nas transações Ethereum? A mudança deve ser calculada a partir de operações de mintagem (padrão de input `0x40c10f19%`) e queima (padrão de input `0x42966c68%`). Para cada transação, a mintagem deve ser positiva e a queima negativa. Extraia o valor relevante do campo 'input' como hexadecimal, converta para milhões, expresse no formato USD. Agrupe os resultados por data e ordene-os em ordem decrescente.","external_knowledge":"Total_Market_Value_Change.md"}
{"instance_id":"sf_bq184","db":"CRYPTO","question":"Usando apenas os rastros, você pode calcular contagens diárias cumulativas de contratos inteligentes criados por endereços externos (onde o trace_address é NULL) versus aqueles criados por outros contratos (onde o trace_address é NOT NULL) para cada data de 2017-01-01 até 2021-12-31, garantindo que todas as datas nesse intervalo estejam incluídas, mesmo que nenhum contrato novo tenha sido criado em alguns dias, e mostrando totais cumulativos monotonamente crescentes para ambas as categorias?","external_knowledge":null}
{"instance_id":"sf_bq195","db":"CRYPTO","question":"Quais são os 10 endereços Ethereum com maior saldo, levando em conta transações de valor e taxas de gas, antes de 1 de setembro de 2021? Apenas mantenha transações bem-sucedidas sem tipo de chamada ou em que o tipo de chamada seja 'call'.","external_knowledge":null}
{"instance_id":"sf_bq256","db":"CRYPTO","question":"Determine o saldo final de Ether do endereço Ethereum que iniciou o maior número de transações bem-sucedidas antes de 1 de setembro de 2021 (UTC), excluindo chamadas do tipo delegatecall, callcode ou staticcall e incluindo todas as transferências recebidas e enviadas relevantes, recompensas dos mineradores e deduções de taxas de gás, com o saldo final apresentado em Ether após converter da unidade nativa.","external_knowledge":null}
{"instance_id":"sf_bq080","db":"CRYPTO","question":"Usando apenas a tabela de rastros do Ethereum, você pode fornecer uma contagem diária cumulativa de contratos inteligentes criados por usuários externos (onde trace_address é nulo) versus contratos criados por outros contratos (onde trace_address não é nulo) entre August 30, 2018 e September 30, 2018? Garanta que os resultados incluam todas as datas nesse intervalo, mesmo que nenhum novo contrato tenha sido criado, e mostre totais cumulativos estritamente crescentes.","external_knowledge":null}
{"instance_id":"sf_bq342","db":"CRYPTO","question":"Qual é a diferença entre as variações médias horárias nos valores das transações para o token Ethereum 0x68e54af74b22acaccffa04ccaad13be16ed14eac, especificamente considerando apenas transações onde o endereço 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d foi o remetente ou o endereço 0xfbd6c6b112214d949dcdfb1217153bc0a742862f foi o destinatário, entre 1 de janeiro de 2019 e 31 de dezembro de 2020, ao comparar 2019 com 2020?","external_knowledge":null}
{"instance_id":"sf_bq341","db":"CRYPTO","question":"Qual é o endereço Ethereum com os 3 menores saldos positivos provenientes de transações envolvendo o token no endereço \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\"?","external_knowledge":null}
{"instance_id":"sf_bq444","db":"CRYPTO","question":"Você pode extrair o timestamp da blockchain, o número do bloco e o hash da transação para os primeiros cinco eventos de mint e burn dos logs do Ethereum para o endereço '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8'? Por favor, inclua os eventos de mint identificados pelo tópico '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' e os eventos de burn por '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c', e ordene-os pelo timestamp do bloco do mais antigo ao mais novo.","external_knowledge":"ethereum_logs_and_events_overview.md"}
{"instance_id":"sf_bq340","db":"CRYPTO","question":"Quais são os seis endereços Ethereum, excluindo '0x0000000000000000000000000000000000000000', que apresentam as maiores diferenças absolutas entre seus saldos anteriores e atuais dos tokens localizados nos endereços '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' e '0x1e15c05cbad367f044cbfbafda3d9a1510db5513'?","external_knowledge":null}
{"instance_id":"sf_bq005","db":"CRYPTO","question":"Calcule a média diária do intervalo entre blocos do Bitcoin (em segundos) para 2023, conectando blocos consecutivos por meio de self-joins numerados por linha (incluindo intervalos entre dias), excluindo o bloco gênese, e liste as primeiras 10 datas com suas médias não ajustadas.","external_knowledge":null}
{"instance_id":"sf_bq334","db":"CRYPTO","question":"Calcule as diferenças anuais nas médias do valor de saída do Bitcoin entre dois métodos: Registros de entrada/saída mesclados: Unir as tabelas inputs e outputs, filtre apenas os registros de outputs e calcule as médias anuais. Tabela transactions: Use diretamente o campo output_value da tabela transactions para as médias anuais. Mostre a diferença (média de outputs mesclados menos média de transactions) apenas para os anos com dados em ambos os métodos.","external_knowledge":null}
{"instance_id":"sf_bq335","db":"CRYPTO","question":"Entre todos os endereços de Bitcoin que tiveram pelo menos uma transação em outubro de 2017 (somando entradas e saídas), qual endereço realizou sua transação final na data mais recente daquele mês e, entre quaisquer endereços que compartilham essa mesma data mais recente, qual deles tem a maior soma dos valores das transações?","external_knowledge":null}
{"instance_id":"sf_bq057","db":"CRYPTO","question":"Qual mês (por exemplo, 3 para março) em 2021 testemunhou a maior porcentagem do volume de transações de Bitcoin que ocorreu em transações CoinJoin (definidas como transações com >2 saídas, valor de saída ≤ valor de entrada, e possuindo várias saídas de valor igual)? Também forneça a porcentagem de todas as transações de Bitcoin que foram CoinJoins, a porcentagem de UTXOs envolvidos em transações CoinJoin (média das porcentagens de entrada e saída), e a porcentagem do volume total de Bitcoin que ocorreu em transações CoinJoin para aquele mês. Arredonde todas as porcentagens para 1 casa decimal.","external_knowledge":null}
{"instance_id":"sf_bq068","db":"CRYPTO","question":"Usando os princípios da contabilidade de partidas dobradas, tratando as entradas das transações como débitos (valores negativos) e as saídas como créditos (valores positivos) para todas as transações de Bitcoin Cash entre 2014-03-01 e 2014-04-01, como podemos calcular o saldo final máximo e o saldo final mínimo agrupados por tipo de endereço a partir dessas transações?","external_knowledge":null}
{"instance_id":"sf_bq092","db":"CRYPTO","question":"Em abril de 2023, quais são os saldos mais altos e mais baixos entre todos os endereços Dash ao calcular o saldo líquido para cada endereço usando a contabilidade de partidas dobradas (em que as entradas são tratadas como débitos/valores negativos e as saídas como créditos/valores positivos)? Considere todas as transações filtradas por block_timestamp_month='2023-04-01', e quando um endereço aparecer como array nos dados, concatene os elementos do array em uma string separada por vírgulas. Para cada combinação de endereço e tipo, some todos os valores para determinar o saldo.","external_knowledge":null}
{"instance_id":"sf_bq093","db":"CRYPTO","question":"Quais foram as variações líquidas máximas e mínimas do saldo de endereços da Ethereum Classic em October 14, 2016? Calcule-as somando todas as transações em que os endereços receberam fundos (débitos), enviaram fundos (créditos) e pagaram ou receberam taxas de gás. Apenas inclua transações com status de sucesso e exclua chamadas internas de tipos. Para as taxas de gás, leve em conta tanto as taxas pagas pelos remetentes das transações quanto as recebidas pelos mineradores, calculadas como multiplicadas pelo preço do gás para mineradores e remetentes.","external_knowledge":null}
{"instance_id":"sf_bq292","db":"CRYPTO","question":"Analise transações de Bitcoin desde julho de 2023 para determinar as porcentagens mensais de: (1) Transações classificadas como CoinJoins (definidas por >2 saídas, valor de saída ≤ valor de entrada, e múltiplas saídas de mesmo valor), (2) UTXOs envolvidos em CoinJoins (calculado como a média das proporções entrada/saída do CoinJoin em relação ao total de UTXOs da rede), (3) Volume de transações (com base no valor de entrada) atribuído a CoinJoins. Forneça os resultados em uma tabela com métricas mensais para transações, UTXOs e volume.","external_knowledge":null}
{"instance_id":"sf_bq135","db":"CRYPTO","question":"Qual data anterior a 2022 teve o maior valor total de transações nos dados da blockchain Zilliqa?","external_knowledge":null}
{"instance_id":"sf_bq136","db":"CRYPTO","question":"Encontre todos os caminhos de transação com exatamente 2 saltos na blockchain Zilliqa entre o endereço de origem 'zil1jrpjd8pjuv50cfkfr7eu6yrm3rn5u8rulqhqpz' e o endereço de destino 'zil19nmxkh020jnequql9kvqkf3pkwm0j0spqtd26e', considerando tanto transações regulares quanto transições de contrato. Um caminho de 2 saltos significa que deve haver um endereço intermediário entre a origem e o destino. Exclua caminhos onde qualquer endereço intermediário tenha mais de 50 transações de saída para filtrar exchanges e carteiras de alta atividade. Garanta que as transações em cada caminho sigam uma ordem cronológica (carimbos de tempo mais antigos primeiro). Exiba os resultados no formato: '<origem> --(tx ABCDE..)--> <intermediário> --(tx FGHIJ..)--> <destino>' onde os IDs de transação são truncados para os primeiros 5 caracteres. Inclua apenas transações confirmadas on-chain em ambas as etapas do caminho.","external_knowledge":null}
{"instance_id":"sf_bq065","db":"CRYPTO","question":"Da tabela de solicitações do Oracle, recupere as 10 solicitações mais recentes com o ID de script 3. Para cada solicitação, extraia todos os pares símbolo-taxa correspondentes, emparelhando cada símbolo do array \"symbols\" com sua taxa correspondente na mesma posição do array \"rates\" a partir do resultado decodificado. Ajuste cada taxa dividindo-a pelo valor do multiplicador da solicitação. Retorne o carimbo de data/hora do bloco, o ID da solicitação do Oracle, o símbolo e a taxa ajustada para cada par símbolo-taxa. Ordene os resultados em ordem cronológica, com os registros mais recentes primeiro.","external_knowledge":null}
{"instance_id":"sf_bq037","db":"HUMAN_GENOME_VARIANTS","question":"Sobre as variações genéticas humanas refinadas coletadas na fase 3 em 2015-02-20, eu quero saber as posições de início mínimas e máximas, bem como as proporções dessas duas, respectivamente, para as bases de referência 'AT' e 'TA'.","external_knowledge":null}
{"instance_id":"sf_bq012","db":"ETHEREUM_BLOCKCHAIN","question":"Calcule a média de saldo (em quadrilhões, 10^15) dos 10 principais endereços Ethereum por saldo líquido, incluindo transferências recebidas e enviadas de traces (apenas transações bem-sucedidas e excluindo tipos de chamada como delegatecall, callcode e staticcall), recompensas de mineradores (soma das taxas de gás por bloco), e deduções da taxa de gás do remetente. Exclua endereços nulos e arredonde o resultado para duas casas decimais.","external_knowledge":null}
{"instance_id":"sf_bq187","db":"ETHEREUM_BLOCKCHAIN","question":"Calcular o total da oferta circulante de tokens 'BNB' (em unidades divididas por 10^18) somando os saldos de todos os endereços não nulos, em que o saldo de cada endereço é igual ao total de BNB recebido menos o BNB enviado. Exclua transações envolvendo o endereço zero (0x000...) para remetentes e destinatários.","external_knowledge":null}
{"instance_id":"sf_bq450","db":"ETHEREUM_BLOCKCHAIN","question":"Gere um relatório abrangente de todos os endereços Ethereum ativos antes de January 1, 2017, calculando seus saldos líquidos (ajustados por taxas de transação e excluindo transações de delegatecall/callcode/staticcall), padrões de atividade por hora, dias ativos, métricas de transações de entrada/saída (contagens, contrapartes únicas, transferências médias de ETH), interações com tokens ERC20 (entradas/saídas, tokens únicos, contrapartes), recompensas de mineração, frequência de criação de contrato, contagens de transações com falha e tamanhos de bytecode de contrato, com todos os valores de ETH convertidos para unidades padrão (divididos por 10^18) e excluindo endereços sem histórico de transações.","external_knowledge":"ethereum_data_transformation.md"}
{"instance_id":"bq034","db":"ghcn_d","question":"Quero saber os IDs e os nomes das estações meteorológicas dentro de uma distância de 50 km em linha reta do centro de Chicago (41.8319°N, 87.6847°W).","external_knowledge":null}
{"instance_id":"bq383","db":"ghcn_d","question":"Você poderia fornecer a precipitação mais alta registrada, a temperatura mínima e a temperatura máxima dos últimos 15 dias de cada ano de 2013 a 2016 na estação meteorológica USW00094846? Certifique-se de que cada valor represente a medição de pico para esse período, com precipitação em milímetros e temperaturas em graus Celsius, usando apenas dados validados (valores não nulos e sem bandeiras de qualidade).","external_knowledge":null}
{"instance_id":"bq051","db":"new_york_ghcn","question":"Calcule o número médio diário de viagens do Citibike na Cidade de Nova York durante 2016, classificando os dias como chuvosos se a precipitação total exceder 5 milímetros (obtido dividindo o valor bruto da precipitação por 10), e não chuvosos caso contrário. Use dados da estação GHCN mais próxima localizada dentro de 50 km de (40.7128, -74.0060) que tenha medições válidas e não sinalizadas, então compare a média resultante de viagens do Citibike em dias chuvosos versus dias sem chuva.","external_knowledge":null}
{"instance_id":"bq038","db":"new_york","question":"Identificar as 10 principais estações Citibike com a maior proporção de viagens em grupo, definidas como viagens que começam e terminam na mesma estação, em que múltiplos ciclistas partiram/chegaram dentro da mesma janela de tempo de 2 minutos. Calcule a proporção como o número de viagens que fazem parte de um grupo dividido pelo número total de viagens que terminam naquela estação.","external_knowledge":null}
{"instance_id":"bq053","db":"new_york","question":"Calcular a mudança no número de árvores vivas de cada cor de outono em Nova York de 1995 a 2015, calculando, para cada espécie de árvore, a diferença entre o número de árvores não marcadas como mortas em 1995 e o número de árvores vivas em 2015, correspondendo as espécies pela forma em maiúsculas de seus nomes científicos da tabela tree_species. Em seguida, agrupe as espécies pela cor de outono e some essas diferenças para determinar a mudança total no número de árvores para cada cor de outono.","external_knowledge":null}
{"instance_id":"bq054","db":"new_york","question":"Por favor forneça as 10 principais espécies de árvores em Nova York, usando seus nomes científicos em maiúsculas onde o nome científico não estiver vazio e incluindo seus nomes comuns, mostrando o número total de árvores, as contagens de árvores vivas e mortas para cada ano, e o crescimento correspondente nessas contagens de 1995 a 2015, depois classificar pela diferença no total de árvores entre esses anos.","external_knowledge":null}
{"instance_id":"bq021","db":"new_york","question":"Para as 20 rotas principais do Citi Bike em 2016, qual rota é mais rápida que os táxis amarelos e, entre elas, qual tem a maior duração média de passeio de bicicleta? Por favor, forneça o nome da estação de partida desta rota. As coordenadas são arredondadas para três casas decimais.","external_knowledge":null}
{"instance_id":"bq202","db":"new_york_plus","question":"Para a estação com o maior número de viagens Citibike iniciadas lá em 2018, qual dia da semana (em formato numérico) e qual horário do dia tiveram o maior número de viagens, com base no horário de início dessas viagens?","external_knowledge":null}
{"instance_id":"bq185","db":"new_york_plus","question":"Qual é a duração média da viagem em minutos para todas as corridas válidas de táxi Yellow que ocorreram entre February 1, 2016 e February 7, 2016 (inclusive), com uma duração de viagem positiva, mais de três passageiros e uma distância de viagem de pelo menos dez milhas, em que tanto o pickup quanto o dropoff estão localizados no Brooklyn?","external_knowledge":null}
{"instance_id":"bq040","db":"new_york_plus","question":"Para viagens de táxi amarelo de NYC entre 1 de janeiro e 7 de janeiro de 2016, excluindo quaisquer viagens embarcadas em ‘EWR’ ou ‘Staten Island’, determine a proporção de corridas que se enquadram em cada categoria de gorjeta em cada bairro de embarque. Inclua apenas viagens em que o horário de desembarque seja posterior ao horário de embarque, o número de passageiros seja maior que zero, e trip_distance, tip_amount, tolls_amount, mta_tax, fare_amount e total_amount sejam todos não-negativos. Classifique a porcentagem de gorjeta da seguinte forma: 0% (sem gorjeta), até 5%, de 5% a 10%, de 10% a 15%, de 15% a 20%, de 20% a 25%, e mais de 25%.","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq098","db":"new_york_plus","question":"Para viagens de táxi amarelo de NYC, onde tanto a retirada quanto o desembarque ocorreram entre 1 de janeiro e 7 de janeiro de 2016, inclusive, calcule a porcentagem de viagens sem gorjeta em cada distrito de retirada, assegurando que apenas viagens em que o desembarque ocorra após a retirada sejam incluídas, que o número de passageiros seja maior que zero, e que a distância da viagem, o valor da gorjeta, o valor dos pedágios, o imposto MTA, o valor da tarifa e o valor total sejam não-negativos; defina viagens \"sem gorjeta\" como aquelas em que a taxa de gorjeta é zero, com a taxa de gorjeta calculada como (tip_amount × 100) dividido por total_amount (e considerada zero quando total_amount é zero).","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq039","db":"new_york_plus","question":"Encontre as 10 viagens de táxi com maior tarifa em Nova Iorque entre 1 de julho e 7 de julho de 2016 (garantindo que tanto os horários de retirada quanto de entrega ocorram dentro dessas datas) em que o número de passageiros é maior que cinco, a distância da viagem é de pelo menos dez milhas e não há valores negativos relacionados à tarifa (incluindo gorjeta, pedágios, taxa MTA, tarifa e custos totais). Exclua quaisquer viagens em que o horário de entrega não seja estritamente posterior ao horário de retirada, em seguida classifique os resultados pela quantia total da tarifa em ordem decrescente. Por fim, exiba a zona de retirada de cada viagem, a zona de entrega, a duração da viagem em segundos, a velocidade de condução em milhas por hora e a taxa de gorjeta como uma porcentagem do valor total da tarifa.","external_knowledge":null}
{"instance_id":"bq203","db":"new_york_plus","question":"Para cada distrito da cidade de Nova Iorque, quantas estações de metrô existem no total, quantas delas possuem pelo menos uma entrada marcada tanto como uma entrada real quanto como compatível com ADA, e qual é a porcentagem do total de estações em cada distrito que isso representa, listando os distritos do maior para o menor percentual?","external_knowledge":null}
{"instance_id":"bq035","db":"san_francisco","question":"Qual é a distância total percorrida por cada bicicleta no programa San Francisco Bikeshare, medida em metros? Use dados de viagens e estações do Bikeshare para calcular isso.","external_knowledge":null}
{"instance_id":"bq186","db":"san_francisco","question":"Por favor, encontre, para cada combinação ano-mês (no formato YYYYMM) derivada da data de início das viagens de compartilhamento de bicicletas em San Francisco, a primeira duração da viagem em minutos, a última duração da viagem em minutos, a maior duração da viagem em minutos e a menor duração da viagem em minutos, onde 'primeiro' e 'último' são determinados pela ordem cronológica da data de início da viagem; em seguida, agrupe seus resultados por esse ano-mês e classifique-os pela mesma chave ano-mês.","external_knowledge":null}
{"instance_id":"bq081","db":"san_francisco_plus","question":"Encontre os dados de viagem mais recentes para cada região entre 2014 e 2017. Quero saber o nome de cada região, o ID da viagem correspondente, a duração da viagem, o horário de início, a estação de partida e o gênero do usuário.","external_knowledge":null}
{"instance_id":"sf_bq294","db":"SAN_FRANCISCO_PLUS","question":"Você poderia fornecer os detalhes das 5 viagens mais longas de compartilhamento de bicicletas que começaram entre July 1, 2017 e December 31, 2017, incluindo o ID da viagem, duração em segundos, data de início, nome da estação de origem, rota (derivada do nome da estação de origem para o nome da estação de destino), número da bicicleta, tipo de assinante, ano de nascimento do membro, a idade atual do membro (calculada com base no ano atual), uma classificação de idade com base em se o membro é menor que 40, entre 40 e 60 ou maior que 60, o gênero do membro e o nome da região da estação de origem? Por favor, exclua quaisquer viagens em que o nome da estação de origem, o ano de nascimento do membro ou o gênero do membro não estejam especificados.","temporal":"Yes","external_knowledge":"trip_info.md"}
{"instance_id":"bq339","db":"san_francisco_plus","question":"Qual mês em 2017 teve a maior diferença absoluta entre os minutos acumulados de uso de bicicleta para clientes e assinantes?\tQual mês (em número) de 2017 teve a maior diferença absoluta entre os minutos acumulados de uso de bicicleta (em milhares) para clientes e assinantes, com base nas datas de término das viagens nos dados de bikeshare de San Francisco.","external_knowledge":null}
{"instance_id":"bq400","db":"san_francisco_plus","question":"Para viagens em que 'Clay St & Drumm St' ocorre antes de 'Sacramento St & Davis St' na sequência de paradas (somente em uma direção), quais são os horários de partida mais cedo de 'Clay St & Drumm St' e os horários de chegada mais tardios em 'Sacramento St & Davis St' no formato HH:MM:SS? Por favor, forneça o headsign da viagem para cada rota.","external_knowledge":null}
{"instance_id":"bq059","db":"san_francisco_plus","question":"Qual é a maior velocidade média (arredondada para 1 casa decimal, em m/s) para viagens de bicicleta em Berkeley com distância da viagem maior que 1000 metros?","external_knowledge":null}
{"instance_id":"bq376","db":"san_francisco_plus","question":"Para cada bairro em San Francisco onde haja pelo menos uma estação de compartilhamento de bicicletas e pelo menos um incidente de crime, forneça o nome do bairro juntamente com o total de estações de compartilhamento de bicicletas e o número total de incidentes de crime nesse bairro.","external_knowledge":null}
{"instance_id":"sf_bq014","db":"THELOOK_ECOMMERCE","question":"Você pode me ajudar a descobrir a receita da categoria de produto que tem o maior número de clientes que realizam uma compra em seu primeiro pedido que não foi cancelado nem devolvido?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq188","db":"THELOOK_ECOMMERCE","question":"Entre todas as categorias de produtos no conjunto de dados, identifique a categoria com a maior quantidade total de compras (com base na tabela order_items), e para essa categoria específica, qual é o tempo médio, em minutos, que os usuários passam em cada visita à página do produto? O tempo médio deve ser calculado como a diferença entre o carimbo de data/hora em que um usuário visualiza a página do produto e o carimbo de data/hora do próximo evento dentro da mesma sessão","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq258","db":"THELOOK_ECOMMERCE","question":"Gerar um relatório mensal para cada categoria de produto, onde cada linha corresponde aos pedidos que têm um status de 'Complete' e foram entregues antes do ano de 2022, agrupando pelo mês e pelo ano de entrega. Para cada categoria, calcule a receita total (a soma de sale_price), o número total de pedidos concluídos, e calcule o crescimento percentual mês a mês tanto para a receita quanto para os pedidos, comparando os totais de cada mês com os do mês anterior. Em seguida, para os mesmos pedidos, agregue e mostre o custo total (a partir de custos dos produtos), o lucro total (receita menos custo total), e, finalmente, a relação lucro-custo para cada mês.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq259","db":"THELOOK_ECOMMERCE","question":"Utilizando dados até o fim de 2022 e organizados pelo mês da primeira compra de cada usuário, você pode fornecer a porcentagem de usuários que realizaram uma compra em cada um dos primeiros, segundos, terceiros e quartos meses desde a compra inicial, onde o 'primeiro mês' se refere ao mês da compra inicial?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq189","db":"THELOOK_ECOMMERCE","question":"Com base apenas em pedidos concluídos, calcule a taxa média de crescimento mensal em porcentagem do número de pedidos únicos (contando IDs de pedido distintos) para cada categoria de produto, comparando a contagem de cada mês com o mês anterior dentro da mesma categoria. Identifique a categoria de produto com a maior média dessas taxas de crescimento mensais de pedidos. Em seguida, para essa categoria específica de produto, calcule a taxa média de crescimento da receita mensal, calculando a variação percentual na receita total (soma dos preços de venda) de mês para mês e fazendo a média desses valores ao longo de todo o período.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq260","db":"THELOOK_ECOMMERCE","question":"De 1 de janeiro de 2019 a 30 de abril de 2022, quantos usuários têm a menor idade e quantos usuários têm a maior idade para cada gênero na plataforma de comércio eletrônico, contando tanto os usuários mais jovens quanto os mais velhos separadamente para cada gênero?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq261","db":"THELOOK_ECOMMERCE","question":"Para cada mês anterior a janeiro de 2024, identifique o produto que atingiu o maior lucro total (calculado como a soma de sale_price menos o custo do produto) entre todos os itens de pedido, em seguida reporte o custo total e o lucro total para esse produto de maior lucro por mês, incluindo todos os itens de pedido independentemente do status, e apresente os resultados em ordem cronológica por mês.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq262","db":"THELOOK_ECOMMERCE","question":"Gere um relatório mensal de análise para as vendas de comércio eletrônico de junho de 2019 a dezembro de 2019 que inclua, para cada categoria de produto e para cada mês, o total de pedidos, a receita total e o lucro total, juntamente com suas taxas de crescimento mês a mês, usando os dados de junho de 2019 como base para calcular o crescimento a partir de julho de 2019. Certifique-se de que todos os pedidos estejam incluídos, independentemente de seu status, e apresente os resultados em ordem crescente por mês (formatado como \"2019-07\") e, em seguida, por categoria de produto. Omitindo junho de 2019 da saída final, mas usando-o para os cálculos de crescimento.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq190","db":"THELOOK_ECOMMERCE","question":"Determine o número de usuários que são os mais jovens e os mais velhos para cada gênero (masculino e feminino) separadamente, entre aqueles que se inscreveram entre 1 de janeiro de 2019 e 30 de abril de 2022. Para cada gênero, identifique as idades mínima e máxima dentro desse intervalo de datas, e conte quantos usuários se enquadram nesses respectivos grupos de idade.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq263","db":"THELOOK_ECOMMERCE","question":"Por favor, crie um relatório mês a mês para o ano de 2023 que se concentre na categoria 'Sleep & Lounge', mostrando para cada mês as vendas totais, o custo total, o número de pedidos completos, o lucro total e a relação lucro-custo, assegurando que o pedido esteja marcado como 'Complete', a data de criação esteja entre January 1, 2023 e December 31, 2023, e que os dados de custo estejam corretamente associados ao produto correspondente por meio dos itens do pedido.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq264","db":"THELOOK_ECOMMERCE","question":"Identifique a diferença entre o número de usuários mais velhos e mais jovens cadastrados entre 1 de janeiro de 2019 e 30 de abril de 2022, com base nos dados da nossa plataforma de comércio eletrônico.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq197","db":"THELOOK_ECOMMERCE","question":"Para cada mês anterior a julho de 2024, identifique o único produto mais vendido (determinado pelo maior volume de vendas, com a receita total como critério de desempate) entre todos os pedidos com status 'Concluído' e produtos com marcas não nulas. Retorne um relatório mostrando o mês, o nome do produto, a marca, a categoria, as vendas totais, a receita total arredondada e o status do pedido para esses principais do mês.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq265","db":"THELOOK_ECOMMERCE","question":"Você pode listar os endereços de e-mail dos 10 principais usuários que se registraram em 2019 e fizeram compras em 2019, classificando-os pelo seu maior valor médio de pedido, onde o valor médio de pedido é calculado multiplicando o número de itens em cada pedido pelo preço de venda, somando esse total ao longo de todos os pedidos de cada usuário e, em seguida, dividindo pelo número total de pedidos?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq266","db":"THELOOK_ECOMMERCE","question":"Por favor, forneça os nomes dos produtos que tiveram vendas em cada mês de 2020 e que apresentaram o menor lucro, calculado como a diferença entre o preço de varejo e o custo deles, a partir dos dados de produtos. Exclua quaisquer meses em que esses dados não estejam disponíveis. Por favor, liste os produtos em ordem cronológica com base no mês.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq333","db":"THELOOK_ECOMMERCE","question":"Quais são os três navegadores com as menores durações médias de sessão — calculadas pela diferença em segundos entre o carimbo de data/hora mais antigo e o mais recente para a sessão de cada usuário —, incluindo apenas navegadores com mais de 10 sessões no total, e quais são suas respectivas durações médias de sessão?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq361","db":"THELOOK_ECOMMERCE","question":"Para a coorte de usuários com data de primeira compra em janeiro de 2020, qual é a proporção de usuários que retornaram nos meses subsequentes de 2020?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq271","db":"THELOOK_ECOMMERCE","question":"Por favor gere um relatório que, para cada mês de 2021, forneça o número de pedidos, o número de compradores únicos e o lucro (calculado como a soma dos preços de varejo dos produtos menos a soma dos custos dos produtos), onde os pedidos foram feitos durante 2021 por usuários que se registraram em 2021 para itens de inventário criados em 2021, e agrupe os resultados pelo país dos usuários, pelo departamento do produto e pela categoria do produto.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq272","db":"THELOOK_ECOMMERCE","question":"Por favor, forneça os nomes dos três produtos mais lucrativos para cada mês de janeiro de 2019 até agosto de 2022, excluindo quaisquer produtos associados a pedidos que foram cancelados ou devolvidos. Para cada produto em cada mês, o lucro deve ser calculado como a soma dos preços de venda de todos os itens de pedido menos a soma dos custos desses itens vendidos naquele mês.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq273","db":"THELOOK_ECOMMERCE","question":"Você pode listar os 5 meses entre agosto de 2022 e novembro de 2023 em que o lucro proveniente de pedidos concluídos do Facebook apresentou o maior aumento mês a mês? Calcule o lucro como vendas menos custos, agrupando por mês de entrega e inclua apenas pedidos criados entre agosto de 2022 e novembro de 2023. Compare o lucro de cada mês com o do mês anterior para encontrar os maiores aumentos.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq020","db":"GENOMICS_CANNABIS","question":"Qual é o nome da sequência de referência com a maior densidade de variantes no conjunto de dados do genoma da cannabis fornecido?","external_knowledge":null}
{"instance_id":"sf_bq107","db":"GENOMICS_CANNABIS","question":"Qual é a densidade de variantes da referência de cannabis com o maior comprimento de referência? Observe que uma variante está presente se houver pelo menos uma chamada de variantes com um genótipo maior que 0.","external_knowledge":null}
{"instance_id":"bq025","db":"census_bureau_international","question":"Forneça uma lista dos 10 principais países para o ano de 2020, ordenados pela maior porcentagem da população com menos de 20 anos. Para cada país, inclua a população total com menos de 20 anos, a população total no meio do ano e a porcentagem da população que é menor de 20 anos.","external_knowledge":null}
{"instance_id":"bq115","db":"census_bureau_international","question":"Qual país tem a maior porcentagem da população com menos de 25 anos em 2017?","external_knowledge":null}
{"instance_id":"bq030","db":"covid19_open_data","question":"A partir de May 10, 2020, entre todos os países que tinham mais de 50,000 casos confirmados de COVID-19, quais três países tinham as maiores taxas de recuperação com base no número total de casos recuperados em relação ao total de casos confirmados nesses países, e quais eram as suas respectivas taxas de recuperação expressas em porcentagens?","external_knowledge":null}
{"instance_id":"bq018","db":"covid19_open_data","question":"Qual dia em março e abril teve a maior taxa de crescimento de casos confirmados de COVID-19 nos Estados Unidos? O formato é MM-DD.","external_knowledge":null}
{"instance_id":"bq086","db":"covid19_open_world_bank","question":"Você precisa calcular a porcentagem da população de cada país que havia sido confirmada com COVID-19 até June 30, 2020. Os dados de população de 2018 podem ser encontrados no conjunto de dados do Banco Mundial, e os dados de casos confirmados acumulados de COVID-19 estão disponíveis no conjunto de dados COVID-19 Open Data. Calcule a porcentagem da população de cada país que foi cumulativamente confirmada com COVID-19","external_knowledge":null}
{"instance_id":"bq085","db":"covid19_jhu_world_bank","question":"Você poderia fornecer, para os Estados Unidos, França, China, Itália, Espanha, Alemanha e Irã, o número total de casos confirmados de COVID-19 em 20 de abril de 2020, juntamente com o número de casos por 100.000 habitantes com base nas populações totais de 2020, calculadas pela soma de todos os dados populacionais relevantes do Banco Mundial.","external_knowledge":null}
{"instance_id":"bq130","db":"covid19_nyt","question":"Analise os números diários de novos casos de COVID-19 de março a maio de 2020, identificando os cinco estados com os maiores aumentos diários. Por favor, compile um ranking com base na frequência com que cada estado aparece nesses top-5 diários. Em seguida, examine o estado que fica em quarto lugar no total e identifique seus cinco condados principais com base na frequência de aparecimento nas contagens diárias de novos casos no top-5.","external_knowledge":null}
{"instance_id":"bq087","db":"covid19_symptom_search","question":"Por favor calcule a variação percentual global na frequência média semanal de busca pelo sintoma 'anosmia' entre os cinco condados da cidade de Nova York — Bronx County, Queens County, Kings County, New York County e Richmond County — comparando os dados combinados de 1 de janeiro de 2019 a 31 de dezembro de 2019 com os dados combinados de 1 de janeiro de 2020 a 31 de dezembro de 2020.","external_knowledge":null}
{"instance_id":"bq088","db":"covid19_symptom_search","question":"Por favor, calcule os níveis médios de sintomas de ansiedade e depressão a partir dos dados semanais do país para os Estados Unidos durante os períodos de 1 de janeiro de 2019 a 1 de janeiro de 2020 e de 1 de janeiro de 2020 a 1 de janeiro de 2021. Em seguida, calcule o aumento percentual desses níveis médios de sintomas do período de 2019 para o período de 2020.","external_knowledge":null}
{"instance_id":"bq089","db":"covid19_usa","question":"Com base nas últimas estimativas populacionais da American Community Survey de cinco anos de 2018, qual é o número de locais de vacinação por mil habitantes para condados na Califórnia?","external_knowledge":null}
{"instance_id":"bq407","db":"covid19_usa","question":"Encontre os três condados com populações superiores a 50.000, usando as estimativas de 5 anos do censo de 2020, que apresentaram as maiores taxas de letalidade de COVID-19 em 27 de agosto de 2020. Para esses condados, forneça o nome, o estado, a idade mediana, a população total, o número de casos confirmados de COVID-19 por 100.000 pessoas, o número de mortes por 100.000 pessoas e a taxa de letalidade de casos como porcentagem","external_knowledge":null}
{"instance_id":"bq137","db":"census_bureau_usa","question":"Por favor, encontre todas as áreas de código postal localizadas a até 10 quilômetros das coordenadas (-122.3321, 47.6062) juntando os dados de população do censo de 2010 (somando apenas as populações masculinas e femininas sem restrições de idade) e as informações da área de código postal, e retorne o polígono de cada área, a área de terra e de água em metros, latitude e longitude, código do estado, nome do estado, cidade, condado e população total.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq060","db":"census_bureau_international","question":"Quais foram os 3 principais países com a maior migração líquida em 2017 entre os que possuem uma área superior a 500 quilômetros quadrados? E quais são as suas taxas de migração?","external_knowledge":null}
{"instance_id":"bq338","db":"census_bureau_acs_1","question":"Você pode encontrar os setores censitários na área 36047 que estejam entre os 20 maiores aumentos percentuais na população de 2011 a 2018, que também estejam entre os 20 maiores aumentos absolutos na renda mediana durante o mesmo período e que tenham mais de 1.000 residentes em cada um desses anos?","external_knowledge":null}
{"instance_id":"bq061","db":"census_bureau_acs_1","question":"Qual setor censitário registrou o maior aumento da renda mediana entre 2015 e 2018 na Califórnia? Informe o código do setor censitário.","external_knowledge":null}
{"instance_id":"bq064","db":"census_bureau_acs_1","question":"Usando os dados de 2017 de áreas censitárias dos EUA, provenientes dos conjuntos de dados públicos do BigQuery, você precisa alocar de forma proporcional a população e a renda de cada área censitária para os códigos postais com base na área de sobreposição entre seus limites geográficos. Em seguida, filtre os resultados para incluir apenas aqueles códigos postais localizados dentro de um raio de 5 milhas de um ponto específico no estado de Washington, com as coordenadas de latitude 47.685833°N e longitude -122.191667°W. Por fim, calcule a população total e a renda média por indivíduo para cada código postal (arredondado para uma casa decimal) e classifique os resultados pela renda média por indivíduo em ordem decrescente.","external_knowledge":"functions_st_intersects_area.md"}
{"instance_id":"bq461","db":"ncaa_basketball","question":"Por favor, forneça um resumo cronológico de todas as jogadas de pontuação do jogo da temporada de 2014, em que o Wildcats era o mandante e o Fighting Irish era o visitante. Inclua para cada evento de pontuação o tempo de jogo, os placares acumulados para ambas as equipes (Wildcats e Fighting Irish), a equipe que marcou e uma descrição do evento.","external_knowledge":null}
{"instance_id":"bq198","db":"ncaa_basketball","question":"Liste as 5 melhores universidades com o maior número de temporadas em que atingiram o maior número de vitórias em suas respectivas temporadas de basquete da NCAA entre 1900 e 2000, mostrando o total de tais temporadas de pico de desempenho de cada equipe, excluindo entradas com nomes de equipes ausentes.","external_knowledge":null}
{"instance_id":"bq462","db":"ncaa_basketball","question":"Por favor gere uma tabela a partir do conjunto de dados de basquete da NCAA que liste os cinco melhores registros em cada uma destas quatro categorias: (1) Principais Sedes - os locais com a maior capacidade de assentos, com a Data mostrada como 'N/A'; (2) Maiores Margens de Campeonatos - jogos do Campeonato Nacional desde a temporada de 2016 (temporada > 2015) com as maiores margens de vitória em pontos; (3) Jogos com Pontuação Máxima - jogos desde a temporada de 2011 (temporada > 2010) com o maior total de pontos marcados por ambas as equipes; e (4) Mais Três - jogos desde a temporada de 2011 (temporada > 2010) com o maior total de arremessos de três pontos convertidos por ambas as equipes. A tabela final deve ser organizada com colunas para Categoria, Data, Confronto ou Sede, e Métrica-Chave, com cada categoria apresentando 5 registros em ordem decrescente da sua métrica-chave.","external_knowledge":null}
{"instance_id":"bq427","db":"ncaa_basketball","question":"Você poderia determinar, para cada tipo de arremesso, as coordenadas médias x e y (ajustadas para garantir consistência em relação ao cesto esquerdo ou direito), o número médio de tentativas de arremesso e o número médio de arremessos bem-sucedidos, considerando apenas arremessos feitos antes de March 15, 2018, excluindo aqueles com tipos de arremesso nulos ou coordenadas nulas, assegurando que os arremessos estejam no lado correto da quadra com base no cesto da equipe.","external_knowledge":"basketball.md"}
{"instance_id":"bq428","db":"ncaa_basketball","question":"Para os cinco principais mercados de equipes com o maior número de jogadores distintos que marcaram pelo menos 15 pontos durante o segundo período dos jogos entre 2010 e 2018, forneça detalhes de cada jogo que eles disputaram nas partidas históricas do torneio de basquete NCAA durante o mesmo período, conforme especificado no documento do modelo de dados.","external_knowledge":"ncaa_data_model.md"}
{"instance_id":"bq144","db":"ncaa_insights","question":"Crie um conjunto de dados combinando os resultados de jogos do torneio de basquete masculino da NCAA a partir da temporada de 2014 em diante, incluindo tanto os jogos históricos do torneio quanto os resultados do torneio de 2018, com as métricas correspondentes de ritmo e eficiência de desempenho para cada equipe e seus oponentes a partir dos dados de feature_engineering. O conjunto de dados deve incluir a temporada, rótulos de resultado do jogo (vitória ou derrota), sementes da equipe e do oponente, nomes das escolas, rankings de pace e eficiência, valores estatísticos e as diferenças entre as métricas da equipe e do oponente para permitir uma análise abrangente da dinâmica entre equipes e oponentes.","external_knowledge":"NCAA_Basketball_Tournament_SQL_Query_Variable_Guide.md"}
{"instance_id":"bq113","db":"bls","question":"Qual condado em Utah teve o maior aumento percentual no emprego na construção entre 2000 e 2018, calculado pela média dos níveis de emprego durante o terceiro mês de cada trimestre nesses anos? Qual é o aumento percentual correspondente?","external_knowledge":null}
{"instance_id":"bq112","db":"bls","question":"Entre 1998 e 2017, no condado de Allegheny, na área de Pittsburgh, os salários médios anuais de todas as indústrias acompanharam a inflação de todos os itens de consumo, e quais foram as respectivas taxas de crescimento (com duas casas decimais) para os salários e o IPC nesse período?","external_knowledge":null}
{"instance_id":"bq055","db":"google_dei","question":"Você pode fornecer as três maiores raças com as maiores diferenças percentuais entre os dados gerais de contratação de 2021 do Google provenientes da contratação não-interseccional e as porcentagens médias nos dados da BLS de 2021 para os setores de tecnologia definidos especificamente como 'Internet publishing and broadcasting and web search portals,' 'Software publishers,' 'Data processing, hosting, and related services,' ou o grupo da indústria 'Computer systems design and related services,' juntamente com as respectivas diferenças?","external_knowledge":null}
{"instance_id":"bq075","db":"google_dei","question":"Você pode fornecer um relatório combinado de 2021 que compare as distribuições raciais (Asiático, Negro, Hispânico/Latino, Branco) e de gênero (Mulheres dos EUA, Homens dos EUA) na contratação da força de trabalho geral do Google, na representação da força de trabalho geral do Google e nos dados do BLS, especificamente para os setores de tecnologia definidos como publicação e transmissão na Internet e portais de busca na web ou design de sistemas computacionais e serviços relacionados?","external_knowledge":null}
{"instance_id":"bq406","db":"google_dei","question":"Por favor, calcule as taxas de crescimento para asiáticos, pessoas negras, pessoas Latinx, nativos americanos, pessoas brancas, mulheres dos EUA, homens dos EUA, mulheres globais e homens globais, de 2014 a 2024, em relação à força de trabalho global.","external_knowledge":null}
{"instance_id":"sf_bq084","db":"GOOG_BLOCKCHAIN","question":"Para cada mês do ano de 2023, quantas transações totais ocorreram (contando todos os registros de transação sem remover duplicatas de hashes de transação), e quantas transações por segundo foram processadas em cada mês, onde o valor de transações por segundo é calculado dividindo o total mensal pelo número exato de segundos daquele mês, incluindo a lógica correta de ano bissexto, se aplicável com base no ano extraído do carimbo de data/hora da transação? Mostre a contagem mensal de transações, as transações por segundo calculadas, o ano e o mês, e apresente as linhas em ordem decrescente pela contagem mensal de transações.","external_knowledge":null}
{"instance_id":"sf_bq058","db":"GOOG_BLOCKCHAIN","question":"Recupere todos os depósitos finalizados em Optimism no bloco 29815485 usando a Optimism Standard Bridge, incluindo o hash da transação, um link Etherscan (a URL completa), endereços de token L1 e L2, endereços de remetente e destinatário (com zeros à esquerda removidos), e o valor depositado (convertido de hex para decimal). Garanta que os dados estejam devidamente formatados e analisados de acordo com os padrões de endereço e token do Optimism, e remova o prefixo '0x' exceto o hash da transação. Observe que o hash keccak-256 da assinatura do evento Ethereum para DepositFinalized é \"0x3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".","external_knowledge":"optimism_standard_bridge_contract.md"}
{"instance_id":"sf_bq416","db":"GOOG_BLOCKCHAIN","question":"Você poderia recuperar as três maiores transferências de USDT na blockchain TRON, listando os números de bloco, endereços de origem, endereços de destino (no formato TronLink) e os valores de transferência, usando o endereço de contrato USDT '0xa614f803b6fd780986a42c78ec9c7f77e6ded13c' e a assinatura do evento de transferência '0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef', dividindo o valor bruto da transferência por 1,000,000 para convertê-lo no valor final de USDT, e então ordenar os resultados pelos maiores valores transferidos primeiro?","external_knowledge":"blockchain_data_transformations.md"}
{"instance_id":"sf_bq226","db":"GOOG_BLOCKCHAIN","question":"Qual endereço de remetente, representado como uma URL completa em https://cronoscan.com, tem sido usado com maior frequência na blockchain Cronos em transações para campos 'to_address' não nulos, dentro de blocos maiores que 4096 bytes, desde 1 de janeiro de 2023?","external_knowledge":null}
{"instance_id":"sf_bq016","db":"DEPS_DEV_V1","question":"Considerando apenas as versões de lançamento mais recentes dos pacotes NPM, qual dependência (pacote e sua versão) aparece com mais frequência entre as dependências desses pacotes?","external_knowledge":null}
{"instance_id":"sf_bq062","db":"DEPS_DEV_V1","question":"Qual é a licença mais utilizada pelos pacotes em cada sistema?","external_knowledge":null}
{"instance_id":"sf_bq063","db":"DEPS_DEV_V1","question":"Encontre a URL do GitHub (com o rótulo de link 'SOURCE_REPO') da versão mais recente lançada do pacote NPM que possui o maior número de dependências em sua última versão lançada, excluindo pacotes cujos nomes contenham o caractere '@' e considerando apenas URLs em que o rótulo do link seja 'SOURCE_REPO' e a URL contenha 'github.com'.","external_knowledge":null}
{"instance_id":"sf_bq028","db":"DEPS_DEV_V1","question":"Considerando apenas as versões de lançamento mais recentes do pacote NPM, quais pacotes são os 8 mais populares com base no número de estrelas do Github, bem como as suas versões?","external_knowledge":null}
{"instance_id":"bq022","db":"chicago","question":"Calcule as durações mínimas e máximas da viagem em minutos (arredondadas para o inteiro mais próximo), o número total de viagens e a tarifa média para cada um dos seis grupos de quantis iguais com base na duração da viagem, considerando apenas viagens entre 0 e 60 minutos.","external_knowledge":null}
{"instance_id":"bq362","db":"chicago","question":"Quais três empresas tiveram o maior aumento no número de viagens entre dois meses consecutivos em 2018?","external_knowledge":null}
{"instance_id":"bq363","db":"chicago","question":"Calcule o número total de viagens e a tarifa média (formatada com duas casas decimais) para dez grupos de quantis de tamanho igual. Crie dez grupos de quantis dividindo a dimensão de duração da viagem (de 1 a 50 minutos) em conjuntos iguais. Cada grupo deve representar um número semelhante de valores de minutos distintos. Exiba o intervalo de tempo de cada grupo formatado como \"XXm to XXm\" (onde os números são preenchidos com zeros à esquerda para dois dígitos), a contagem total de viagens e a tarifa média. Os intervalos de tempo devem representar os valores mínimo e máximo de duração dentro de cada quantil. Ordene os resultados cronologicamente pelo intervalo de tempo. Use NTILE(10) para criar os quantis a partir das durações de viagem ordenadas.","external_knowledge":null}
{"instance_id":"bq076","db":"chicago","question":"Qual foi o maior número de incidentes de furto de veículo automotor que ocorreu em qualquer mês de 2016?","external_knowledge":null}
{"instance_id":"bq077","db":"chicago","question":"Para cada ano de 2010 a 2016, qual é o maior número de furtos de veículos em um mês?","external_knowledge":null}
{"instance_id":"sf_bq350","db":"OPEN_TARGETS_PLATFORM_1","question":"Para os dados moleculares detalhados, por favor exiba o id do medicamento, o tipo de medicamento e o status de retirada para fármacos aprovados com um aviso de caixa preta e com o tipo de fármaco conhecido entre 'Keytruda', 'Vioxx', 'Premarin' e 'Humira'","external_knowledge":null}
{"instance_id":"sf_bq379","db":"OPEN_TARGETS_PLATFORM_1","question":"Qual símbolo aprovado do alvo tem a pontuação de associação global mais próxima da pontuação média para a psoríase?","external_knowledge":null}
{"instance_id":"sf_bq078","db":"OPEN_TARGETS_PLATFORM_2","question":"Recupere o símbolo aprovado dos genes-alvo com a maior pontuação global que estejam associados à doença 'EFO_0000676' a partir da fonte de dados 'IMPC'.","external_knowledge":null}
{"instance_id":"sf_bq095","db":"OPEN_TARGETS_PLATFORM_1","question":"Gere uma lista de fármacos da tabela que contém detalhes moleculares que concluíram ensaios clínicos para carcinoma endócrino pancreático, ID da doença EFO_0007416. Por favor inclua o nome de cada fármaco, o símbolo do alvo aprovado e links para os ensaios clínicos relevantes.","external_knowledge":null}
{"instance_id":"bq109","db":"open_targets_genetics_1","question":"Encontre a média, variância, diferença entre o máximo e o mínimo e a fonte do QTL (estudo à direita) do máximo de log2(h4/h3) para dados onde o ID do gene direito é \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, o traço relatado inclui \"níveis de colesterol\", a característica biológica direita é \"IPSC\" e a variante é '1_55029009_C_T'.","external_knowledge":null}
{"instance_id":"sf_bq325","db":"OPEN_TARGETS_GENETICS_2","question":"Por favor identifique os 10 genes com as associações mais fortes em todos os estudos, primeiramente selecionando, para cada gene em cada estudo, a variante com o menor valor-p, e então classificando todos esses pares gene–variante para retornar os 10 genes com os menores valores-p no conjunto.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq090","db":"CYMBAL_INVESTMENTS","question":"Quão maior é o valor intrínseco médio para operações que utilizam a estratégia feeling-lucky em comparação com aquelas que utilizam a estratégia momentum em operações de posição comprada?","external_knowledge":null}
{"instance_id":"bq442","db":"CYMBAL_INVESTMENTS","question":"Por favor, colete as informações dos 6 relatórios de negociação com os maiores preços de fechamento. Consulte o documento para todas as informações que eu quero.","external_knowledge":"Trade_Capture_Report_Data_List.md"}
{"instance_id":"bq079","db":"usfs_fia","question":"Considerando apenas o último grupo de avaliação por estado para o tipo de avaliação 'EXPCURR', determine qual estado tem a maior área total em acres de timberland e qual tem a maior área total em acres de forestland. Para timberland, inclua parcelas onde o código de status de condição é 1, o código de status reservado é 0, e o código da classe de produtividade do sítio está entre 1 e 6. Para forestland, inclua parcelas onde o código de status de condição é 1. Calcule as acres totais somando os fatores de expansão ajustados para macroplots e subplots, usando suas respectivas bases de proporção ('MACR' para macroplots e 'SUBP' para subplots) e fatores de ajuste quando maiores que zero. Para cada categoria (timberland e forestland), forneça o código do estado, o grupo de avaliação, o nome do estado, e as acres totais para o estado com a maior área, considerando apenas o último grupo de avaliação por estado.","external_knowledge":null}
{"instance_id":"bq024","db":"usfs_fia","question":"Para o ano de 2012, quais são os dez principais grupos de avaliação que possuem os maiores acres de subplot ao considerar apenas a condição com os maiores acres de subplot dentro de cada grupo? Por favor inclua o grupo de avaliação, tipo de avaliação, código de status da condição, descrição da avaliação, código do estado, acres de macroplot e acres de subplot.","external_knowledge":null}
{"instance_id":"bq220","db":"usfs_fia","question":"Com base na condição, plot_tree e nas tabelas population em bigquery-public-data.usfs_fia, para o evaluation_type definido como 'EXPCURR' e condition_status_code igual a 1, quais estados tiveram o maior tamanho médio de subplot e o maior tamanho médio de macroplot, respectivamente, para cada um dos anos 2015, 2016 e 2017? Por favor, inclua o tipo de plot (subplot ou macroplot), o ano específico, o estado e o tamanho médio correspondente em seus resultados.","external_knowledge":"subplot_macroplot_size.md"}
{"instance_id":"bq096","db":"gbif","question":"Determine qual ano teve a data mais precoce após janeiro em que foram registrados mais de 10 avistamentos de Sterna paradisaea ao norte de 40 graus de latitude. Para cada ano, encontre o primeiro dia após janeiro com mais de 10 avistamentos dessa espécie nessa região, e identifique o ano cujo primeiro dia mais precoce seja o mais cedo entre todos os anos.","external_knowledge":null}
{"instance_id":"sf_bq276","db":"NOAA_PORTS","question":"Você pode fornecer uma lista abrangente de todos os portos na região número 6585 que se encontram dentro das fronteiras dos EUA e que foram afetados por tempestades nomeadas na bacia do Atlântico Norte, com velocidades de vento de pelo menos 35 nós e uma classificação Saffir-Simpson de pelo menos força de tempestade tropical mínima, incluindo, para cada porto, o seu nome, o nome do estado, os anos distintos em que as tempestades ocorreram, a contagem total de tempestades distintas, os nomes distintos das tempestades, a categoria média da tempestade, a velocidade média do vento, e as geometrias respectivas tanto da área do porto quanto das áreas da tempestade tropical?","temporal":"Yes","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq277","db":"noaa_ports","question":"Qual é o único porto listado sob o número de região '6585' que está localizado dentro dos limites de um estado dos EUA e que aparece com maior frequência nas áreas geográficas de tempestades tropicais nomeadas com ventos de pelo menos 35 nós na bacia do Atlântico Norte, excluindo aquelas rotuladas como 'NOT_NAMED'?","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq278","db":"sunroof_solar","question":"Por favor, forneça uma comparação detalhada do potencial solar para cada estado, distinguindo entre os níveis de código postal e de área censitária. Para cada estado, inclua o número total de edifícios disponíveis para instalações solares, a porcentagem média da área do Google Maps coberta pelo Project Sunroof, a porcentagem média dessa cobertura que é adequada para energia solar, o número total de painéis potenciais, a capacidade total em kW, o potencial de geração de energia, a compensação de dióxido de carbono, o número atual de edifícios com painéis solares e a lacuna no potencial de instalações calculada ajustando o total de edifícios qualificados com as porcentagens de cobertura e de adequação e subtraindo as instalações atuais.","external_knowledge":null}
{"instance_id":"bq102","db":"gnomAD","question":"Identifique quais posições de início estão associadas a variantes missense no gene BRCA1 no cromossomo 17, onde a base de referência é 'C' e a base alternativa é 'T'. Usando dados da versão gnomAD v2.1.1.","external_knowledge":null}
{"instance_id":"bq445","db":"gnomAD","question":"Usando os dados do genoma gnomAD v2.1.1 para o cromossomo 17, determine a menor posição inicial e a maior posição final de qualquer variante cujas anotações aninhadas do VEP contenham o símbolo 'BRCA1'. Em seguida, para todas as variantes cujas posições estejam dentro da região correspondente ao gene, recupere apenas os valores de 'Protein_position' se a 'Consequence' incluir 'missense_variant', classifique-os em ordem crescente por 'Protein_position' e, por fim, apresente o primeiro resultado correspondente.","external_knowledge":null}
{"instance_id":"bq103","db":"gnomAD","question":"Gere estatísticas resumidas sobre variantes genéticas na região entre as posições 55039447 e 55064852 no cromossomo 1. Isso inclui o número de variantes, a contagem total de alelos, o número total de alelos e símbolos de genes distintos (usando o Variant Effect Predictor, VEP, para anotação de genes). Além disso, calcule a densidade de mutações dividindo o comprimento da região pelo número de variantes. Usando dados do gnomAD v3.","external_knowledge":null}
{"instance_id":"sf_bq104","db":"GOOGLE_TRENDS","question":"Com base na data de atualização mais recente, identifique o termo de busca em ascensão com a melhor classificação para a semana que é exatamente um ano antes da semana mais recente disponível no conjunto de dados.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq411","db":"GOOGLE_TRENDS","question":"Por favor recupere os três principais termos de busca do Google Trends (posições 1, 2 e 3) de top_terms para cada dia útil da semana (segunda-feira a sexta-feira) entre 1 de setembro de 2024 e 14 de setembro de 2024, agrupados pela coluna refresh_date e ordenados em ordem decrescente de refresh_date.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq105","db":"nhtsa_traffic_fatalities_plus","question":"De acordo com os acidentes de 2015 e 2016 e com a distração do motorista, e excluindo os casos em que o status de distração do motorista é registrado como 'Não Distraído', 'Desconhecido se está distraído' ou 'Não informado', quantos acidentes de trânsito por 100.000 pessoas foram causados pela distração do motorista em cada estado dos EUA nesses dois anos, com base nos dados da população do censo de 2010, e quais foram os cinco estados com as maiores taxas em cada ano?","external_knowledge":null}
{"instance_id":"bq108","db":"nhtsa_traffic_fatalities","question":"No conjunto de dados de 2015, para acidentes que ocorreram de January through August e envolveram mais de uma pessoa distinta, qual é a porcentagem desses acidentes que tiveram mais de um indivíduo com uma lesão grave (injury severity = 4)?","external_knowledge":null}
{"instance_id":"bq067","db":"nhtsa_traffic_fatalities","question":"Quero criar um conjunto de dados rotulado a partir dos dados de fatalidades de tráfego da National Highway Traffic Safety Administration que prevê se um acidente de trânsito envolvendo mais de uma pessoa distinta resulta em mais de uma fatalidade, onde o rótulo é 1 se um acidente tiver mais de uma pessoa com um código de gravidade de lesão 4 (lesão fatal) e 0 caso contrário. Para cada acidente, inclua os preditores numéricos: state_number, o vehicle_body_type, number_of_drunk_drivers, day_of_week, hour_of_crash, e um indicador binário de se o acidente ocorreu em uma zona de obras (1 se não for “None,” caso contrário 0). Além disso, gere uma feature para a diferença absoluta média entre travel_speed e speed_limit por acidente, apenas considerando velocidades de viagem até 151 mph (excluindo códigos 997, 998, 999) e limites de velocidade até 80 mph (excluindo códigos 98, 99), e categorize essa diferença média de velocidade em níveis de 0 a 4 em incrementos de 20 mph com limites inferiores inclusivos e superiores exclusivos. Por fim, inclua apenas acidentes que envolvam mais de uma pessoa distinta.","external_knowledge":"nhtsa_traffic_fatalities.md"}
{"instance_id":"bq396","db":"nhtsa_traffic_fatalities","question":"Quais foram os três estados com as maiores diferenças no número de acidentes de trânsito entre tempo chuvoso e tempo claro durante os fins de semana em 2016? Por favor, forneça também as respectivas diferenças para cada estado.","external_knowledge":null}
{"instance_id":"bq441","db":"nhtsa_traffic_fatalities","question":"Por favor, ajude-me a compilar os detalhes críticos sobre acidentes de trânsito em 2015, conforme descritos no documento de informações.","external_knowledge":"Traffic_Fatalities_Info_List_2015.md"}
{"instance_id":"bq097","db":"sdoh","question":"Qual é o aumento do rendimento médio por emprego entre os anos de 2012 e 2017 para cada região geográfica em Massachusetts (indicado por \"MA\" no final de GeoName)?","external_knowledge":null}
{"instance_id":"bq120","db":"sdoh","question":"Identifique as 10 regiões (condados) com o maior número total de domicílios participantes do SNAP, usando os dados por condado do ACS de 5 anos de 2017 e os dados de inscrição no SNAP a partir de 1 de janeiro de 2017, excluindo regiões em que a participação total no SNAP seja zero. Para cada uma dessas regiões, calcule a proporção de domicílios com renda inferior a $20,000 em relação ao número total de domicílios participantes do SNAP.","external_knowledge":null}
{"instance_id":"bq110","db":"sdoh","question":"Qual é a mudança no número de veteranos sem-teto entre 2012 e 2018 para cada região CoC em Nova York que tenha dados disponíveis em ambos os anos?","external_knowledge":null}
{"instance_id":"bq395","db":"sdoh","question":"Calcule a variação percentual no número total de pessoas sem abrigo entre 2015 e 2018 para cada estado, somando as contagens de todos os Continuums of Care (CoCs) dentro de cada estado. Em seguida, determine a média nacional dessas variações percentuais por estado. Identifique os cinco estados cuja variação percentual esteja mais próxima dessa média nacional de variação percentual. Por favor, forneça as siglas dos estados.","external_knowledge":null}
{"instance_id":"bq352","db":"sdoh","question":"Por favor, liste o número médio de semanas pré-natais em 2018 para os condados de Wisconsin onde mais de 5% da população empregada tinha deslocamentos de 45 a 59 minutos em 2017.","external_knowledge":null}
{"instance_id":"bq074","db":"sdoh","question":"Conte o número de condados que apresentaram um aumento no desemprego de 2015 a 2018, usando dados ACS de 5 anos, e uma diminuição no número de beneficiários com dupla elegibilidade entre December 1, 2015, e December 1, 2018.","external_knowledge":null}
{"instance_id":"bq066","db":"sdoh","question":"Você poderia avaliar a relação entre as taxas de pobreza, com base nos dados do censo do ano anterior, e a porcentagem de nascimentos sem morbidade materna para os anos de 2016 a 2018? Use apenas dados de nascimentos em que não houve morbidade materna relatada e, para cada ano, use os dados do censo de 5 anos do ano anterior para calcular o coeficiente de correlação de Pearson.","external_knowledge":null}
{"instance_id":"bq114","db":"openaq","question":"Quais três cidades têm a maior diferença entre suas medições de PM2.5 da EPA de 1990 (usando units_of_measure = 'Micrograms/cubic meter (LC)' e parameter_name = 'Acceptable PM2.5 AQI & Speciation Mass') and suas medições de PM2.5 da OpenAQ de 2020 (where pollutant = 'pm25' com base no ano extraído do carimbo de data/hora), com latitude e longitude arredondadas para duas casas decimais, and a diferença ordenada do maior para o menor?","external_knowledge":null}
{"instance_id":"bq116","db":"sec_quarterly_financials","question":"Qual estado dos EUA relatou a maior receita anual total, em bilhões de dollars, durante o ano fiscal de 2016, considerando empresas que forneceram quatro trimestres de dados e relataram as tags de medida em ('Revenues','SalesRevenueNet','SalesRevenueGoodsNet'), excluindo quaisquer entradas em que o campo do estado (stprba) seja nulo ou vazio?","external_knowledge":null}
{"instance_id":"sf_bq015","db":"STACKOVERFLOW_PLUS","question":"Identifique e classifique as 10 principais tags das perguntas do Stack Overflow que foram referenciadas em comentários do Hacker News em 2014 ou posteriormente, contando quantas vezes cada pergunta foi mencionada, em seguida, dividindo as strings de tags das perguntas pelo delimitador '|' e agrupando por tag","external_knowledge":null}
{"instance_id":"bq041","db":"stackoverflow","question":"Calcule as estatísticas mensais para novos usuários do StackOverflow criados em 2021. Para cada mês, informe o número total de novos usuários, a porcentagem desses novos usuários que fizeram pelo menos uma pergunta dentro de 30 dias após a inscrição e, entre aqueles que fizeram uma pergunta dentro de 30 dias, a porcentagem que, em seguida, respondeu pelo menos uma pergunta após a sua primeira pergunta e dentro de 30 dias após a sua primeira pergunta.","external_knowledge":null}
{"instance_id":"sf_bq121","db":"STACKOVERFLOW","question":"Como variam a reputação média e o número de insígnias entre os usuários do Stack Overflow com base no número de anos completos como membros, considerando apenas aqueles que ingressaram até 1 de outubro de 2021?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq123","db":"stackoverflow","question":"Você precisa determinar qual dia da semana tem a terceira maior porcentagem de perguntas no Stack Overflow que recebem uma resposta dentro de uma hora. Para fazer isso, use a data de criação da pergunta da tabela posts_questions e a data de criação da primeira resposta da tabela posts_answers. Depois de calcular a porcentagem de perguntas que recebem uma resposta dentro de uma hora para cada dia, identifique o dia com a terceira maior porcentagem e informe essa porcentagem.","external_knowledge":null}
{"instance_id":"bq280","db":"stackoverflow","question":"Por favor, forneça o nome de exibição do usuário que respondeu ao maior número de perguntas no Stack Overflow, considerando apenas usuários com reputação superior a 10.","external_knowledge":null}
{"instance_id":"bq300","db":"stackoverflow","question":"Qual é o maior número de respostas recebidas para uma única pergunta específica sobre Python 2 no Stack Overflow, excluindo quaisquer discussões que envolvam Python 3?","external_knowledge":null}
{"instance_id":"bq301","db":"stackoverflow","question":"Recupere detalhes das respostas aceitas para perguntas do Stack Overflow postadas em janeiro de 2016 que possuam tags incluindo \"javascript\" e pelo menos uma de \"xss\", \"cross-site\", \"exploit\" ou \"cybersecurity\"; as respostas também devem ter sido postadas em janeiro de 2016. Para cada resposta aceita, inclua o ID da resposta, a reputação do autor da resposta, a pontuação e a contagem de comentários, juntamente com as tags da pergunta associada, a pontuação, a contagem de respostas, a reputação do autor da pergunta, a contagem de visualizações e a contagem de comentários.","external_knowledge":null}
{"instance_id":"bq302","db":"stackoverflow","question":"Qual é a proporção mensal das perguntas do Stack Overflow com a tag 'python' no ano de 2022?","external_knowledge":null}
{"instance_id":"bq303","db":"stackoverflow","question":"De 1 de julho de 2019 até 31 de dezembro de 2019, para todos os usuários com IDs entre 16712208 e 18712208 no Stack Overflow, recupere o ID do usuário e as tags da pergunta relevante para cada uma de suas contribuições, incluindo comentários em perguntas e respostas, quaisquer respostas que eles tenham postado e quaisquer perguntas que eles tenham criado, certificando-se de associar corretamente o comentário ou a resposta às tags da pergunta correspondente.","external_knowledge":null}
{"instance_id":"bq304","db":"stackoverflow","question":"Recupere as 50 perguntas mais visualizadas para cada uma das seguintes tags relacionadas ao Android no StackOverflow: 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps' e 'android-asynctask'. Cada pergunta deve conter a palavra 'how' em seu título ou corpo e não deve conter nenhum dos seguintes termos de solução de problemas em seu título ou corpo: 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve' ou 'trouble'. Inclua apenas tags que tenham pelo menos 50 perguntas que atendam a esses critérios, e para cada uma dessas tags, selecione as 50 perguntas classificadas pela contagem de visualizações.","external_knowledge":null}
{"instance_id":"bq310","db":"stackoverflow","question":"Qual é o título da pergunta \"how\" mais visualizada relacionada ao desenvolvimento Android no StackOverflow, abrangendo tags especificadas como 'android-layout', 'android-activity', 'android-intent', e outras","external_knowledge":null}
{"instance_id":"bq305","db":"stackoverflow","question":"Quais são os 10 usuários com a maior soma total de visualizações para as perguntas às quais estão associados, onde um usuário é considerado associado se ele for o proprietário da pergunta, ou se a resposta dele for a resposta aceita, ou se a pontuação da resposta dele for maior que 5, ou se a pontuação da resposta dele exceder 20% do total de pontuações das respostas para essa pergunta (e estiver acima de 0), ou se a resposta dele estiver entre as três respostas com maior pontuação para essa pergunta?","external_knowledge":null}
{"instance_id":"bq306","db":"stackoverflow","question":"Identifique as 10 principais tags para o usuário 1908967, com base apenas nas respostas postadas antes de June 7, 2018, em que a pontuação de cada tag é 10 vezes o número de votos positivos (vote_type_id=2) e 15 vezes o número de respostas aceitas (vote_type_id=1). Obtenha as tags a partir das perguntas associadas àquelas respostas, e considere apenas os votos positivos e as respostas aceitas para essas respostas. Retorne as tags com as maiores pontuações totais em ordem decrescente, limitando a 10 tags.","external_knowledge":null}
{"instance_id":"sf_bq307","db":"STACKOVERFLOW","question":"Encontre as 10 principais insígnias de ouro que os usuários ganham com mais frequência como sua primeira insígnia de ouro no Stack Overflow. Para cada uma dessas insígnias, exiba o nome da insígnia, o número de usuários que a conquistaram como sua primeira insígnia de ouro e a média de dias desde a data de criação da conta do usuário até a data em que a insígnia foi conquistada, calculada em dias sem qualquer ajuste para formatos de data.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq308","db":"stackoverflow","question":"Mostrar o número de perguntas do Stack Overflow feitas em cada dia da semana em 2021, e descobrir quantas dessas perguntas e qual a porcentagem delas foram respondidas dentro de uma hora.","external_knowledge":null}
{"instance_id":"bq309","db":"stackoverflow","question":"Recupere as 10 perguntas mais longas no Stack Overflow, com base no comprimento do corpo de cada pergunta, em que cada pergunta tenha uma resposta aceita ou, se não houver, tenha pelo menos uma resposta com uma proporção de votos para visualizações superior a 0.01. Para cada uma dessas perguntas, inclua a reputação do usuário que fez a pergunta, os votos líquidos do usuário (calculados como o total de up_votes menos down_votes), e o total de emblemas que o usuário ganhou.","external_knowledge":null}
{"instance_id":"bq124","db":"fhir_synthea","question":"Entre todos os pacientes, quantos indivíduos ainda estão vivos (ou seja, sem deceased.dateTime registrado), têm um diagnóstico de diabetes ou hipertensão, e são prescritos pelo menos sete medicamentos ativos distintos?","external_knowledge":null}
{"instance_id":"bq391","db":"fhir_synthea","question":"Entre pacientes vivos cujos sobrenomes começam com \"A\" e que cada um tem exatamente uma condição distinta, quais são as oito condições com o maior número de diferentes medicamentos ativos prescritos para qualquer paciente, e quais são seus códigos correspondentes?","external_knowledge":null}
{"instance_id":"bq126","db":"the_met","question":"Quais são os títulos, nomes dos artistas, meios e URLs das imagens originais de objetos com 'Photograph' em seus nomes do departamento 'Photographs', criados não por um artista desconhecido, com data de término do objeto em 1839 ou anterior?","external_knowledge":null}
{"instance_id":"bq366","db":"the_met","question":"Quais são as três etiquetas mais frequentemente associadas às obras de arte de cada período histórico na coleção do The Met, considerando apenas etiquetas vinculadas a 500 ou mais obras? Forneça o período, o rótulo e a contagem associada.","external_knowledge":null}
{"instance_id":"bq414","db":"the_met","question":"Recupere o id do objeto, o título e a data de metadados formatada (como uma string no formato 'YYYY-MM-DD') para objetos no departamento \"The Libraries\" onde o cropConfidence é maior que 0.5, o título do objeto contém a palavra \"book\".","external_knowledge":null}
{"instance_id":"bq200","db":"mlb","question":"Usando dados da temporada regular e da pós-temporada, identifique o arremessador que atingiu a maior velocidade de arremesso diferente de zero para cada equipe, confirmando se o ID do arremessador aparece nas listas de jogadores da equipe mandante ou visitante relevantes para aquele jogo, em seguida recupere o nome completo desse arremessador juntamente com a velocidade de arremesso máxima válida que ele atingiu enquanto jogava para essa equipe específica.","external_knowledge":null}
{"instance_id":"sf_bq458","db":"WORD_VECTORS_US","question":"Tokenize o texto do corpo de cada artigo em palavras, excluindo palavras de parada, e obtenha os vetores de palavras correspondentes para essas palavras a partir do glove vector. Para cada palavra, atribua peso ao seu vetor de palavras dividindo cada componente pela potência de 0,4 da frequência da palavra a partir das frequências de palavras. Em seguida, para cada artigo, agregue esses vetores de palavras ponderados somando seus componentes para formar um vetor do artigo. Normalize cada vetor do artigo para comprimento unitário dividindo-o pela sua magnitude. Por fim, obtenha o ID, a data, o título e o vetor do artigo normalizado para cada artigo.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq459","db":"WORD_VECTORS_US","question":"Por favor, encontre os 10 artigos mais relevantes processando apenas o campo 'body' de cada artigo, onde cada 'body' é tokenizado sem stopwords, cada token remanescente é transformado em um vetor de palavras baseado em GloVe e ponderado dividindo cada dimensão pela potência de 0,4 da frequência da palavra; em seguida esses vetores ponderados são somados e normalizados para obter um vetor unitário para cada artigo. Aplique a mesma ponderação e normalização na frase de consulta 'Epigenética e organoides cerebrais: direções promissoras em transtornos do espectro autista' e calcule a similaridade do cosseno entre o vetor da consulta e o vetor de cada artigo. Por fim, retorne o id, date, title e o escore de similaridade do cosseno para os 10 artigos com maior similaridade.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq460","db":"WORD_VECTORS_US","question":"Por favor processe os artigos do conjunto de dados 'nature' primeiro tokenizando o texto do corpo em palavras e removendo palavras de parada. Para cada palavra restante, recupere seu vetor de palavras da tabela glove_vectors e sua frequência da tabela word_frequencies, então divida cada vetor de palavra pela potência de 0,4 da frequência da palavra para pesá-lo. Some os vetores ponderados para obter um vetor agregado para cada artigo, normalize esse vetor agregado para comprimento unitário e, em seguida, calcule as pontuações de similaridade do cosseno entre esses vetores normalizados. Por fim, retorne os IDs, datas, títulos e as pontuações de similaridade do cosseno dos 10 artigos mais similares ao artigo com o ID '8a78ef2d-d5f7-4d2d-9b47-5adb25cbd373'.","external_knowledge":"tokenize_func.md"}
{"instance_id":"bq204","db":"eclipse_megamovie","question":"Encontre o usuário com o maior total de cliques em todos os registros de todas as coleções de fotos disponíveis.","external_knowledge":null}
{"instance_id":"bq389","db":"epa_historical_air_quality","question":"Por favor calcule os níveis médios mensais de PM10, PM2.5 FRM, PM2.5 non-FRM, emissões orgânicas voláteis, SO2 (escalado por um fator de 10) e Chumbo (escalado por um fator de 100) para poluentes atmosféricos na Califórnia no ano de 2020.","external_knowledge":null}
{"instance_id":"sf_bq345","db":"IDC","question":"Quais são os tamanhos dos arquivos de imagem DICOM com as modalidades SEG ou RTSTRUCT e o SOP Class UID \"1.2.840.10008.5.1.4.1.1.66.4\", quando agrupados por coleção, estudo e IDs de série, se eles não tiverem referências a outras séries, imagens ou fontes? Você também pode fornecer uma URL de visualizador formatada como \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" seguida pelo ID do estudo, e listar esses tamanhos em kilobytes, classificados do maior para o menor?","external_knowledge":null}
{"instance_id":"sf_bq346","db":"IDC","question":"Em dados DICOM publicamente acessíveis, onde a Modalidade é 'SEG' e o SOPClassUID é '1.2.840.10008.5.1.4.1.1.66.4', e cada segmentação faz referência ao seu SOPInstanceUID original, quais são as cinco categorias de segmentação (por meio de 'SegmentedPropertyCategory.CodeMeaning') que ocorrem com maior frequência?","external_knowledge":null}
{"instance_id":"sf_bq347","db":"IDC","question":"Da união das séries MR especificadas com o SeriesInstanceUID 1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147 e de todas as instâncias de segmentação associadas, qual modalidade tem o maior número total de instâncias SOP e quantas existem?","external_knowledge":null}
{"instance_id":"sf_bq390","db":"IDC","question":"Na coleção \"qin_prostate_repeatability\", por favor forneça os StudyInstanceUIDs distintos para estudos que incluam imagens de RM axiais com ponderação T2 e que também contenham segmentações da estrutura anatômica rotuladas como \"zona periférica\".","external_knowledge":null}
{"instance_id":"sf_bq421","db":"IDC","question":"Você pode listar todos os pares únicos de significados dos códigos de meio de inclusão e substância de coloração, juntamente com o número de ocorrências para cada par, com base em códigos distintos de meio de inclusão e de substância de coloração da modalidade 'SM' no conjunto de dados DICOM, nas sequências de preparo de espécimes não aninhadas, garantindo que os códigos sejam do esquema de codificação SCT?","external_knowledge":null}
{"instance_id":"sf_bq422","db":"IDC","question":"Usando as imagens CT da coleção 'nlst', calcule e compare duas métricas distintas: 1) o tamanho médio da série em MiB para os 3 pacientes com a maior tolerância de diferença de intervalo de fatias (definida como a diferença entre o intervalo máximo e o intervalo mínimo único entre todas as suas séries), e 2) o tamanho médio da série em MiB para os 3 pacientes com a maior diferença de exposição (definida como a diferença entre os valores de exposição únicos máximos e mínimos entre todas as suas séries). Para cada paciente, calcule o tamanho da série somando os tamanhos das instâncias de todas as imagens nessa série e convertendo para MiB. Retorne os resultados como dois grupos separados rotulados \"Top 3 by Slice Interval\" e \"Top 3 by Max Exposure\" com seus respectivos tamanhos médios de série.","external_knowledge":null}
{"instance_id":"sf_bq069","db":"IDC","question":"Você pode me ajudar a gerar um relatório de séries de imagens de TC da tabela dicom_all de modo que todas as séries da coleção NLST sejam excluídas, quaisquer localizadores ou séries comprimidas JPEG (sintaxes de transferência 1.2.840.10008.1.2.4.70 ou 1.2.840.10008.1.2.4.51) sejam ignoradas, e apenas aquelas que passam por verificações de geometria específicas — a saber, uma única orientação, espaçamento de pixels idêntico, contagens de SOP de instância e posição correspondentes, linhas e colunas de pixels uniformes, e um produto escalar próximo de 1 entre os vetores de orientação da imagem — sejam incluídas, ao mesmo tempo em que calculamos diferenças de intervalo de fatias, diferenças de exposição e o tamanho aproximado da série em MB para cada série qualificada?","external_knowledge":"nonNlstCohort.md"}
{"instance_id":"sf_bq219","db":"IOWA_LIQUOR_SALES","question":"No Iowa Liquor Sales dataset, a partir de January 1, 2022 até o último mês totalmente concluído, quais duas categorias de destilados, cada uma contribuindo com uma média de pelo menos 1% do volume mensal de vendas ao longo de pelo menos 24 meses de dados disponíveis, têm o menor coeficiente de correlação de Pearson ao comparar suas mudanças mensais no total de vendas de destilados nesses meses, e quais são seus nomes?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq199","db":"iowa_liquor_sales","question":"Identifique as 10 principais categorias de destilados em Iowa em 2021, calculando, para cada categoria, a média dos preços de varejo por litro em todas as transações de venda nessa categoria durante 2021. Para essas categorias principais, forneça seus preços médios de varejo por litro calculados da mesma forma para os anos de 2019, 2020 e 2021.","external_knowledge":null}
{"instance_id":"bq218","db":"iowa_liquor_sales","question":"Quais são os 5 itens com o maior percentual de crescimento ano a ano na receita total de vendas para o ano de 2023?","external_knowledge":null}
{"instance_id":"bq049","db":"iowa_liquor_sales_plus","question":"Por favor, mostre as vendas mensais per capita de Bourbon Whiskey durante 2022 no Condado de Dubuque para o código postal que ocupa o terceiro lugar em vendas totais de Bourbon Whiskey, usando apenas a população com 21 anos ou mais.","external_knowledge":null}
{"instance_id":"bq360","db":"nppes","question":"Entre os provedores de assistência à saúde cuja localização de prática é Mountain View, CA, e que possuem uma especialização especificada no campo healthcare provider taxonomy, identifique as 10 especializações mais comuns com base na contagem de NPIs distintos. Em seguida, determine qual dentre essas 10 principais tem uma contagem de NPIs distintos mais próxima da média das contagens entre essas 10 especializações.","external_knowledge":null}
{"instance_id":"bq286","db":"usa_names","question":"Você pode me dizer o nome do bebê feminino mais popular em Wyoming no ano de 2021, com base na proporção de bebês do sexo feminino com esse nome em relação ao número total de bebês do sexo feminino com o mesmo nome em todos os estados?","external_knowledge":null}
{"instance_id":"sf_bq044","db":"TCGA","question":"Para pacientes com câncer de bexiga que apresentam mutações no gene CDKN2A (cyclin-dependent kinase inhibitor 2A), usando dados clínicos do Genomic Data Commons Release 39, quais são os tipos de mutações, qual é o sexo, o estado vital e os dias até a morte - e para quatro genes a jusante (MDM2 (MDM2 proto-oncogene), TP53 (tumor protein p53), CDKN1A (cyclin-dependent kinase inhibitor 1A) e CCNE1 (Cyclin E1)), quais são os níveis de expressão gênica de cada paciente?","external_knowledge":"TCGA_Study_Abbreviations.md"}
{"instance_id":"sf_bq043","db":"TCGA","question":"Quais são os níveis de expressão de RNA dos genes MDM2, TP53, CDKN1A e CCNE1, juntamente com informações clínicas associadas, em pacientes com câncer de bexiga com mutações em CDKN2A no projeto 'TCGA-BLCA'? Use dados clínicos do Genomic Data Commons Release 39, dados sobre mutações somáticas derivados da referência do genoma humano hg19 em fevereiro de 2017.","external_knowledge":null}
{"instance_id":"bq143","db":"CPTAC_PDC","question":"Use dados de proteômica CPTAC e RNAseq para Carcinoma de Células Renais Claras para selecionar amostras de 'Primary Tumor' e 'Solid Tissue Normal'. Junte os conjuntos de dados com base nos IDs do remetente da amostra e nos símbolos dos genes. Calcule a correlação entre a abundância de proteína (razão log2) e os níveis de expressão gênica (FPKM log-transformado+1) para cada gene e tipo de amostra. Filtre as correlações com valor absoluto maior que 0,5 e calcule a correlação média para cada tipo de amostra.","external_knowledge":null}
{"instance_id":"sf_bq147","db":"TCGA","question":"Você consegue identificar os casos de câncer de mama TCGA a partir do sequenciamento de RNA hg38 r35`, nos quais o gene protein_coding e o projeto TCGA-BRCA estejam presentes, e que possuam amostras de sequenciamento de RNA de vários tipos de tecido — incluindo \"Solid Tissue Normal\" — dentro do mesmo caso?","external_knowledge":null}
{"instance_id":"sf_bq148","db":"TCGA","question":"Você poderia identificar os cinco principais genes codificadores de proteínas que apresentam a maior variância em seus níveis de expressão (medidos como fpkm_uq_unstranded), especificamente dentro de amostras 'Solid Tissue Normal'? Por favor, limite a análise aos casos do projeto TCGA-BRCA que incluam pelo menos um tipo de amostra 'Solid Tissue Normal'.","external_knowledge":null}
{"instance_id":"sf_bq175","db":"TCGA_MITELMAN","question":"Identifique os nomes de citobandas no cromossomo 1 no conjunto de dados de segmentação alélica TCGA-KIRC, onde a frequência de amplificações, ganhos e deleções heterozigóticas esteja entre as 11 melhores posições. Calcule esses rankings com base no número máximo de cópias observado em vários estudos genômicos sobre câncer de rim, refletindo a gravidade das alterações genéticas.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"sf_bq176","db":"TCGA_MITELMAN","question":"Identifique os barcodes de caso do estudo TCGA-LAML com o maior número de cópias médio ponderado na citobanda 15q11 no cromossomo 15, usando dados de segmentos e sobreposições de citobandas dos bancos de dados genômicos do TCGA e Mitelman.","external_knowledge":null}
{"instance_id":"sf_bq170","db":"TCGA_MITELMAN","question":"Para casos de câncer de mama (TCGA-BRCA) do Release 23 do arquivo ativo do GDC, identifique e classifique variações no número de cópia (CNVs) em todos os citobandas de cada cromossomo. Para cada citobanda e para cada caso, determine a sobreposição entre a região do citobanda e os segmentos de número de cópia do caso, e calcule a média ponderada do número de cópia pela sobreposição para esse citobanda no caso, arredondando para o inteiro mais próximo. Classifique o número de cópia arredondado nos tipos de CNV da seguinte forma: deleções homozigóticas (0), deleções heterozigóticas (1), estado diploide normal (2), ganhos (3) e ampliações (>3). Para cada citobanda, forneça seu nome e posições de início/fim, e calcule a frequência de cada tipo de CNV entre todos os casos como uma porcentagem do total de casos, arredondada para duas casas decimais.","external_knowledge":"copy_number_variations.md"}
{"instance_id":"sf_bq150","db":"TCGA_HG19_DATA_V0","question":"","external_knowledge":"TCGA_F_Score.md"}
{"instance_id":"sf_bq152","db":"TCGA_HG38_DATA_V0","question":"Para casos de câncer de mama (TCGA-BRCA) da Release 23 do arquivo ativo do GDC, identifique e classifique variações no número de cópias (CNVs) em todas as citobandas em todos os cromossomos. Para cada citobanda e para cada caso, determine a sobreposição entre a região da citobanda e os segmentos de número de cópia do caso, e calcule a média ponderada pela sobreposição do número de cópia para essa citobanda no caso, arredondando para o inteiro mais próximo. Classifique o número de cópia arredondado nos tipos de CNV conforme: deleções homozigóticas (0), deleções heterozigóticas (1), estado diploide normal (2), ganhos (3), e amplificações (maior que 3). Para cada citobanda, forneça seu nome e as posições de início/fim, e calcule a frequência de cada tipo de CNV entre todos os casos como uma porcentagem do total de casos, arredondada para duas casas decimais.","external_knowledge":null}
{"instance_id":"sf_bq155","db":"TCGA_HG38_DATA_V0","question":"Na coorte TCGA-BRCA de pacientes com 80 anos ou menos no diagnóstico e com estágio patológico de Estágio I, Estágio II ou Estágio IIA, calcule o t-statístico derivado da correlação de Pearson entre as expressões médias RNA-Seq transformadas em log10 (usando HTSeq__Counts + 1) do gene SNORA31 e as expressões médias de microRNA-Seq de todos os microRNAs únicos, considerando apenas pares com mais de 25 amostras e em que o coeficiente de correlação de Pearson absoluto esteja entre 0.3 e 1.0","external_knowledge":null}
{"instance_id":"sf_bq141","db":"TCGA_HG38_DATA_V0","question":"Usando o conjunto de dados TCGA-KIRP, select pacientes da tabela 'TCGA_bioclin_v0.Clinical' que tenham clinical_stage não nulo e um disease_code de 'KIRP'. Recupere seus dados de expressão gênica da tabela 'TCGA_hg38_data_v0.RNAseq_Gene_Expression' para os genes 'MT-CO3,' 'MT-CO1,' e 'MT-CO2,' e divida aleatoriamente os pacientes em um conjunto de treino (90%) e um conjunto de teste (10%) pelo método FARM_FINGERPRINT. Para cada clinical_stage no conjunto de treino, calcule a expressão média HTSeq__FPKM_UQ dos três genes. Para cada paciente no conjunto de teste, calcule a distância euclidiana entre os valores de expressão do paciente e as médias específicas de clinical_stage, e atribua esse paciente ao clinical_stage cuja média seja a mais próxima. Por fim, exiba o case_barcode e o clinical_stage previsto.","external_knowledge":null}
{"instance_id":"bq046","db":"TCGA_bioclin_v0","question":"Encontre códigos de barras de casos e seus URLs de arquivo GDC correspondentes para pacientes do sexo feminino com 30 anos ou menos diagnosticadas com câncer de mama (BRCA) no banco de dados TCGA. A consulta deve primeiro identificar pacientes da tabela Annotations onde entity_type é \"Patient\" e (category é \"History of unacceptable prior treatment related to a prior/other malignancy\" ou classificação é \"Redaction\"). Também identifique pacientes da tabela Clinical com disease_code \"BRCA\", age_at_diagnosis menor ou igual a 30, e gender \"FEMALE\". Realize um FULL JOIN entre esses dois conjuntos, mas apenas mantenha pacientes onde tanto categoryName quanto classificationName são NULL no resultado final. Use metadados GDC da archive release 14 (especificamente rel14_caseData, rel14_fileData_current, e rel14_GDCfileID_to_GCSurl_NEW tabelas) para obter as URLs de arquivo correspondentes.","external_knowledge":null}
{"instance_id":"sf_bq153","db":"PANCANCER_ATLAS_1","question":"Calcular, para cada tipo de histologia especificado no campo 'icd_o_3_histology' (excluindo os que estiverem entre colchetes), a média, por paciente, dos níveis de expressão log10(normalized_count + 1) do gene IGF2 entre pacientes LGG com dados de expressão IGF2 válidos. Combinar dados de expressão gênica e dados clínicos usando o campo ParticipantBarcode.","external_knowledge":null}
{"instance_id":"sf_bq154","db":"PANCANCER_ATLAS_1","question":"Pontuação H de Kruskal-Wallis entre grupos de pacientes com LGG para a expressão de IGF2, onde a expressão de IGF2 de cada paciente é determinada aplicando log10(normalized_count + 1) e, em seguida, fazendo a média entre as amostras. Agrupe os pacientes pelos códigos de histologia ICD-O-3, exclua quaisquer códigos totalmente entre colchetes, inclua apenas grupos com mais de um paciente e garanta que normalized_count não seja nulo. Por fim, retorne o número total de grupos, o número total de amostras e a pontuação H de Kruskal-Wallis em ordem decrescente.","external_knowledge":"Regulome_Explorer_Kruskal-Wallis_test_for_numerical_and_categorical_data.md"}
{"instance_id":"sf_bq156","db":"PANCANCER_ATLAS_1","question":"Calcular o t-score (arredondado para 2 casas decimais) para comparar a diferença nas médias dos níveis de expressão do gene DRG2 entre dois grupos (mutado em TP53 vs. não mutado) no estudo de glioma de baixo grau (LGG), onde os níveis de expressão são calculados como a média de log10(normalized_count + 1) para cada participante, considerando apenas amostras com mutações em TP53 que tenham o status 'FILTER' de 'PASS' nos dados de mutação, e desconsiderando quaisquer grupos com menos de 10 amostras ou com variância zero; consulte `t_score.md` para o método de cálculo do t-score.","external_knowledge":"t_score.md"}
{"instance_id":"sf_bq157","db":"PANCANCER_ATLAS_1","question":"Por favor, calcule o valor-t para determinar a diferença estatística na expressão do gene DRG2 entre pacientes com LGG com e sem mutação em TP53: para cada paciente, calcule a média de log10(normalized_count + 1) da expressão de DRG2 em todas as suas amostras, usando apenas amostras presentes na tabela `MC3_MAF_V5_one_per_tumor_sample` para o estudo LGG; identifique pacientes com mutação em TP53 a partir desta tabela onde `Hugo_Symbol` é 'TP53' e `FILTER` é 'PASS'; então realize um teste t comparando a média da expressão de DRG2 log-transformada entre pacientes com mutação em TP53 e sem mutação em TP53.","external_knowledge":"Regulome_Explorer_T_test_for_numerical_and_binary_data.md"}
{"instance_id":"sf_bq158","db":"PANCANCER_ATLAS_1","question":"Quais são os cinco principais tipos histológicos de câncer de mama (BRCA) no PanCancer Atlas que apresentam a maior porcentagem de mutações no gene CDH1?","external_knowledge":null}
{"instance_id":"sf_bq159","db":"PANCANCER_ATLAS_1","question":"Calcule o valor de qui-quadrado para avaliar a associação entre os tipos histológicos e a presença de mutações no gene CDH1 em pacientes com BRCA usando dados do PanCancer Atlas. Concentre-se em pacientes com tipos histológicos conhecidos e considere apenas entradas de mutação confiáveis. Exclua quaisquer tipos histológicos ou status de mutação com totais marginais menores ou iguais a 10. Faça a correspondência entre dados clínicos e de mutação usando ParticipantBarcode","external_knowledge":null}
{"instance_id":"bq161","db":"pancancer_atlas_2","question":"Calcule a diferença líquida entre o número de pacientes com adenocarcinoma pancreático (PAAD) no conjunto de dados do TCGA que foram confirmados como possuindo mutações em ambos os genes KRAS e TP53, e aqueles sem mutações em nenhum desses genes. Utilize dados clínicos e de acompanhamento dos pacientes, juntamente com detalhes de mutações genômicas do banco de dados de genômica do câncer do TCGA, concentrando-se especificamente em estudos PAAD nos quais as mutações passaram pelos filtros de qualidade.","external_knowledge":null}
{"instance_id":"bq151","db":"pancancer_atlas_2","question":"Usando o conjunto de dados TCGA, calcule a estatística qui-quadrada para avaliar a associação entre mutações nos genes KRAS e TP53 em pacientes diagnosticados com adenocarcinoma pancreático (PAAD). Incorpore dados de acompanhamento clínico e anotações de mutações de alta qualidade para determinar com precisão a frequência de pacientes com mutações co-ocorrentes em KRAS e TP53 em comparação com aqueles em que cada mutação ocorre de forma independente. Assegure-se de que os registros de pacientes sejam meticulosamente pareados com base em identificadores únicos para manter a integridade dos dados. Esta análise visa identificar e quantificar possíveis correlações entre alterações genéticas em KRAS e TP53 dentro da população de pacientes com PAAD.","external_knowledge":null}
{"instance_id":"bq162","db":"HTAN_1","question":"Com base na 5ª revisão (r5) dos dados HTAN, liste os tipos de ensaio de imagem disponíveis no centro HTAN WUSTL que possuam dados Level2 e quaisquer dados de nível superior associados (Level3, Level4) derivados deles por meio de relações 'entityId' na tabela 'id_provenance_r5'; exclua quaisquer registros em que o 'Component' seja NULL ou contenha 'Auxiliary' ou 'OtherAssay'; para cada tipo de ensaio de imagem, forneça os níveis de dados disponíveis (Level2, Level3, Level4), e não inclua dados Level1 nem tipos de ensaio de Microscopia Eletrônica.","external_knowledge":null}
{"instance_id":"sf_bq163","db":"HTAN_2","question":"Quais são os 20 genes no conjunto de dados HTAN scRNAseq MSK-SCLC de amostras combinadas que apresentam a maior diferença na expressão média de X_value entre células epiteliais femininas e masculinas, especificamente no cluster 41 de pacientes humanos com 74 anos de idade em estágio? Calcule a diferença subtraindo a média masculina de X_value da média feminina de X_value para cada gene.","external_knowledge":null}
{"instance_id":"sf_bq164","db":"HTAN_2","question":"Consolide metadados de conjuntos de dados de transcriptômica espacial e scRNAseq—incluindo os níveis 1 a 4 e arquivos auxiliares—para o ID de execução 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test'. Inclua Filename, HTAN Parent Biospecimen ID, Component, File Format, Entity ID e Run ID.","external_knowledge":null}
{"instance_id":"sf_bq166","db":"TCGA_MITELMAN","question":"Usando dados de número de cópia em nível de segmento do dataset copy_number_segment_allelic_hg38_gdc_r23, restrito às amostras 'TCGA-KIRC', mescle esses segmentos com as definições de banda citogenética em 'CytoBands_hg38' para identificar o número máximo de cópias de cada amostra por citobanda. Classifique esses números máximos de cópia em amplificações (>3), ganhos (=3), deleções homozigóticas (=0), deleções heterozigóticas (=1) ou normais (=2), em seguida calcule a frequência de cada subtipo em relação ao total de casos distintos, e por fim apresente essas frequências como percentuais ordenados por cromossomo e citobanda.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"bq165","db":"mitelman","question":"Você pode usar as coordenadas genômicas do CytoConverter para calcular a frequência de ganhos e perdas cromossômicas ao longo de uma coorte de amostras de câncer de mama (morphology='3111') e amostras de adenocarcinoma (topology='0401')? Especificamente, por favor inclua o número e a frequência (duas casas decimais em porcentagem) de ampliações (ganhos de mais de 1 cópia), ganhos (1 cópia adicional), perdas (1 cópia) e deleções homozigóticas (perda de 2 cópias) para cada banda cromossômica. E ordene o resultado pelo número do cromossomo e pela posição de base inicial e final de cada banda em ordem crescente.","external_knowledge":null}
{"instance_id":"bq169","db":"mitelman","question":"Recupere referências de caso distintas, números de caso, números de investigação e informações de clonagem, onde um único clone exibe simultaneamente as três alterações genéticas a seguir: (1) uma perda no cromossomo 13 entre as posições 48,303,751 e 48,481,890, (2) uma perda no cromossomo 17 entre as posições 7,668,421 e 7,687,490, e (3) um ganho no cromossomo 11 entre as posições 108,223,067 e 108,369,102. Para cada clone correspondente, exiba os detalhes cromossomais de cada uma dessas três regiões (incluindo o número do cromossomo representado por ChrOrd, posição inicial e posição final) e a descrição curta correspondente do cariótipo da tabela KaryClone. Use o CytoConverted e o KaryClone.","external_knowledge":null}
{"instance_id":"bq111","db":"mitelman","question":"Você poderia calcular, por cromossomo, a correlação de Pearson entre a frequência de aberrações no número de cópias (incluindo amplificações, ganhos, perdas e deleções) provenientes do banco de dados Mitelman para casos com morph = 3111 e topo = 0401, e aquelas calculadas a partir dos dados TCGA, retornando os coeficientes de correlação e os p-valores correspondentes para cada tipo de aberração, garantindo que apenas os resultados com pelo menos cinco registros correspondentes sejam exibidos.","external_knowledge":"Correlations_between_Mitelman_and_TCGA_datasets.md"}
{"instance_id":"sf_bq451","db":"_1000_GENOMES","question":"Extraia dados de genótipo para polimorfismos de nucleotídeo único (SNPs) no cromossomo X, excluindo posições onde o valor de `start` está entre 59999 e 2699519 ou entre 154931042 e 155260559. Para cada amostra, identifique chamadas de genótipo em que o array de genótipos possua pelo menos um alelo. Classifique cada chamada de genótipo em uma das seguintes categorias: alelos homozigotos de referência (ambos os alelos são 0), alelos homozigotos alternativos (ambos os alelos são iguais e maiores que 0), ou alelos heterozigotos (alelos são diferentes, ou qualquer alelo é nulo, e pelo menos um alelo é maior que 0). Calcule o número total de sites utilizáveis (a soma das três categorias de genótipo), o número de chamadas de genótipo homozigotos de referência, homozigotos alternativos e heterozigotos, o número total de variantes de nucleotídeo único (SNVs) como a soma de chamadas de genótipo homozigotos alternativos e heterozigotos, a porcentagem de chamadas de genótipo heterozigotos entre todos os SNVs, e a porcentagem de chamadas de genótipo homozigotos alternativos entre todos os SNVs. Exiba o ID da amostra juntamente com esses totais e porcentagens calculados, e classifique os resultados pela porcentagem de chamadas de genótipo heterozigotos entre SNVs em ordem decrescente, depois pelo ID da amostra.","external_knowledge":"1000_genomes_alleles_type.md"}
{"instance_id":"sf_bq452","db":"_1000_GENOMES","question":"Identifique variantes no cromossomo 12 e, para cada variante, calcule a pontuação de qui-quadrado usando contagens de alelos em casos e controles, onde casos são indivíduos da superpopulação 'EAS' e controles são indivíduos de todas as outras superpopulações. Aplique a correção de Yates para continuidade no cálculo do qui-quadrado, garantindo que as contagens esperadas de cada alelo em ambos os grupos sejam de pelo menos 5. Retorne a posição inicial, a posição final e a pontuação de qui-quadrado das variantes com as maiores pontuações de qui-quadrado, sendo a pontuação de qui-quadrado pelo menos 29.71679.","external_knowledge":null}
{"instance_id":"sf_bq453","db":"_1000_GENOMES","question":"No cromossomo 17, entre as posições 41196311 e 41277499, quais são os nomes de referência, as posições de início e fim, as bases de referência, as bases alternativas distintas, os tipos de variantes e os valores de qui-quadrado (calculados a partir do equilíbrio de Hardy-Weinberg), juntamente com o número total de genótipos, suas contagens observadas e esperadas para genótipos homozigotos de referência, heterozigotos e homozigotos alternativos, bem como as frequências alélicas (incluindo aquelas do 1KG), para cada variante?","external_knowledge":null}
{"instance_id":"sf_bq454","db":"_1000_GENOMES","question":"Para o conjunto de dados do 1000 Genomes, analise variantes autossômicas comuns (aquelas com frequência alélica de pelo menos 0.05) em diferentes superpopulações. Para cada superpopulação, conte quantas variantes são compartilhadas por cada número específico de amostras dentro dessa superpopulação. Inclua em seus resultados o tamanho total da população de cada superpopulação, se a variante é comum (frequência alélica ≥ 0.05), o número de amostras que possuem cada variante e o total de variantes compartilhadas por esse número de amostras. Apenas inclua variantes autossômicas, excluindo explicitamente os cromossomos sexuais (X, Y) e o DNA mitocondrial (MT) da análise. Considere apenas as amostras que apresentem pelo menos um alelo alternativo (não de referência) para a variante.","external_knowledge":null}
{"instance_id":"sf_bq415","db":"HUMAN_GENOME_VARIANTS","question":"Liste as 10 principais amostras nos dados do genoma que possuem o maior número de posições em que há exatamente um alelo alternativo e o genótipo da amostra é homozigoto para o alelo de referência (ambos os alelos são 0). Ordene os resultados em ordem decrescente com base nessas contagens.","external_knowledge":"Homozygous_Reference_Genotype.md"}
{"instance_id":"bq279","db":"austin","question":"Você pode fornecer o número de estações distintas de compartilhamento de bicicletas ativas e fechadas para cada ano de 2013 e 2014?","external_knowledge":null}
{"instance_id":"bq281","db":"austin","question":"Qual é o maior número de passeios de bicicleta elétrica com duração superior a 10 minutos realizados por assinantes com 'Student Membership' em um único dia, excluindo passeios que começam ou terminam em 'Mobile Station' ou 'Repair Shop'?","external_knowledge":null}
{"instance_id":"bq282","db":"austin","question":"Você pode me dizer o valor numérico do distrito do conselho ativo em Austin que tem o maior número de viagens de bicicleta que começam e terminam dentro do mesmo distrito, mas não na mesma estação?","external_knowledge":null}
{"instance_id":"bq006","db":"austin","question":"Qual é a data com o segundo maior Z-score para as contagens diárias de incidentes de 'PUBLIC INTOXICATION' em Austin para o ano de 2016? Liste a data no formato de '2016-xx-xx'.","external_knowledge":null}
{"instance_id":"sf_bq283","db":"AUSTIN","question":"Entre todas as estações que estão atualmente ativas, identifique aquelas que ocupam as 15 primeiras posições (incluindo empates) com base no número total de viagens iniciadas em cada estação. Para cada uma dessas estações, retorne o ID da estação, o número total de viagens iniciadas, a porcentagem dessas viagens em relação ao total de viagens iniciadas das estações ativas e a duração média das viagens em minutos. Ordene os resultados pela posição da estação.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq284","db":"bbc","question":"Você pode fornecer uma divisão do número total de artigos entre diferentes categorias e a porcentagem desses artigos que mencionam \"educação\" em cada categoria da BBC News?","external_knowledge":null}
{"instance_id":"bq413","db":"dimensions_ai_covid19","question":"Recupere os títulos do veículo de publicação das publicações que possuam um `date_inserted` a partir do ano de 2021 e que estejam associadas a uma grid cuja cidade do endereço seja 'Qianjiang'. Para cada publicação, priorize o título do venue, selecionando primeiro o título da revista, se existir; se não, então o título das atas; se isso também não estiver disponível, então o título do livro; e, por fim, se nenhum desses estiver disponível, o título da série de livros.","external_knowledge":null}
{"instance_id":"bq425","db":"ebi_chembl","question":"Usando dados do ChEMBL Release 23, recupere todas as moléculas distintas associadas à empresa 'SanofiAventis', listando o nome comercial e a data de aprovação mais recente para cada molécula. Certifique-se de manter apenas a data de aprovação mais recente por molécula e garantir que o campo da empresa corresponda exatamente a 'SanofiAventis' sem depender de outros campos.","external_knowledge":null}
{"instance_id":"bq430","db":"ebi_chembl","question":"Encontre pares de moléculas diferentes testadas no mesmo ensaio e no mesmo tipo de padrão, onde ambas possuem entre 10 e 15 átomos pesados, menos de 5 atividades naquele ensaio, menos de 2 atividades duplicadas, valores padrão não nulos e valores de pChEMBL superiores a 10. Para cada par, relate a contagem máxima de átomos pesados, a data de publicação mais recente (calculada com base no ranking do documento dentro do mesmo periódico e ano, e mapeada para um mês e dia sintéticos), o maior ID de documento, classifique a mudança nos valores padrão como 'aumento', 'diminuição' ou 'sem mudança' com base em seus valores e relações, e gere UUIDs a partir de seus IDs de atividade e SMILES canônico.","external_knowledge":"chembl.md"}
{"instance_id":"bq023","db":"fec","question":"Usando a 2018 5-Year American Community Survey (ACS) para a renda mediana ao nível de tracto censitário e o conjunto de dados de contribuições individuais da Federal Election Commission (FEC) de 2020 filtrado para doadores em Nova York, mapeado às geometrias de tracto censitário via um crosswalk de código ZIP para tracto censitário, calcule e liste o valor médio de doação política e a renda mediana para cada tracto censitário localizado no Kings County (Brooklyn), Nova York.","external_knowledge":null}
{"instance_id":"bq094","db":"fec","question":"Por favor, forneça uma lista de todos os comitês de 2016 que apoiaram pelo menos um candidato e receberam um montante total de contribuições individuais entre $0 e $200 (incluindo valores maiores que $0 e menores que $200), em que essas doações de baixo valor somam mais de $0 no total. Para cada comitê que se qualifique, inclua o nome do comitê, o número de candidatos únicos que apoiou, os nomes dos candidatos em ordem alfabética (separados por vírgulas) e a soma total dessas doações de baixo valor recebidas pelo comitê.","external_knowledge":null}
{"instance_id":"bq287","db":"fda","question":"Entre todos os códigos ZIP de Utah, qual é a taxa de emprego da American Community Survey de 2017 para a população com 16 anos ou mais no código ZIP que possui o menor número de agências bancárias seguradas pela FDIC?","external_knowledge":null}
{"instance_id":"bq432","db":"fda","question":"Por favor, forneça os dados de eventos alimentares onde tanto \"date_created\" quanto \"date_started\" estejam entre January 1 e January 31, 2015, aplique as seguintes etapas de limpeza de dados: divida os campos reactions e outcomes em arrays por vírgulas; trate padrões numéricos especiais no campo products_brand_name (onde um dígito é seguido por vírgula e outro dígito) preservando esses padrões numéricos, substituindo as outras \", \" por \" -- \"; substitua \", \" por \" -- \" nos campos products_industry_code, products_role e products_industry_name; e calcule industry_code_length e brand_name_length como os comprimentos dos arrays após a divisão.","external_knowledge":"Food_Event_Cleansing_Logic.md"}
{"instance_id":"bq285","db":"fda","question":"Você poderia me fornecer o código postal da localização que tem o maior número de instituições bancárias na Flórida?","external_knowledge":null}
{"instance_id":"bq288","db":"fda","question":"Qual é o número total de todas as instituições bancárias no estado que possui a maior soma de ativos de bancos estabelecidos entre 1º de janeiro de 1900 e 31 de dezembro de 2000, com os nomes das instituições começando com 'Bank'?","external_knowledge":null}
{"instance_id":"sf_bq412","db":"GOOGLE_ADS","question":"Por favor recupere as URLs das páginas, o primeiro horário exibido, o último horário exibido, o motivo de remoção, a categoria de violação e os limites inferior e superior dos tempos exibidos para os cinco anúncios removidos mais recentemente na região da Croácia (código da região 'HR'), onde a data de disponibilidade dos horários exibidos é nula, o limite inferior dos tempos exibidos excede 10,000, o limite superior dos tempos exibidos está abaixo de 25,000, e os anúncios utilizaram pelo menos uma abordagem de seleção de público entre demografia, localização geográfica, sinais contextuais, listas de clientes ou tópicos de interesse, ordenando os anúncios resultantes pelo seu último horário exibido, em ordem decrescente.","external_knowledge":null}
{"instance_id":"sf_bq423","db":"GOOGLE_ADS","question":"Entre 1 de janeiro de 2023 e 1 de janeiro de 2024, qual anúncio do tipo imagem, sobre o tema Saúde, publicado por um anunciante verificado localizado em Chipre, foi exibido na Croácia, tem times_shown_availability_date como NULL (significando que os dados de times exibidos estão disponíveis), utilizou informações demográficas, segmentação por geolocalização, sinais contextuais, listas de clientes e tópicos de interesse sem que algum desses métodos de seleção tenha ficado sem uso, e adicionalmente teve a data de exibição inicial estritamente posterior a 1 de janeiro de 2023 e a data de exibição final estritamente anterior a 1 de janeiro de 2024? Entre tais anúncios, forneça o URL da página do anúncio com o maior limite superior do número de exibições.","external_knowledge":null}
{"instance_id":"sf_bq070","db":"IDC","question":"Você pode fornecer um conjunto de dados limpo e estruturado a partir da tabela dicom_all que inclua apenas imagens SM marcadas como VOLUME das coleções TCGA-LUAD e TCGA-LUSC, excluindo quaisquer lâminas com o tipo de compressão “other,” onde a etapa de preparação da amostra explicitamente tenha “Embedding medium” definido como “Tissue freezing medium,” e garantindo que o tipo de tecido seja apenas “normal” ou “tumor” e o subtipo de câncer seja informado conforme?","external_knowledge":"dicom_dataset_selection.md"}
{"instance_id":"sf_bq320","db":"IDC","question":"Na tabela dicom_pivot, quantos valores únicos de StudyInstanceUID correspondem exatamente ao SegmentedPropertyTypeCodeSequence de \"15825003\" (insensível a maiúsculas/minúsculas) e também possuam um collection_id igual a \"Community\" ou \"nsclc_radiomics\"?","external_knowledge":null}
{"instance_id":"sf_bq321","db":"IDC","question":"Quantas StudyInstanceUIDs únicas existem nas séries DWI, T2 ponderado axial, coeficiente de difusão aparente e segmentações axiais ponderadas em T2 na coleção 'qin_prostate_repeatability'?","external_knowledge":null}
{"instance_id":"sf_bq323","db":"IDC","question":"Na coleção 'prostatex', para sequências de RM em que a Modality é 'MR', atribua a etiqueta 't2w_prostateX' às sequências cujas SeriesDescription contêm 't2_tse_tra' e 'adc_prostateX' às sequências cujas SeriesDescription contêm 'ADC'. Para todas as sequências rotuladas como 't2w_prostateX' ou 'adc_prostateX', calcule a média de Tempo de Repetição, a média de Tempo de Eco e a média de Espessura de Fatia, e então some essas médias para obter a média geral combinada.","external_knowledge":null}
{"instance_id":"sf_bq417","db":"IDC","question":"Por favor forneça informações de identificação, informações de estudo e série, local de armazenamento e tamanho total em MB para as imagens médicas pertencentes a pacientes do sexo masculino que têm exatamente 18 anos com base na porção numérica do campo PatientAge, em que o BodyPartExamined está definido como 'MEDIASTINUM' e a data do estudo é estritamente posterior a 1 de setembro de 2014.","external_knowledge":"IDC_data_model.md"}
{"instance_id":"sf_bq455","db":"IDC","question":"Identifique as cinco maiores séries de TC por tamanho (em MiB), incluindo o SeriesInstanceUID, o número da série, o ID do paciente e o tamanho da série. Essas séries devem ser da modalidade CT e não fazerem parte da coleção 'nlst'. Exclua qualquer série em que o ImageType seja classificado como 'LOCALIZER' ou em que o TransferSyntaxUID seja um de '1.2.840.10008.1.2.4.70' ou '1.2.840.10008.1.2.4.51' (ou seja, JPEG comprimido). As séries selecionadas devem ter intervalos de fatia consistentes, níveis de exposição, orientação da imagem (com apenas um valor único de ImageOrientationPatient), espaçamento de pixels, posições da imagem (tanto no eixo z quanto nas posições xy) e dimensões de pixels (linhas e colunas). Certifique-se de que o número de imagens corresponda ao número de posições únicas no eixo z, indicando que não há fatias duplicadas. Além disso, o componente do eixo z do produto cruzado das direções cosines x e y de ImageOrientationPatient deve ter valor absoluto entre 0.99 e 1.01, garantindo alinhamento com o plano de imagem esperado. Por fim, ordene os resultados pelo tamanho da série em ordem decrescente e limite a saída às cinco primeiras séries que atendam a estas condições.","external_knowledge":null}
{"instance_id":"sf_bq456","db":"IDC","question":"Por favor, recupere da tabela dicom_all cada PatientID, StudyInstanceUID, StudyDate e o CodeMeaning de FindingSite para pacientes cujo StudyDate esteja no ano de 2001, juntamente com os valores máximos de cada uma das seguintes medições identificadas pelo CodeMeaning (Elongation, Flatness, Least Axis in 3D Length, Major Axis in 3D Length, Maximum 3D Diameter of a Mesh, Minor Axis in 3D Length, Sphericity, Surface Area of Mesh, Surface to Volume Ratio, Volume from Voxel Summation, e Volume of Mesh), garantindo que a tabela quantitative_measurements seja ligada por segmentationInstanceUID correspondente ao SOPInstanceUID em dicom_all, e agrupando por PatientID, StudyInstanceUID, StudyDate e FindingSite CodeMeaning.","external_knowledge":null}
{"instance_id":"sf_bq324","db":"IDC","question":"Quantos quadros no total existem em todas as imagens de microscopia de lâmina inteira da coleção TCGA-BRCA que utilizam a modalidade SM e incluem uma etapa de coloração baseada em eosina em sua SpecimenPreparationSequence?","external_knowledge":null}
{"instance_id":"bq418","db":"targetome_reactome","question":"Determine quais são as três vias de nível mais baixo do Reactome (com evidência TAS) que apresentam as maiores estatísticas qui-quadradas, considerando apenas alvos de Homo sapiens associados ao sorafenib, sob as condições de que o valor mediano do ensaio seja ≤ 100 e que tanto os valores de ensaio baixos quanto altos sejam ≤ 100 ou nulo. Para cada uma dessas três vias, quantos desses alvos e não-alvos ficam dentro da via e fora dela?","external_knowledge":null}
{"instance_id":"bq330","db":"fda","question":"Qual código postal do Colorado tem a maior concentração de agências bancárias por grupo de blocos, com base na sobreposição entre códigos postais e grupos de blocos?","external_knowledge":"overlap_ratio.md"}
{"instance_id":"bq398","db":"world_bank","question":"Quais são os três principais indicadores de dívida da Rússia com base nos maiores valores de dívida?","external_knowledge":null}
{"instance_id":"bq399","db":"world_bank","question":"Qual país de alta renda teve a maior taxa média de natalidade bruta em cada região, respectivamente, e quais são suas respectivas taxas médias de natalidade durante a década de 1980?","external_knowledge":null}
{"instance_id":"bq457","db":"libraries_io","question":"Obtenha detalhes de repositórios que utilizam bibliotecas específicas de `feature toggle`. Para cada repositório, inclua o nome completo com o proprietário, tipo de plataforma de hospedagem, tamanho em bytes, idioma de programação principal, nome da fonte de fork (se houver), o carimbo de data e hora da última atualização, os nomes de artefato e de biblioteca do `feature toggle` utilizado e as linguagens de programação da biblioteca. Inclua repositórios que dependam das bibliotecas de `feature toggle` especificadas, definidas pelos nomes de artefato, nomes de biblioteca, plataformas e linguagens.","external_knowledge":"feature_toggle_libraries.md"}
{"instance_id":"bq227","db":"london","question":"Você poderia fornecer as participações percentuais anuais, arredondadas para duas casas decimais, das 5 principais categorias de crimes menores a partir de 2008 nos crimes totais de Londres, com cada ano apresentado em uma linha?","external_knowledge":null}
{"instance_id":"bq232","db":"london","question":"Você poderia fornecer o número total de incidentes de 'Other Theft' dentro da categoria 'Theft and Handling' para cada ano no distrito de Westminster?","external_knowledge":null}
{"instance_id":"bq228","db":"london","question":"Por favor, forneça uma lista das três principais categorias de crime no distrito de Barking and Dagenham, juntamente com o número de incidentes em cada categoria.","external_knowledge":null}
{"instance_id":"bq229","db":"open_images","question":"Usando o conjunto de dados bigquery-public-data.open_images, você pode fornecer uma contagem de quantos URLs de imagem distintos são categorizados como 'gato' (onde a imagem possui o rótulo '/m/01yrx' com confiança=1) e quantos URLs de imagem distintos são categorizados como 'outro' (significando que não possuem nenhum rótulo de gato '/m/01yrx')?","external_knowledge":null}
{"instance_id":"bq230","db":"usda_nass_agriculture","question":"Usando o conjunto de dados de safras, encontre as cifras de produção total de 2022, medidas em bushels, para milho da categoria 'FIELD CROPS' e cogumelos do grupo 'HORTICULTURE' para cada estado dos EUA. Inclua apenas linhas de dados onde 'statisticcat_desc' é 'PRODUCTION', 'agg_level_desc' é 'STATE', 'value' não é nulo, e garanta que para o milho a 'unit_desc' seja 'BU'. Combine ambos os resultados para que os totais de 2022 de milho e cogumelos por estado sejam apresentados.","external_knowledge":null}
{"instance_id":"bq326","db":"world_bank","question":"Com base no conjunto de dados de população global do World Bank e no conjunto de dados População, Saúde e Nutrição do World Bank, quantos países experimentaram um aumento de mais de 1% em relação ao ano anterior até 2018, tanto na população total quanto no gasto atual com saúde per capita (PPP)?","external_knowledge":null}
{"instance_id":"bq424","db":"world_bank","question":"Liste os 10 países com a maior dívida externa de longo prazo, em ordem decrescente, excluindo os que não têm região especificada.","external_knowledge":null}
{"instance_id":"bq327","db":"world_bank","question":"Quantos indicadores de dívida para a Rússia têm um valor igual a 0, excluindo valores NULL?","external_knowledge":null}
{"instance_id":"bq328","db":"world_bank","question":"Qual região tem o PIB mediano mais alto (em US$ constantes de 2015)?","external_knowledge":null}
{"instance_id":"sf_bq331","db":"META_KAGGLE","question":"Encontre os três principais usuários que tenham publicado a primeira mensagem em tópicos de fórum, classificados em ordem decrescente de suas pontuações de mensagem, onde a pontuação de uma mensagem é definida como o número de usuários distintos que votaram nessa mensagem. Para cada um desses usuários, forneça seu nome de usuário e a diferença absoluta entre a pontuação da mensagem deles e a pontuação média das primeiras mensagens em tópicos de fórum.","external_knowledge":null}
{"instance_id":"sf_bq380","db":"META_KAGGLE","question":"Usando os dados das tabelas Forum Message Votes e Users, encontre os três usuários que receberam a maior quantidade de votos positivos distintos no fórum Kaggle. Para cada um desses usuários, liste seu nome de usuário, o número total de votos positivos distintos que eles receberam (com base no campo ToUserId) e o número total de votos positivos distintos que eles deram (com base no campo FromUserId), ordenados pelo número de votos positivos recebidos em ordem decrescente e limitados apenas aos três primeiros resultados.","external_knowledge":null}
{"instance_id":"sf_bq370","db":"WIDE_WORLD_IMPORTERS","question":"Quantos clientes possuem pedidos e faturas que correspondem ao nível de item de linha e, quando agregados, dão como resultado que cada cliente tenha uma contagem igual de pedidos e faturas, bem como um valor total idêntico para os pedidos e faturas?","external_knowledge":null}
{"instance_id":"sf_bq371","db":"WIDE_WORLD_IMPORTERS","question":"No ano de 2013, considerando o valor total de cada fatura como o produto do preço unitário pela quantidade e agrupando pelo trimestre (Q1, Q2, Q3, Q4) em que ocorre a data da fatura, qual é a diferença entre o valor médio máximo e o valor médio mínimo dessas faturas nesses trimestres?","external_knowledge":null}
{"instance_id":"sf_bq372","db":"WIDE_WORLD_IMPORTERS","question":"Entre todos os pedidos que não aparecem na tabela de faturas, para cada categoria de cliente calcule o valor máximo do pedido perdido e, em seguida, determine qual categoria de cliente tem o valor máximo do pedido perdido mais próximo da média geral desses valores máximos de pedidos perdidos entre todas as categorias?","external_knowledge":null}
{"instance_id":"sf_bq373","db":"WIDE_WORLD_IMPORTERS","question":"Usando a data da fatura para determinar cada mês do ano de 2014 e somando os valores das linhas de fatura para cada cliente ao longo desses meses, qual é a mediana do gasto mensal médio resultante entre todos os clientes?","external_knowledge":null}
{"instance_id":"bq393","db":"hacker_news","question":"Quero identificar usuários que tiveram atividade seguida de inatividade. Especificamente, encontre o ID do usuário e o número do mês correspondente (contando a partir do mês da primeira atividade dele) para o usuário com o maior número de meses que ficou inativo (sem atividade registrada) após o seu último mês de atividade registrado. Para esta análise, considere apenas os dados até 10 de setembro de 2024, e garanta que o número do mês represente a contagem de meses desde a primeira atividade do usuário. O usuário deve ter pelo menos um mês em que era esperado estar ativo (dentro do seu período de atividade), mas, na prática, não houve registros.","external_knowledge":null}
{"instance_id":"bq403","db":"irs_990","question":"Quais três anos entre 2012 e 2017 têm a menor diferença absoluta entre a receita mediana e as despesas funcionais medianas para organizações que apresentam formulários IRS 990? Por favor, informe três anos e as respectivas diferenças.","external_knowledge":null}
{"instance_id":"bq397","db":"ecommerce","question":"Depois de remover quaisquer registros duplicados do conjunto de dados rev_transactions, identifique cada agrupamento por canal que tenha transações de mais de um país. Para cada agrupamento por canal, encontre o país com o maior total de Transações e apresente tanto o nome do país quanto a soma de transações para esse agrupamento por canal.","external_knowledge":null}
{"instance_id":"bq402","db":"ecommerce","question":"Calcule a taxa de conversão de visitantes únicos para compradores usando apenas dados da tabela `web_analytics` no conjunto de dados `data-to-insights.ecommerce`. Um visitante é definido como um `fullVisitorId` único presente na tabela, enquanto um comprador é um visitante que tem pelo menos uma transação registrada (`totals.transactions` is not null). A taxa de conversão é obtida dividindo o número de compradores únicos pelo total de visitantes únicos. Além disso, calcule a média de transações por comprador, considerando apenas os visitantes que efetuaram pelo menos uma transação.","external_knowledge":null}
{"instance_id":"sf_bq160","db":"META_KAGGLE","question":"Por favor forneça a data de criação, o título, o título do fórum pai, a contagem de respostas, a contagem de respostas de usuários distintos, os totais de votos positivos e as visualizações totais para os cinco tópicos de fórum mais antigos que pertencem a qualquer subfórum sob o fórum pai intitulado \"General\". A contagem de respostas deve ser calculada como o número total de mensagens associadas a cada tópico, e a contagem de respostas de usuários distintos deve ser o número de usuários únicos que postaram mensagens no tópico. Os votos positivos devem ser calculados como o número total de votos positivos em todas as mensagens dentro de cada tópico. Se algum valor estiver ausente ou for None, por favor trate-os como zero","external_knowledge":null}
{"instance_id":"sf_bq167","db":"META_KAGGLE","question":"Identifique o par de usuários do Kaggle envolvidos em ForumMessageVotes, de modo que um usuário tenha dado ao outro o maior número distinto de votos positivos; em seguida, também exiba quantos votos positivos esse destinatário retornou. Apresente os nomes de usuário de ambos os usuários, o total distinto de votos positivos que um recebeu do outro, e os votos positivos que eles deram de volta, ordenando pelo maior número recebido e, em seguida, pelo maior número dado, e mostre apenas o resultado superior.","external_knowledge":null}
{"instance_id":"sf_bq171","db":"META_KAGGLE","question":"De quem são os votos positivos das mensagens do fórum mais próximos da média em 2019? Se houver empate, indique aquele com o nome de usuário que vem primeiro em ordem alfabética.","external_knowledge":null}
{"instance_id":"sf_bq118","db":"DEATH","question":"Entre indivíduos identificados como brancos, quão maior é, em média, o número de mortes provenientes de códigos ICD-10 cujas descrições contêm a palavra “secreção” (excluindo especificamente “secreção uretral”, “Disparo de fogos de artifício” e “intervenção legal envolvendo disparo de arma de fogo”) em comparação com o número médio de mortes provenientes de códigos ICD-10 cujas descrições contêm a palavra “veículo”, quando agregado por faixas etárias?","external_knowledge":null}
{"instance_id":"sf_bq072","db":"DEATH","question":"Por favor, forneça, para cada idade entre 12 e 18 anos (inclusive), o número total de mortes e o número de mortes entre indivíduos identificados como negro (com base em descrições de raça que contenham a palavra 'negro'), especificamente para mortes associadas a códigos ICD-10 cujas descrições incluam a palavra 'veículo' e para mortes associadas a códigos ICD-10 cujas descrições incluam a palavra 'arma de fogo'. Use a tabela EntityAxisConditions para determinar quais códigos ICD-10 estiveram envolvidos em cada morte, em vez de realizar a junção das informações do código ICD-10 diretamente nos registros de morte.","external_knowledge":null}
{"instance_id":"ga001","db":"ga4","question":"Quero conhecer as preferências dos clientes que compraram o Google Navy Speckled Tee em dezembro de 2020. Qual foi o outro produto adquirido com a maior quantidade total juntamente com este item?","external_knowledge":null}
{"instance_id":"ga002","db":"ga4","question":"Diga-me quais são os outros produtos mais comprados e as suas quantidades pelos clientes que compraram o Google Red Speckled Tee em cada mês durante os três meses, começando em novembro de 2020.","external_knowledge":null}
{"instance_id":"ga003","db":"firebase","question":"Estou tentando avaliar quais tipos de tabuleiro foram mais eficazes em 15 de setembro de 2018. Você pode descobrir as pontuações médias para cada tipo de tabuleiro a partir das finalizações no modo de jogo rápido naquele dia?","external_knowledge":null}
{"instance_id":"ga004","db":"ga4","question":"Você consegue descobrir a diferença média de pageviews entre usuários que compraram algo e aqueles que não compraram em dezembro de 2020? Apenas rotule quem esteve envolvido em eventos de compra como comprador.","external_knowledge":null}
{"instance_id":"ga008","db":"ga4","question":"Você poderia fornecer o número total de visualizações de página para cada dia de novembro de 2020, bem como a média de visualizações de página por usuário nesses dias, limitando-se aos usuários que fizeram pelo menos uma compra em novembro de 2020?","external_knowledge":null}
{"instance_id":"ga017","db":"ga4","question":"Quantos usuários distintos visualizaram a página mais visitada durante janeiro de 2021?","external_knowledge":null}
{"instance_id":"ga007","db":"ga4","question":"Por favor, descubra qual porcentagem das visualizações de página em January 2, 2021, foi para páginas do tipo PDP.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga013","db":"ga4","question":"Quero saber todas as páginas visitadas pelo usuário 1402138.5184246691 em January 2, 2021. Por favor, mostre os nomes dessas páginas e ajuste os nomes para PDP ou PLP quando necessário.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga018","db":"ga4","question":"Em January 2nd, 2021, eu quero determinar a porcentagem de vezes que os usuários passam de uma visualização de página de lista de produtos (PLP) para uma visualização de página de detalhes do produto (PDP) dentro da mesma sessão, usando apenas eventos page_view. Você poderia calcular quantas visualizações de PLP eventualmente levaram a uma visualização de PDP na mesma sessão naquela data, e então fornecer a porcentagem resultante das transições PLP-to-PDP?","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga032","db":"ga4","question":"Você pode gerar o fluxo de navegação para o usuário com o pseudo_id '1362228.4966015575' em January 28th 2021, mostrando apenas os eventos page_view? Conecte os títulos das páginas com '>>' entre cada etapa, converta as páginas de detalhe do produto para 'PDP' e as páginas de listagem de produtos para 'PLP' com base na estrutura da URL, e mescle páginas adjacentes idênticas para que apareçam apenas uma vez na sequência. Preciso entender como esse usuário específico navegou pelo nosso site naquele dia.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga031","db":"ga4","question":"Eu quero saber a taxa de conversão de sessão do usuário em 2 de janeiro de 2021, usando apenas eventos 'page_view'. A taxa de conversão deve ser calculada como a porcentagem de visitas de usuários que atingiram as páginas Home e Checkout Confirmation em uma única sessão, em relação àquelas que chegaram à página inicial.","external_knowledge":null}
{"instance_id":"ga006","db":"ga4","question":"Para o intervalo de datas de 1 a 30 de novembro de 2020, você pode recuperar cada user_pseudo_id e sua média de receita de compra em USD por sessão para usuários que tiveram mais de uma sessão de compra, considerando apenas eventos com event_name='purchase' e uma ecommerce.purchase_revenue_in_usd não nula, agrupando as sessões pelo ga_session_id de event_params","external_knowledge":null}
{"instance_id":"ga009","db":"ga4","question":"Você poderia me dizer qual é o número médio de sessões engajadas por usuário em dezembro de 2020, considerando apenas aquelas sessões em que o parâmetro de evento 'session_engaged' é igual a '1' e usando 'user_pseudo_id' combinado com o 'ga_session_id' para identificar sessões distintas?","external_knowledge":null}
{"instance_id":"ga010","db":"ga4","question":"Você pode me dar uma visão geral do tráfego do nosso site para dezembro de 2020? Estou particularmente interessado no canal com o quarto maior número de sessões.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga014","db":"ga4","question":"Você pode fornecer o número total de sessões para cada canal de tráfego em dezembro de 2020, usando as informações de 'event_params'?","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga011","db":"ga4","question":"Qual é a página com o segundo maior número total de visualizações de páginas, após limpar a URL (removendo barras extras) e extrair o caminho correto da página, no site 'shop.googlemerchandisestore.com' durante dezembro de 2020?","external_knowledge":null}
{"instance_id":"ga012","db":"ga4","question":"Em 30 de novembro de 2020, identifique a categoria de item com a maior alíquota de imposto dividindo o valor do imposto em USD pela receita de compra em USD para eventos de compra, e então recupere os IDs de transação, as quantidades totais de itens, e tanto a receita de compra em USD quanto a receita de compra para esses eventos de compra nessa categoria de maior alíquota de imposto.","external_knowledge":null}
{"instance_id":"ga019","db":"firebase","question":"Você poderia determinar qual porcentagem de usuários que não desinstalaram nosso aplicativo dentro de sete dias ou que nunca o desinstalaram após a instalação durante agosto e setembro de 2018?","external_knowledge":null}
{"instance_id":"ga030","db":"firebase","question":"Você pode agrupar usuários pela semana de início da primeira sessão, começando a partir de 2 de julho de 2018? Para cada grupo, calcule a taxa de retenção na quarta semana (ou seja, a porcentagem de usuários do grupo original que retornaram na quarta semana após a primeira sessão deles). Por favor, identifique a coorte com a maior taxa de retenção na quarta semana e nomeie o grupo pela data de segunda-feira da semana da primeira sessão da coorte. Retorne o resultado no formato \"YYYY-MM-DD\".","external_knowledge":"retention_rate.md"}
{"instance_id":"ga005","db":"firebase","question":"Realize uma análise de coorte semanal para retenção de usuários, começando em 9 de julho de 2018 e terminando em 2 de outubro de 2018. Agrupe os usuários pela semana do seu primeiro evento session_start (com as semanas começando na segunda-feira), e identifique novos usuários como aqueles em que event_date corresponde à data de seu user_first_touch_timestamp. Calcule a taxa de retenção da Semana 2 para cada coorte semanal, definida como a porcentagem de usuários que tiveram um evento session_start exatamente 2 semanas depois de sua primeira semana. Inclua apenas as coortes de 9 de julho de 2018 até 17 de setembro de 2018 (a última coorte que pode ser analisada para retenção de 2 semanas dadas os dados disponíveis). Apresente os resultados com cada coorte semanal e sua respectiva taxa de retenção da Semana 2, ordenados pela data da coorte.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga028","db":"firebase","question":"Por favor, realize uma análise de retenção de 7 dias para usuários cuja primeira sessão tenha iniciado o aplicativo durante a semana que começa em July 2, 2018. Para cada semana, de Semana 0 (a semana da primeira sessão deles) até Semana 4, forneça o número total de novos usuários na Semana 0 e o número de usuários retidos para cada semana subsequente, garantindo que conte apenas eventos até October 2, 2018 e que agrupe as datas por semanas iniciadas na segunda-feira.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga020","db":"firebase","question":"Qual tipo de evento quickplay teve a menor taxa de retenção de usuários durante a segunda semana após o seu engajamento inicial, para usuários que se envolveram pela primeira vez entre 1 de agosto e 15 de agosto de 2018, medido pela presença de eventos session_start??","external_knowledge":"retention_rate.md"}
{"instance_id":"ga021","db":"firebase","question":"Qual é a taxa de retenção dos usuários duas semanas após o seu evento inicial de quickplay, calculada separadamente para cada tipo de evento de quickplay, dentro do período de 2 de julho de 2018 a 16 de julho de 2018? Por favor, concentre-se nos usuários que iniciaram uma sessão (`session_start`) durante esse período.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga022","db":"firebase","question":"Você poderia me ajudar a obter a taxa de retenção semanal de clientes em setembro de 2018 para novos clientes que usaram nosso aplicativo pela primeira vez (first_open event) dentro da primeira semana a partir de 1º de setembro de 2018 (fuso horário de Xangai)? As taxas de retenção devem cobrir o período de 1, 2 e 3 semanas após o uso inicial e apresentá-las em formato de coluna.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga025","db":"firebase","question":"Para todos os usuários que abriram pela primeira vez o aplicativo em setembro de 2018 e, em seguida, desinstalaram dentro de sete dias, quero saber qual porcentagem deles teve uma falha do aplicativo (app_exception). O cálculo deve ser feito convertendo os carimbos de data/hora em datas primeiro e, em seguida, calculando os dias até a desinstalação com base nas datas. Apenas usuários que desinstalaram dentro de sete dias e tiveram uma falha devem ser considerados na porcentagem final.","external_knowledge":null}
{"instance_id":"local002","db":"E_commerce","question":"Você pode calcular a média móvel simétrica de 5 dias das vendas previstas de brinquedos para 5 a 8 de dezembro de 2018, usando dados diários de vendas de 1 de janeiro de 2017 a 29 de agosto de 2018, com um modelo de regressão linear simples? Por fim, forneça a soma dessas quatro médias móveis de 5 dias?","external_knowledge":null}
{"instance_id":"local003","db":"E_commerce","question":"De acordo com o documento de definição de RFM, calcule o valor médio por pedido para cada cliente dentro de segmentos RFM distintos, considerando apenas ordens 'entregues'. Use o identificador único do cliente. Defina claramente como calcular a Recência com base no carimbo de data/hora da última compra e especifique os critérios para classificar os segmentos RFM. O valor médio por pedido deve ser calculado como o total gasto dividido pelo número total de pedidos. Por favor, analise e relate as diferenças no valor médio por pedido entre os segmentos RFM.","external_knowledge":"RFM.md"}
{"instance_id":"local004","db":"E_commerce","question":"Você poderia me dizer o número de pedidos, o pagamento médio por pedido e a duração de vida do cliente em semanas dos 3 clientes com o maior pagamento médio por pedido, onde a duração de vida é calculada subtraindo a data da primeira compra da data da última compra em dias, dividindo por 7, e se o resultado for menor que 7 dias, definindo-o como 1.0?","external_knowledge":null}
{"instance_id":"local007","db":"Baseball","question":"Você poderia me ajudar a calcular a média do valor de duração de carreira única, em anos, para todos os jogadores de beisebol? Por favor, informe o resultado como um número de ponto flutuante. Primeiro, calcule a diferença entre anos, meses e dias entre as datas de estreia e o último jogo. Para cada jogador, a duração da carreira é calculada como a soma do número absoluto de anos, mais o número absoluto de meses dividido por 12, mais o número absoluto de dias dividido por 365. Arredonde cada parte para duas casas decimais antes de somar. Finalmente, faça a média das durações de carreira e arredonde o resultado para um número de ponto flutuante.","external_knowledge":null}
{"instance_id":"local008","db":"Baseball","question":"Eu gostaria de saber os nomes próprios dos jogadores de beisebol que tenham atingido o maior valor de jogos disputados, corridas, rebatidas e home runs, com seus respectivos valores de pontuação.","external_knowledge":null}
{"instance_id":"local009","db":"Airlines","question":"Qual é a distância da rota mais longa em que Abakan seja a cidade de partida ou de destino (em quilômetros)?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local010","db":"Airlines","question":"Distribua todos os pares de cidades únicos nas faixas de distância 0, 1000, 2000, 3000, 4000, 5000 e 6000+, com base na distância média de todas as rotas entre eles. Então, quantos pares existem na faixa de distância com o menor número de pares únicos de cidades?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local015","db":"California_Traffic_Collision","question":"Por favor, calcule a taxa de fatalidade para colisões de motocicletas, separadas pelo uso de capacete. Especificamente, calcule duas porcentagens: 1) a porcentagem de fatalidades de motociclistas em colisões em que as partes (motoristas ou passageiros) estavam usando capacetes, e 2) a porcentagem de fatalidades de motociclistas em colisões em que as partes não estavam usando capacetes. Para cada grupo, calcule isso dividindo o número total de fatalidades de motociclistas pelo total de colisões envolvendo esse grupo. Use a tabela parties para determinar o uso de capacete (a partir dos campos party_safety_equipment).","external_knowledge":null}
{"instance_id":"local017","db":"California_Traffic_Collision","question":"Em que ano as duas causas mais comuns de acidentes de trânsito foram diferentes daquelas em outros anos?","external_knowledge":null}
{"instance_id":"local018","db":"California_Traffic_Collision","question":"Para a categoria de violação do fator de colisão primário, que foi a causa mais comum de acidentes de trânsito em 2021, quantos pontos percentuais a participação nos incidentes rodoviários anuais em 2021 diminuiu em comparação com a participação em 2011?","external_knowledge":null}
{"instance_id":"local019","db":"WWE","question":"Para o título do NXT que teve a luta mais curta (excluindo títulos com \"mudança de título\"), quais foram os nomes dos dois lutadores envolvidos?","external_knowledge":null}
{"instance_id":"local026","db":"IPL","question":"Por favor, ajude-me a identificar os 3 melhores arremessadores que, nos overs em que foram concedidas as corridas máximas em cada partida, cederam o maior número de corridas em uma única over entre todas as partidas. Para cada um desses arremessadores, forneça a partida na qual eles cederam essas corridas máximas. Considere apenas os overs que tiveram o maior número de corridas concedidas dentro de suas respectivas partidas e, entre eles, determine quais arremessadores cederam o maior número de corridas em uma única over no total.","external_knowledge":null}
{"instance_id":"local020","db":"IPL","question":"Qual arremessador tem a menor média de bowling por wicket obtido?","external_knowledge":null}
{"instance_id":"local021","db":"IPL","question":"Você poderia calcular a média do total de corridas marcadas por todos os batedores que anotaram mais de 50 corridas em qualquer partida?","external_knowledge":null}
{"instance_id":"local022","db":"IPL","question":"Recupere os nomes dos jogadores que marcaram pelo menos 100 corridas em uma partida enquanto jogavam pela equipe que perdeu essa partida.","external_knowledge":null}
{"instance_id":"local023","db":"IPL","question":"Por favor, ajude-me a encontrar os nomes dos 5 melhores jogadores com a maior média de corridas por partida na temporada 5, juntamente com suas médias de rebatidas.","external_knowledge":null}
{"instance_id":"local024","db":"IPL","question":"Você pode me ajudar a encontrar os 5 principais países cujos jogadores têm a maior média entre as suas médias individuais de corridas por partida ao longo de todas as temporadas? Especificamente, para cada jogador, calcule a média de corridas por partida em todas as partidas que ele jogou, depois calcule a média dessas médias de jogadores para cada país e inclua essas médias de rebatagem dos países no resultado.","external_knowledge":null}
{"instance_id":"local025","db":"IPL","question":"Para cada partida, considerando todas as innings, por favor combine as corridas marcadas por ambos os batedores e as corridas extras de cada over, em seguida identifique o over único com o maior total de corridas, recupere o arremessador para esse over a partir da tabela bola a bola e calcule a média desses totais do over mais altos ao longo de todas as partidas, assegurando que todas as corridas e os detalhes do arremessador sejam refletidos com precisão.","external_knowledge":null}
{"instance_id":"local028","db":"Brazilian_E_Commerce","question":"Você poderia gerar um relatório que mostre o número de pedidos entregues para cada mês nos anos de 2016, 2017 e 2018? Cada coluna representa um ano, e cada linha representa um mês.","external_knowledge":null}
{"instance_id":"local031","db":"Brazilian_E_Commerce","question":"Qual é o maior volume mensal de pedidos entregues no ano com o menor volume anual de pedidos entregues entre 2016, 2017 e 2018?","external_knowledge":null}
{"instance_id":"local029","db":"Brazilian_E_Commerce","question":"Por favor identifique os três principais clientes, com base no customer_unique_id de cada um, que possuam o maior número de pedidos entregues, e forneça o valor médio de pagamento, a cidade e o estado para cada um desses clientes.","external_knowledge":null}
{"instance_id":"local030","db":"Brazilian_E_Commerce","question":"Entre todas as cidades com pedidos entregados, encontre as cinco cidades cujos pagamentos somados são os mais baixos, então calcule a média de seus pagamentos totais e a média de seus totais de pedidos entregados.","external_knowledge":null}
{"instance_id":"local032","db":"Brazilian_E_Commerce","question":"Você poderia me ajudar a encontrar os vendedores que se destacam nas seguintes categorias, considerando apenas pedidos entregues: o vendedor com o maior número de IDs de clientes únicos, o vendedor com o maior lucro (calculado como preço menos o valor do frete), o vendedor com o maior número de pedidos distintos e o vendedor com mais avaliações de 5 estrelas? Para cada categoria, por favor forneça o ID do vendedor e o valor correspondente, rotulando cada linha com uma descrição da conquista.","external_knowledge":null}
{"instance_id":"local034","db":"Brazilian_E_Commerce","question":"Você poderia me ajudar a calcular a média do total de pagamentos feitos usando o método de pagamento mais utilizado em cada categoria de produto, sendo que o método de pagamento mais utilizado em uma categoria é aquele com o maior número de pagamentos?","external_knowledge":null}
{"instance_id":"local037","db":"Brazilian_E_Commerce","question":"Identifique as três principais categorias de produto cuja forma de pagamento mais comumente utilizada tem o maior número de pagamentos entre todas as categorias, e indique o número de pagamentos realizados em cada categoria usando esse tipo de pagamento.","external_knowledge":null}
{"instance_id":"local035","db":"Brazilian_E_Commerce","question":"Na tabela “olist_geolocation”, identifique quais duas cidades consecutivas, quando ordenadas por geolocation_state, geolocation_city, geolocation_zip_code_prefix, geolocation_lat e geolocation_lng, apresentem a maior distância entre si, com base na diferença de distância calculada entre cada cidade e seu predecessor imediato nessa ordenação.","external_knowledge":"spherical_law.md"}
{"instance_id":"local038","db":"Pagila","question":"Você poderia me ajudar a determinar qual ator atuou com mais frequência em filmes infantis em língua inglesa, classificados como G ou PG, com duração de 120 minutos ou menos, e lançados entre 2000 e 2010? Por favor, forneça o nome completo do ator.","external_knowledge":null}
{"instance_id":"local039","db":"Pagila","question":"Por favor, ajude-me a encontrar a categoria de filmes com o maior total de horas de aluguel em cidades cujo nome começa com \"A\" ou contém um hífen.","external_knowledge":null}
{"instance_id":"local040","db":"modern_data","question":"No conjunto de dados combinado que unifica os dados de árvores com os dados de renda por código ZIP, preenchendo valores de código ZIP ausentes quando necessário, quais três distritos, restritos a registros com renda mediana e renda média ambas maiores que zero e com um nome de distrito válido, contêm o maior número de árvores, e qual é a renda média para cada um desses três distritos?","external_knowledge":null}
{"instance_id":"local041","db":"modern_data","question":"Qual é a porcentagem de árvores no Bronx que têm um estado de saúde bom?","external_knowledge":null}
{"instance_id":"local049","db":"modern_data","question":"Você pode me ajudar a calcular a média do número de novas empresas unicórnio por ano na indústria principal de 2019 a 2021?","external_knowledge":null}
{"instance_id":"local054","db":"chinook","question":"Você poderia me dizer os primeiros nomes dos clientes que gastaram menos de $1 em álbuns do artista mais vendido, juntamente com os valores que eles gastaram?","external_knowledge":null}
{"instance_id":"local055","db":"chinook","question":"Identifique o artista com as maiores vendas totais de álbuns (empate resolvido pela ordem alfabética) e o artista com as menores vendas totais de álbuns (empate resolvido pela ordem alfabética), então calcule o valor que cada cliente gastou especificamente nos álbuns desses dois artistas. Em seguida, calcule a média de gastos dos clientes que compraram do artista com mais vendas e a média de gastos dos clientes que compraram do artista com menos vendas, e por fim retorne a diferença absoluta entre essas duas médias.","external_knowledge":null}
{"instance_id":"local198","db":"chinook","question":"Usando os dados de vendas, qual é a mediana das vendas totais realizadas em países onde o número de clientes é maior que 4?","external_knowledge":null}
{"instance_id":"local056","db":"sqlite-sakila","question":"Qual cliente apresenta a maior variação média mensal nos pagamentos? Forneça o nome completo do cliente.","external_knowledge":null}
{"instance_id":"local058","db":"education_business","question":"Você pode fornecer uma lista de segmentos de hardware, juntamente com suas contagens únicas de produtos para 2020 na saída, ordenada pelo maior aumento percentual nos produtos de vendas únicos entre 2020 e 2021?","external_knowledge":null}
{"instance_id":"local059","db":"education_business","question":"Para o ano civil de 2021, qual é a média global da quantidade vendida dos três produtos de hardware mais vendidos (pela quantidade total vendida) em cada divisão?","external_knowledge":null}
{"instance_id":"local060","db":"complex_oracle","question":"Nos Estados Unidos, para Q4 2019 e Q4 2020, primeiro selecione apenas as cidades onde as vendas totais (sem promoções) aumentaram pelo menos 20% de Q4 2019 a Q4 2020. Entre essas cidades, classifique os produtos pelas suas vendas totais nesses trimestres e selecione os 20% superiores. Em seguida, calcule a participação de cada um dos produtos dos 20% superiores nas vendas totais em Q4 2019 e Q4 2020 e calcule a diferença de participação de Q4 2019 para Q4 2020, retornando os resultados em ordem decrescente dessa variação de participação.","external_knowledge":null}
{"instance_id":"local063","db":"complex_oracle","question":"Entre todos os produtos vendidos nos Estados Unidos com promo_id=999, considerando apenas as cidades cujas vendas aumentaram pelo menos 20% de 4º trimestre de 2019 (calendar_quarter_id=1772) para 4º trimestre de 2020 (calendar_quarter_id=1776), qual produto que está entre os 20% superiores em vendas totais tem a menor variação em pontos percentuais de sua participação nas vendas totais entre esses dois trimestres?","external_knowledge":null}
{"instance_id":"local061","db":"complex_oracle","question":"Qual é a média de vendas mensais projetadas em USD para a França em 2021, considerando apenas as vendas de produtos com promoções onde promo_total_id = 1 e canais onde channel_total_id = 1, tomando as vendas mensais de cada produto de 2019 e 2020, calculando a taxa de crescimento de 2019 para 2020 para esse mesmo produto e mês, aplicando essa taxa de crescimento para projetar as vendas mensais de 2021, convertendo todos os montantes projetados de 2021 para USD com as taxas de câmbio de 2021, e, por fim, fazendo a média e listando-as por mês?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local050","db":"complex_oracle","question":"Qual é a mediana da média mensal projetada de vendas em USD para a França em 2021, calculada usando os dados de vendas mensais de 2019 e 2020 (filtrados por promo_total_id=1 e channel_total_id=1), aplicando a taxa de crescimento de 2019 para 2020 para projetar 2021, convertendo para USD com base na tabela de câmbio, e então determinando as médias mensais antes de encontrar a mediana?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local062","db":"complex_oracle","question":"Por favor, agrupe todos os clientes italianos em dez faixas para dezembro de 2021 somando seus lucros de todos os produtos adquiridos (onde o lucro é calculado como quantity_sold multiplicado pela diferença entre unit_price e unit_cost), e, em seguida, divida o intervalo total de lucros mensais em dez intervalos iguais. Para cada faixa, forneça o número de clientes e identifique o lucro total mínimo e máximo dentro dessa faixa.","external_knowledge":null}
{"instance_id":"local067","db":"complex_oracle","question":"Você pode fornecer os maiores e menores lucros para clientes italianos, segmentados em dez faixas igualmente distribuídas com base nos lucros de vendas de dezembro de 2021?","external_knowledge":null}
{"instance_id":"local070","db":"city_legislation","question":"Por favor, examine nossos registros de banco de dados para cidades chinesas (country_code_2 = 'cn') durante julho de 2021 e identifique tanto as sequências mais curtas quanto as mais longas de entradas de datas consecutivas. Para cada data nessas sequências, retorne exatamente um registro por data juntamente com o nome da cidade correspondente. Em sua saída, por favor garanta que a primeira letra de cada nome de cidade esteja em maiúscula e o restante em minúscula. Exiba as datas e os nomes das cidades para as sequências de datas consecutivas mais curtas e mais longas, ordenadas pela data.","external_knowledge":null}
{"instance_id":"local071","db":"city_legislation","question":"Você poderia revisar nossos registros em junho de 2022 e identificar quais países têm a maior sequência de datas de cidades inseridas consecutivamente? Por favor, liste os códigos de país de duas letras desses países.","external_knowledge":null}
{"instance_id":"local072","db":"city_legislation","question":"Identifique o país com dados inseridos em nove dias diferentes em janeiro de 2022. Em seguida, encontre o período consecutivo mais longo com inserções de dados para esse país durante janeiro de 2022 e calcule a proporção de entradas provenientes de sua capital dentro desse período de inserção consecutiva mais longo.","external_knowledge":null}
{"instance_id":"local068","db":"city_legislation","question":"Calcule o número de novas cidades inseridas em abril, maio e junho para cada ano de 2021 a 2023. Para cada mês, calcule o total acumulado de cidades adicionadas naquele mês ao longo dos anos, até e inclusive o ano fornecido (ou seja, some os totais desse mês ao longo dos anos). Além disso, calcule as porcentagens de crescimento ano-a-ano tanto para o total mensal quanto para o total acumulado de cada mês, comparando cada ano com o ano anterior. Apresente os resultados apenas para 2022 e 2023, listando o ano, o mês, o número total de cidades adicionadas naquele mês, o total acumulado daquele mês e as porcentagens de crescimento ano-a-ano tanto para o total mensal quanto para o total acumulado. Use os dados de 2021 somente como base para calcular as taxas de crescimento, e exclua-os do resultado final.","external_knowledge":null}
{"instance_id":"local073","db":"modern_data","question":"Para cada pedido de pizza, forneça uma única linha de resultado com o ID da linha, o ID do pedido, o ID do cliente, o nome da pizza e o conjunto final de ingredientes. Os ingredientes finais são determinados começando com as coberturas padrão da receita da pizza, removendo quaisquer coberturas excluídas e adicionando quaisquer coberturas extras. Apresente os ingredientes em uma string começando com o nome da pizza seguido de ': ', com os ingredientes listados em ordem alfabética. Ingredientes que aparecem várias vezes (por exemplo, provenientes de coberturas padrão e extras) devem ser precedidos por '2x' e listados primeiro, seguidos pelos ingredientes de ocorrência única, ambos em ordem alfabética. Agrupe por ID da linha, ID do pedido, nome da pizza e horário do pedido para garantir que cada pedido apareça apenas uma vez. Classifique os resultados por ID da linha em ordem crescente. Atribua pizza_id 1 às pizzas 'Meatlovers' e pizza_id 2 para todas as outras.","external_knowledge":null}
{"instance_id":"local066","db":"modern_data","question":"Com base nas informações sobre pedidos de pizza dos nossos clientes, resuma a quantidade total de cada ingrediente usado nas pizzas que entregamos. Apresente o nome e a quantidade de cada ingrediente.","external_knowledge":null}
{"instance_id":"local065","db":"modern_data","question":"Calcule a receita total das pizzas Meat Lovers, com preço de $12, e das pizzas Vegetarian, com preço de $10. Inclua quaisquer toppings extras cobrados a $1 cada. Certifique-se de que pedidos cancelados sejam filtrados. Quanto dinheiro a Pizza Runner ganhou no total?","external_knowledge":null}
{"instance_id":"local074","db":"bank_sales_trading","question":"Por favor, gere um resumo dos saldos de fechamento no final de cada mês para cada transação de cliente, mostre as mudanças mensais e os saldos mensais cumulativos da conta bancária. Certifique-se de que, mesmo que um cliente não tenha atividade na conta em um mês específico, o saldo desse mês ainda seja incluído na saída.","external_knowledge":null}
{"instance_id":"local064","db":"bank_sales_trading","question":"Para cada cliente e cada mês de 2020, primeiro calcule o saldo de fim de mês somando todos os valores de depósito e subtraindo todos os valores de retirada que ocorreram durante esse mês específico. Em seguida, determine qual mês de 2020 tem o maior número de clientes com saldo de fim de mês positivo e qual mês tem o menor número de clientes com saldo de fim de mês positivo. Para cada um desses dois meses, calcule a média do saldo de fim de mês entre todos os clientes e forneça a diferença entre essas duas médias.","external_knowledge":null}
{"instance_id":"local297","db":"bank_sales_trading","question":"Para cada cliente, agrupe todas as entradas (depósitos) e saques no primeiro dia de cada mês para obter um valor líquido mensal, em seguida calcule o saldo de fechamento de cada mês acumulando esses saldos líquidos mensais. Em seguida, determine a taxa de crescimento do mês mais recente comparando seu saldo de fechamento com o saldo do mês anterior, tratando depósitos como positivos e saques como negativos, e se o saldo do mês anterior for zero, a taxa de crescimento deve ser o saldo do mês atual multiplicado por 100. Por fim, calcule a porcentagem de clientes cujo mês mais recente apresenta uma taxa de crescimento superior a 5%.","external_knowledge":null}
{"instance_id":"local298","db":"bank_sales_trading","question":"Para cada mês, calcule o saldo total de todos os usuários para o mês anterior (medido no dia 1 de cada mês), substituindo quaisquer saldos negativos por zero. Garanta que os dados do primeiro mês sejam usados apenas como linha de base para calcular o saldo total anterior, e exclua-os da saída final. Classifique os resultados em ordem crescente por mês.","external_knowledge":null}
{"instance_id":"local299","db":"bank_sales_trading","question":"Para um banco de dados com transações de clientes, calcule o saldo diário acumulado de cada cliente (onde depósitos aumentam o saldo e os outros tipos de transação o diminuem). Para cada cliente e cada dia, calcule a média móvel de 30 dias do saldo (somente após ter 30 dias de dados, e tratando médias negativas como zero). Em seguida, agrupe essas médias diárias por mês e encontre o saldo médio de 30 dias máximo de cada cliente dentro de cada mês. Some esses valores máximos entre todos os clientes para cada mês. Considere o primeiro mês do histórico de transações de cada cliente como o período de referência e exclua-o dos resultados finais, apresentando totais mensais desses saldos médios de 30 dias máximos somados.","external_knowledge":null}
{"instance_id":"local300","db":"bank_sales_trading","question":"Para cada cliente, calcule seus saldos diários para cada dia entre as datas de transação mais antigas e mais recentes de cada cliente, incluindo dias sem transações, mantendo o saldo do dia anterior. Considere quaisquer saldos diários negativos como zero. Em seguida, para cada mês, determine o maior saldo diário que cada cliente teve durante esse mês. Por fim, para cada mês, some esses saldos diários máximos de todos os clientes para obter um total mensal.","external_knowledge":null}
{"instance_id":"local075","db":"bank_sales_trading","question":"Você pode fornecer uma visão detalhada de quantas vezes cada produto foi visualizado, quantas vezes ele foi adicionado ao carrinho de compras e quantas vezes ficou no carrinho sem ser adquirido? Além disso, forneça a contagem de compras reais para cada produto. Garanta que os produtos com um id da página em (1, 2, 12, 13) sejam filtrados.","external_knowledge":null}
{"instance_id":"local077","db":"bank_sales_trading","question":"Por favor, analise nossos dados de interesse de setembro de 2018 a agosto de 2019. Para cada mês, calcule a composição média de cada interesse dividindo a composição pelo valor do índice. Identifique o interesse com o maior valor médio de composição em cada mês e relate sua composição média como a composição máxima do índice para aquele mês. Calcule a média móvel de três meses dessas composições máximas do índice mensal. Certifique-se de que a saída inclua a data, o nome do interesse, a composição máxima do índice para aquele mês, a média móvel, e os nomes e as composições máximas do índice dos principais interesses de um mês atrás e de dois meses atrás.","external_knowledge":null}
{"instance_id":"local078","db":"bank_sales_trading","question":"Identifique as 10 principais e as 10 de menor valor entre as categorias de interesse com base em seus maiores valores de composição ao longo de todos os meses. Para cada categoria, exiba o tempo (MM-YYYY), o nome do interesse e o valor de composição","external_knowledge":null}
{"instance_id":"local081","db":"northwind","question":"Considerando apenas os clientes que fizeram pedidos em 1998, calcule o valor total gasto por cada cliente somando o preço unitário multiplicado pela quantidade de todos os produtos em seus pedidos, excluindo quaisquer descontos. Atribua cada cliente a um grupo de gastos com base nos limiares de gasto dos grupos de clientes, e determine quantos clientes há em cada grupo de gastos e qual a porcentagem do total de clientes que fizeram pedidos em 1998 que cada grupo representa.","external_knowledge":null}
{"instance_id":"local085","db":"northwind","question":"Entre os funcionários que têm mais de 50 pedidos no total, quais são os três com a maior porcentagem de pedidos atrasados, onde um pedido é considerado atrasado se a data de envio for igual ou posterior à data exigida? Por favor, liste o ID de cada funcionário, o número de pedidos atrasados e a correspondente porcentagem de pedidos atrasados.","external_knowledge":null}
{"instance_id":"local096","db":"Db-IMDB","question":"Para cada ano, calcule a porcentagem de filmes que tivessem exclusivamente atores do sexo feminino (ou seja, sem atores do sexo masculino e sem atores com sexo desconhecido/indeterminado). Considere atores com o sexo marcado como 'Male' ou 'None' como não-femininos. Para os resultados, exiba o ano, o número total de filmes nesse ano e a porcentagem de filmes com exclusivamente atores do sexo feminino. Extraia o ano do campo Movie.year pegando os últimos 4 caracteres e convertendo-os para um número.","external_knowledge":null}
{"instance_id":"local097","db":"Db-IMDB","question":"Você poderia analisar nossos dados e identificar qual período de dez anos, iniciando a partir de qualquer ano de lançamento de filme presente nos dados, teve o maior número de filmes, considerando períodos consecutivos de dez anos que começam em cada ano único? Apresente apenas o ano inicial e a contagem total para esse período específico.","external_knowledge":null}
{"instance_id":"local098","db":"Db-IMDB","question":"Do primeiro ano em que cada ator apareceu em um filme até o último, quantos atores no banco de dados nunca tiveram uma lacuna maior que três anos consecutivos sem pelo menos uma nova aparição em filme, ou seja, não há nenhum intervalo de quatro anos em qualquer parte de sua carreira ativa sem pelo menos um crédito em filme?","external_knowledge":null}
{"instance_id":"local099","db":"Db-IMDB","question":"Preciso que você examine as colaborações entre atores e me diga quantos atores fizeram mais filmes com Yash Chopra do que com qualquer outro diretor. Isso nos ajudará a entender melhor a influência dele na indústria.","external_knowledge":null}
{"instance_id":"local100","db":"Db-IMDB","question":"Descubra quantos atores têm um 'Shahrukh number' de 2? Isso significa que eles atuaram em um filme com alguém que atuou com Shahrukh Khan, mas não diretamente com ele.","external_knowledge":null}
{"instance_id":"local114","db":"education_business","question":"Forneça um relatório detalhado de vendas online para cada região, incluindo o número de pedidos, o valor total de vendas e o nome e o valor de vendas de todos os representantes de vendas que atingiram o maior total de vendas naquela região (inclua todos os representantes em caso de empate).","external_knowledge":null}
{"instance_id":"local128","db":"BowlingLeague","question":"Liste os bolicheiros (incluindo o seu ID, primeiro nome e sobrenome), o número da partida, o número do jogo, a pontuação de handicap, a data do torneio e o local apenas para aqueles bolicheiros que venceram partidas com uma pontuação de handicap de 190 ou menos em todos os três locais: Thunderbird Lanes, Totem Lanes e Bolero Lanes. Inclua apenas os registros de jogos específicos em que eles venceram com uma pontuação de handicap de 190 ou menos nesses três locais.","external_knowledge":null}
{"instance_id":"local130","db":"school_scheduling","question":"Você poderia fornecer uma lista dos sobrenomes de todos os estudantes que concluíram cursos de inglês (onde a conclusão é definida como ter um ClassStatus de 2), juntamente com suas classificações de quintil com base em suas notas individuais nesses cursos? O quintil deve ser determinado calculando quantos alunos têm notas maiores ou iguais à nota de cada aluno, em seguida dividindo esse ranking pelo número total de alunos que concluíram os cursos de inglês. Os quintis devem ser rotulados como \"First\" (top 20%), \"Second\" (top 21-40%), \"Third\" (top 41-60%), \"Fourth\" (top 61-80%), e \"Fifth\" (bottom 20%). Por favor, ordene os resultados do quintil de maior desempenho para o menor (First to Fifth).","external_knowledge":null}
{"instance_id":"local131","db":"EntertainmentAgency","question":"Você poderia listar cada estilo musical com o número de vezes que ele aparece como primeira, segunda ou terceira preferência em uma única linha por estilo?","external_knowledge":null}
{"instance_id":"local133","db":"EntertainmentAgency","question":"Dado um banco de dados de estilos musicais e preferências de usuários, em que Musical_Preferences contém as classificações dos usuários para estilos musicais (PreferenceSeq=1 para a primeira opção, PreferenceSeq=2 para a segunda opção, PreferenceSeq=3 para a terceira opção): Calcule uma pontuação ponderada para cada estilo musical atribuindo 3 pontos para cada vez em que foi classificado como primeira opção, 2 pontos para cada segunda opção e 1 ponto para cada ranking de terceira opção. Calcule a pontuação ponderada total para cada estilo musical que tenha sido classificado por pelo menos um usuário. Em seguida, calcule a diferença absoluta entre a pontuação ponderada total de cada estilo e a média das pontuações ponderadas totais entre todos esses estilos.","external_knowledge":null}
{"instance_id":"local132","db":"EntertainmentAgency","question":"Mostre todos os pares de artistas e clientes que possuam até três forças ou preferências de estilo, onde as primeiras e segundas preferências de estilo dos clientes correspondem às primeiras e segundas forças de estilo dos artistas (ou na ordem inversa). Retorne apenas o nome artístico do artista e o sobrenome do cliente","external_knowledge":null}
{"instance_id":"local141","db":"AdventureWorks","question":"Como as vendas anuais totais de cada vendedor se comparam com a cota anual de vendas? Forneça a diferença entre as vendas totais de cada vendedor e a cota para cada ano, organizada por vendedor e por ano.","external_knowledge":null}
{"instance_id":"local152","db":"imdb_movies","question":"Você pode fornecer os 9 principais diretores por contagem de filmes, incluindo seu ID, nome, número de filmes, duração média entre filmes (arredondada para o inteiro mais próximo), avaliação média (arredondada para 2 casas decimais), total de votos, avaliações mínimas e máximas, e a duração total dos filmes? Classifique a saída primeiro pela contagem de filmes em ordem decrescente e, em seguida, pela duração total dos filmes em ordem decrescente.","external_knowledge":null}
{"instance_id":"local230","db":"imdb_movies","question":"Determine os três gêneros com mais filmes avaliados acima de 8, e, em seguida, identifique os quatro diretores que dirigiram mais filmes avaliados acima de 8 dentro desses gêneros. Liste esses diretores e as respectivas contagens de filmes.","external_knowledge":null}
{"instance_id":"local156","db":"bank_sales_trading","question":"Analise o preço médio anual de compra por Bitcoin por região, calculado como o valor total gasto em dólares dividido pela quantidade total adquirida a cada ano, excluindo os dados do primeiro ano para cada região. Em seguida, para cada ano, classifique as regiões com base nesses preços médios de compra e calcule a variação percentual anual no custo para cada região em relação ao ano anterior.","external_knowledge":null}
{"instance_id":"local157","db":"bank_sales_trading","question":"Usando a tabela \"bitcoin_prices\", por favor calcule a variação percentual diária no volume de negociação para cada ticker de 1 de agosto a 10 de agosto de 2021, assegurando que qualquer volume que termine em \"K\" ou \"M\" seja convertido com precisão para milhares ou milhões, qualquer volume \"-\" seja considerado zero, apenas volumes não nulos são usados para determinar o volume do dia anterior, e os resultados sejam ordenados por ticker e data.","external_knowledge":null}
{"instance_id":"local163","db":"education_business","question":"Quais docentes da universidade têm salários mais próximos da média salarial para seus respectivos cargos? Por favor, forneça os cargos, os nomes e os sobrenomes, e salaries.university","external_knowledge":null}
{"instance_id":"local168","db":"city_legislation","question":"Entre as vagas de emprego que especificam o cargo de Analista de Dados, exigem um salário anual médio não nulo e são remotas, qual é o salário médio global ao considerar apenas as três habilidades mais demandadas para essas posições?","external_knowledge":null}
{"instance_id":"local169","db":"city_legislation","question":"Qual é a taxa anual de retenção de legisladores que iniciaram seu primeiro mandato entre January 1, 1917 e December 31, 1999, medida como a proporção desta coorte ainda no exercício do cargo em December 31st para cada um dos primeiros 20 anos após o início de seu mandato inicial? Os resultados devem mostrar todos os 20 períodos em sequência, independentemente de haver legisladores retidos em um ano específico.","external_knowledge":null}
{"instance_id":"local171","db":"city_legislation","question":"Para legisladores homens do Louisiana, quantos legisladores distintos estavam em pleno exercício em 31 de dezembro de cada ano, variando de mais de 30 anos desde o seu primeiro mandato até menos de 50 anos, agrupando os resultados pelo número exato de anos decorridos desde o seu primeiro mandato?","external_knowledge":null}
{"instance_id":"local167","db":"city_legislation","question":"Com base no estado que cada legisladora representou pela primeira vez, qual estado tem o maior número de legisladoras cujos mandatos incluíram o dia 31 de dezembro em algum momento, e qual é esse número? Por favor, forneça a sigla do estado.","external_knowledge":null}
{"instance_id":"local170","db":"city_legislation","question":"Identifique as siglas de estados onde, para ambos os legisladores do sexo masculino e do sexo feminino, a taxa de retenção permanece maior que zero em intervalos específicos de 0, 2, 4, 6, 8 e 10 anos após a data de início do seu primeiro mandato. Um legislador é considerado retido se estiver em exercício em 31 de dezembro do respectivo ano. Inclua apenas estados onde ambas as coortes de gênero mantêm taxas de retenção não nulas em todos esses seis pontos no tempo durante a primeira década de serviço.","external_knowledge":null}
{"instance_id":"local193","db":"sqlite-sakila","question":"Você pode descobrir a porcentagem média do total de vendas ao longo da vida (LTV) que ocorrem nos primeiros 7 e 30 dias após a compra inicial de um cliente? Além disso, inclua a média do total de vendas ao longo da vida (LTV). Por favor, exclua clientes com zero de vendas ao longo da vida. Os períodos de 7 e 30 dias devem basear-se no número exato de horas-minutos-segundos, não em dias do calendário.","external_knowledge":null}
{"instance_id":"local194","db":"sqlite-sakila","question":"Por favor, forneça uma lista dos três filmes com maior receita para cada ator, bem como a receita média por ator nesses filmes, calculada dividindo a receita total do filme igualmente entre os atores de cada filme.","external_knowledge":null}
{"instance_id":"local195","db":"sqlite-sakila","question":"Por favor, descubra quão grande é o apelo dos nossos cinco atores principais. Qual é a porcentagem de nossos clientes que alugaram filmes com esses atores?","external_knowledge":null}
{"instance_id":"local196","db":"sqlite-sakila","question":"Para cada categoria de classificação do primeiro filme alugado pelos clientes — onde o primeiro filme é identificado com base na data de pagamento mais antiga por cliente —, forneça a média do valor total gasto por cliente e a média do número de alugueis subsequentes (calculada como o número total de alugueis menos um) para clientes cujo primeiro filme alugado se enquadre nessa categoria de classificação.","external_knowledge":null}
{"instance_id":"local197","db":"sqlite-sakila","question":"Entre os nossos 10 principais clientes pagantes, você pode identificar a maior variação nos valores de pagamento de um mês para o mês imediatamente seguinte? Especificamente, por favor determine para qual cliente e durante qual mês ocorreu essa diferença mês-a-mês máxima, e forneça a diferença arredondada para duas casas decimais.","external_knowledge":null}
{"instance_id":"local199","db":"sqlite-sakila","question":"Você pode identificar o ano e o mês com o maior número de pedidos de aluguel criados pela equipe da loja para cada loja? Por favor, liste o ID da loja, o ano, o mês e o total de aluguéis para essas datas.","external_knowledge":null}
{"instance_id":"local201","db":"modern_data","question":"Identifique as primeiras 10 palavras, ordenadas alfabeticamente, que tenham 4 a 5 caracteres, comecem com 'r' e tenham pelo menos um anagrama do mesmo tamanho, levando em conta letras sensíveis a maiúsculas/minúsculas. Forneça a contagem de tais anagramas para cada palavra.","external_knowledge":null}
{"instance_id":"local202","db":"city_legislation","question":"Para dados sobre alienígenas, quantos dos 10 estados com maior população de alienígenas têm uma porcentagem maior de alienígenas amigáveis do que de alienígenos hostis, com uma idade média de alienígenas superior a 200 anos?","external_knowledge":null}
{"instance_id":"local209","db":"delivery_center","question":"No conjunto de dados de pedidos, que foi unido com informações da loja, qual loja tem o maior número total de pedidos, e entre os pedidos dessa loja, qual é a razão de pedidos que aparecem na tabela deliveries com o status 'DELIVERED' em relação ao total de pedidos dessa loja?","external_knowledge":null}
{"instance_id":"local210","db":"delivery_center","question":"Você pode identificar os centros que registraram mais de 20% de aumento nos pedidos concluídos de fevereiro para março?","external_knowledge":null}
{"instance_id":"local212","db":"delivery_center","question":"Você pode encontrar 5 entregadores com a maior média de entregas diárias?","external_knowledge":null}
{"instance_id":"local218","db":"EU_soccer","question":"Você consegue calcular a mediana a partir dos gols da melhor temporada de cada equipe?","external_knowledge":null}
{"instance_id":"local219","db":"EU_soccer","question":"Em cada liga, considerando todas as temporadas, qual é o único time com o menor total de vitórias em partidas, com base na comparação de gols marcados em casa e fora, incluindo equipes com zero vitórias, assegurando que, se várias equipes empatarem pelo menor número de vitórias, apenas uma equipe seja indicada para cada liga?","external_knowledge":null}
{"instance_id":"local221","db":"EU_soccer","question":"Diga-me quais são as 10 equipes com mais vitórias na liga.","external_knowledge":null}
{"instance_id":"local220","db":"EU_soccer","question":"Qual jogador participou no maior número de partidas vencidas e qual jogador participou no maior número de partidas perdidas, considerando apenas as partidas em que eles realmente jogaram (excluindo entradas nulas) e em que a equipe deles venceu ou perdeu (excluindo empates)?","external_knowledge":null}
{"instance_id":"local228","db":"IPL","question":"Para cada temporada da IPL, identifique os três melhores batedores com o maior total de corridas marcadas e os três melhores arremessadores com o maior número de wickets obtidos, excluindo eliminações por ‘run out’, ‘hit wicket’ e ‘retired hurt’. No caso de empates em corridas ou wickets, desempate-se pelo menor ID do jogador. Em seguida, apresente esses seis jogadores nas posições correspondentes — batedor 1 com arremessador 1, batedor 2 com arremessador 2 e batedor 3 com arremessador 3 — em ordem crescente do ID da temporada, juntamente com o total de corridas ou wickets de cada jogador.","external_knowledge":null}
{"instance_id":"local229","db":"IPL","question":"Encontre os IDs dos jogadores que marcaram o maior número de corridas de parceria em cada partida. A saída deve incluir os IDs de dois jogadores, cada um com suas pontuações individuais e o total de pontuação da parceria. Para cada par, o jogador com a pontuação individual mais alta deve ser listado como jogador 1, e o jogador com a pontuação mais baixa como jogador 2. Em casos em que ambos os jogadores têm a mesma pontuação, o jogador com o ID mais alto deve ser jogador 1, e o jogador com o ID mais baixo deve ser jogador 2. Pode haver várias linhas para uma única partida.","external_knowledge":null}
{"instance_id":"local244","db":"music","question":"Calcule a duração de cada faixa, classifique-as como curto, médio ou longo, apresente a duração mínima e máxima para cada tipo (em minutos) e a receita total para cada categoria, group by categoria.","external_knowledge":"music_length_type.md"}
{"instance_id":"local253","db":"education_business","question":"Usando um conjunto de dados de salários em que os valores salariais precisam ser limpos removendo caracteres não numéricos e convertendo-os para um tipo numérico, escreva uma consulta SQL detalhada que identifique as 5 principais empresas por salário médio em cada uma de Mumbai, Pune, New Delhi e Hyderabad, e então compare o salário médio de cada empresa nessas cidades com a média salarial nacional. O resultado final deve exibir quatro colunas: Localização, Nome da Empresa, Salário Médio por Estado e Salário Médio no País, listando apenas as 5 principais empresas em cada uma das localidades especificadas.","external_knowledge":null}
{"instance_id":"local258","db":"IPL","question":"Calcule o número total de wickets obtidos por cada arremessador (excluindo run-outs e outras eliminações não atribuídas ao arremessador), a taxa de economia dele (corridas totais concedidas divididas pelo total de overs lançados, considerando apenas corridas marcadas com o bastão e ignorando quaisquer corridas extras como wides e no-balls), a taxa de strike dele (número médio de bolas lançadas por wicket obtido) e o seu melhor desempenho de bowling em uma única partida (a partida com mais wickets obtidos pelo arremessador, formatado como \"wickets-runs\" onde as corridas são as corridas concedidas sem contar extras).","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local259","db":"IPL","question":"Para cada jogador, liste o seu ID, o nome, o seu papel mais frequente em todas as partidas, o lado de batting, o estilo de bowling, o total de corridas anotadas, o total de partidas disputadas, o total de vezes que foi eliminado, a média de batting (corridas totais divididas pelo número de eliminações), a pontuação mais alta em uma única partida, o número de partidas em que marcou pelo menos 30 corridas, pelo menos 50 corridas e pelo menos 100 corridas, o total de bolas enfrentadas na carreira, a taxa de strike (corridas totais divididas pelo total de bolas enfrentadas, multiplicado por 100), o total de wickets obtidos, a taxa de economia (média de corridas cedidas por over), e a melhor atuação de bowling em uma única partida (maior número de wickets obtidos em uma partida, formatado como \"wickets taken-runs given\", onde a melhor atuação é aquela com mais wickets, e se empatado, com menos corridas cedidas). Ignore os dados de extras.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local262","db":"stacking","question":"Quais problemas excedem o número total de vezes que aparecem na tabela de soluções ao contar todas as ocorrências, ao longo das etapas 1, 2 e 3, onde qualquer modelo que não seja o \"Stack\" tem a pontuação máxima de teste menor do que a pontuação de teste do modelo \"Stack\" para a mesma etapa e versão?","external_knowledge":null}
{"instance_id":"local263","db":"stacking","question":"Identifique o L1_model associado a cada modelo (especificado pelo nome e pela versão) que ocorre com maior frequência para cada status ('forte' ou 'suave'), juntamente com o número de ocorrências. Um modelo tem status 'forte' se, para qualquer uma de suas etapas, a pontuação máxima de teste entre modelos não-'Stack' for menor do que a pontuação de teste do modelo 'Stack'. Ele tem status 'suave' se a pontuação máxima de teste entre modelos não-'Stack' for igual à pontuação de teste do modelo 'Stack'. Conte quantas vezes cada L1_model está associado a um status 'forte' ou 'suave' em todos os modelos, e determine qual L1_model tem a maior ocorrência para cada status.","external_knowledge":null}
{"instance_id":"local264","db":"stacking","question":"Qual categoria de modelo (L1_model) aparece com mais frequência em todas as etapas e versões ao comparar modelos tradicionais com o modelo Stack, e qual é o total de ocorrências dessa categoria?","external_knowledge":null}
{"instance_id":"local269","db":"oracle_sql","question":"Qual é a média da quantidade total em todas as combinações finais de embalagem, considerando apenas os itens no nível folha dentro de cada combinação após expandir completamente quaisquer relações de embalagem aninhadas?","external_knowledge":null}
{"instance_id":"local270","db":"oracle_sql","question":"Quais são os contêineres de embalagem de nível superior, ou seja, aqueles que não estão contidos em nenhuma outra embalagem, que possuem algum item cuja quantidade total acumulada em todos os níveis aninhados da hierarquia excede 500, e quais são os nomes de ambos, esses contêineres e os itens correspondentes?","external_knowledge":null}
{"instance_id":"local272","db":"oracle_sql","question":"Para o pedido 423, identifique os IDs de produto, os corredores e as posições de onde retirar as quantidades exatas necessárias para cada linha de pedido, garantindo que a quantidade total retirada de cada produto corresponda às quantidades acumuladas encomendadas, sem exceder o estoque disponível no armazém 1. Calcule as quantidades a serem retiradas de cada localização priorizando o estoque com datas de compra mais antigas e quantidades menores, e assegure que a retirada respeite a sequência e as quantidades cumulativas das linhas de pedido para produtos com várias entradas.","external_knowledge":null}
{"instance_id":"local273","db":"oracle_sql","question":"Calcular o percentual médio de retirada para cada nome de produto, usando uma abordagem FIFO (first-in, first-out) que seleciona de locais de estoque com base na data de compra mais antiga e na menor quantidade disponível, garantindo que a quantidade retirada reflita apenas o intervalo de sobreposição entre a quantidade exigida de cada pedido e a quantidade disponível do estoque, e então agrupando e ordenando os resultados pelo nome do produto?","external_knowledge":null}
{"instance_id":"local274","db":"oracle_sql","question":"Quais produtos foram retirados para o pedido 421, e qual é o número médio de unidades retiradas para cada produto, usando FIFO (First-In, First-Out)?","external_knowledge":null}
{"instance_id":"local275","db":"oracle_sql","question":"Com base em dados de vendas mensais a partir de janeiro de 2016 e usando uma média móvel centrada para ajustar a sazonalidade, quais produtos tiveram uma razão de vendas ajustada pela sazonalidade que permaneceu consistentemente acima de 2 em todos os meses do ano de 2017?","external_knowledge":"calculation_method.md"}
{"instance_id":"local277","db":"oracle_sql","question":"Qual é a venda anual média prevista para os produtos 4160 e 7790 durante 2018, usando dados de vendas mensais a partir de janeiro de 2016 para os primeiros 36 meses, aplicando ajustes de sazonalidade de passos de tempo de 7 a 30 e empregando um método de regressão ponderada para estimar as vendas?","external_knowledge":"calculation_method.md"}
{"instance_id":"local279","db":"oracle_sql","question":"Usando um modelo recursivo de ajuste de inventário mensal, partindo dos níveis de inventário de December 2018, onde reabastecemos um produto se o seu estoque final cair abaixo do nível mínimo exigido, determine para cada produto o mês de 2019 em que a diferença absoluta entre o estoque final e o nível mínimo exigido é a menor, e retorne o product_id, aquele mês, e a diferença absoluta.","external_knowledge":null}
{"instance_id":"local283","db":"EU_soccer","question":"Analise o conjunto de dados de partidas de futebol para determinar o time campeão de cada temporada em todos os países e ligas, atribuindo 3 pontos para cada vitória, 1 ponto para cada empate e 0 pontos para cada derrota. Para cada temporada, retorne o nome do time campeão, a liga, o país e os pontos totais acumulados.","external_knowledge":null}
{"instance_id":"local284","db":"bank_sales_trading","question":"Para os dados de atacado de vegetais, você pode gerar um resumo das taxas de perda dos nossos itens? Inclua a taxa média de perda e também desagregue a contagem de itens que estão abaixo, acima e dentro de um desvio padrão dessa média.","external_knowledge":null}
{"instance_id":"local285","db":"bank_sales_trading","question":"Para os dados de atacado de vegetais, você pode analisar nosso desempenho financeiro ao longo dos anos de 2020 a 2023? Preciso de informações sobre o preço médio de atacado, preço máximo de atacado, preço mínimo de atacado, diferença de preço de atacado, preço total de atacado, preço total de venda, taxa média de perda, perda total e lucro para cada categoria dentro de cada ano. Arredonde todos os valores calculados para duas casas decimais.","external_knowledge":null}
{"instance_id":"local286","db":"electronic_sales","question":"Prepare um relatório abrangente de desempenho sobre nossos vendedores, com foco em vendas totais, preço médio por item, notas médias de avaliações e tempos de embalagem. Garanta que o relatório inclua apenas os vendedores que venderam mais de 100 produtos e destaque os nomes das categorias de produtos em inglês com o maior volume de vendas.","external_knowledge":null}
{"instance_id":"local301","db":"bank_sales_trading","question":"Para dados de vendas semanais, preciso de uma análise do nosso desempenho de vendas em meados de junho para os anos de 2018, 2019 e 2020. Especificamente, calcule a variação percentual nas vendas entre as quatro semanas que antecedem 15 de junho e as quatro semanas que se seguem a 15 de junho para cada ano.","external_knowledge":null}
{"instance_id":"local302","db":"bank_sales_trading","question":"Analise a variação percentual média das vendas entre as 12 semanas anteriores e posteriores a June 15, 2020, para cada tipo de atributo: região, plataforma, faixa etária, demografia e tipo de cliente. Para cada tipo de atributo, calcule a variação percentual média das vendas em todos os seus valores de atributo. Identifique o tipo de atributo com o maior impacto negativo nas vendas e forneça a variação percentual média das vendas desse tipo.","external_knowledge":null}
{"instance_id":"local329","db":"log","question":"Quantas sessões únicas visitaram a página /regist/input e, em seguida, a página /regist/confirm, nessa ordem?","external_knowledge":null}
{"instance_id":"local330","db":"log","question":"Usando a tabela de log de atividades, calcule o número total de sessões de usuário únicas nas quais cada página da web aparece como página de destino (a primeira página visitada em uma sessão com base no carimbo de data/hora) ou como página de saída (a última página visitada em uma sessão com base no carimbo de data/hora), ou ambos. Conte cada sessão apenas uma vez por página, mesmo que a página funcione como página de destino e página de saída para essa sessão.","external_knowledge":null}
{"instance_id":"local331","db":"log","question":"Quais são as três visitas distintas à terceira página mais frequentes observadas imediatamente após duas visitas consecutivas à página '/detail', e quantas vezes cada visita à terceira página ocorre?","external_knowledge":null}
{"instance_id":"local358","db":"log","question":"Quantos usuários existem em cada faixa etária (20s, 30s, 40s, 50s e outros)?","external_knowledge":null}
{"instance_id":"local360","db":"log","question":"Para cada sessão de usuário na tabela de logs de atividade, identifique o número de eventos que ocorreram antes do primeiro clique em '/detail' ou da conversão '/complete', contando apenas os eventos que possuam um tipo de busca não vazio. Encontre as sessões com a contagem mínima de tais eventos pré-clique/pré-conversão. Se várias sessões compartilharem essa contagem mínima, inclua todas nos resultados. Retorne cada sessão qualificada juntamente com o caminho correspondente e o tipo de busca.","external_knowledge":null}
{"instance_id":"local344","db":"f1","question":"Considerando todas as corridas em que os dados de pit stop estão disponíveis, e concentrando-se nas situações em que um piloto não estava atrás de outro carro na volta anterior, mas está atrás na volta atual (levando em conta retiros, entradas de pit-stop, saídas de pit-stop e largadas), quantas vezes ocorreu cada tipo de ultrapassagem na Fórmula 1?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local336","db":"f1","question":"Nas primeiras cinco voltas da corrida, quantas ultrapassagens ocorreram em cada categoria — retiradas, paradas nos boxes, ultrapassagens de largada e ultrapassagens normais na pista?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local335","db":"f1","question":"Nas temporadas de Fórmula 1 desde 2001, considerando apenas pilotos que pontuaram em uma temporada, quais são os cinco construtores que tiveram mais temporadas em que seus pilotos obtiveram o menor total de pontos entre todos os pilotos que pontuaram naquela temporada?","external_knowledge":null}
{"instance_id":"local309","db":"f1","question":"Para cada ano, qual piloto e qual construtor marcaram mais pontos? Quero o nome completo de cada piloto.","external_knowledge":null}
{"instance_id":"local310","db":"f1","question":"Usando apenas os dados da tabela ‘results’, encontre os três anos nos quais a soma dos maiores pontos totais obtidos por qualquer piloto e dos maiores pontos totais obtidos por qualquer construtor naquele ano (ambos calculados somando pontos da tabela ‘results’) é o menor, e liste esses três anos em ordem crescente do total.","external_knowledge":null}
{"instance_id":"local311","db":"f1","question":"Quais construtores tiveram os três primeiros pontos combinados do seu melhor piloto e da equipe, e em quais anos eles os alcançaram?","external_knowledge":null}
{"instance_id":"local354","db":"f1","question":"Entre os pilotos de Fórmula 1 que competiram durante os anos 1950, quais pilotos concluíram uma temporada naquela década com o mesmo construtor na primeira e na última corrida em que participaram, além de terem participado em pelo menos duas corridas distintas durante aquela temporada?","external_knowledge":null}
{"instance_id":"local355","db":"f1","question":"Calcule a média global da primeira corrida perdida e da última corrida perdida pelos pilotos de Formula 1 ao longo de todos os anos. Inclua apenas os pilotos que perderam menos de três corridas em um determinado ano e que tenham trocado de equipes entre suas aparições imediatamente antes e depois de seu hiato (ou seja, o ID do construtor da corrida imediatamente anterior à primeira corrida perdida deve ser diferente do ID do construtor da corrida imediatamente posterior à última corrida perdida naquele ano). Não agrupe os resultados por ano; retorne apenas as médias globais em todo o conjunto de dados.","external_knowledge":null}
{"instance_id":"local356","db":"f1","question":"Forneça os nomes completos dos pilotos que foram ultrapassados em pista mais vezes do que ultrapassaram outros pilotos em pista durante as voltas de corrida, excluindo mudanças de posição devido a paradas nos boxes (tanto na entrada quanto na saída dos boxes), retiros ou mudanças de posição que ocorreram durante a primeira volta de uma corrida (consideradas como movimentos de largada).","external_knowledge":null}
{"instance_id":"sf001","db":"GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI","question":"Assumindo que hoje seja 1 de abril de 2024, eu gostaria de saber as quantidades diárias de neve superiores a 6 polegadas para cada código postal dos EUA durante a semana que termina após as duas primeiras semanas completas do ano anterior. Mostre o código postal, a data e a quantidade de neve.","external_knowledge":null}
{"instance_id":"sf003","db":"GLOBAL_GOVERNMENT","question":"Para cada ano de 2015 a 2020, qual foi a Área de Tabulação de Código Postal do Censo (ZCTA) que teve a segunda maior taxa de crescimento populacional anual? Inclua apenas áreas com uma estimativa populacional de pelo menos 25.000 pessoas naquele ano (com base nas estimativas de 5 anos da American Community Survey). Para cada ano, forneça o código postal, a sigla do estado e a taxa de crescimento anual em porcentagem.","external_knowledge":null}
{"instance_id":"sf002","db":"FINANCE__ECONOMICS","question":"Em 31 de dezembro de 2022, liste os 10 maiores bancos ativos com ativos superiores a US$ 10 bilhões, classificados pela maior porcentagem de ativos não segurados, em que a porcentagem é calculada como um menos o valor da variável '% Insured (Estimated)' a partir de estimativas trimestrais. Forneça os nomes desses bancos e as respectivas porcentagens de ativos não segurados.","external_knowledge":null}
{"instance_id":"sf044","db":"FINANCE__ECONOMICS","question":"Qual foi a variação percentual nos preços de fechamento no pós-mercado das Magnificent 7, empresas de tecnologia, de 1 de janeiro a 30 de junho de 2024?","external_knowledge":null}
{"instance_id":"sf006","db":"FINANCE__ECONOMICS","question":"Para cada estado dos EUA, determine como mudou o número de filiais financeiras ativas desde 1 de março de 2020 até 31 de dezembro de 2021. Uma entidade é considerada ativa em uma data específica se sua data de início for anterior ou igual a essa data e sua data de término for nula ou posterior a essa data. Para cada estado, calcule o número de entidades ativas em 1 de março de 2020, o número de entidades ativas em 31 de dezembro de 2021 e a variação percentual desses números.","external_knowledge":null}
{"instance_id":"sf008","db":"US_REAL_ESTATE","question":"Determine a variação percentual no fluxo de renda bruta e no índice de preço de compra de imóveis ajustado sazonalmente para a área metropolitana Phoenix-Mesa-Scottsdale, AZ, de 1 de janeiro de 2023 a 31 de dezembro de 2023. O fluxo de renda bruta refere-se à renda bruta ajustada total de todas as entidades financeiras dentro da área metropolitana especificada.","external_knowledge":null}
{"instance_id":"sf010","db":"US_REAL_ESTATE","question":"Quais são as razões acumuladas de hipotecas próximas da inadimplência na Califórnia para cada data registrada em 2023, incluindo aquelas com atraso de 90 a 180 dias, em moratória, ou passando por execução hipotecária, falência ou cessão por escritura em vez de execução?","external_knowledge":null}
{"instance_id":"sf037","db":"US_REAL_ESTATE","question":"Como podemos encontrar a menor distância em linha reta em milhas entre cada loja 'The Home Depot' e sua localização mais próxima 'Lowe's Home Improvement'? Usando o banco de dados US_REAL_ESTATE.CYBERSYN, junte a tabela point_of_interest_index com point_of_interest_addresses_relationships e us_addresses para obter coordenadas geográficas. Para cada localização de 'The Home Depot' (identificada pelo poi_id), calcule sua distância para todas as lojas de 'Lowe's Home Improvement' usando as funções ST_DISTANCE e ST_MAKEPOINT, converta a distância de metros para milhas (dividindo por 1609) e retorne apenas o registro com a menor distância para cada loja de 'The Home Depot' usando QUALIFY com ROW_NUMBER().","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf012","db":"WEATHER__ENVIRONMENT","question":"Usando dados do FEMA National Flood Insurance Program Claim Index, para cada ano de 2010 a 2019, quais foram os valores totais de danos aos edifícios e os valores totais de danos ao conteúdo relatados pelo NFIP para a comunidade NFIP chamada 'City Of New York', agrupados por cada ano de perda?","external_knowledge":null}
{"instance_id":"sf018","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Analise o engajamento do usuário com notificações push dentro de uma janela de uma hora especificada em 1 de junho de 2023.","temporal":"Yes","external_knowledge":"PushNotificationAnalysis.md"}
{"instance_id":"sf035","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Quantos usuários únicos iniciaram sessões a cada dia dentro de cada grupo de aplicativos entre 1 de junho de 2023 e 7 de junho de 2023? Além disso, exiba o ID do grupo de aplicativos e o dia de início da sessão.","external_knowledge":null}
{"instance_id":"sf029","db":"AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET","question":"Gerar um relatório diário detalhado de vendas para cada produto sob a visualização de distribuidor 'Manufacturing', cobrindo os 30 dias anteriores até 6 de fevereiro de 2022, por meio da junção dos dados de vendas, tráfego, inventário e net PPM em date, ASIN, program, period e distributor_view. O relatório deve incluir o total de unidades encomendadas, receita de pedidos, preço médio de venda, visualizações rápidas, taxa de conversão, unidades despachadas, receita de unidades despachadas, net PPM médio, OOS médio do produto disponível para compra, total de unidades em estoque e valor, unidades recebidas líquidas e valor, quantidades de pedidos de compra em aberto, unidades encomendadas pelos clientes ainda não atendidas, e a taxa média de confirmação do fornecedor, taxa de preenchimento de recebimento, taxa de escoamento e tempo de entrega do fornecedor.","external_knowledge":null}
{"instance_id":"sf040","db":"US_ADDRESSES__POI","question":"Encontre os 10 endereços mais ao norte na maior área de códigos postais da Flórida. Quais são os números de endereço, os nomes das ruas e os tipos deles?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf009","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Uma empresa imobiliária precisa de uma comparação detalhada lado a lado de edifícios em Amsterdã e Roterdão. Eles exigem um relatório que mostre cada classe de edifício e subclasse, com a área total de superfície (em metros quadrados) e o número total de edifícios para cada categoria de classificação em ambas as cidades. Os dados devem ser organizados por classe de edifício e subclasse em ordem crescente, com as estatísticas de Amsterdã e Roterdão apresentadas em colunas paralelas para facilitar a comparação direta. Você pode gerar este relatório abrangente de comparação de classificações de edifícios?","external_knowledge":null}
{"instance_id":"sf013","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Compare os comprimentos totais das estradas em Amsterdã e Roterdão, criando uma análise lado a lado de ambas as cidades. Para cada combinação de classe de estrada e subclasse, calcule o comprimento total das estradas (em metros) especificamente para os segmentos de QUADKEY '12020210' e '12020211'. Apresente os resultados com colunas para classe, subclasse, comprimentos das estradas de Amsterdã e comprimentos das estradas de Roterdão.","external_knowledge":null}
{"instance_id":"sf041","db":"YES_ENERGY__SAMPLE_DATA","question":"Elabore um relatório para a ERCOT em 1 de outubro de 2022, que combine dados horários de preços day-ahead e em tempo real a partir do node ID 10000697078, previsões de carga (datatypeid 19060) e cargas reais, além de previsões de geração eólica (forecast datatypeid 9285, actual datatypeid 16) e solar (forecast datatypeid 662, actual datatypeid 650) a partir do object ID 10000712973. Este relatório deve incluir alinhamentos de fusos horários, classificações de pico e cálculos de carga líquida, fornecendo insights sobre a dinâmica operacional diária e a eficiência.","temporal":"Yes","external_knowledge":"ERCOT_Daily_Market_Dynamics_Report.md"}
{"instance_id":"sf011","db":"CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE","question":"Determine a distribuição populacional dentro de cada grupo de blocos em relação ao seu trecho censitário no Estado de Nova York usando dados ACS de 2021. Inclua o ID do grupo de blocos, o valor do censo, o ID do trecho censitário por estado e condado, a população total do trecho censitário e a proporção populacional de cada grupo de blocos.","external_knowledge":null}
{"instance_id":"sf014","db":"CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE","question":"Qual é o código ZIP do estado de Nova York com o maior número de deslocados que percorrem mais de uma hora, de acordo com os dados ACS de 2021? Inclua o código ZIP, o total de deslocados, a referência estadual para essa duração e a população do estado.","external_knowledge":null}
