{"instance_id":"bq011","db":"ga4","question":"¿Cuántos usuarios pseudo distintos tuvieron tiempo de compromiso positivo en el periodo de 7 días que termina en January 7, 2021 at 23:59:59, pero no tuvieron tiempo de compromiso positivo en el periodo de 2 días que termina en la misma fecha (January 7, 2021 at 23:59:59)?","external_knowledge":"ga4_obfuscated_sample_ecommerce.events.md"}
{"instance_id":"bq010","db":"ga360","question":"Encuentra el producto más vendido entre los clientes que compraron 'Youtube Men’s Vintage Henley' en julio de 2017, excluyéndolo.","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq009","db":"ga360","question":"¿Qué fuente de tráfico tiene el mayor total de ingresos por transacciones para el año 2017, y cuál es la diferencia en millones (redondeada a dos decimales) entre los totales de ingresos mensuales más altos y más bajos para esa fuente de tráfico?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq001","db":"ga360","question":"Para cada visitante que haya realizado al menos una transacción en February 2017, ¿cuántos días transcurrieron entre la fecha de su primera visita en February y la fecha de su primera transacción en February, y en qué tipo de dispositivo realizaron esa primera transacción?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq002","db":"ga360","question":"Durante la primera mitad de 2017, centrándose en los ingresos por el producto hits, ¿qué fuente de tráfico generó los ingresos totales por productos más altos, y cuáles fueron los ingresos máximos diarios, semanales y mensuales para esa fuente de mayor rendimiento durante este periodo (en millones)?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq003","db":"ga360","question":"Entre el 1 de abril y el 31 de julio de 2017, utilizando los datos de ingresos por producto de hits junto con las transacciones totales para clasificar las sesiones como compra (transacciones ≥ 1 y productRevenue no nulo) o no compra (transacciones nulo y productRevenue nulo), compara las vistas de página promedio por visitante para cada grupo por mes","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq004","db":"ga360","question":"En julio de 2017, entre todos los visitantes que compraron cualquier producto relacionado con YouTube, ¿qué producto distinto—excluyendo aquellos que contengan ‘YouTube’ en el nombre del producto—tuvo la mayor cantidad total adquirida?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq008","db":"ga360","question":"En enero de 2017, entre los visitantes cuyo nombre de campaña contiene 'Data Share' y que accedieron a cualquier página que comience con '/home', ¿qué página visitaron a continuación con mayor frecuencia y cuál es el tiempo máximo (en segundos) que pasaron en la página '/home' antes de continuar?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq269","db":"ga360","question":"Entre el 1 de junio de 2017 y el 31 de julio de 2017, considere solo sesiones que tengan vistas de página no nulas. Clasifique cada sesión como ‘purchase’ si tiene al menos una transacción, o ‘non_purchase’ en caso contrario. Para cada mes, sume el total de vistas de página de cada visitante bajo cada clasificación, luego calcule el promedio de vistas de página por visitante para los grupos de purchase y non_purchase en cada mes, y presente los resultados lado a lado.","external_knowledge":null}
{"instance_id":"bq268","db":"ga360","question":"Determina la mayor cantidad de días entre la primera visita y el último evento registrado (ya sea la última visita o la primera transacción) para un usuario, cuando el último evento registrado esté asociado a un dispositivo móvil. El último evento registrado podría ser la última visita o la primera transacción, y debes enfocarte en los usuarios cuyo último evento registrado ocurrió en un dispositivo móvil.","external_knowledge":null}
{"instance_id":"bq270","db":"ga360","question":"¿Cuáles fueron las tasas mensuales de conversión de agregar al carrito y de compra, calculadas como un porcentaje de las vistas de la página de detalles del producto, desde enero de 2017 hasta marzo de 2017?","external_knowledge":"ga360_hits.eCommerceAction.action_type.md"}
{"instance_id":"bq275","db":"ga360","question":"¿Qué IDs de visitante pertenecen a usuarios cuyas primeras transacciones ocurrieron en un dispositivo etiquetado explícitamente como 'mobile' en una fecha posterior a su primera visita?","external_knowledge":null}
{"instance_id":"bq374","db":"ga360","question":"Calcula el porcentaje de nuevos usuarios que, entre el 1 de agosto de 2016 y el 30 de abril de 2017, tanto permanecieron en el sitio durante más de 5 minutos durante su visita inicial como realizaron una compra en una visita posterior en cualquier momento posterior, en relación con el número total de nuevos usuarios en el mismo período.","external_knowledge":null}
{"instance_id":"sf_bq029","db":"PATENTS","question":"Obtenga el número medio de inventores por patente y el recuento total de publicaciones de patentes en Canadá (CA) para cada período de 5 años desde 1960 hasta 2020, basándose en las fechas de publicación. Solo incluya patentes que tengan al menos un inventor listado y agrupe los resultados por intervalos de 5 años (1960-1964, 1965-1969, etc.).","external_knowledge":null}
{"instance_id":"sf_bq026","db":"PATENTS","question":"Para el cesionario que ha sido el más activo en la categoría de patentes 'A61', me gustaría saber los cinco códigos de jurisdicción de patentes en los que presentaron la mayor cantidad de patentes durante su año de mayor actividad, separados por comas.","external_knowledge":null}
{"instance_id":"sf_bq091","db":"PATENTS","question":"¿En qué año presentó el cesionario con más solicitudes en la categoría de patentes 'A61' la mayor cantidad de solicitudes?","external_knowledge":null}
{"instance_id":"sf_bq099","db":"PATENTS","question":"Para la clase de patentes A01B3, quiero analizar la información de los tres asignatarios principales basándome en el número total de solicitudes. Por favor, proporcione las siguientes cinco piezas de información: el nombre de este asignatario, el número total de solicitudes, el año con más solicitudes, el número de solicitudes en ese año y el código de país con más solicitudes durante ese año.","external_knowledge":null}
{"instance_id":"sf_bq033","db":"PATENTS","question":"¿Cuántas publicaciones de EE. UU. relacionadas con IoT (donde el resumen incluye la frase 'internet of things') se presentaron cada mes desde 2008 hasta 2022, incluyendo meses sin presentaciones?","external_knowledge":null}
{"instance_id":"sf_bq209","db":"PATENTS","question":"¿Puede calcular el número de patentes de utilidad que fueron concedidas en 2010 y que tienen exactamente una citación posterior dentro de una ventana de 10 años tras su fecha de presentación? Para este análisis, las citaciones posteriores deben contarse como números de solicitud distintos que citaron la patente dentro de los 10 años después de la fecha de presentación de la propia patente.","external_knowledge":null}
{"instance_id":"sf_bq027","db":"PATENTS","question":"Para patentes concedidas entre 2010 y 2018, proporcione el número de publicación de cada patente y el número de citaciones anteriores que ha recibido en la categoría SEA.","external_knowledge":null}
{"instance_id":"sf_bq210","db":"PATENTS","question":"¿Cuántas patentes US B2 concedidas entre 2008 y 2018 contienen reivindicaciones que no incluyen la palabra 'claim'?","external_knowledge":null}
{"instance_id":"sf_bq211","db":"PATENTS","question":"Entre las patentes concedidas entre 2010 y 2023 en CN, ¿cuántas de ellas pertenecen a familias que tienen un total de más de una solicitud distinta?","external_knowledge":null}
{"instance_id":"sf_bq213","db":"PATENTS","question":"¿Cuál es el código IPC de 4 dígitos más común entre las patentes utilitarias B2 de EE. UU. concedidas desde junio hasta agosto de 2022?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq212","db":"PATENTS","question":"Para las patentes de utilidad de Estados Unidos concedidas bajo la clasificación B2 entre junio y septiembre de 2022, identifique el código IPC de 4 dígitos más frecuente para cada patente. Luego, enumere los números de publicación y los códigos IPC4 de las patentes donde este código aparece 10 veces o más.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq214","db":"PATENTS_GOOGLE","question":"Para patentes de utilidad de los Estados Unidos bajo la clasificación B2 concedidas entre 2010 y 2014, encuentre la que tenga la mayor cantidad de citaciones hacia adelante dentro de un mes a partir de su fecha de presentación, y identifique la patente más similar del mismo año de presentación, independientemente de su tipo.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq216","db":"PATENTS_GOOGLE","question":"Identifique las cinco patentes principales presentadas en el mismo año que `US-9741766-B2` que sean las más similares a la mencionada, basadas en similitudes tecnológicas. Por favor, proporcione los números de publicación.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq247","db":"PATENTS_GOOGLE","question":"Del conjunto de datos de publicaciones, primero identifique las seis familias con más publicaciones cuyas family_id no sea '-1'. Luego, utilizando la tabla abs_and_emb (unida en publication_number), proporcione a cada una de esas familias sus IDs junto con cada resumen no vacío asociado a sus publicaciones.","external_knowledge":null}
{"instance_id":"sf_bq127","db":"PATENTS_GOOGLE","question":"Para cada familia de publicaciones cuya publicación más temprana se publicó por primera vez en enero de 2015, por favor proporcione la fecha de la publicación más temprana, los distintos números de publicación, sus códigos de país, los distintos códigos CPC e IPC, distintas familias (a saber, los identificadores) que citan y son citadas por esta familia de publicaciones. Por favor, presente todas las listas como valores separados por comas, ordenados alfabéticamente.","external_knowledge":null}
{"instance_id":"sf_bq215","db":"PATENTS","question":"¿Qué patente de EE. UU. (con un código de tipo B2 y una fecha de concesión entre 2015 y 2018) tiene la puntuación de originalidad más alta, calculada como 1 - (la suma de las ocurrencias al cuadrado de los códigos IPC de 4 dígitos distintos en sus citaciones hacia atrás dividida por el cuadrado del total de ocurrencias de estos códigos IPC de 4 dígitos)?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq222","db":"PATENTS","question":"Encuentre las áreas tecnológicas CPC en Alemania que tuvieron el promedio móvil exponencial más alto (factor de suavizado 0.1) de las solicitudes de patentes por año, específicamente para patentes concedidas en diciembre de 2016. Para cada grupo CPC de nivel 4, muestre el título completo, el grupo CPC y el año con el promedio móvil exponencial más alto de las solicitudes de patentes.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq221","db":"PATENTS","question":"Identifique las áreas tecnológicas CPC con la mayor media móvil exponencial de las solicitudes de patente cada año (con un factor de suavizado de 0.2), considerando solo el primer código CPC de cada patente que tenga una fecha de presentación válida y un número de solicitud no vacío, y reporte el título completo del CPC junto con el mejor año asociado con la mayor media móvil exponencial para cada grupo CPC en el nivel 5.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq223","db":"PATENTS","question":"¿Qué cesionarios, excluyendo a DENSO CORP en sí, han citado patentes asignadas a DENSO CORP, y cuáles son los títulos de las CPC primarias asociadas con estas citaciones? Proporcione el nombre de cada cesionario citante (excluyendo DENSO CORP), el título completo de la subclase CPC primaria (basado en el primer código CPC), y el conteo de citaciones agrupadas por el cesionario citante y el título de la subclase CPC. Asegúrese de que solo se consideren citaciones de patentes con fechas de presentación válidas, y enfóquese en el primer código CPC de cada patente citada. Los resultados deben excluir específicamente a DENSO CORP como cesionario citante.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq420","db":"PATENTS_USPTO","question":"¿Puede identificar las 5 principales patentes que inicialmente fueron rechazadas bajo la sección 101 sin reclamaciones aceptadas, basándose en la longitud de sus reclamaciones concedidas? Las patentes deberían haber sido concedidas en EE. UU. entre 2010 y 2023. Además, asegúrese de seleccionar la primera fecha de acción de la Oficina para cada solicitud. Por favor, incluya sus números de primera publicación, junto con sus fechas de primera publicación, la longitud de las reclamaciones presentadas y las fechas de concesión.","external_knowledge":null}
{"instance_id":"sf_bq207","db":"PATENTS_USPTO","question":"¿Podría proporcionar los números de publicación más tempranos, los números de solicitud correspondientes, los números de reivindicación y el conteo de palabras para las 100 reivindicaciones independientes de patentes, basándose en el mayor conteo de palabras, obtenidas de estadísticas de reivindicaciones dentro de uspto_oce_claims (filtrados por ind_flg='1'), emparejadas con sus números de publicación de uspto_oce_claims match, y además unidas con publicaciones de patentes para asegurar que solo se incluya la publicación más temprana para cada solicitud, ordenadas de forma descendente por el conteo de palabras y limitadas a los 100 resultados?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq128","db":"PATENTSVIEW","question":"Obtenga la siguiente información de patentes de EE. UU. presentadas entre el 1 de enero de 2014 y el 1 de febrero de 2014. El título de la patente y su resumen. La fecha de publicación de la patente. El número de citas hacia atrás para cada patente (es decir, el número de patentes citadas por la patente actual antes de su fecha de presentación). El número de citas hacia adelante para cada patente dentro de los primeros 5 años de su publicación (es decir, el número de patentes que citaron la patente actual dentro de 5 años después de su publicación). Para cada patente, asegúrese de que las citas hacia adelante se cuenten solo para las citas dentro de los 5 años posteriores a la fecha de publicación, y las citas hacia atrás se cuenten antes de la fecha de presentación.","external_knowledge":"forward_backward_citation.md"}
{"instance_id":"sf_bq246","db":"PATENTSVIEW","question":"Recuperar patentes de EE. UU. con el número de citaciones hacia adelante dentro de los primeros 3 años después de la fecha de solicitud de la patente (es decir, patentes que citan la patente actual dentro de 3 años). Solo incluir patentes que tengan tanto citaciones anteriores dentro de 1 año antes de la fecha de solicitud como citaciones posteriores dentro de 1 año después de la fecha de solicitud. La consulta debe enfocarse en categorías CPC específicas, ordenar los resultados por citaciones anteriores en orden descendente y devolver la patente con la mayor cantidad de citaciones anteriores, limitando a un único resultado.","external_knowledge":null}
{"instance_id":"sf_bq052","db":"PATENTSVIEW","question":"Obtenga la siguiente información para patentes de EE. UU.: el identificador de la patente, el título y la fecha de presentación. El número de citas hacia atrás dentro de un mes antes de la fecha de presentación (es decir, patentes que citaron la patente actual antes de su presentación). El número de citas hacia adelante dentro de un mes después de la fecha de presentación (es decir, patentes que citaron la patente actual después de su presentación). El texto del resumen de la patente. Incluya solo patentes que pertenezcan a categorías CPC específicas, como la subsección 'C05' o el grupo 'A01G'. La consulta debe filtrar patentes para incluir solo aquellas que tengan al menos una cita hacia atrás o una cita hacia adelante en el periodo de 1 mes especificado. Ordene los resultados por fecha de presentación y devuelva todos los registros que coincidan.","external_knowledge":null}
{"instance_id":"sf_bq036","db":"GITHUB_REPOS","question":"¿Cuál fue el número promedio de commits de GitHub realizados por mes en 2016 para repositorios que contienen código Python?","external_knowledge":null}
{"instance_id":"sf_bq100","db":"GITHUB_REPOS","question":"¿Cómo podemos identificar los 10 paquetes más utilizados en el contenido de repositorios de GitHub buscando sentencias de importación entre paréntesis, dividiendo cualquier import de varias líneas por saltos de línea, extrayendo los nombres de los paquetes que aparecen entre comillas dobles, contando con qué frecuencia aparecen estos paquetes, ignorando cualquier resultado nulo y, por último, ordenándolos en orden descendente de su frecuencia? La respuesta final debe eliminar las comillas.","external_knowledge":null}
{"instance_id":"sf_bq101","db":"GITHUB_REPOS","question":"Desde el contenido de los repos de GitHub, ¿cómo podemos identificar los 10 nombres de paquete más importados en archivos fuente Java dividiendo el contenido de cada archivo en líneas, filtrando por sentencias de importación válidas, extrayendo solo la parte del paquete utilizando una expresión regular adecuada, agrupando por estos nombres de paquete extraídos, contando sus ocurrencias y, finalmente devolviendo los 10 paquetes que aparecen con mayor frecuencia en orden descendente de frecuencia?","external_knowledge":null}
{"instance_id":"sf_bq182","db":"GITHUB_REPOS_DATE","question":"¿Qué lenguajes de programación principales, determinados por la mayor cantidad de bytes en cada repositorio, tuvieron al menos 5 PullRequestEvents en January 18, 2023 en todos sus repositorios?","external_knowledge":null}
{"instance_id":"sf_bq217","db":"GITHUB_REPOS_DATE","question":"El 18 de enero de 2023, ¿cuántos eventos de creación de pull request se produjeron en repositorios de GitHub que incluyen JavaScript como uno de sus lenguajes de programación? Utilice los datos de la tabla githubarchive para los eventos y la tabla languages para la información del lenguaje de los repositorios.","external_knowledge":null}
{"instance_id":"sf_bq191","db":"GITHUB_REPOS_DATE","question":"A partir de los datos de GitHub WatchEvent de 2017, encuentra los dos primeros repositorios que tengan más de 300 observadores distintos, asegurando que los resultados se unan con la tabla 'sample_files' para que devuelvas el nombre de cada repositorio junto con su conteo de observadores distintos, y limita la salida a los dos repositorios con el mayor conteo de observadores.","external_knowledge":null}
{"instance_id":"sf_bq224","db":"GITHUB_REPOS_DATE","question":"¿Qué repositorio con una licencia aprobada en `licenses.md` tuvo el mayor total combinado de forks, issues y watches en abril de 2022?","external_knowledge":null}
{"instance_id":"sf_bq192","db":"GITHUB_REPOS_DATE","question":"Encuentra el repositorio de Python más activo en GitHub basado en el número de observadores, incidencias y bifurcaciones. La consulta debe seleccionar repositorios con licencias de código abierto específicas (`artistic-2.0`, `isc`, `mit`, `apache-2.0`), contar observadores distintos, eventos de issues y bifurcaciones para cada repositorio en April 2022, e incluir solo aquellos con archivos `.py` en la rama `master`. Une los datos de licencias con los recuentos de observadores, eventos de issues y recuentos de bifurcaciones, y ordénalos por una métrica combinada de bifurcaciones, incidencias y observadores, devolviendo el nombre y el recuento del repositorio más activo.","external_knowledge":null}
{"instance_id":"sf_bq225","db":"GITHUB_REPOS","question":"De los archivos del repositorio de GitHub en 'github_repos.sample_files' unidos con 'github_repos.sample_contents', ¿cuáles son los 10 lenguajes de programación que aparecen con mayor frecuencia (basado en las extensiones de archivo reconocidas) en archivos que tienen contenido no vacío, ordenados por su recuento de archivos en orden descendente?","external_knowledge":"lang_and_ext.md"}
{"instance_id":"sf_bq180","db":"GITHUB_REPOS","question":"Obtén los 5 nombres de módulos más frecuentemente usados de scripts de Python (`.py`) y R (`.r`), contando las ocurrencias de módulos en declaraciones `import` y `from` para Python, y llamadas `library()` para R. La consulta debe considerar solo archivos de Python y R, agrupar por nombre de módulo y devolver los 5 módulos más frecuentes, ordenados por frecuencia.","external_knowledge":null}
{"instance_id":"sf_bq233","db":"GITHUB_REPOS","question":"¿Puedes analizar los datos combinados de los archivos de repos de github y del contenido de github_repos, enfocándote solo en archivos que terminen con '.py' o '.r', luego extraer módulos de Python de las líneas 'import' o 'from ... import' y bibliotecas de R de las líneas 'library(...)', contar sus ocurrencias y, finalmente, enumerar los resultados ordenados por lenguaje y por el número de ocurrencias en orden descendente?","external_knowledge":null}
{"instance_id":"sf_bq248","db":"GITHUB_REPOS","question":"Entre todos los repositorios que no utilicen ningún lenguaje de programación cuyo nombre (insensible a mayúsculas/minúsculas) incluya la subcadena \"python,\" ¿cuál es la proporción de archivos cuyas rutas incluyen \"readme.md\" y cuyos contenidos contienen la frase \"Copyright (c)\"?","external_knowledge":null}
{"instance_id":"sf_bq193","db":"GITHUB_REPOS","question":"Recupera todas las líneas no vacías y no comentadas de los archivos `README.md` en repositorios de GitHub, excluyendo las líneas que son comentarios (ya sea que empiecen con `#` para Markdown o con `//` para comentarios de código). Para cada línea, calcula con qué frecuencia aparece cada línea única en todos los repositorios y devuelve una lista separada por comas de los lenguajes de programación usados en cada repositorio que contiene esa línea, ordenada alfabéticamente, con los resultados ordenados por la frecuencia de aparición en orden descendente.","external_knowledge":null}
{"instance_id":"sf_bq295","db":"GITHUB_REPOS_DATE","question":"Usando los datos de 2017 del GitHub Archive para eventos de watch, ¿cuáles son los tres repositorios que incluyen al menos un archivo Python (con extensión .py) de tamaño menor a 15,000 bytes y que contienen la subcadena \"def \" en su contenido, y que tienen el mayor número total de eventos de watch para ese año?","external_knowledge":null}
{"instance_id":"sf_bq249","db":"GITHUB_REPOS","question":"Por favor, proporcione un informe sobre el número de ocurrencias de tipos de línea específicos en archivos del repositorio de GitHub. Clasifique una línea como 'final' si termina con un carácter en blanco, como 'Espacio' si empieza con un espacio, y como 'Otro' si no cumple ninguna de las condiciones. El informe debe incluir el número total de ocurrencias para cada categoría, considerando todas las líneas de todos los archivos.","external_knowledge":null}
{"instance_id":"sf_bq375","db":"GITHUB_REPOS","question":"Determine cuál tipo de archivo entre Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java) y JavaScript (.js) en la base de código de GitHub tiene la mayor cantidad de archivos con una profundidad de directorio mayor que 10, y proporcione el recuento de archivos.","external_knowledge":null}
{"instance_id":"sf_bq255","db":"GITHUB_REPOS","question":"¿Cuántos mensajes de commit hay en repositorios que utilizan el lenguaje de programación 'Shell' y la licencia 'apache-2.0', donde la longitud del mensaje de commit es mayor que 5 caracteres pero menor que 10,000 caracteres, y los mensajes no comienzan con la palabra 'merge', 'update' o 'test'?","external_knowledge":null}
{"instance_id":"sf_bq194","db":"GITHUB_REPOS","question":"Entre todos los archivos de Python (*.py), R (*.r, *.R, *.Rmd, *.rmd) y cuadernos de IPython (*.ipynb) en el conjunto de datos de muestra de GitHub, ¿qué biblioteca o módulo se identifica como el segundo más frecuentemente importado o cargado según las declaraciones de importación extraídas?","external_knowledge":null}
{"instance_id":"sf_bq377","db":"GITHUB_REPOS","question":"Extraer y contar la frecuencia de todos los nombres de paquetes enumerados en la sección require del contenido formateado en JSON","external_knowledge":null}
{"instance_id":"sf_bq359","db":"GITHUB_REPOS","question":"Enumera los nombres de los repositorios y sus recuentos de commits para los dos principales repositorios de GitHub que tienen JavaScript como lenguaje principal y el mayor número de commits.","external_knowledge":null}
{"instance_id":"sf_bq252","db":"GITHUB_REPOS","question":"¿Podrías por favor encontrar el nombre del repositorio que contiene el archivo Swift no binario más copiado en el conjunto de datos, garantizando que cada archivo esté identificado de forma única por su ID?","external_knowledge":null}
{"instance_id":"sf_bq251","db":"PYPI","question":"Quiero conocer las URLs de proyectos de GitHub para los 3 paquetes de PyPI más descargados basados en el conteo de descargas. Primero, extrae los metadatos de los paquetes PyPI, incluyendo nombre, versión y URLs del proyecto. Filtra estas URLs para incluir solo aquellas que enlacen a repositorios de GitHub. Utiliza una expresión regular para limpiar las URL de GitHub eliminando partes innecesarias como 'issues', 'pull', 'blob' y 'tree' en las rutas, dejando solo la URL principal del repositorio. Para paquetes con múltiples versiones, usa solo la versión más reciente según la hora de subida. Combina estos datos con las métricas de descarga para determinar los paquetes más descargados. Devuelve únicamente las URL limpias del repositorio de GitHub (sin comillas) para los 3 paquetes principales por el total de descargas, asegurando que solo se incluyan en los resultados los paquetes con URLs de GitHub válidas.","external_knowledge":null}
{"instance_id":"bq019","db":"cms_data","question":"En los datos de cargos hospitalarios de Medicare de CMS de 2014, ¿qué definición DRG tiene el mayor número total de altas, y entre las tres ciudades con más altas para esa definición DRG, cuáles son sus respectivos pagos totales promedio ponderados (ponderados por el total de altas)?","external_knowledge":null}
{"instance_id":"bq234","db":"cms_data","question":"¿Cuál es el medicamento más prescrito en cada estado en 2014?","external_knowledge":null}
{"instance_id":"bq235","db":"cms_data","question":"¿Puede decirme qué proveedor de atención médica incurre en los costos promedio combinados más altos tanto para servicios ambulatorios como para servicios hospitalarios en 2014?","external_knowledge":null}
{"instance_id":"bq172","db":"cms_data","question":"Para el fármaco con el mayor número total de prescripciones en el estado de Nueva York durante 2014, ¿podrías enumerar los cinco estados con el mayor recuento total de reclamaciones para este fármaco? Por favor, incluye también sus recuentos totales de reclamaciones y los costos totales del fármaco.","external_knowledge":null}
{"instance_id":"bq177","db":"cms_data","question":"Para el proveedor cuyo costo total de Medicare por internaciones de 2011 a 2015 es el mayor (calculado como la suma de average_medicare_payments multiplicados por total_discharges), por favor enumere el costo promedio anual de internación de ese proveedor y el costo promedio anual de atención ambulatoria para cada año calendario en este período, donde el costo de internación se calcula como el promedio de (average_medicare_payments × total_discharges) y el costo de atención ambulatoria se calcula como el promedio de (average_total_payments × outpatient_services).","external_knowledge":null}
{"instance_id":"bq354","db":"cms_data","question":"¿Podría proporcionar el porcentaje de participantes para el acné estándar, dermatitis atópica, psoriasis y vitiligo tal como se definen en la Clasificación Internacional de Enfermedades 10-CM (ICD-10-CM), incluyendo sus subcategorías? Por favor, incluya todos los conceptos relacionados mapeados a los códigos ICD-10-CM estándar (L70 para acné, L20 para dermatitis atópica, L40 para psoriasis y L80 para vitiligo) utilizando relaciones entre conceptos, incluyendo conceptos descendientes. El porcentaje debe calcularse basándose en el número total de participantes, considerando solo los conceptos estándar y sus descendientes relacionados.","external_knowledge":null}
{"instance_id":"bq355","db":"cms_data","question":"Por favor, indíqueme el porcentaje de participantes que no están usando quinapril y medicamentos relacionados (Quinapril RxCUI: 35208).","external_knowledge":null}
{"instance_id":"bq032","db":"noaa_data","question":"¿Puede proporcionar la latitud de las coordenadas finales del huracán que recorrió la segunda mayor distancia en el Atlántico Norte durante 2020?","external_knowledge":"functions_st_distance.md"}
{"instance_id":"bq119","db":"noaa_data","question":"Por favor, muestre información sobre el huracán con la tercera mayor distancia total de recorrido en el Atlántico Norte durante 2020, incluyendo sus coordenadas de recorrido, la distancia total acumulada de recorrido (en kilómetros) en cada punto y la velocidad máxima sostenida del viento en esos momentos.","external_knowledge":"functions_st_distance.md"}
{"instance_id":"sf_bq117","db":"NOAA_DATA","question":"¿cuál es el número total de eventos de tormentas severas que ocurrieron en el mes más afectado en los últimos 15 años según los registros de NOAA, considerando solo los 100 eventos de tormentas con mayor daño a la propiedad?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq419","db":"noaa_data","question":"¿Qué 5 estados tuvieron la mayor cantidad de eventos de tormenta desde 1980 hasta 1995, considerando solo los 1000 estados con el mayor recuento de eventos cada año? Por favor, use las abreviaturas de los estados.","external_knowledge":null}
{"instance_id":"sf_bq071","db":"NOAA_DATA_PLUS","question":"¿Puede proporcionar la cantidad de huracanes y una lista de nombres de huracanes (ordenados alfabéticamente y separados por comas) para cada ciudad y su código postal asociado, donde los huracanes se encuentren dentro de los límites de los códigos postales? Por favor, excluya cualquier huracán sin nombre y ordene los resultados por la cantidad de huracanes en orden descendente. La salida debe incluir las siguientes columnas: ciudad, código postal, estado, cantidad de huracanes y la lista de huracanes.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq236","db":"NOAA_DATA_PLUS","question":"¿Cuáles son los 5 códigos postales principales de las áreas en los Estados Unidos que han experimentado la mayor cantidad de eventos de granizo en los últimos 10 años? No utilice datos de la tabla de informes de granizo.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq356","db":"noaa_data","question":"Entre todas las estaciones meteorológicas NOAA GSOD que registraron datos diarios de temperatura válidos (temp, max, min) en 2019 y cuyos periodos de registro comenzaron el 1 de enero de 2000 o antes, y continuaron al menos hasta el 30 de junio de 2019, ¿cuántas de estas estaciones lograron 90% o más del número máximo posible de días con registro de temperatura válidos en 2019?","external_knowledge":null}
{"instance_id":"bq042","db":"noaa_data","question":"¿Puedes ayudarme a obtener la temperatura media, la velocidad media del viento y la precipitación para el Aeropuerto LaGuardia en Nueva York el 12 de junio para cada año desde 2011 hasta 2020, específicamente usando el ID de estación 725030?","external_knowledge":null}
{"instance_id":"bq394","db":"noaa_data","question":"¿Cuáles son los 3 meses entre 2010 y 2014 con la menor suma de diferencias absolutas entre la temperatura media del aire, la temperatura del bulbo húmedo, la temperatura del punto de rocío y la temperatura de la superficie del mar, incluyendo los años correspondientes y la suma de las diferencias? Por favor, presenta el año y el mes en formato numérico.","external_knowledge":null}
{"instance_id":"bq357","db":"noaa_data","question":"¿Cuáles son las coordenadas de latitud y longitud y las fechas entre 2005 y 2015 con las 5 velocidades medias diarias más altas del viento, excluyendo los registros con valores de velocidad del viento faltantes? Usando datos de tablas que comienzan con el prefijo \"icoads_core\".","external_knowledge":null}
{"instance_id":"bq181","db":"noaa_data","question":"¿Qué porcentaje de estaciones meteorológicas registraron datos de temperatura válidos (sin valores faltantes o inválidos) para al menos el 90% de los días de 2022, donde la temperatura, el valor máximo y el valor mínimo no sean NULL ni iguales a 9999.9, y la estación tiene un identificador válido (código USAF distinto de '999999'), de todas las estaciones disponibles en la base de datos NOAA GSOD?","external_knowledge":null}
{"instance_id":"bq045","db":"noaa_data","question":"¿Qué estaciones meteorológicas en el estado de Washington registraron más de 150 días lluviosos en 2023 pero con menos días lluviosos que en 2022? Definiendo un “día lluvioso” como aquel que tiene precipitación mayor que 0 milímetros y que no es igual a 99.99. Solo incluir estaciones con datos de precipitación válidos.","external_knowledge":null}
{"instance_id":"sf_bq358","db":"NEW_YORK_CITIBIKE_1","question":"¿Puede decirme qué viaje en bicicleta en la Ciudad de Nueva York, el 15 de julio de 2015, comenzó y terminó en zonas de código postal con la temperatura promedio más alta de ese día, según lo registrado por la estación meteorológica de Central Park (WBAN '94728')? Si hay más de un viaje que cumpla con estos criterios, me gustaría conocer aquel que comienza en el código postal más pequeño y termina en el más grande. Por favor, devuelva los códigos postales de inicio y final de este viaje.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq290","db":"noaa_data","question":"¿Puede calcular la diferencia entre la temperatura máxima, la temperatura mínima y la temperatura promedio entre las estaciones meteorológicas de EE. UU. y del Reino Unido para cada día de octubre de 2023, usando el campo de fecha, y excluyendo los registros con valores de temperatura ausentes o inválidos?","external_knowledge":null}
{"instance_id":"bq031","db":"noaa_data","question":"Proporcione los datos meteorológicos diarios de Rochester desde el 1 de enero hasta el 31 de marzo de 2019, incluyendo temperatura (en Celsius), precipitación (en centimeters) y velocidad del viento (en meters per second). Para cada variable, calcule la media móvil de 8 días (incluyendo el día actual y los 7 días anteriores). También, calcule la diferencia entre la media móvil de cada día y las medias móviles para los días anteriores de 1 a 8 días (es decir, lag1 a lag8). El resultado debe incluir: Los valores diarios de temperatura, precipitación y velocidad del viento. Las medias móviles de 8 días para cada variable. Las diferencias entre las medias móviles para cada uno de los días anteriores de 1 a 8 días (p. ej., la diferencia entre la media móvil de hoy y la media móvil de hace 1 día, de hace 2 días, y así sucesivamente). Redondear todos los valores a un decimal. Los datos deben estar ordenados por fecha, empezando desde el 9 de enero de 2019.","external_knowledge":null}
{"instance_id":"bq392","db":"noaa_gsod","question":"¿Cuáles son las 3 fechas en octubre de 2009 con la temperatura media más alta para la estación número 723758, en el formato YYYY-MM-DD?","external_knowledge":null}
{"instance_id":"sf_bq050","db":"NEW_YORK_CITIBIKE_1","question":"Quiero analizar viajes en bicicleta en la Ciudad de Nueva York en 2014 vinculando los datos de viaje con información meteorológica para entender cómo las condiciones climáticas (temperatura, velocidad del viento y precipitación) afectan los viajes en bicicleta entre barrios. Para cada combinación de barrios de inicio y de destino, necesito lo siguiente: 1. El número total de viajes en bicicleta entre los barrios. 2. La duración promedio de los viajes en minutos (redondeada a 1 decimal). 3. La temperatura promedio al inicio del viaje (redondeada a 1 decimal). 4. La velocidad del viento promedio al inicio (en metros por segundo, redondeada a 1 decimal). 5. La precipitación promedio al inicio (en centímetros, redondeada a 1 decimal). 6. El mes con más viajes (p. ej., `4` para abril). Los datos deben agruparse por los barrios de inicio y de destino, con:`zip_codes` en `geo_us_boundaries` utilizados para mapear las ubicaciones de los viajes en función de la latitud y longitud. `zip_codes` en `cyclistic` utilizados para obtener los nombres de los barrios y vecindarios. Utilizando datos meteorológicos de la estación Central Park para las fechas de los viajes, cubriendo todos los viajes de 2014.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq426","db":"NEW_YORK_CITIBIKE_1","question":"¿Qué tipo de usuario registró la temperatura promedio más alta para viajes que comienzan y terminan en el código postal 10019 de la ciudad de Nueva York durante 2018? Incluya la precipitación promedio, la velocidad del viento y la temperatura para ese tipo de usuario, basados en los datos meteorológicos de la estación Central Park de Nueva York.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq291","db":"NOAA_GLOBAL_FORECAST_SYSTEM","question":"¿Puedes proporcionar un resumen diario del tiempo para julio de 2019 dentro de un radio de 5 km de latitud 26.75 y longitud 51.5? Necesito las temperaturas máximas, mínimas y medias; la precipitación total; la cobertura de nubes promedio entre las 10:00 y las 17:00; la nieve total (cuando la temperatura media esté por debajo de 32°F); y la lluvia total (cuando la temperatura media sea de 32°F o superior) para cada fecha de pronóstico. Los datos deben corresponder a pronósticos creados en julio de 2019 para el día siguiente.","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq208","db":"new_york_noaa","question":"¿Puede proporcionar estaciones meteorológicas dentro de un radio de 20 millas de Chappaqua, Nueva York (Latitud: 41.197, Longitud: -73.764), y decirme el número de observaciones de temperatura válidas que han registrado desde 2011 hasta 2020, excluyendo cualquier dato de temperatura inválido o faltante?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq047","db":"new_york_noaa","question":"¿Podrías analizar la relación entre cada tipo de queja y la temperatura diaria en la Ciudad de Nueva York, específicamente utilizando los datos de temperatura de los aeropuertos LaGuardia (STN=725030) y JFK (STN=744860) para los 10 años que comienzan en 2008, y luego determinar, para cada tipo de queja que tenga más de 5000 ocurrencias totales y muestre una correlación fuerte (valor absoluto > 0.5) con la temperatura, el número total de quejas, el número total de días con registros de temperatura válidos, y los coeficientes de correlación de Pearson (redondeados a cuatro decimales) entre la temperatura y tanto el recuento diario de quejas como el porcentaje diario del total de quejas, excluyendo cualquier día con datos de temperatura faltantes o inválidos (como 9999.9)?","external_knowledge":null}
{"instance_id":"bq048","db":"new_york_noaa","question":"¿Qué tipos de quejas con más de 3000 solicitudes totales desde 2011 hasta 2020 muestran las correlaciones de Pearson más fuertes, tanto positivas como negativas, con la velocidad media diaria del viento medida en la estación 744860 (JFK Airport), basadas en las proporciones diarias de quejas (la proporción de quejas por tipo respecto al total de quejas diarias)? Proporcione los tipos de quejas y sus coeficientes de correlación, redondeados a cuatro cifras decimales.","external_knowledge":null}
{"instance_id":"bq293","db":"new_york_geo","question":"Quiero analizar los datos de viajes de taxis amarillos de la Ciudad de Nueva York específicamente para el 1 de enero de 2015, utilizando el dataset bigquery-public-data.new_york.tlc_yellow_trips_2015. Necesito unir esto con la tabla geo_us_boundaries.zip_codes para mapear cada viaje a su respectivo código postal de NYC basado en las coordenadas de recogida. El análisis debe crear un desglose completo hora por hora para todos los códigos postales mediante un cruce entre distintos zip_codes y horas distintas, incluyendo las horas con cero viajes. Para cada combinación de código postal y hora, calcule el número total de viajes y las siguientes métricas basadas en el tiempo: conteo de viajes desde 1 hora atrás, 1 día (24 horas) atrás, 7 días (168 horas) atrás y 14 días (336 horas) atrás. Además, calcule las medias móviles de 14 días y 21 días y desviaciones estándar de los recuentos de viajes, excluyendo la hora actual. Solo incluya viajes con coordenadas de latitud y longitud válidas. Los resultados finales deben ordenarse por el mayor recuento de viajes, mostrando solo los 5 primeros grupos con la mayor cantidad de viajes.","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq017","db":"GEO_OPENSTREETMAP","question":"¿Cuáles son los cinco tipos de carreteras más largas dentro del límite de multipolígono de Dinamarca (según lo definido por el ID de Wikidata 'Q35') por longitud total, analizado a través de las características de Planet?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq131","db":"GEO_OPENSTREETMAP","question":"¿Cuál es el número de paradas de autobús para la red de autobuses con más paradas dentro del límite de multipolígono de Dinamarca (según el identificador de Wikidata 'Q35'), analizado mediante características de Planet?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq349","db":"GEO_OPENSTREETMAP","question":"¿Qué ID de OpenStreetMap de la planet features table corresponde a una frontera administrativa, representada como multipolígonos, cuya cantidad total de 'amenity'-tagged Puntos de Interés (POIs), tal como se deriva de la planet nodes table, está más cercana a la mediana entre todas esas fronteras?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq007","db":"CENSUS_BUREAU_ACS_2","question":"Identifica los 10 estados de Estados Unidos con la mayor población vulnerable, calculados en función de una suma ponderada de sectores de empleo utilizando los datos ACS 5-Year 2017, y determina su cambio promedio en el ingreso mediano desde 2015 hasta 2018 utilizando datos de código postal.","external_knowledge":"total_vulnerable_weights.md"}
{"instance_id":"sf_bq429","db":"CENSUS_BUREAU_ACS_2","question":"Cuáles son los cinco estados con la mayor diferencia promedio en el ingreso mediano entre 2015 y 2018 a nivel de código postal, y cuál es el número promedio correspondiente de empleados vulnerables en las industrias de comercio mayorista, recursos naturales y construcción, artes y entretenimiento, información y comercio minorista en 2017 según las Estimaciones de Cinco Años de la ACS y los datos de límites de códigos postales?","external_knowledge":"avg_vulnerable_weights.md"}
{"instance_id":"sf_bq073","db":"CENSUS_BUREAU_ACS_2","question":"Usando datos sobre las diferencias de ingresos medianos a nivel ZIP entre 2015 y 2018, junto con las cifras de empleo de la ACS de 2017, enumera cada estado en orden descendente por el total de trabajadores vulnerables, donde “vulnerable” se define como el 38% de los empleados del comercio mayorista y el 41% de los empleados de manufactura en 2017. Los resultados deben incluir el nombre del estado, el número de trabajadores vulnerables del comercio mayorista, el número de trabajadores vulnerables de manufactura y el total combinado de estos trabajadores vulnerables.","external_knowledge":null}
{"instance_id":"sf_bq410","db":"CENSUS_BUREAU_ACS_2","question":"Encuentra los 3 estados con la menor población ajustada fuera de la fuerza laboral utilizando datos a nivel de tracto censal de la ACS de 2017. Calcula la población ajustada fuera de la fuerza laboral como (unemployed_pop + not_in_labor_force - group_quarters), limitando cualquier valor negativo a cero. Para cada uno de estos estados, muestra la abreviatura del estado, el cambio total del ingreso mediano entre 2015 y 2018 a través de todos los tractos censales, la población ajustada fuera de la fuerza laboral total y la proporción promedio ajustada por población (calculada como la razón de la población ajustada fuera de la fuerza laboral respecto a la población total a nivel de tracto). Une los datos de tractos con los estados usando prefijos del código FIPS, excluye cualquier tracto con diferencias de ingresos nulas y ordena los resultados por la población ajustada fuera de la fuerza laboral en orden ascendente.","external_knowledge":null}
{"instance_id":"sf_bq348","db":"GEO_OPENSTREETMAP","question":"Dentro del área rectangular definida por los geogpoints (31.1798246, 18.4519921), (54.3798246, 18.4519921), (54.3798246, 33.6519921) y (31.1798246, 33.6519921), ¿cuáles son los tres nombres de usuario principales responsables del mayor número de nodos históricos, originalmente etiquetados con las amenidades ‘hospital’, ‘clinic’ o ‘doctors’, que ya no aparecen en el conjunto de datos planet_nodes actual?","external_knowledge":"functions_st_intersects_polygon_line.md"}
{"instance_id":"sf_bq253","db":"GEO_OPENSTREETMAP","question":"Encuentre el nombre de la relación de OpenStreetMap que abarque la mayor cantidad de características dentro de la misma área geográfica que el multipolígono etiquetado con el ítem Wikidata 'Q1095'. La relación debe tener un nombre especificado y no tener la etiqueta 'wikidata', y al menos una de las características incluidas debe tener una etiqueta 'wikidata'. El análisis debe realizarse usando la tabla planet_features. Devuelva el nombre de esta relación.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq254","db":"GEO_OPENSTREETMAP","question":"Entre todos los multipolígonos ubicados dentro de la misma área geográfica que el multipolígono asociado con el ítem de Wikidata Q191, pero que no poseen la etiqueta 'wikidata', ¿cuáles dos ocupan los primeros lugares por el número de puntos que se encuentran dentro de sus límites, y cuáles son sus nombres?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq056","db":"GEO_OPENSTREETMAP_BOUNDARIES","question":"¿Cuántos pares diferentes de carreteras clasificadas como motorway, trunk, primary, secondary o residential en California se superponen entre sí sin compartir nodos y no tienen la etiqueta bridge, donde estas carreteras están etiquetadas con 'highway', analizadas a través de planet ways?","external_knowledge":"functions_st_intersects.md"}
{"instance_id":"sf_bq289","db":"GEO_OPENSTREETMAP_CENSUS_PLACES","question":"¿Puedes encontrar la distancia más corta entre dos amenidades cualesquiera (ya sea una biblioteca, un lugar de culto o un centro comunitario) ubicadas dentro de Filadelfia, analizada a través de pennsylvania table y planet features points?","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq250","db":"GEO_OPENSTREETMAP_WORLDPOP","question":"A partir de los datos de la cuadrícula de población de 1km más recientes en Singapur antes de enero de 2023, utilizando ST_CONVEXHULL para agrupar todos los centróides de la cuadrícula de población en una región delimitante y ST_INTERSECTS para identificar hospitales desde la capa Planet de OpenStreetMap (layer_code in (2110, 2120)) que se encuentren dentro de esta región, luego calculando la distancia desde cada celda de la cuadrícula hasta su hospital más cercano, ¿cuál es la población total de la celda de cuadrícula que está más alejada de cualquier hospital?","external_knowledge":"OpenStreetMap_data_in_layered_GIS_format.md"}
{"instance_id":"sf_bq083","db":"CRYPTO","question":"¿Puedes calcular el cambio diario en el valor de mercado de los tokens USDC (dirección `0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48`) para 2023, basado en transacciones de Ethereum? El cambio debe calcularse a partir de las operaciones de acuñación (patrón de entrada `0x40c10f19%`) y de quema (patrón de entrada `0x42966c68%`). Para cada transacción, la acuñación debe ser positiva y la quema negativa. Extrae la cantidad relevante del campo 'input' como hexadecimal, conviértela a millones y exprésala en formato USD. Agrupa los resultados por fecha y ordénalos en orden descendente.","external_knowledge":"Total_Market_Value_Change.md"}
{"instance_id":"sf_bq184","db":"CRYPTO","question":"Usando solo las trazas, ¿puedes calcular los conteos diarios acumulados de contratos inteligentes creados por direcciones externas (donde trace_address es NULL) frente a los creados por otros contratos (donde trace_address es NOT NULL) para cada fecha desde 2017-01-01 hasta 2021-12-31, asegurando que todas las fechas en este rango estén incluidas aunque no se haya creado ningún contrato nuevo en algunos días, y mostrando totales acumulados que crecen de forma monótona para ambas categorías?","external_knowledge":null}
{"instance_id":"sf_bq195","db":"CRYPTO","question":"¿Cuáles son las 10 direcciones de Ethereum con mayor saldo, considerando tanto transacciones de valor como tarifas de gas, antes del September 1, 2021? Solo conserva transacciones exitosas sin tipo de llamada o donde el tipo de llamada sea 'call'.","external_knowledge":null}
{"instance_id":"sf_bq256","db":"CRYPTO","question":"Determina el saldo final de Ether de la dirección de Ethereum que inició el mayor número de transacciones exitosas antes del 1 de septiembre de 2021 (UTC), excluyendo llamadas del tipo delegatecall, callcode o staticcall y incluyendo todas las transferencias entrantes y salientes relevantes, recompensas de los mineros y deducciones por tarifas de gas, con el saldo final presentado en Ether tras convertirlo desde la unidad nativa.","external_knowledge":null}
{"instance_id":"sf_bq080","db":"CRYPTO","question":"Usando solo la tabla de trazas de Ethereum, ¿puede proporcionar un recuento diario acumulativo de contratos inteligentes creados por usuarios externos (where trace_address is null) frente a contratos creados por otros contratos (where trace_address is not null) entre August 30, 2018, y September 30, 2018? Asegúrese de que los resultados incluyan cada fecha en este rango, incluso si no se crearon nuevos contratos, y que muestren totales acumulativos estrictamente crecientes.","external_knowledge":null}
{"instance_id":"sf_bq342","db":"CRYPTO","question":"¿Cuál es la diferencia entre los cambios promedio por hora en los valores de las transacciones para el token Ethereum 0x68e54af74b22acaccffa04ccaad13be16ed14eac, considerando específicamente solo las transacciones en las que la dirección 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d fue el remitente o la dirección 0xfbd6c6b112214d949dcdfb1217153bc0a742862f fue el receptor, entre el 1 de enero de 2019 y el 31 de diciembre de 2020, al comparar 2019 con 2020?","external_knowledge":null}
{"instance_id":"sf_bq341","db":"CRYPTO","question":"¿Qué dirección de Ethereum tiene los 3 saldos positivos más pequeños de las transacciones que involucren al token en la dirección \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\"?","external_knowledge":null}
{"instance_id":"sf_bq444","db":"CRYPTO","question":"¿Puedes obtener la marca de tiempo de la blockchain, el número de bloque y el hash de la transacción para los primeros cinco eventos de acuñación y quema desde los registros de Ethereum para la dirección '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8'? Por favor, incluye eventos de acuñación identificados por el tema '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' y eventos de quema por '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c', y ordénalos por la marca de tiempo del bloque desde la más antigua hasta la más reciente.","external_knowledge":"ethereum_logs_and_events_overview.md"}
{"instance_id":"sf_bq340","db":"CRYPTO","question":"¿Cuáles son las seis direcciones de Ethereum, excluyendo '0x0000000000000000000000000000000000000000', que tienen las mayores diferencias absolutas entre sus saldos previos y actuales de los tokens en las direcciones '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' y '0x1e15c05cbad367f044cbfbafda3d9a1510db5513'?","external_knowledge":null}
{"instance_id":"sf_bq005","db":"CRYPTO","question":"Calcula el intervalo diario promedio de bloques de Bitcoin (en segundos) para 2023 uniendo bloques consecutivos mediante autouniones numeradas por fila (incluyendo intervalos entre días), excluyendo el bloque Génesis, y lista las primeras 10 fechas con sus promedios no ajustados.","external_knowledge":null}
{"instance_id":"sf_bq334","db":"CRYPTO","question":"Calcular las diferencias anuales en los promedios del valor de salida de Bitcoin entre dos métodos: Registros de entrada/salida fusionados: combinar las tablas de entradas y salidas, filtrar solo los registros de salida y calcular promedios anuales. Tabla transactions: usar directamente el campo output_value de la tabla transactions para promedios anuales. Mostrar la diferencia (promedio de salidas fusionadas menos promedio de transactions) solo para los años con datos en ambos métodos.","external_knowledge":null}
{"instance_id":"sf_bq335","db":"CRYPTO","question":"Entre todas las direcciones de Bitcoin que tienen al menos una transacción en octubre de 2017 (combinando tanto las entradas como las salidas), ¿qué dirección realizó su última transacción en la fecha más tardía de ese mes y, entre las direcciones que comparten esa misma fecha más tardía, cuál de ellas tiene la mayor suma de valores de las transacciones?","external_knowledge":null}
{"instance_id":"sf_bq057","db":"CRYPTO","question":"¿Qué mes (p. ej., 3 para marzo) de 2021 registró el porcentaje más alto del volumen de transacciones de Bitcoin que ocurrió en transacciones CoinJoin (definidas como transacciones con >2 salidas, valor de salida ≤ valor de entrada, y que tengan múltiples salidas de igual valor)? Además, proporcione el porcentaje de todas las transacciones de Bitcoin que fueron CoinJoins, el porcentaje de UTXOs involucrados en transacciones CoinJoin (promedio de los porcentajes de entrada y salida), y el porcentaje del volumen total de Bitcoin que ocurrió en transacciones CoinJoin para ese mes. Redondee todos los porcentajes a 1 decimal.","external_knowledge":null}
{"instance_id":"sf_bq068","db":"CRYPTO","question":"Utilizando principios de contabilidad de doble entrada al tratar las entradas de transacciones como débitos (valores negativos) y las salidas como créditos (valores positivos) para todas las transacciones de Bitcoin Cash entre 2014-03-01 y 2014-04-01, ¿cómo podemos calcular los saldos finales máximos y mínimos agrupados por tipo de direcciones a partir de estas transacciones?","external_knowledge":null}
{"instance_id":"sf_bq092","db":"CRYPTO","question":"En abril de 2023, ¿cuáles son los saldos más altos y más bajos en todas las direcciones Dash al calcular el saldo neto para cada dirección utilizando la contabilidad de doble entrada (donde las entradas se tratan como débitos/valores negativos y las salidas como créditos/valores positivos)? Considere todas las transacciones filtradas por block_timestamp_month='2023-04-01', y cuando una dirección aparezca como un arreglo en los datos, concatene los elementos del arreglo en una cadena separada por comas. Para cada dirección y combinación de tipo, sume todos los valores para determinar el saldo.","external_knowledge":null}
{"instance_id":"sf_bq093","db":"CRYPTO","question":"¿Cuáles fueron los cambios netos máximos y mínimos en el saldo de las direcciones de Ethereum Classic el 14 de octubre de 2016? Calcule estos valores sumando todas las transacciones en las que las direcciones recibieron fondos (débito), enviaron fondos (crédito) y pagaron o recibieron comisiones de gas. Solo incluya transacciones con estado exitoso y excluya las llamadas internas de tipos. Para las comisiones de gas, tenga en cuenta tanto las comisiones pagadas por los remitentes de las transacciones como las recibidas por los mineros, calculadas multiplicando por el precio del gas tanto para mineros como para remitentes.","external_knowledge":null}
{"instance_id":"sf_bq292","db":"CRYPTO","question":"Analizar transacciones de Bitcoin desde julio de 2023 para determinar los porcentajes mensuales de: (1) Transacciones clasificadas como CoinJoins (definidas por >2 salidas, valor de salida ≤ valor de entrada y múltiples salidas de igual valor), (2) UTXOs involucrados en CoinJoins (calculado como el promedio de las proporciones de entrada/salida de CoinJoin respecto al total de UTXOs de la red), (3) Volumen de transacciones (basado en valor de entrada) atribuido a CoinJoins. Proporcione los resultados en una tabla con métricas mensuales para transacciones, UTXOs y volumen.","external_knowledge":null}
{"instance_id":"sf_bq135","db":"CRYPTO","question":"¿Qué fecha anterior a 2022 tuvo el monto total de transacciones más alto en los datos de la cadena de bloques de Zilliqa?","external_knowledge":null}
{"instance_id":"sf_bq136","db":"CRYPTO","question":"Encuentre todas las rutas de transacciones exactamente de 2 saltos en la cadena de bloques de Zilliqa entre la dirección fuente 'zil1jrpjd8pjuv50cfkfr7eu6yrm3rn5u8rulqhqpz' y la dirección de destino 'zil19nmxkh020jnequql9kvqkf3pkwm0j0spqtd26e', considerando tanto transacciones regulares como transiciones de contrato. Una ruta de 2 saltos significa que debe haber una dirección intermedia entre la fuente y el destino. Excluya rutas en las que alguna dirección intermedia tenga más de 50 transacciones salientes para filtrar intercambios y billeteras de alta actividad. Asegúrese de que las transacciones en cada ruta sigan un orden cronológico (las transacciones más antiguas primero). Muestre los resultados en el formato: '<fuente> --(tx ABCDE..)--> <intermedio> --(tx FGHIJ..)--> <destino>' donde los IDs de transacción se truncarán a los primeros 5 caracteres. Incluya solo transacciones confirmadas en la cadena en ambas etapas de la ruta.","external_knowledge":null}
{"instance_id":"sf_bq065","db":"CRYPTO","question":"Desde la tabla de solicitudes de Oracle, obtenga las 10 solicitudes más recientes con el ID de script 3. Para cada solicitud, extraiga todos los pares símbolo-tasa igualando cada símbolo en el arreglo \"symbols\" con su tasa correspondiente en la misma posición en el arreglo \"rates\" del resultado decodificado. Ajuste cada tasa dividiéndola por el valor multiplicador de la solicitud. Devuelva la marca de tiempo del bloque, el ID de la solicitud de Oracle, el símbolo y la tasa ajustada para cada par símbolo-tasa. Ordene los resultados en orden cronológico, con los registros más nuevos primero.","external_knowledge":null}
{"instance_id":"sf_bq037","db":"HUMAN_GENOME_VARIANTS","question":"Sobre las variantes genéticas humanas refinadas recogidas en la fase 3 el 2015-02-20, quiero saber las posiciones de inicio mínimas y máximas, así como las proporciones de estas dos, respectivamente, para las bases de referencia 'AT' y 'TA'.","external_knowledge":null}
{"instance_id":"sf_bq012","db":"ETHEREUM_BLOCKCHAIN","question":"Calcule el saldo promedio (en cuadrillones, 10^15) de las 10 principales direcciones de Ethereum por saldo neto, incluyendo transferencias entrantes y salientes a partir de trazas (solo transacciones exitosas y excluyendo tipos de llamada como delegatecall, callcode y staticcall), recompensas de minero (suma de tarifas de gas por bloque) y deducciones de tarifas de gas del emisor. Excluir direcciones nulas y redondear el resultado a dos decimales.","external_knowledge":null}
{"instance_id":"sf_bq187","db":"ETHEREUM_BLOCKCHAIN","question":"Calcular la oferta total en circulación de los tokens 'BNB' (en unidades divididas por 10^18) sumando los saldos de todas las direcciones distintas de cero, donde el saldo de cada dirección es el total de BNB recibido menos BNB enviado. Excluir las transacciones que involucren la dirección cero (0x000...) tanto para remitentes como para destinatarios.","external_knowledge":null}
{"instance_id":"sf_bq450","db":"ETHEREUM_BLOCKCHAIN","question":"Genere un informe exhaustivo de todas las direcciones de Ethereum activas antes del 1 de enero de 2017, calculando sus saldos netos (ajustados por las tarifas de transacción y excluyendo transacciones de delegatecall/callcode/staticcall), patrones de actividad por hora, días activos, métricas de transacciones entrantes/salientes (conteos, contrapartes únicas, transferencias promedio de ETH), interacciones con tokens ERC20 (entradas/salidas, tokens únicos, contrapartes), recompensas de minería, frecuencia de creación de contratos, conteos de transacciones fallidas y tamaños del código de contrato, con todos los valores de ETH convertidos a unidades estándar (divididos por 10^18) y excluyendo direcciones sin historial de transacciones.","external_knowledge":"ethereum_data_transformation.md"}
{"instance_id":"bq034","db":"ghcn_d","question":"Quiero saber los identificadores y los nombres de las estaciones meteorológicas dentro de una distancia en línea recta de 50 km desde el centro de Chicago (41.8319°N, 87.6847°W).","external_knowledge":null}
{"instance_id":"bq383","db":"ghcn_d","question":"¿Podría proporcionar la precipitación más alta registrada, la temperatura mínima y la temperatura máxima de los últimos 15 días de cada año desde 2013 hasta 2016 en la estación meteorológica USW00094846? Asegúrese de que cada valor represente la medición máxima para ese periodo, con precipitación en milímetros y temperaturas en grados Celsius, usando solo datos validados (valores no nulos y sin banderas de calidad).","external_knowledge":null}
{"instance_id":"bq051","db":"new_york_ghcn","question":"Calcule el número promedio diario de viajes de Citibike en la Ciudad de Nueva York durante 2016, clasificando los días como lluviosos si la precipitación total supera 5 milímetros (obtenido dividiendo el valor de precipitación bruta entre 10), y como no lluviosos en caso contrario. Utilice datos de la estación GHCN más cercana ubicada a menos de 50 km de (40.7128, -74.0060) que tenga mediciones válidas y sin banderas, y, a continuación, compare el promedio de viajes de Citibike en días lluviosos frente a días no lluviosos.","external_knowledge":null}
{"instance_id":"bq038","db":"new_york","question":"Identifique las 10 estaciones de Citibike con la mayor proporción de viajes en grupo, definidos como viajes que comienzan y terminan en la misma estación donde varios usuarios partieron/llegaron dentro de la misma ventana de tiempo de 2 minutos. Calcule la proporción como el número de viajes que forman parte de un grupo dividido por el número total de viajes que terminan en esa estación.","external_knowledge":null}
{"instance_id":"bq053","db":"new_york","question":"Calcule el cambio en el número de árboles vivos de cada color de otoño en la Ciudad de Nueva York desde 1995 hasta 2015, calculando, para cada especie de árbol, la diferencia entre el número de árboles no marcados como muertos en 1995 y el número de árboles vivos en 2015, emparejando las especies por la forma en mayúsculas de sus nombres científicos desde la tabla tree_species. Luego, agrupe las especies por su color de otoño y sume estas diferencias para determinar el cambio total en el número de árboles para cada color de otoño.","external_knowledge":null}
{"instance_id":"bq054","db":"new_york","question":"Por favor proporcione las 10 principales especies de árboles en Nueva York, utilizando sus nombres latinos en mayúsculas cuando el nombre latino no esté vacío e incluyendo sus nombres comunes, mostrando el número total de árboles, los recuentos de árboles vivos y muertos para cada año, y el crecimiento correspondiente en estos recuentos desde 1995 hasta 2015, luego ordénelo por la diferencia en el recuento total de árboles entre estos años.","external_knowledge":null}
{"instance_id":"bq021","db":"new_york","question":"Para las 20 mejores rutas de Citi Bike en 2016, ¿qué ruta es más rápida que los taxis amarillos y, entre ellas, cuál tiene la mayor duración media de los viajes en bicicleta? Por favor, proporciona el nombre de la estación de inicio de esta ruta. Las coordenadas están redondeadas a tres decimales.","external_knowledge":null}
{"instance_id":"bq202","db":"new_york_plus","question":"Para la estación que tuvo el mayor número de viajes de Citibike que comenzaron allí en 2018, ¿qué día numérico de la semana y qué hora del día tuvieron la mayor cantidad de viajes basándose en la hora de inicio de esos viajes?","external_knowledge":null}
{"instance_id":"bq185","db":"new_york_plus","question":"¿Cuál es la duración promedio del viaje en minutos para todos los viajes válidos de taxi amarillo que tuvieron lugar entre el 1 de febrero de 2016 y el 7 de febrero de 2016 (ambas fechas incluidas), con una duración de viaje positiva, más de tres pasajeros y una distancia de viaje de al menos diez millas, donde tanto la recogida como la entrega se encuentran en Brooklyn?","external_knowledge":null}
{"instance_id":"bq040","db":"new_york_plus","question":"Para los viajes en taxi amarillo de NYC entre el 1 de enero y el 7 de enero de 2016, excluyendo cualquier viaje recogido en ‘EWR’ o ‘Staten Island’, determine la proporción de viajes que caen en cada categoría de propina en cada distrito de recogida. Solo incluya viajes donde la hora de entrega sea posterior a la hora de recogida, la cantidad de pasajeros sea mayor que cero, y trip_distance, tip_amount, tolls_amount, mta_tax, fare_amount y total_amount sean todos no negativos. Clasifique el porcentaje de propina como sigue: 0% (sin propina), hasta 5%, 5% a 10%, 10% a 15%, 15% a 20%, 20% a 25%, y más de 25%.","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq098","db":"new_york_plus","question":"Para viajes en taxi amarillo de NYC en los que tanto la recogida como la entrega ocurran entre January 1 and 7, 2016, inclusive, calcule el porcentaje de viajes sin propina en cada distrito de recogida, asegurándose de que solo se incluyan viajes donde la entrega ocurra después de la recogida, que la cantidad de pasajeros sea mayor que cero, y que la distancia del viaje, el monto de la propina, el monto de los peajes, el impuesto MTA, el monto de la tarifa y el monto total sean no negativos; defina los viajes sin propina como aquellos en los que la tasa de propina sea cero, con la tasa de propina calculada como (tip_amount × 100) dividido por total_amount (y se considere cero cuando total_amount sea cero).","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq039","db":"new_york_plus","question":"Encuentra los 10 viajes en taxi más destacados en Nueva York entre el 1 y el 7 de julio de 2016 (asegurando que tanto la hora de recogida como la de entrega caigan dentro de estas fechas) donde la cantidad de pasajeros sea mayor que cinco, la distancia del viaje sea de al menos diez millas, y no haya importes negativos relacionados con la tarifa (incluyendo propina, peajes, impuesto de la MTA, tarifa y costos totales). Excluye cualquier viaje en el que la hora de entrega no sea estrictamente posterior a la hora de recogida, luego ordena los resultados por el importe total de la tarifa en orden descendente. Finalmente, muestra la zona de recogida de cada viaje, la zona de entrega, la duración del viaje en segundos, la velocidad de conducción en millas por hora, y la tasa de propina como porcentaje del importe total de la tarifa.","external_knowledge":null}
{"instance_id":"bq203","db":"new_york_plus","question":"¿Para cada uno de los cinco condados de la Ciudad de Nueva York, cuántas estaciones de metro hay en total, cuántas tienen al menos una entrada que esté marcada tanto como una entrada real como compatible con ADA, y qué porcentaje del total de estaciones en cada condado representa esto, enumerando los condados de mayor a menor porcentaje?","external_knowledge":null}
{"instance_id":"bq035","db":"san_francisco","question":"¿Cuál es la distancia total recorrida por cada bicicleta en el programa de Bikeshare de San Francisco, medida en meters? Utilice datos de viajes y estaciones de bikeshare para calcularlo.","external_knowledge":null}
{"instance_id":"bq186","db":"san_francisco","question":"Por favor, encuentre, para cada combinación año-mes (en el formato YYYYMM) derivada de la fecha de inicio de los viajes de bicicletas compartidas en San Francisco, la primera duración del viaje en minutos, la última duración del viaje en minutos, la mayor duración del viaje en minutos y la menor duración del viaje en minutos, donde ‘primero’ y ‘último’ se determinan por el orden cronológico de la fecha de inicio del viaje, luego agrupe sus resultados por este año-mes y ordénelos por la misma clave año-mes.","external_knowledge":null}
{"instance_id":"bq081","db":"san_francisco_plus","question":"Encuentra los datos de viaje más recientes para cada región entre 2014 y 2017. Quiero conocer el nombre de cada región, el ID de viaje de este viaje, la duración del viaje, la hora de inicio, la estación de inicio y el género del usuario.","external_knowledge":null}
{"instance_id":"sf_bq294","db":"SAN_FRANCISCO_PLUS","question":"¿Podrías proporcionar los detalles de los 5 viajes de bicicletas compartidas más largos que comenzaron entre el 1 de julio de 2017 y el 31 de diciembre de 2017, incluyendo el identificador del viaje, la duración en segundos, la fecha de inicio, el nombre de la estación de inicio, la ruta (derivada desde el nombre de la estación de inicio hasta el nombre de la estación de destino), el número de bicicleta, el tipo de suscriptor, el año de nacimiento del miembro, la edad actual del miembro (calculada usando el año actual), una clasificación de edad basada en si el miembro es menor de 40 años, entre 40 y 60 años, o mayor de 60 años, el género del miembro y el nombre de la región de la estación de inicio? Por favor, excluya cualquier viaje en el que no se especifique el nombre de la estación de inicio, el año de nacimiento del miembro o el género del miembro.","temporal":"Yes","external_knowledge":"trip_info.md"}
{"instance_id":"bq339","db":"san_francisco_plus","question":"¿Qué mes en 2017 tuvo la mayor diferencia absoluta entre los minutos de uso de la bicicleta acumulados para clientes y suscriptores?\t¿Qué mes (en número) en 2017 tuvo la mayor diferencia absoluta entre los minutos de uso de la bicicleta acumulados (en miles) para clientes y suscriptores, basándose en las fechas de finalización de los viajes en los datos de bikeshare de San Francisco?","external_knowledge":null}
{"instance_id":"bq400","db":"san_francisco_plus","question":"Para los viajes en los que 'Clay St & Drumm St' aparezca antes de 'Sacramento St & Davis St' en la secuencia de paradas (solo en una dirección), ¿cuáles son los horarios de salida más tempranos desde 'Clay St & Drumm St' y los horarios de llegada más tardíos en el formato HH:MM:SS? Por favor indique el letrero de la ruta para cada ruta.","external_knowledge":null}
{"instance_id":"bq059","db":"san_francisco_plus","question":"¿Cuál es la velocidad media más alta (redondeada a 1 decimal, en m/s) para viajes en bicicleta en Berkeley con una distancia de viaje mayor a 1000 metros?","external_knowledge":null}
{"instance_id":"bq376","db":"san_francisco_plus","question":"Para cada vecindario en San Francisco, donde haya al menos una estación de bicicletas compartidas y al menos un incidente delictivo ubicados, proporcione el nombre del vecindario junto con el recuento total de estaciones de bicicletas compartidas y el número total de incidentes delictivos en ese vecindario.","external_knowledge":null}
{"instance_id":"sf_bq014","db":"THELOOK_ECOMMERCE","question":"¿Puedes ayudarme a averiguar los ingresos para la categoría de producto que tiene la mayor cantidad de clientes que realizan una compra en su primer pedido no cancelado ni devuelto?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq188","db":"THELOOK_ECOMMERCE","question":"Entre todas las categorías de productos en el conjunto de datos, identifique la categoría con la mayor cantidad total de compras (basada en la tabla order_items), y para esa categoría específica, ¿cuál es el tiempo promedio en minutos que los usuarios pasan en cada visita a la página de un producto? El tiempo promedio debe calcularse como la diferencia entre la marca de tiempo cuando un usuario ve una página de producto y la marca de tiempo del siguiente evento dentro de la misma sesión","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq258","db":"THELOOK_ECOMMERCE","question":"Informe mensual para cada categoría de producto, donde cada fila corresponde a pedidos que tienen un estado de 'Completado' y que fueron entregados antes del año 2022, agrupando por el mes y el año de entrega. Para cada categoría, calcule los ingresos totales (la suma de sale_price), el número total de pedidos completados, y calcule el crecimiento porcentual mes a mes tanto de los ingresos como de los pedidos, comparando los totales de cada mes con los del mes anterior. Luego, para los mismos pedidos, agregue y muestre el costo total (a partir de los costos de los productos), el beneficio total (ingreso menos costo total), y, finalmente, la proporción de beneficio a costo para cada mes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq259","db":"THELOOK_ECOMMERCE","question":"Utilizando datos hasta finales de 2022 y organizados por el mes de la primera compra de cada usuario, ¿puede proporcionar el porcentaje de usuarios que realizaron una compra en cada uno de los primeros, segundos, terceros y cuartos meses desde su compra inicial, donde el \"primer mes\" se refiere al mes de su compra inicial?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq189","db":"THELOOK_ECOMMERCE","question":"Basado únicamente en pedidos completados, calcule la tasa de crecimiento porcentual media mensual en el número de pedidos únicos (contando IDs de pedido distintos) para cada categoría de producto al comparar la cantidad de cada mes con el mes anterior dentro de la misma categoría. Identifique la categoría de producto con el promedio más alto de estas tasas de crecimiento mensual de pedidos. Luego, para esa categoría de producto específica, calcule la tasa de crecimiento mensual promedio de los ingresos calculando el cambio porcentual en los ingresos totales (suma de los precios de venta) de mes a mes y promediando estos valores a lo largo de todo el periodo.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq260","db":"THELOOK_ECOMMERCE","question":"Desde el 1 de enero de 2019 hasta el 30 de abril de 2022, ¿cuántos usuarios tienen la edad mínima y cuántos usuarios tienen la edad máxima para cada género en la plataforma de comercio electrónico, contando por separado a los usuarios con la edad mínima y a los de la edad máxima para cada género?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq261","db":"THELOOK_ECOMMERCE","question":"Para cada mes anterior a January 2024, identifique el producto que haya logrado el mayor beneficio total (calculado como la suma de sale_price menos el costo del producto) en todos los artículos de pedido, luego informe el costo total y el beneficio total para ese producto líder por mes, incluyendo todos los artículos de pedido sin importar su estado, y presente los resultados en orden cronológico por mes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq262","db":"THELOOK_ECOMMERCE","question":"Genera un informe de análisis mensual de ventas de comercio electrónico desde junio de 2019 hasta diciembre de 2019 que incluya, para cada categoría de producto y cada mes, el número total de pedidos, los ingresos totales y el beneficio total, junto con sus tasas de crecimiento mes a mes, utilizando los datos de junio de 2019 como base para calcular el crecimiento a partir de julio de 2019. Asegúrese de que todos los pedidos estén incluidos independientemente de su estado, y presente los resultados ordenados en forma ascendente por mes (formateado como \"2019-07\") y luego por categoría de producto. Omitir junio de 2019 del resultado final pero usarlo para los cálculos de crecimiento.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq190","db":"THELOOK_ECOMMERCE","question":"Determine el número de usuarios que son los más jóvenes y los mayores para cada género (masculino y femenino) por separado, entre quienes se registraron entre el 1 de enero de 2019 y el 30 de abril de 2022. Para cada género, identifique la edad mínima y máxima dentro de este rango de fechas y cuente cuántos usuarios pertenecen a estos respectivos grupos de edad.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq263","db":"THELOOK_ECOMMERCE","question":"Por favor, crea un informe mes a mes para el año 2023 que se enfoque en la categoría 'Sleep & Lounge', mostrando para cada mes las ventas totales, el costo total, el número de órdenes completas, el beneficio total y la relación beneficio-costo, asegurando que la orden esté marcada como 'Complete', la fecha de creación esté entre January 1, 2023, y December 31, 2023, y que los datos de costo estén asociados con el producto correspondiente a través de los ítems de la orden.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq264","db":"THELOOK_ECOMMERCE","question":"Identifique la diferencia en el número de usuarios registrados más antiguos y más jóvenes entre January 1, 2019, y April 30, 2022, a partir de los datos de nuestra plataforma de comercio electrónico.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq197","db":"THELOOK_ECOMMERCE","question":"Para cada mes anterior a julio de 2024, identifique el producto único más vendido (determinado por el mayor volumen de ventas, con los ingresos totales como criterio de desempate) entre todos los pedidos con estado 'Complete' y productos con marcas no nulas. Devuelva un informe que muestre el mes, el nombre del producto, la marca, la categoría, las ventas totales, los ingresos totales redondeados y el estado del pedido para estos líderes del mes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq265","db":"THELOOK_ECOMMERCE","question":"¿Puedes listar las direcciones de correo electrónico de los 10 usuarios principales que se registraron en 2019 y realizaron compras en 2019, clasificándolos por su mayor valor medio de pedido, donde el valor medio de pedido se calcula multiplicando el número de artículos en cada pedido por el precio de venta, sumando este total a través de todos los pedidos de cada usuario y luego dividiendo por el número total de pedidos?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq266","db":"THELOOK_ECOMMERCE","question":"Por favor, proporcione los nombres de los productos que tuvieron ventas en cada mes de 2020 y que tuvieron la menor ganancia, calculada como la diferencia entre su precio minorista y su costo, a partir de los datos de productos. Excluya cualquier mes para el que estos datos no estén disponibles. Por favor, liste los productos en orden cronológico según el mes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq333","db":"THELOOK_ECOMMERCE","question":"¿Qué tres navegadores tienen la duración media de sesión más corta, calculada por la diferencia en segundos entre la marca de tiempo más temprana y la más tardía para la sesión de cada usuario, mientras solo se incluyan navegadores que tengan más de 10 sesiones totales, y cuáles son sus respectivas duraciones medias de sesión?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq361","db":"THELOOK_ECOMMERCE","question":"Para la cohorte de usuarios con una fecha de primera compra en enero de 2020, ¿qué proporción de usuarios regresó en los meses siguientes de 2020?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq271","db":"THELOOK_ECOMMERCE","question":"Por favor genera un informe que, para cada mes de 2021, proporcione el número de pedidos, el número de compradores únicos y las ganancias (calculadas como la suma de los precios minoristas de los productos menos la suma de los costos de los productos), donde los pedidos se realizaron durante 2021 por usuarios que se registraron en 2021 para artículos de inventario creados en 2021, y agrupe los resultados por el país de los usuarios, el departamento de productos y la categoría de productos.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq272","db":"THELOOK_ECOMMERCE","question":"Por favor proporcione los nombres de los tres productos más rentables para cada mes desde enero de 2019 hasta agosto de 2022, excluyendo cualquier producto asociado con pedidos que hayan sido cancelados o devueltos. Para cada producto en cada mes, la ganancia debe calcularse como la suma de los precios de venta de todos los artículos de pedido menos la suma de los costos de esos artículos vendidos en ese mes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq273","db":"THELOOK_ECOMMERCE","question":"¿Puedes enumerar los 5 meses desde agosto de 2022 hasta noviembre de 2023 en los que el beneficio de los pedidos completados procedentes de Facebook mostró el mayor incremento intermensual? Calcula el beneficio como ventas menos costos, agrupa por mes de entrega y incluye solo los pedidos creados entre agosto de 2022 y noviembre de 2023. Compara el beneficio de cada mes con el del mes anterior para encontrar los mayores incrementos.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq020","db":"GENOMICS_CANNABIS","question":"¿Cuál es el nombre de la secuencia de referencia con la densidad de variantes más alta en el conjunto de datos del genoma de cannabis dado?","external_knowledge":null}
{"instance_id":"sf_bq107","db":"GENOMICS_CANNABIS","question":"¿Cuál es la densidad de variantes de la referencia de cannabis con la mayor longitud de referencia? Tenga en cuenta que una variante está presente si hay al menos una llamada de variantes con un genotipo mayor que 0.","external_knowledge":null}
{"instance_id":"bq025","db":"census_bureau_international","question":"Proporciona una lista de los 10 principales países para el año 2020, ordenados por el mayor porcentaje de su población menor de 20 años. Para cada país, incluye la población total menor de 20 años, la población total a mitad de año y el porcentaje de la población que es menor de 20 años.","external_knowledge":null}
{"instance_id":"bq115","db":"census_bureau_international","question":"¿Qué país tiene el porcentaje más alto de la población menor de 25 años en 2017?","external_knowledge":null}
{"instance_id":"bq030","db":"covid19_open_data","question":"As of May 10, 2020, entre todos los países que tenían más de 50,000 casos confirmados de COVID-19, ¿cuáles fueron los tres países con las tasas de recuperación más altas basadas en el cociente entre el número de casos recuperados y su total de casos confirmados, y cuáles fueron sus respectivas tasas de recuperación expresadas como porcentajes?","external_knowledge":null}
{"instance_id":"bq018","db":"covid19_open_data","question":"¿Qué día en marzo y abril tuvo la mayor tasa de crecimiento de casos confirmados de COVID-19 en Estados Unidos? El formato es MM-DD.","external_knowledge":null}
{"instance_id":"bq086","db":"covid19_open_world_bank","question":"Necesitas calcular el porcentaje de la población de cada país que había sido confirmado con COVID-19 para el 30 de junio de 2020. Los datos de población de 2018 se pueden encontrar en el conjunto de datos del Banco Mundial, y los datos de casos confirmados acumulados de COVID-19 están disponibles en el conjunto de datos COVID-19 Open Data. Calcula el porcentaje de la población de cada país que, de forma acumulativa, había sido confirmado con COVID-19.","external_knowledge":null}
{"instance_id":"bq085","db":"covid19_jhu_world_bank","question":"¿Podrías proporcionar, para Estados Unidos, Francia, China, Italia, España, Alemania e Irán, el número total de casos confirmados de COVID-19 a 20 de abril de 2020, junto con el número de casos por cada 100.000 personas, basados en sus poblaciones totales de 2020 calculadas sumando todas las entradas de población relevantes de los datos del Banco Mundial?","external_knowledge":null}
{"instance_id":"bq130","db":"covid19_nyt","question":"Analice los conteos diarios de nuevos casos de COVID-19 desde marzo hasta mayo de 2020, identificando los cinco estados principales por incrementos diarios. Por favor, elabore un ranking basado en la frecuencia con la que aparece cada estado en esos cinco primeros lugares diarios. Luego, examine el estado que ocupa el cuarto lugar en general y identifique sus cinco condados principales, en función de la frecuencia con la que aparecen entre los cinco primeros lugares diarios de nuevos casos.","external_knowledge":null}
{"instance_id":"bq087","db":"covid19_symptom_search","question":"Por favor calcule el cambio porcentual total en la frecuencia de búsqueda semanal promedio del síntoma 'anosmia' entre los cinco condados de la ciudad de Nueva York — Condado de Bronx, Condado de Queens, Condado de Kings, Condado de Nueva York y Condado de Richmond — al comparar los datos combinados desde el 1 de enero de 2019 hasta el 31 de diciembre de 2019 con los datos combinados desde el 1 de enero de 2020 hasta el 31 de diciembre de 2020.","external_knowledge":null}
{"instance_id":"bq088","db":"covid19_symptom_search","question":"Por favor, calcule los niveles promedio de ansiedad y de depresión a partir de los datos semanales por país para Estados Unidos durante los periodos desde el 1 de enero de 2019 hasta el 1 de enero de 2020, y desde el 1 de enero de 2020 hasta el 1 de enero de 2021. Luego, calcule el aumento porcentual de esos niveles promedio de síntomas desde el periodo de 2019 al periodo de 2020.","external_knowledge":null}
{"instance_id":"bq089","db":"covid19_usa","question":"Dadas las estimaciones de población más recientes de la Encuesta Comunitaria Estadounidense de cinco años de 2018, ¿cuál es el número de sitios de vacunación por cada 1000 personas para los condados de California?","external_knowledge":null}
{"instance_id":"bq407","db":"covid19_usa","question":"Encuentre los tres condados con poblaciones superiores a 50,000, utilizando los datos del censo quinquenal de 2020, que tuvieron las tasas de letalidad por COVID-19 más altas al 27 de agosto de 2020. Para estos condados, proporcione el nombre, el estado, la edad mediana, la población total, el número de casos confirmados de COVID-19 por cada 100,000 personas, el número de muertes por cada 100,000 personas y la tasa de letalidad por COVID-19 como porcentaje.","external_knowledge":null}
{"instance_id":"bq137","db":"census_bureau_usa","question":"Por favor localice todas las áreas de código postal ubicadas a un radio de 10 kilómetros de las coordenadas (-122.3321, 47.6062) uniendo los datos de población del censo de 2010 (sumando solo la población masculina y la población femenina sin restricciones de edad) y la información de las áreas de código postal, y devuelva el polígono de cada área, el área de tierra y de agua en metros, la latitud y longitud, el código de estado, el nombre del estado, la ciudad, el condado y la población total.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq060","db":"census_bureau_international","question":"¿Qué 3 países tuvieron la mayor migración neta en 2017 entre aquellos con una superficie mayor a 500 kilómetros cuadrados? ¿Y cuáles son sus tasas de migración?","external_knowledge":null}
{"instance_id":"bq338","db":"census_bureau_acs_1","question":"¿Puedes encontrar los tractos censales en el área 36047 que estén entre los 20 primeros en los mayores aumentos porcentuales de la población entre 2011 y 2018, que también estén entre los 20 primeros en los mayores aumentos absolutos del ingreso mediano durante el mismo periodo, y que hayan tenido más de 1,000 residentes en cada uno de esos años?","external_knowledge":null}
{"instance_id":"bq061","db":"census_bureau_acs_1","question":"¿Qué tracto censal ha experimentado el mayor incremento en el ingreso medio entre 2015 y 2018 en California? Indícame el código del tracto censal.","external_knowledge":null}
{"instance_id":"bq064","db":"census_bureau_acs_1","question":"Utilizando los datos de tractos censales de 2017 del Censo de EE. UU. procedentes de los conjuntos de datos públicos de BigQuery, debe asignar de forma proporcional la población y los ingresos de cada tracto a los códigos postales basándose en el área superpuesta entre sus límites geográficos. Luego, filtre los resultados para incluir solo aquellos códigos postales ubicados dentro de un radio de 5 millas de un punto específico en el Estado de Washington, con coordenadas de latitud 47.685833°N y longitud -122.191667°W. Finalmente, calcule la población total y el ingreso medio por persona para cada código postal (redondeado a un decimal) y ordene los resultados por el ingreso medio por persona en orden descendente.","external_knowledge":"functions_st_intersects_area.md"}
{"instance_id":"bq461","db":"ncaa_basketball","question":"Por favor, proporciona un resumen cronológico de todas las jugadas de puntuación del partido de la temporada 2014 en el que los Wildcats eran el equipo local y los Fighting Irish eran el equipo visitante. Incluye para cada evento de puntuación el reloj del juego, las puntuaciones acumuladas para ambos equipos (Wildcats y Fighting Irish), el equipo que anotó y una descripción del evento.","external_knowledge":null}
{"instance_id":"bq198","db":"ncaa_basketball","question":"Lista las 5 universidades con más temporadas en las que alcanzaron el máximo de victorias en sus respectivas temporadas de baloncesto de la NCAA entre 1900 y 2000, mostrando el número total de esas temporadas de máximo rendimiento para cada equipo, mientras se excluyen las entradas que carecen de nombres de equipo.","external_knowledge":null}
{"instance_id":"bq462","db":"ncaa_basketball","question":"Por favor genera una tabla a partir del conjunto de datos de baloncesto de la NCAA que liste los cinco primeros registros en cada una de estas cuatro categorías: (1) Principales sedes - los recintos más grandes por capacidad de asientos con la Fecha mostrada como 'N/A'; (2) Mayores márgenes de campeonato - Partidos del Campeonato Nacional desde la temporada 2016 (temporada > 2015) con las mayores diferencias de puntos; (3) Partidos con más puntos - juegos desde la temporada 2011 (temporada > 2010) con la mayor cantidad total de puntos anotados por ambos equipos; y (4) Totales de triples - juegos desde la temporada 2011 (temporada > 2010) con la mayor cantidad total de triples anotados por ambos equipos. La tabla final debe organizarse con columnas para Categoría, Fecha, Encuentro o Sede, y Métrica clave, con 5 registros por categoría en orden descendente de su métrica clave.","external_knowledge":null}
{"instance_id":"bq427","db":"ncaa_basketball","question":"¿Podrías determinar, para cada tipo de tiro, las coordenadas promedio en x e y (ajustadas para garantizar la consistencia respecto al aro izquierdo o derecho), el número promedio de intentos de tiro y el número promedio de tiros exitosos, considerando únicamente los tiros tomados antes de March 15, 2018, excluyendo aquellos con tipos de tiro nulos o coordenadas nulas, asegurando que los tiros estén en el lado correcto de la cancha según el aro del equipo?","external_knowledge":"basketball.md"}
{"instance_id":"bq428","db":"ncaa_basketball","question":"Para los cinco principales mercados de equipos con el mayor número de jugadores distintos que anotaron al menos 15 puntos durante el segundo periodo de los partidos entre 2010 y 2018, proporcione detalles de cada juego que disputaron en los encuentros históricos del torneo de baloncesto de la NCAA durante el mismo periodo, tal como se especifica en el documento del modelo de datos.","external_knowledge":"ncaa_data_model.md"}
{"instance_id":"bq144","db":"ncaa_insights","question":"Crea un conjunto de datos combinando los resultados de los juegos del torneo de baloncesto masculino de la NCAA desde la temporada 2014 en adelante, incluyendo tanto los juegos históricos del torneo como los resultados del torneo de 2018, con las métricas correspondientes de ritmo y eficiencia para cada equipo y sus oponentes procedentes de los datos de feature_engineering. El conjunto de datos debe incluir la temporada, etiquetas de resultado de los juegos (victoria o derrota), las semillas del equipo y del oponente, los nombres de las escuelas, las clasificaciones de ritmo y eficiencia, los valores estadísticos y las diferencias entre las métricas del equipo y las del oponente para permitir un análisis exhaustivo de la dinámica entre equipos y oponentes.","external_knowledge":"NCAA_Basketball_Tournament_SQL_Query_Variable_Guide.md"}
{"instance_id":"bq113","db":"bls","question":"¿Qué condado de Utah experimentó el mayor incremento porcentual en el empleo en la construcción desde 2000 hasta 2018, calculado promediando los niveles de empleo durante el tercer mes de cada trimestre en esos años? ¿Cuál es el incremento porcentual correspondiente?","external_knowledge":null}
{"instance_id":"bq112","db":"bls","question":"Entre 1998 y 2017, para el condado de Allegheny en la zona de Pittsburgh, ¿los salarios anuales promedio para todas las industrias siguieron el ritmo de la inflación de todos los artículos de consumo, y cuáles fueron las respectivas tasas de crecimiento porcentual (con dos decimales) para los salarios y el IPC durante ese periodo?","external_knowledge":null}
{"instance_id":"bq055","db":"google_dei","question":"¿Puede proporcionar las tres principales razas con las mayores diferencias porcentuales entre los datos de contratación general de Google en 2021, provenientes de una contratación no interseccional, y los promedios en 2021 de los datos de la BLS para los sectores de tecnología definidos específicamente como 'Internet publishing and broadcasting and web search portals,' 'Software publishers,' 'Data processing, hosting, and related services,' o el grupo de industria 'Computer systems design and related services,' junto con sus respectivas diferencias?","external_knowledge":null}
{"instance_id":"bq075","db":"google_dei","question":"¿Podrías proporcionar un informe combinado de 2021 que compare las distribuciones raciales (asiáticos, negros, hispano/Latinx, blancos) y de género (Mujeres estadounidenses, Hombres estadounidenses) a lo largo de la contratación de la fuerza laboral general de Google, la representación de la fuerza laboral general de Google y los datos de la BLS específicamente para los sectores tecnológicos definidos como publicación y radiodifusión en Internet y portales de búsqueda en la web o diseño de sistemas informáticos y servicios relacionados?","external_knowledge":null}
{"instance_id":"bq406","db":"google_dei","question":"Por favor calcule las tasas de crecimiento para personas asiáticas, personas negras, personas latinx, nativos americanos, personas blancas, mujeres estadounidenses, hombres estadounidenses, mujeres en todo el mundo y hombres en todo el mundo desde 2014 hasta 2024 con respecto a la fuerza laboral en su conjunto.","external_knowledge":null}
{"instance_id":"sf_bq084","db":"GOOG_BLOCKCHAIN","question":"Para cada mes del año 2023, cuántas transacciones totales ocurrieron (contando todos los registros de transacciones sin eliminar duplicados de hashes de transacciones), y cuántas transacciones por segundo se procesaron cada mes, donde el valor de transacciones por segundo se calcula dividiendo el conteo total mensual por el número exacto de segundos en ese mes, incluyendo la lógica correcta de año bisiesto si aplica, basada en el año extraído de la marca de tiempo de la transacción? Muestre el conteo de transacciones mensuales, el valor calculado de transacciones por segundo, el año y el mes, y presente las filas en orden descendente según el conteo de transacciones mensuales.","external_knowledge":null}
{"instance_id":"sf_bq058","db":"GOOG_BLOCKCHAIN","question":"Recupere todos los depósitos finalizados en Optimism en el bloque 29815485 utilizando Optimism Standard Bridge, incluyendo el hash de la transacción, un enlace de Etherscan (la URL completa), direcciones de token L1 y L2, direcciones del remitente y del destinatario (con ceros a la izquierda eliminados) y la cantidad depositada (convertida de hexadecimal a decimal). Asegúrese de que los datos estén debidamente formateados y analizados de acuerdo con los estándares de direcciones y tokens de Optimism, y elimine el prefijo '0x' excepto para el hash de la transacción. Tenga en cuenta que el hash keccak-256 de la firma del evento de Ethereum para DepositFinalized es \"0x3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".","external_knowledge":"optimism_standard_bridge_contract.md"}
{"instance_id":"sf_bq416","db":"GOOG_BLOCKCHAIN","question":"¿Podrías recuperar las tres transferencias de USDT más grandes en la cadena de bloques TRON, enumerando los números de bloque, las direcciones de origen, las direcciones de destino (en formato TronLink) y las cantidades transferidas, usando la dirección de contrato USDT '0xa614f803b6fd780986a42c78ec9c7f77e6ded13c' y la firma del evento de transferencia '0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef', dividiendo el valor de transferencia bruta entre 1,000,000 para convertirlo en la cantidad final de USDT, y luego ordenando los resultados por las cantidades transferidas más grandes primero?","external_knowledge":"blockchain_data_transformations.md"}
{"instance_id":"sf_bq226","db":"GOOG_BLOCKCHAIN","question":"¿Qué dirección de remitente, representada como una URL completa en https://cronoscan.com, ha sido utilizada con mayor frecuencia en la cadena de bloques Cronos en transacciones hacia campos 'to_address' no nulos, dentro de bloques de más de 4096 bytes, desde el 1 de enero de 2023?","external_knowledge":null}
{"instance_id":"sf_bq016","db":"DEPS_DEV_V1","question":"Considerando solo las versiones de lanzamiento más altas de los paquetes NPM, ¿qué dependencia (paquete y su versión) aparece con mayor frecuencia entre las dependencias de estos paquetes?","external_knowledge":null}
{"instance_id":"sf_bq062","db":"DEPS_DEV_V1","question":"¿Cuál es la licencia más frecuentemente utilizada por los paquetes en cada sistema?","external_knowledge":null}
{"instance_id":"sf_bq063","db":"DEPS_DEV_V1","question":"Encuentra la URL de GitHub (con la etiqueta de enlace 'SOURCE_REPO') de la versión lanzada más reciente del paquete NPM que tenga el mayor número de dependencias en su versión lanzada más reciente, excluyendo paquetes cuyos nombres contengan el carácter '@' y considerando únicamente las URL donde la etiqueta de enlace es 'SOURCE_REPO' y la URL contiene 'github.com'.","external_knowledge":null}
{"instance_id":"sf_bq028","db":"DEPS_DEV_V1","question":"Considerando solo las versiones de lanzamiento más recientes de los paquetes NPM, ¿qué paquetes son los 8 más populares basándose en el número de estrellas de Github, así como sus versiones?","external_knowledge":null}
{"instance_id":"bq022","db":"chicago","question":"Calcule la duración mínima y máxima de los viajes en minutos (redondeados al entero más cercano), el número total de viajes y la tarifa promedio para cada uno de los seis grupos de cuantiles iguales basados en la duración de los viajes, considerando solo los viajes entre 0 y 60 minutos.","external_knowledge":null}
{"instance_id":"bq362","db":"chicago","question":"¿Qué tres empresas tuvieron el mayor aumento en el número de viajes entre dos meses consecutivos en 2018?","external_knowledge":null}
{"instance_id":"bq363","db":"chicago","question":"Calcule el número total de viajes y la tarifa media (con dos decimales) para diez grupos de cuantiles de tamaño igual. Cree diez grupos de cuantiles particionando la dimensión de duración del viaje (de 1 a 50 minutos) en conjuntos iguales. Cada grupo debe representar un número similar de valores de minuto distintos. Muestre el rango de tiempo de cada grupo formateado como \"XXm a XXm\" (donde los números se rellenan con ceros a dos dígitos), el recuento total de viajes y la tarifa media. Los rangos de tiempo deben representar los valores de duración mínimo y máximo dentro de cada cuantil. Ordene los resultados cronológicamente por rango de tiempo. Utilice NTILE(10) para crear los cuantiles a partir de las duraciones de viaje ordenadas.","external_knowledge":null}
{"instance_id":"bq076","db":"chicago","question":"¿Cuál es el mayor número de incidentes de robo de vehículos automotores que ocurrieron en un solo mes durante 2016?","external_knowledge":null}
{"instance_id":"bq077","db":"chicago","question":"Para cada año de 2010 a 2016, ¿cuál es el número máximo de robos de vehículos en un mes?","external_knowledge":null}
{"instance_id":"sf_bq350","db":"OPEN_TARGETS_PLATFORM_1","question":"Para los datos moleculares detallados, por favor muestre el identificador del fármaco, el tipo de fármaco y el estado de retirada para fármacos aprobados con una advertencia de recuadro negro y cuyo tipo de fármaco sea conocido entre 'Keytruda', 'Vioxx', 'Premarin' y 'Humira'","external_knowledge":null}
{"instance_id":"sf_bq379","db":"OPEN_TARGETS_PLATFORM_1","question":"¿Qué símbolo aprobado como objetivo tiene la puntuación de asociación global más cercana a la puntuación media para la psoriasis?","external_knowledge":null}
{"instance_id":"sf_bq078","db":"OPEN_TARGETS_PLATFORM_2","question":"Obtenga el símbolo aprobado de los genes objetivo con la puntuación global más alta que estén asociados con la enfermedad 'EFO_0000676' desde la fuente de datos 'IMPC'.","external_knowledge":null}
{"instance_id":"sf_bq095","db":"OPEN_TARGETS_PLATFORM_1","question":"Genera una lista de fármacos de la tabla con detalles moleculares que hayan completado ensayos clínicos para el carcinoma endocrino pancreático, ID de enfermedad EFO_0007416. Por favor, incluya el nombre de cada fármaco, el símbolo de la diana aprobado y los enlaces a los ensayos clínicos relevantes.","external_knowledge":null}
{"instance_id":"bq109","db":"open_targets_genetics_1","question":"Encuentre la media, la varianza, la diferencia entre el máximo y el mínimo, y la fuente de QTL (estudio derecho) del log2 máximo de h4/h3 para datos donde el id del gen derecho es \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, el rasgo informado incluye \"niveles de colesterol\", y la característica biológica derecha es \"IPSC\", y la variante es '1_55029009_C_T'.","external_knowledge":null}
{"instance_id":"sf_bq325","db":"OPEN_TARGETS_GENETICS_2","question":"Por favor identifique los 10 genes con las asociaciones más fuertes en todos los estudios, primero seleccionando, para cada gen dentro de cada estudio, la variante con el valor-p más bajo, y luego clasificando todos esos pares gen-variante para devolver los 10 genes con los valores-p más bajos en conjunto.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq090","db":"CYMBAL_INVESTMENTS","question":"¿Cuánto mayor es el valor intrínseco promedio de las operaciones que utilizan la estrategia feeling-lucky en comparación con las que utilizan la estrategia momentum en operaciones en posición larga?","external_knowledge":null}
{"instance_id":"bq442","db":"CYMBAL_INVESTMENTS","question":"Por favor, recopile la información de los 6 informes de trading con los precios de cierre más altos. Consulte el documento para obtener toda la información que deseo.","external_knowledge":"Trade_Capture_Report_Data_List.md"}
{"instance_id":"bq079","db":"usfs_fia","question":"Considerando solo el último grupo de evaluación por estado para el tipo de evaluación 'EXPCURR', determine qué estado tiene la mayor superficie total de terrenos madereros y cuál tiene la mayor superficie total de tierras forestales. Para terrenos madereros, incluya parcelas donde el código de estado de condición sea 1, el código de estado reservado sea 0 y el código de clase de productividad del sitio esté entre 1 y 6. Para tierras forestales, incluya parcelas donde el código de estado de condición sea 1. Calcule las superficies totales sumando los factores de expansión ajustados para macroplots y subplots, utilizando sus respectivas bases de proporción ('MACR' para macroplots y 'SUBP' para subplots) y los factores de ajuste cuando sean mayores que cero. Para cada categoría (terrenos madereros y tierras forestales), proporcione el código de estado, el grupo de evaluación, el nombre del estado y las superficies totales en acres para el estado con la mayor superficie total, considerando solo el último grupo de evaluación por estado.","external_knowledge":null}
{"instance_id":"bq024","db":"usfs_fia","question":"Para el año 2012, ¿cuáles son los 10 principales grupos de evaluación que tienen las mayores subplot acres cuando se considera únicamente la condición con las mayores subplot acres dentro de cada grupo? Por favor, incluya el grupo de evaluación, tipo de evaluación, código de estado de la condición, descripción de la evaluación, código de estado, macroplot acres y subplot acres.","external_knowledge":null}
{"instance_id":"bq220","db":"usfs_fia","question":"Basado en las tablas condition, plot_tree y population en bigquery-public-data.usfs_fia, para evaluation_type establecido en 'EXPCURR' y condition_status_code igual a 1, ¿qué estados tuvieron el mayor tamaño medio de subplot y el mayor tamaño medio de macroplot, respectivamente, para cada uno de los años 2015, 2016 y 2017? Por favor incluye el tipo de plot (subplot o macroplot), el año específico, el estado y el tamaño medio correspondiente en tus resultados.","external_knowledge":"subplot_macroplot_size.md"}
{"instance_id":"bq096","db":"gbif","question":"Determina cuál año tuvo la fecha más temprana después de enero en la que se registraron más de 10 avistamientos de Sterna paradisaea al norte de los 40 grados de latitud. Para cada año, encuentra el primer día después de enero con más de 10 avistamientos de esta especie en esa región, e identifica el año cuyo primer día de este tipo sea el más temprano de todos los años.","external_knowledge":null}
{"instance_id":"sf_bq276","db":"NOAA_PORTS","question":"¿Puede proporcionar una lista exhaustiva de todos los puertos en la región número 6585 que se encuentren dentro de los límites estatales de EE. UU. y que hayan sido afectados por tormentas nombradas en la cuenca del Atlántico Norte con vientos de al menos 35 nudos y una clasificación de Saffir-Simpson de al menos la fuerza mínima de tormenta tropical, incluyendo para cada puerto su nombre, el nombre del estado, los años distintos en los que ocurrieron tormentas, el recuento total de tormentas distintas, los nombres distintos de las tormentas, la categoría promedio de las tormentas, la velocidad media del viento y las respectivas geometrías tanto del puerto como de las áreas de tormenta tropical?","temporal":"Yes","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq277","db":"noaa_ports","question":"¿Qué puerto único, listado bajo el número de región '6585', se encuentra dentro de la frontera de un estado de EE. UU. y aparece con mayor frecuencia dentro de las áreas geográficas de tormentas tropicales nombradas con velocidades de viento de al menos 35 nudos en la cuenca del Atlántico Norte, excluyendo aquellas etiquetadas como 'NOT_NAMED'?","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq278","db":"sunroof_solar","question":"Por favor, proporcione una comparación detallada del potencial solar para cada estado, distinguiendo entre los niveles de código postal y de tramo censal. Para cada estado, incluya el número total de edificios disponibles para instalaciones solares, el porcentaje promedio del área de Google Maps cubierta por Project Sunroof, el porcentaje promedio de esa cobertura que es adecuada para la energía solar, el recuento total de paneles potenciales, la capacidad total en kilovatios, el potencial de generación de energía, la compensación de dióxido de carbono, el número actual de edificios con paneles solares y la brecha en las instalaciones potenciales calculada ajustando el total de edificios calificados con los porcentajes de cobertura y adecuación y restando las instalaciones actuales.","external_knowledge":null}
{"instance_id":"bq102","db":"gnomAD","question":"Identifique qué posiciones de inicio están asociadas con variantes missense en el gen BRCA1 en el cromosoma 17, donde la base de referencia es 'C' y la base alterna es 'T'. Usando datos de la versión gnomAD v2.1.1.","external_knowledge":null}
{"instance_id":"bq445","db":"gnomAD","question":"Utilizando los datos de los genomas de gnomAD v2.1.1 para el cromosoma 17, determina la posición de inicio más pequeña y la posición de final más grande de cualquier variante cuyas anotaciones VEP anidadas contengan el símbolo 'BRCA1'. Luego, para todas las variantes cuyas posiciones caigan dentro de esa región génica, recupera los valores de 'Protein_position' solo si 'Consequence' incluye 'missense_variant', ordénalos en orden ascendente por 'Protein_position' y, por último, muestra el primer resultado.","external_knowledge":null}
{"instance_id":"bq103","db":"gnomAD","question":"Genere estadísticas resumidas sobre variantes genéticas en la región entre las posiciones 55039447 y 55064852 en el cromosoma 1. Esto incluye el número de variantes, el recuento total de alelos, el número total de alelos y símbolos génicos distintos (usando Variant Effect Predictor, VEP, para la anotación de genes). Además, calcule la densidad de mutaciones dividiendo la longitud de la región por el número de variantes. Utilizando datos de la versión gnomAD v3.","external_knowledge":null}
{"instance_id":"sf_bq104","db":"GOOGLE_TRENDS","question":"Basado en la fecha de actualización más reciente, identifique el término de búsqueda en ascenso mejor clasificado para la semana que sea exactamente un año anterior a la última semana disponible en el conjunto de datos.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq411","db":"GOOGLE_TRENDS","question":"Por favor, obtenga los tres principales términos de búsqueda de Google Trends (rangos 1, 2 y 3) desde top_terms para cada día de la semana (lunes a viernes) entre el 1 de septiembre de 2024 y el 14 de septiembre de 2024, agrupados por la columna refresh_date y ordenados en orden descendente de refresh_date.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq105","db":"nhtsa_traffic_fatalities_plus","question":"Según el informe de accidentes y distracciones del conductor de 2015 y 2016, y excluyendo los casos en que el estado de distracción del conductor se registra como 'No distraído', 'Desconocido si distraído' o 'No reportado', ¿cuántos accidentes de tráfico por cada 100,000 personas fueron causados por la distracción del conductor en cada estado de EE. UU. para esos dos años, basándose en los datos de población del censo de 2010, y cuáles fueron los cinco estados con las tasas más altas de cada año?","external_knowledge":null}
{"instance_id":"bq108","db":"nhtsa_traffic_fatalities","question":"Dentro del conjunto de datos de 2015, para accidentes ocurridos de enero a agosto y que involucraron a más de una persona distinta, ¿qué porcentaje de estos accidentes tuvo más de una persona con una lesión grave (gravedad de la lesión = 4)?","external_knowledge":null}
{"instance_id":"bq067","db":"nhtsa_traffic_fatalities","question":"Quiero crear un conjunto de datos etiquetado a partir de los datos de fatalidades de tráfico de la Administración Nacional de Seguridad del Tránsito en Carretera (NHTSA) que predice si un accidente de tráfico que involucra a más de una persona distinta resulta en más de una fatalidad, donde la etiqueta es 1 si un accidente tiene más de una persona con un código de severidad de lesión de 4 (lesión fatal) y 0 en otro caso. Para cada accidente, incluye los predictores numéricos: state_number, vehicle_body_type, number_of_drunk_drivers, day_of_week, hour_of_crash, y un indicador binario de si el accidente ocurrió en una zona de obras (1 si no es “Ninguno,” de lo contrario 0). Además, diseña una característica para la diferencia absoluta media entre travel_speed y speed_limit por accidente, solo considerando velocidades de viaje hasta 151 mph (excluyendo códigos 997, 998, 999) y límites de velocidad hasta 80 mph (excluyendo códigos 98, 99), y categoriza esta diferencia de velocidad promedio en niveles de 0 a 4 en incrementos de 20 mph con límites inferiores inclusivos y límites superiores exclusivos. Finalmente, solo incluir accidentes que involucren a más de una persona distinta.","external_knowledge":"nhtsa_traffic_fatalities.md"}
{"instance_id":"bq396","db":"nhtsa_traffic_fatalities","question":"¿Qué 3 estados tuvieron las mayores diferencias en el número de accidentes de tráfico entre condiciones lluviosas y despejadas durante los fines de semana en 2016? También proporcione las diferencias respectivas para cada estado.","external_knowledge":null}
{"instance_id":"bq441","db":"nhtsa_traffic_fatalities","question":"Por favor, ayúdame a compilar los detalles críticos sobre los accidentes de tráfico en 2015, tal como aparecen en el documento de información.","external_knowledge":"Traffic_Fatalities_Info_List_2015.md"}
{"instance_id":"bq097","db":"sdoh","question":"¿Cuál es el incremento de los ingresos promedio por empleo entre los años 2012 y 2017 para cada región geográfica en Massachusetts (indicado por \"MA\" al final de GeoName)?","external_knowledge":null}
{"instance_id":"bq120","db":"sdoh","question":"Identifica las 10 regiones (condados) con el mayor número total de hogares que participan en SNAP, utilizando los datos a nivel de condado de la ACS de 5 años de 2017 y los datos de inscripción en SNAP desde el 1 de enero de 2017, excluyendo las regiones donde la participación total en SNAP sea cero. Para cada una de estas regiones, calcula la proporción de hogares que ganan menos de $20,000 respecto al total de hogares que participan en SNAP.","external_knowledge":null}
{"instance_id":"bq110","db":"sdoh","question":"¿Cuál es el cambio en el número de veteranos sin hogar entre 2012 y 2018 para cada región CoC en el estado de Nueva York que tenga datos disponibles en ambos años?","external_knowledge":null}
{"instance_id":"bq395","db":"sdoh","question":"Calcule el cambio porcentual en el número total de personas sin techo desde 2015 hasta 2018 para cada estado, sumando los recuentos de todos los Continuums of Care (CoCs) dentro de cada estado. Luego, determine el promedio nacional de estos cambios porcentuales por estado. Identifique los cinco estados cuyo cambio porcentual esté más cercano a este promedio nacional. Por favor, proporcione las abreviaturas de los estados.","external_knowledge":null}
{"instance_id":"bq352","db":"sdoh","question":"Por favor, indique el promedio de semanas de gestación en 2018 para los condados de Wisconsin donde más del 5% de la población empleada tenía desplazamientos al trabajo de 45 a 59 minutos en 2017.","external_knowledge":null}
{"instance_id":"bq074","db":"sdoh","question":"Contar el número de condados que experimentaron un aumento en el desempleo desde 2015 hasta 2018, utilizando datos del ACS de 5 años, y una disminución en los recuentos de inscritos duales elegibles entre el 1 de diciembre de 2015 y el 1 de diciembre de 2018.","external_knowledge":null}
{"instance_id":"bq066","db":"sdoh","question":"¿Podrías evaluar la relación entre las tasas de pobreza de los censos del año anterior y el porcentaje de nacimientos sin morbilidad materna para los años 2016 a 2018? Utiliza solo datos de nacimientos en los que no se reportó morbilidad materna y, para cada año, utiliza los datos censales de 5 años del año anterior para calcular el coeficiente de correlación de Pearson.","external_knowledge":null}
{"instance_id":"bq114","db":"openaq","question":"¿Qué tres ciudades tienen la mayor diferencia entre sus mediciones de PM2.5 de la EPA en 1990 (usando units_of_measure = 'Micrograms/cubic meter (LC)' y parameter_name = 'Acceptable PM2.5 AQI & Speciation Mass') y sus mediciones de PM2.5 de OpenAQ en 2020 (donde pollutant = 'pm25' basadas en el año extraído de la marca de tiempo), con ambos conjuntos de datos emparejados por latitud y longitud redondeadas a dos decimales, y la diferencia ordenada de mayor a menor?","external_knowledge":null}
{"instance_id":"bq116","db":"sec_quarterly_financials","question":"¿Qué estado de EE. UU. reportó los ingresos anuales totales más altos en miles de millones de dólares durante el año fiscal 2016, considerando empresas que proporcionaron cuatro trimestres de datos y reportaron etiquetas de medida en ('Revenues','SalesRevenueNet','SalesRevenueGoodsNet'), excluyendo cualquier entrada donde el campo de estado (stprba) sea nulo o esté vacío?","external_knowledge":null}
{"instance_id":"sf_bq015","db":"STACKOVERFLOW_PLUS","question":"Identifica y clasifica los 10 principales etiquetas de preguntas de Stack Overflow que fueron mencionadas en comentarios de Hacker News a partir de 2014, contando cuántas veces se mencionó cada pregunta, luego divide las cadenas de etiquetas de las preguntas por el delimitador '|' y agrupa por etiqueta.","external_knowledge":null}
{"instance_id":"bq041","db":"stackoverflow","question":"Calcule las estadísticas mensuales de los nuevos usuarios de StackOverflow creados en 2021. Para cada mes, informe el número total de nuevos usuarios, el porcentaje de estos nuevos usuarios que realizaron al menos una pregunta dentro de los 30 días siguientes a su registro, y entre aquellos que realizaron una pregunta dentro de los 30 días, el porcentaje que luego respondió al menos a una pregunta después de su primera pregunta y dentro de los 30 días siguientes a su primera pregunta.","external_knowledge":null}
{"instance_id":"sf_bq121","db":"STACKOVERFLOW","question":"¿Como varían la reputación promedio y el número de insignias entre los usuarios de Stack Overflow en función del número de años completos que llevan siendo miembros, considerando solo a aquellos que se unieron en o antes del 1 de octubre de 2021?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq123","db":"stackoverflow","question":"Necesitas determinar qué día de la semana tiene el tercer porcentaje más alto de preguntas en Stack Overflow que reciben una respuesta dentro de una hora. Para hacer esto, utiliza la fecha de creación de la pregunta de la tabla posts_questions y la fecha de creación de la respuesta más temprana de la tabla posts_answers. Una vez que hayas calculado el porcentaje de preguntas que reciben una respuesta dentro de una hora para cada día, identifica el día con el tercer porcentaje más alto y reporta ese porcentaje.","external_knowledge":null}
{"instance_id":"bq280","db":"stackoverflow","question":"Por favor, proporciona el nombre para mostrar del usuario que ha respondido la mayor cantidad de preguntas en Stack Overflow, considerando solo a los usuarios con una reputación mayor que 10.","external_knowledge":null}
{"instance_id":"bq300","db":"stackoverflow","question":"¿Cuál es el número más alto de respuestas recibidas para una única pregunta específica de Python 2 en Stack Overflow, excluyendo cualquier discusión que involucre Python 3?","external_knowledge":null}
{"instance_id":"bq301","db":"stackoverflow","question":"Recuperar detalles de respuestas aceptadas a preguntas de Stack Overflow publicadas en enero de 2016 que tengan etiquetas que incluyan \"javascript\" y al menos una de \"xss\", \"cross-site\", \"exploit\" o \"cybersecurity\"; las respuestas en sí también deben haber sido publicadas en enero de 2016. Para cada respuesta aceptada, incluir la ID de la respuesta, la reputación del autor de la respuesta, su puntuación y el recuento de comentarios, junto con las etiquetas de la pregunta asociada, su puntuación, el recuento de respuestas, la reputación del preguntador, el recuento de visualizaciones y el recuento de comentarios.","external_knowledge":null}
{"instance_id":"bq302","db":"stackoverflow","question":"¿Cuál es la proporción mensual de preguntas de Stack Overflow etiquetadas con 'python' en el año 2022?","external_knowledge":null}
{"instance_id":"bq303","db":"stackoverflow","question":"Desde el 1 de julio de 2019 hasta el 31 de diciembre de 2019, para todos los usuarios con IDs entre 16712208 y 18712208 en Stack Overflow, recupere el ID de usuario y las etiquetas de la pregunta relevante para cada una de sus contribuciones, incluyendo comentarios en preguntas y respuestas, cualquier respuesta que hayan publicado y cualquier pregunta que hayan creado, asegurándose de asociar correctamente el comentario o la respuesta con las etiquetas de la pregunta padre.","external_knowledge":null}
{"instance_id":"bq304","db":"stackoverflow","question":"Recupera las 50 preguntas más vistas para cada una de las siguientes etiquetas relacionadas con Android en StackOverflow: 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps' y 'android-asynctask'. Cada pregunta debe contener la palabra 'how' en cualquiera de su título o cuerpo y no debe contener ninguno de los siguientes términos de solución de problemas en cualquiera de su título o cuerpo: 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve', o 'trouble'. Solo incluye etiquetas que tengan al menos 50 preguntas que cumplan estos criterios, y para cada una de esas etiquetas, selecciona las 50 preguntas principales clasificadas por el número de vistas.","external_knowledge":null}
{"instance_id":"bq310","db":"stackoverflow","question":"¿Cuál es el título de la pregunta \"how\" más vista relacionada con el desarrollo de Android en StackOverflow, entre etiquetas especificadas como 'android-layout', 'android-activity', 'android-intent', y otras","external_knowledge":null}
{"instance_id":"bq305","db":"stackoverflow","question":"¿Qué 10 usuarios tienen la mayor suma de vistas para las preguntas con las que están asociados, donde se considera que un usuario está asociado si posee la pregunta, o su respuesta es la respuesta aceptada, o la puntuación de su respuesta es mayor que 5, o la puntuación de su respuesta supera el 20% del total de puntuaciones de las respuestas para esa pregunta (y es mayor que 0), o su respuesta está entre las tres respuestas con mayor puntuación para esa pregunta?","external_knowledge":null}
{"instance_id":"bq306","db":"stackoverflow","question":"Identifica las 10 etiquetas principales para el usuario 1908967, basándote únicamente en las respuestas publicadas antes del 7 de junio de 2018, donde cada etiqueta tiene una puntuación de 10 veces el número de votos a favor (`vote_type_id=2`) y 15 veces el número de respuestas aceptadas (`vote_type_id=1`). Deriva las etiquetas de las preguntas asociadas a esas respuestas, y considera solo los votos a favor y las respuestas aceptadas para esas respuestas. Devuelve las etiquetas con las puntuaciones totales más altas en orden descendente, limitado a 10 etiquetas.","external_knowledge":null}
{"instance_id":"sf_bq307","db":"STACKOVERFLOW","question":"Encuentra las 10 insignias doradas que los usuarios obtienen con mayor frecuencia como su primera insignia en Stack Overflow. Para cada una de estas insignias, muestra el nombre de la insignia, el número de usuarios que la obtuvieron como su primera insignia dorada y el número promedio de días desde la fecha de creación de la cuenta del usuario hasta la fecha en que obtuvieron la insignia, calculado en días sin ajustes por formatos de fecha.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq308","db":"stackoverflow","question":"Muestra el número de preguntas de Stack Overflow realizadas cada día de la semana en 2021, y averigua cuántas y qué porcentaje de esas preguntas fueron respondidas dentro de una hora.","external_knowledge":null}
{"instance_id":"bq309","db":"stackoverflow","question":"Obtén las 10 preguntas más largas en Stack Overflow, medidas por la longitud de su texto del cuerpo de la pregunta, donde cada pregunta tenga una respuesta aceptada o no tenga respuesta aceptada pero tenga al menos una respuesta con una relación de puntuación-vistas que supere 0,01. Para cada una de estas preguntas, incluye la reputación del usuario que hizo la pregunta, los votos netos del usuario (calculados como su total de votos a favor menos votos en contra), y el número total de insignias que ha ganado el usuario.","external_knowledge":null}
{"instance_id":"bq124","db":"fhir_synthea","question":"Entre todos los pacientes, ¿cuántos individuos siguen vivos (es decir, sin un registro de deceased.dateTime), tienen un diagnóstico de diabetes o hipertensión y están recetados con al menos siete medicamentos activos distintos?","external_knowledge":null}
{"instance_id":"bq391","db":"fhir_synthea","question":"Entre pacientes vivos cuyos apellidos comienzan con \"A\" y que cada uno tiene exactamente una condición distinta, ¿qué ocho condiciones tienen el mayor número de medicamentos activos diferentes prescritos a un solo paciente y cuáles son sus códigos correspondientes?","external_knowledge":null}
{"instance_id":"bq126","db":"the_met","question":"¿Cuáles son los títulos, nombres de los artistas, medios y URLs de las imágenes originales de objetos con 'Photograph' en sus nombres, del departamento 'Photographs', creados no por un artista desconocido, con una fecha de finalización del objeto de 1839 o anterior?","external_knowledge":null}
{"instance_id":"bq366","db":"the_met","question":"¿Cuáles son las tres etiquetas más frecuentemente asociadas con obras de arte de cada periodo histórico en la colección de The Met's, considerando solo las etiquetas vinculadas a 500 o más obras? Proporciona el periodo, la etiqueta y el conteo asociado.","external_knowledge":null}
{"instance_id":"bq414","db":"the_met","question":"Obtener el ID del objeto, el título y la fecha de metadatos formateada (como una cadena en el formato 'YYYY-MM-DD') para objetos en el departamento \"The Libraries\" donde cropConfidence es mayor que 0.5, el título del objeto contiene la palabra \"book\".","external_knowledge":null}
{"instance_id":"bq200","db":"mlb","question":"Usando datos tanto de la temporada regular como de la postemporada, identifica al lanzador que logró la velocidad de lanzamiento no nula más alta para cada equipo al confirmar si la identificación del lanzador aparece en las listas de jugadores locales o visitantes relevantes para ese juego, luego recupera el nombre completo de ese lanzador junto con la velocidad de lanzamiento válida máxima que logró mientras jugaba para ese equipo específico.","external_knowledge":null}
{"instance_id":"sf_bq458","db":"WORD_VECTORS_US","question":"Tokeniza el texto del cuerpo de cada artículo en palabras, excluyendo las palabras vacías, y obtén los vectores de palabras correspondientes para estas palabras a partir del vector de GloVe. Para cada palabra, pondera su vector dividiendo cada componente por la frecuencia de la palabra elevada a la potencia 0.4. Luego, para cada artículo, agrega estos vectores ponderados sumando sus componentes para formar un vector de artículo. Normaliza cada vector de artículo a longitud unitaria dividiendo por su magnitud. Finalmente, recupera el ID, la fecha, el título y el vector de artículo normalizado para cada artículo.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq459","db":"WORD_VECTORS_US","question":"Por favor, encuentre los 10 artículos más relevantes procesando únicamente el campo 'body' de cada artículo, donde cada cuerpo se tokeniza sin palabras vacías, cada token restante se convierte en un vector de palabras basado en GloVe y se pondera dividiendo cada dimensión por la potencia de 0,4 de su frecuencia de palabras; luego estos vectores ponderados se suman y normalizan para obtener un vector unitario para cada artículo. Realice la misma ponderación y normalización en la frase de consulta 'Epigenetics and cerebral organoids: promising directions in autism spectrum disorders' y calcule la similitud coseno entre el vector de la consulta y cada vector de artículo. Finalmente, devuelva el id, date, title y el puntaje de similitud coseno para los 10 artículos con mayor similitud.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq460","db":"WORD_VECTORS_US","question":"Por favor procese los artículos del conjunto de datos 'nature' primero tokenizando el texto del cuerpo y eliminando las palabras vacías. Para cada palabra restante, obtén su vector de palabras de la tabla glove_vectors y su frecuencia de la tabla word_frequencies, luego divide cada vector de palabras por la potencia de 0.4 de la frecuencia de la palabra para ponderarlo. Suma los vectores ponderados para obtener un vector agregado para cada artículo, normaliza este vector agregado a una longitud unitaria y luego calcula los valores de similitud coseno entre estos vectores normalizados. Finalmente, devuelve los identificadores, las fechas, los títulos y los valores de similitud coseno de los 10 artículos más similares al artículo con el ID '8a78ef2d-d5f7-4d2d-9b47-5adb25cbd373'.","external_knowledge":"tokenize_func.md"}
{"instance_id":"bq204","db":"eclipse_megamovie","question":"Encuentra al usuario con el mayor total de clics en todos los registros de todas las colecciones de fotos disponibles.","external_knowledge":null}
{"instance_id":"bq389","db":"epa_historical_air_quality","question":"Por favor calcule los niveles promedio mensuales de PM10, PM2.5 FRM, PM2.5 non-FRM, emisiones de compuestos orgánicos volátiles, SO2 (escalado por un factor de 10) y plomo (escalado por un factor de 100) de contaminantes atmosféricos en California para el año 2020.","external_knowledge":null}
{"instance_id":"sf_bq345","db":"IDC","question":"¿Qué tan grandes son los archivos de imagen DICOM con las modalidades SEG o RTSTRUCT y el SOP Class UID \"1.2.840.10008.5.1.4.1.1.66.4\", cuando se agrupan por colección, estudio y IDs de serie, si no tienen referencias a otras series, imágenes o fuentes? ¿También puedes proporcionar una URL del visor formateada como \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" seguida del ID de estudio, y enumerar estos tamaños en kilobytes, ordenados de mayor a menor?","external_knowledge":null}
{"instance_id":"sf_bq346","db":"IDC","question":"En datos DICOM de acceso público donde la modalidad es 'SEG' y el SOPClassUID es '1.2.840.10008.5.1.4.1.1.66.4', y cada segmentación hace referencia a su SOPInstanceUID original, ¿qué cinco categorías de segmentación (según 'SegmentedPropertyCategory.CodeMeaning') ocurren con mayor frecuencia?","external_knowledge":null}
{"instance_id":"sf_bq347","db":"IDC","question":"A partir de la unión de la serie MR especificada con SeriesInstanceUID 1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147 y todas las instancias de segmentación asociadas, ¿qué modalidad tiene la mayor cantidad de instancias SOP en total, y cuántas hay?","external_knowledge":null}
{"instance_id":"sf_bq390","db":"IDC","question":"En la colección \"qin_prostate_repeatability\", por favor proporcione los distintos StudyInstanceUIDs para estudios que incluyan imágenes RM axiales ponderadas en T2 y que además contengan segmentaciones de estructuras anatómicas etiquetadas como \"Peripheral zone\".","external_knowledge":null}
{"instance_id":"sf_bq421","db":"IDC","question":"¿Puede enumerar todos los pares únicos de significados de los códigos de medio de incrustación y de sustancias de tinción, junto con el número de ocurrencias para cada par, basándose en códigos distintos de medio de incrustación y sustancias de tinción de la modalidad 'SM' del conjunto de datos DICOM en las secuencias de preparación de muestras no anidadas, asegurando que los códigos provengan del esquema de codificación SCT?","external_knowledge":null}
{"instance_id":"sf_bq422","db":"IDC","question":"Utilizando las imágenes CT de la colección 'nlst', calcule y compare dos métricas distintas: 1) el tamaño medio de la serie en MiB para los 3 pacientes con la mayor tolerancia a la diferencia de intervalos de corte (definida como la diferencia entre los intervalos únicos máximos y mínimos de corte en todas sus series), y 2) el tamaño medio de la serie en MiB para los 3 pacientes con la mayor diferencia de exposición (definida como la diferencia entre los valores de exposición únicos máximos y mínimos en todas sus series). Para cada paciente, calcule el tamaño de la serie sumando los tamaños de instancia de todas las imágenes en esa serie y convirtiéndolo a MiB. Devuelva los resultados en dos grupos separados etiquetados \"Top 3 by Slice Interval\" y \"Top 3 by Max Exposure\" con sus tamaños medios de serie respectivos.","external_knowledge":null}
{"instance_id":"sf_bq069","db":"IDC","question":"¿Podrías ayudarme a generar un informe de series de imágenes CT desde la tabla dicom_all, de modo que se excluyan todas las series de la colección NLST, se omitan cualquier localizador o serie comprimida JPEG (sintaxis de transferencia 1.2.840.10008.1.2.4.70 o 1.2.840.10008.1.2.4.51), y solo aquellas que superen ciertas verificaciones de geometría —es decir, una única orientación, espaciado de píxeles idéntico, recuentos de instancias SOP y de posición coincidentes, filas y columnas de píxeles uniformes, y un producto punto cercano a 1 entre los vectores de orientación de la imagen— estén incluidas, además de calcular diferencias de intervalo entre cortes, diferencias de exposición y el tamaño aproximado de la serie en MB para cada serie calificada?","external_knowledge":"nonNlstCohort.md"}
{"instance_id":"sf_bq219","db":"IOWA_LIQUOR_SALES","question":"En el conjunto de datos de ventas de licores de Iowa, desde el 1 de enero de 2022 hasta el último mes completamente terminado, ¿cuáles son las dos categorías de licores, cada una con un promedio de al menos el 1% del volumen de ventas mensual durante al menos 24 meses de datos disponibles, que presentan el coeficiente de correlación de Pearson más bajo al comparar sus porcentajes mensuales de las ventas totales de licores a lo largo de esos meses, y cuáles son sus nombres?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq199","db":"iowa_liquor_sales","question":"Identifica las 10 principales categorías de licores en Iowa en 2021 calculando, para cada categoría, el promedio de los precios minoristas por litro de todas las transacciones de venta en esa categoría durante 2021. Para estas categorías principales, proporciona sus precios promedio minoristas por litro calculados de la misma manera para los años 2019, 2020 y 2021.","external_knowledge":null}
{"instance_id":"bq218","db":"iowa_liquor_sales","question":"¿Cuáles son los 5 artículos con mayor porcentaje de crecimiento interanual en los ingresos por ventas totales para el año 2023?","external_knowledge":null}
{"instance_id":"bq049","db":"iowa_liquor_sales_plus","question":"Por favor muestre las ventas mensuales per cápita de Bourbon Whiskey durante 2022 en el condado de Dubuque para el código postal que ocupa el tercer lugar en ventas totales de Bourbon Whiskey, utilizando solo la población de 21 años o más.","external_knowledge":null}
{"instance_id":"bq360","db":"nppes","question":"Entre los proveedores de atención médica cuyo lugar de práctica se encuentra en Mountain View, CA, y que tienen una especialización especificada en el campo de la taxonomía de proveedores de atención médica, identifique las 10 especializaciones más comunes basadas en el conteo de NPIs distintos. Luego determine cuál de esas 10 tiene un conteo de NPIs distintos más cercano al conteo medio entre esas 10 especializaciones.","external_knowledge":null}
{"instance_id":"bq286","db":"usa_names","question":"¿Puedes decirme el nombre del bebé femenino más popular en Wyoming para el año 2021, basado en la proporción de bebés femeninos con ese nombre en comparación con el número total de bebés femeninos con el mismo nombre en todos los estados?","external_knowledge":null}
{"instance_id":"sf_bq044","db":"TCGA","question":"Para pacientes con cáncer de vejiga que presentan mutaciones en el gen CDKN2A (cyclin-dependent kinase inhibitor 2A), utilizando datos clínicos de Genomic Data Commons Release 39, ¿qué tipos de mutaciones presentan, cuál es su sexo, estado vital y días hasta la muerte, y para cuatro genes aguas abajo (MDM2 (MDM2 proto-oncogene), TP53 (tumor protein p53), CDKN1A (cyclin-dependent kinase inhibitor 1A) y CCNE1 (Cyclin E1)), ¿cuáles son los niveles de expresión génica para cada paciente?","external_knowledge":"TCGA_Study_Abbreviations.md"}
{"instance_id":"sf_bq043","db":"TCGA","question":"¿Cuáles son los niveles de expresión de ARN de los genes MDM2, TP53, CDKN1A y CCNE1, junto con la información clínica asociada, en pacientes con cáncer de vejiga con mutaciones en CDKN2A en el proyecto 'TCGA-BLCA'? Utilice datos clínicos de la Genomic Data Commons Release 39, datos sobre mutaciones somáticas derivadas de la referencia del genoma humano hg19 en febrero de 2017.","external_knowledge":null}
{"instance_id":"bq143","db":"CPTAC_PDC","question":"Utiliza datos de proteómica CPTAC y RNAseq para el Carcinoma de Células Claras de Riñón para seleccionar muestras 'Primary Tumor' y 'Solid Tissue Normal'. Une los conjuntos de datos por los IDs de submitter de muestra y por los símbolos de genes. Calcula la correlación entre la abundancia de proteínas (razón log2) y los niveles de expresión génica (log2(FPKM + 1)) para cada gen y tipo de muestra. Filtra las correlaciones con un valor absoluto mayor que 0.5 y calcula la correlación media para cada tipo de muestra.","external_knowledge":null}
{"instance_id":"sf_bq147","db":"TCGA","question":"¿Puedes identificar los casos de cáncer de mama TCGA a partir de la secuenciación de ARN hg38 r35` donde el gen protein_coding y el proyecto TCGA-BRCA existan y tengan muestras de secuenciación de ARN de múltiples tipos de tejidos—incluyendo \"Solid Tissue Normal\"—dentro del mismo caso?","external_knowledge":null}
{"instance_id":"sf_bq148","db":"TCGA","question":"¿Podrías identificar los cinco genes codificadores de proteínas con mayor varianza en sus niveles de expresión (medidos como fpkm_uq_unstranded) específicamente dentro de las muestras de 'Solid Tissue Normal'? Por favor, limite el análisis a los casos del proyecto TCGA-BRCA que incluyan al menos un tipo de muestra 'Solid Tissue Normal'.","external_knowledge":null}
{"instance_id":"sf_bq175","db":"TCGA_MITELMAN","question":"Identifica los nombres de citobanda en el cromosoma 1 en el conjunto de datos de segmento alélico de TCGA-KIRC, donde la frecuencia de amplificaciones, ganancias y deleciones heterozigotas se ubiquen entre los 11 primeros. Calcula estas clasificaciones basándote en el número máximo de copias observado en diversos estudios genómicos del cáncer de riñón, reflejando la severidad de las alteraciones genéticas.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"sf_bq176","db":"TCGA_MITELMAN","question":"Identifica los códigos de barras de los casos del estudio TCGA-LAML con el mayor número de copias promedio ponderado en el cytoband 15q11 en el cromosoma 15, utilizando datos de segmentos y solapamientos de cytobands de las bases de datos genómicas de TCGA y Mitelman.","external_knowledge":null}
{"instance_id":"sf_bq170","db":"TCGA_MITELMAN","question":"Para casos de cáncer de mama (TCGA-BRCA) de Release 23 del archivo activo de GDC, identifique y clasifique las variaciones en el número de copias (CNVs) a través de todas las bandas citogenéticas en cada cromosoma. Para cada banda citogenética y cada caso, determine la superposición entre la región de la banda citogenética y los segmentos de número de copias del caso, y calcule la media ponderada por la superposición del número de copias para esa banda en el caso, redondeando al número entero más cercano. Clasifique el número de copias redondeado en tipos de CNV de la siguiente manera: deleciones homocigotas (0), deleciones heterocigotas (1), estado diploide normal (2), ganancias (3) y amplificaciones (mayores que 3). Para cada banda citogenética, proporcione su nombre y las posiciones de inicio y final, y calcule la frecuencia de cada tipo de CNV a través de todos los casos como un porcentaje del número total de casos, redondeado a dos decimales.","external_knowledge":"copy_number_variations.md"}
{"instance_id":"sf_bq150","db":"TCGA_HG19_DATA_V0","question":"Evalúe si diferentes variantes genéticas afectan los niveles de expresión de TP53 transformados con log10 en muestras de TCGA-BRCA utilizando datos de secuenciación y mutaciones. Proporcione el número total de muestras, el número de tipos de mutaciones, el cuadrado medio entre grupos, el cuadrado medio dentro de los grupos y el estadístico F.","external_knowledge":"TCGA_F_Score.md"}
{"instance_id":"sf_bq152","db":"TCGA_HG38_DATA_V0","question":"Para los casos de cáncer de mama (TCGA-BRCA) del Release 23 del archivo activo de GDC, identifique y clasifique las variaciones del número de copias (CNVs) en todas las citobandas de cada cromosoma. Para cada citobanda y cada caso, determine la superposición entre la región de la citobanda y los segmentos del número de copias del caso, y calcule el promedio ponderado por superposición del número de copias para esa citobanda en el caso, redondeando al entero más cercano. Clasifique el número de copias redondeado en tipos de CNV como sigue: deleciones homocigotas (0), deleciones heterocigotas (1), estado diploide normal (2), ganancias (3) y amplificaciones (mayores que 3). Para cada citobanda, proporcione su nombre y sus posiciones de inicio y fin, y calcule la frecuencia de cada tipo de CNV entre todos los casos como un porcentaje del número total de casos, redondeado a dos decimales.","external_knowledge":null}
{"instance_id":"sf_bq155","db":"TCGA_HG38_DATA_V0","question":"En la cohorte TCGA-BRCA de pacientes que tienen 80 años o menos al momento del diagnóstico y presentan una etapa patológica de Etapa I, Etapa II o Etapa IIA, calcule el estadístico t derivado de la correlación de Pearson entre los niveles de expresión promedio de RNA-Seq transformados con log10 (utilizando HTSeq__Counts + 1) del gen SNORA31 y los niveles de expresión promedio de microRNA-Seq de todos los microRNAs únicos, considerando solo pares con más de 25 muestras y donde el coeficiente de correlación de Pearson absoluto esté entre 0.3 y 1.0","external_knowledge":null}
{"instance_id":"sf_bq141","db":"TCGA_HG38_DATA_V0","question":"Usando el conjunto de datos TCGA-KIRP, seleccione pacientes de la tabla 'TCGA_bioclin_v0.Clinical' que tengan una clinical_stage no nulo y un disease_code de 'KIRP'. Recupere sus datos de expresión génica de la tabla 'TCGA_hg38_data_v0.RNAseq_Gene_Expression' para los genes 'MT-CO3,' 'MT-CO1,' y 'MT-CO2,' y divida aleatoriamente a los pacientes en un conjunto de entrenamiento (90%) y un conjunto de prueba (10%) basándose en su case_barcode mediante el método FARM_FINGERPRINT. Para cada clinical_stage en el conjunto de entrenamiento, calcule la expresión media HTSeq__FPKM_UQ de los tres genes. Para cada paciente en el conjunto de prueba, calcule la distancia euclidiana entre los valores de expresión del paciente y los promedios por etapa, y asigne a ese paciente la clinical_stage cuyo promedio esté más cercano. Finalmente, muestre el case_barcode y la clinical_stage prevista.","external_knowledge":null}
{"instance_id":"bq046","db":"TCGA_bioclin_v0","question":"Encuentre los códigos de barras de casos y sus URL de archivos GDC correspondientes para pacientes de sexo femenino de 30 años o menos diagnosticadas con cáncer de mama (BRCA) en la base de datos TCGA. La consulta debe identificar primero a los pacientes de la tabla Annotations donde entity_type es \"Patient\" y ya sea que la categoría sea \"History of unacceptable prior treatment related to a prior/other malignancy\" o la clasificación sea \"Redaction\". También identifique a los pacientes de la tabla Clinical con disease_code \"BRCA\", age_at_diagnosis menor o igual a 30 y gender \"FEMALE\". Realice un FULL JOIN entre estos dos conjuntos, pero solo conserve a los pacientes para quienes tanto categoryName como classificationName sean NULL en el resultado final. Use los metadatos de GDC de la liberación de archivo 14 (específicamente rel14_caseData, rel14_fileData_current y rel14_GDCfileID_to_GCSurl_NEW) para obtener las URL de los archivos correspondientes.","external_knowledge":null}
{"instance_id":"sf_bq153","db":"PANCANCER_ATLAS_1","question":"Calcule, para cada tipo de histología especificado en el campo 'icd_o_3_histology' (excluyendo aquellos que se encuentran entre corchetes), el promedio de los valores de expresión log10(normalized_count + 1) del gen IGF2, calculados por paciente, entre pacientes LGG con datos de expresión de IGF2 válidos. Empareje la expresión génica y los datos clínicos utilizando el campo ParticipantBarcode.","external_knowledge":null}
{"instance_id":"sf_bq154","db":"PANCANCER_ATLAS_1","question":"Calcular el puntaje H de Kruskal-Wallis entre grupos de pacientes con LGG para la expresión del gen IGF2, donde la expresión de IGF2 de cada paciente se determina aplicando log10(normalized_count + 1) y luego promediando entre muestras. Agrupe a los pacientes por códigos de histología ICD-O-3, excluya cualquier código que esté completamente entre corchetes, solo incluya grupos con más de un paciente, y asegúrese de que normalized_count no sea nulo. Finalmente, devuelva el número total de grupos, el número total de muestras y la puntuación H de Kruskal-Wallis en orden descendente.","external_knowledge":"Regulome_Explorer_Kruskal-Wallis_test_for_numerical_and_categorical_data.md"}
{"instance_id":"sf_bq156","db":"PANCANCER_ATLAS_1","question":"Calcular el t-score (redondeado a 2 decimales) para comparar la diferencia en los niveles medios de expresión del gen DRG2 entre dos grupos (TP53 mutado vs. no mutado) en el estudio de glioma de grado bajo (LGG), donde los niveles de expresión se calculan como el promedio de log10(normalized_count + 1) para cada participante, considerando únicamente muestras con mutaciones en TP53 que tengan un estatus 'FILTER' de 'PASS' en los datos de mutación, y descartando cualquier grupo con menos de 10 muestras o con varianza cero; consulte `t_score.md` para el método de cálculo del t-score.","external_knowledge":"t_score.md"}
{"instance_id":"sf_bq157","db":"PANCANCER_ATLAS_1","question":"Calcule el valor t para determinar la diferencia estadística en la expresión del gen DRG2 entre pacientes con LGG con mutación en TP53 y sin ella: para cada paciente, calcule el promedio de log10(normalized_count + 1) de la expresión de DRG2 a través de todas sus muestras, utilizando solo las muestras presentes en la tabla `MC3_MAF_V5_one_per_tumor_sample` para el estudio LGG; identifique a los pacientes con mutaciones en TP53 a partir de esta tabla donde `Hugo_Symbol` es 'TP53' y `FILTER` es 'PASS'; luego realice una prueba t comparando la media de la expresión de DRG2 tras la transformación logarítmica entre pacientes con y sin mutación en TP53.","external_knowledge":"Regulome_Explorer_T_test_for_numerical_and_binary_data.md"}
{"instance_id":"sf_bq158","db":"PANCANCER_ATLAS_1","question":"¿Qué cinco principales tipos histológicos de cáncer de mama (BRCA) en el PanCancer Atlas muestran el porcentaje más alto de mutaciones del gen CDH1?","external_knowledge":null}
{"instance_id":"sf_bq159","db":"PANCANCER_ATLAS_1","question":"Calcule el valor de chi-cuadrado para evaluar la asociación entre los tipos histológicos y la presencia de mutaciones del gen CDH1 en pacientes con BRCA, utilizando datos de PanCancer Atlas. Enfóquese en pacientes con tipos histológicos conocidos y considere únicamente entradas de mutación confiables. Excluya cualquier tipo histológico o estado de mutación con totales marginales menores o iguales a 10. Empareje los datos clínicos y de mutación utilizando ParticipantBarcode.","external_knowledge":null}
{"instance_id":"bq161","db":"pancancer_atlas_2","question":"Calcula la diferencia neta entre el número de pacientes con adenocarcinoma pancreático (PAAD) en el conjunto de datos de TCGA que tengan mutaciones en ambos genes KRAS y TP53, y aquellos sin mutaciones en ninguno de esos genes. Utiliza datos clínicos y de seguimiento de los pacientes junto con detalles de mutaciones genómicas de la base de datos de genómica del cáncer de TCGA, enfocándose específicamente en estudios de PAAD donde las mutaciones hayan pasado filtros de calidad.","external_knowledge":null}
{"instance_id":"bq151","db":"pancancer_atlas_2","question":"Utilizando el conjunto de datos de TCGA, calcule la estadística chi-cuadrado para evaluar la asociación entre las mutaciones de los genes KRAS y TP53 en pacientes diagnosticados con adenocarcinoma pancreático (PAAD). Incorpore datos de seguimiento clínico y anotaciones de mutaciones de alta calidad para determinar con precisión la frecuencia de pacientes con mutaciones concomitantes de KRAS y TP53 en comparación con aquellos en los que cada mutación ocurre de forma independiente. Asegúrese de que los registros de pacientes estén meticulosamente emparejados basándose en identificadores únicos para mantener la integridad de los datos. Este análisis tiene como objetivo identificar y cuantificar posibles correlaciones entre las alteraciones genéticas KRAS y TP53 dentro de la población de pacientes con PAAD.","external_knowledge":null}
{"instance_id":"bq162","db":"HTAN_1","question":"A partir de la quinta revisión (r5) de los datos HTAN, enumere los tipos de ensayo de imagen disponibles en el centro HTAN WUSTL que tengan datos Level2 y cualquier dato de nivel superior asociado (Level3, Level4) derivados de ellos a través de las relaciones 'entityId' en la tabla 'id_provenance_r5'; excluya cualquier registro donde el 'Component' sea NULL o contenga 'Auxiliary' o 'OtherAssay'; para cada tipo de ensayo de imagen, proporcione los niveles de datos disponibles (Level2, Level3, Level4), y no incluya datos Level1 ni tipos de ensayo de Microscopía Electrónica.","external_knowledge":null}
{"instance_id":"sf_bq163","db":"HTAN_2","question":"Cuáles son los 20 genes en el conjunto de muestras combinadas HTAN scRNAseq MSK-SCLC que muestran la mayor diferencia en la expresión promedio de X_value entre células epiteliales femeninas y masculinas, específicamente en el clúster 41 de pacientes humanos de 74 años en estadio? Por favor calcule la diferencia restando la media de X_value de los hombres de la media de X_value de las mujeres para cada gen.","external_knowledge":null}
{"instance_id":"sf_bq164","db":"HTAN_2","question":"Consolide metadatos de conjuntos de datos de transcriptómica espacial y scRNAseq, incluidos los niveles 1 a 4 y archivos auxiliares, para el Run ID 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test'. Incluya Filename, HTAN Parent Biospecimen ID, Component, File Format, Entity ID y Run ID.","external_knowledge":null}
{"instance_id":"sf_bq166","db":"TCGA_MITELMAN","question":"Usando datos de número de copias a nivel de segmento del conjunto de datos copy_number_segment_allelic_hg38_gdc_r23 restringidos a muestras 'TCGA-KIRC', fusiona estos segmentos con las definiciones de bandas citogenéticas en 'CytoBands_hg38' para identificar el número máximo de copias de cada muestra por citobanda. Clasifique estos números máximos de copias en amplificaciones (>3), ganancias (=3), deleciones homocigotas (=0), deleciones heterozigotas (=1), o normal (=2), luego calcule la frecuencia de cada subtipo respecto al total de casos distintos, y por último presente estas frecuencias como porcentajes ordenados por cromosoma y citobanda.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"bq165","db":"mitelman","question":"¿Puede usar las coordenadas genómicas de CytoConverter para calcular la frecuencia de ganancias y pérdidas cromosomales en una cohorte de muestras de cáncer de mama (morphology='3111') y adenocarcinoma (topology='0401')? Concretamente, por favor incluya el número y la frecuencia (con dos decimales en porcentaje) de amplificaciones (ganancias de más de 1 copia), ganancias (1 copia adicional), pérdidas (1 copia) y deleciones homozigotas (pérdida de 2 copias) para cada banda cromosómica. Y ordene el resultado por el número ordinal de cada cromosoma y por la posición de inicio y fin en pares de bases de cada banda, en orden ascendente.","external_knowledge":null}
{"instance_id":"bq169","db":"mitelman","question":"Recuperar distinct referencias de casos, números de caso, números de investigación y información de clon, cuando un único clon exhiba simultáneamente las tres alteraciones genéticas siguientes: (1) una pérdida en el cromosoma 13 entre las posiciones 48,303,751 y 48,481,890, (2) una pérdida en el cromosoma 17 entre las posiciones 7,668,421 y 7,687,490, y (3) una ganancia en el cromosoma 11 entre las posiciones 108,223,067 y 108,369,102. Para cada clon que coincida, muestre los detalles cromosómicos de cada una de estas tres regiones (incluyendo el número de cromosoma representado por ChrOrd, la posición de inicio y la posición final) y la descripción corta correspondiente del cariotipo de la tabla KaryClone. Utilice el CytoConverted y KaryClone.","external_knowledge":null}
{"instance_id":"bq111","db":"mitelman","question":"¿Podrías calcular, por cromosoma, la correlación de Pearson entre la frecuencia de las aberraciones del número de copias (incluyendo amplificaciones, ganancias, pérdidas y deleciones) de la base de datos Mitelman para casos con morph = 3111 y topo = 0401, y las calculadas a partir de los datos de TCGA, devolviendo coeficientes de correlación y valores p correspondientes para cada tipo de aberración, asegurando que solo se muestren los resultados con al menos cinco registros coincidentes?","external_knowledge":"Correlations_between_Mitelman_and_TCGA_datasets.md"}
{"instance_id":"sf_bq451","db":"_1000_GENOMES","question":"Extraer datos de genotipo para polimorfismos de nucleótido único (SNPs) en el cromosoma X, excluyendo las posiciones donde el valor de `start` esté entre 59999 y 2699519 o entre 154931042 y 155260559. Para cada muestra, identifique las llamadas de genotipo en las que el array de genotipos tiene al menos un alelo. Clasifique cada llamada de genotipo en una de las siguientes categorías: alelos homocigotos de referencia (ambos alelos son 0), alelos homocigotos alternos (ambos alelos son iguales y mayores que 0), o alelos heterocigotos (los alelos son diferentes, o cualquier alelo es nulo, y al menos un alelo es mayor que 0). Calcule el número total de sitios llamables (la suma de las tres categorías de genotipo), el número de llamadas de genotipo homocigotas de referencia, homocigotas alternas y heterocigotas, el número total de variantes de nucleótido único (SNVs) como la suma de llamadas homocigotas alternas y heterocigotas, el porcentaje de llamadas heterocigotas entre todos los SNVs, y el porcentaje de llamadas homocigotas alternas entre todos los SNVs. Imprima el identificador de la muestra junto con estos conteos y porcentajes calculados, y ordene los resultados por el porcentaje de llamadas de genotipo heterocigotas entre SNVs en orden descendente, luego por el identificador de la muestra.","external_knowledge":"1000_genomes_alleles_type.md"}
{"instance_id":"sf_bq452","db":"_1000_GENOMES","question":"Identifica variantes en el cromosoma 12 y, para cada variante, calcula el valor de chi-cuadrado utilizando conteos de alelos en casos y controles, donde los casos son individuos de la superpoblación 'EAS' y los controles son individuos de todas las demás superpoblaciones. Aplica la corrección de continuidad de Yates en el cálculo de chi-cuadrado, asegurando que los conteos esperados para cada alelo en ambos grupos sean al menos 5. Devuelve la posición de inicio, la posición final y el valor de chi-cuadrado de las principales variantes donde el valor de chi-cuadrado no es menor que 29.71679.","external_knowledge":null}
{"instance_id":"sf_bq453","db":"_1000_GENOMES","question":"En el cromosoma 17 entre las posiciones 41196311 y 41277499, ¿cuáles son los nombres de referencia, las posiciones de inicio y fin, las bases de referencia, las distintas bases alternativas, los tipos de variantes, y los valores de chi-cuadrado (calculados a partir del equilibrio de Hardy-Weinberg) junto con el número total de genotipos, sus recuentos observados y esperados para genotipos homocigotos de referencia, heterocigotos y homocigotos alternos, así como las frecuencias alélicas (incluidas las de 1KG), para cada variante?","external_knowledge":null}
{"instance_id":"sf_bq454","db":"_1000_GENOMES","question":"Para el conjunto de datos 1000 Genomes, analice variantes autosomales comunes (aquellas con una frecuencia alélica de al menos 0.05) en diferentes superpoblaciones. Para cada superpoblación, cuente cuántas variantes son compartidas por cada número específico de muestras dentro de esa superpoblación. Incluya en sus resultados el tamaño total de la población de cada superpoblación, si la variante es común (frecuencia alélica ≥ 0.05), el número de muestras que tienen cada variante y el recuento total de variantes compartidas por esa cantidad de muestras. Solo incluya variantes autosomales excluyendo explícitamente los cromosomas sexuales (X, Y) y el ADN mitocondrial (MT) del análisis. Considere solo las muestras que tienen al menos un alelo alternativo (no referencial) para la variante.","external_knowledge":null}
{"instance_id":"sf_bq415","db":"HUMAN_GENOME_VARIANTS","question":"Lista las 10 muestras con mayor número de posiciones en las que hay exactamente un alelo alternativo y el genotipo de la muestra es homocigoto para el alelo de referencia (ambos alelos son 0). Ordena los resultados en orden descendente de estos recuentos.","external_knowledge":"Homozygous_Reference_Genotype.md"}
{"instance_id":"bq279","db":"austin","question":"¿Puede proporcionar el número de estaciones de bicicletas compartidas distintas, tanto activas como cerradas, para cada año 2013 y 2014?","external_knowledge":null}
{"instance_id":"bq281","db":"austin","question":"¿Cuál es el número máximo de viajes en bicicleta eléctrica que duren más de 10 minutos realizados por suscriptores con 'Student Membership' en un solo día, excluyendo los viajes que comienzan o terminan en 'Mobile Station' o 'Repair Shop'?","external_knowledge":null}
{"instance_id":"bq282","db":"austin","question":"¿Puedes decirme el valor numérico del distrito del consejo activo en Austin que tiene el mayor número de viajes en bicicleta que comienzan y terminan dentro del mismo distrito, pero no en la misma estación?","external_knowledge":null}
{"instance_id":"bq006","db":"austin","question":"¿Cuál es la fecha con el segundo mayor Z-score para los recuentos diarios de incidentes de 'PUBLIC INTOXICATION' en Austin para el año 2016? Indique la fecha en el formato de '2016-xx-xx'.","external_knowledge":null}
{"instance_id":"sf_bq283","db":"AUSTIN","question":"Entre todas las estaciones que están actualmente activas, identifique aquellas que ocupan los 15 primeros puestos (incluidos los empates) según el número total de viajes que comienzan en cada estación. Para cada una de estas estaciones, devuelva el ID de la estación, el número total de viajes que comienzan, el porcentaje de esos viajes respecto al total de viajes de inicio de las estaciones activas y la duración media de los viajes en minutos. Ordene los resultados por el rango de la estación.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq284","db":"bbc","question":"¿Puedes proporcionar un desglose del número total de artículos en diferentes categorías y el porcentaje de esos artículos que mencionan \"educación\" dentro de cada categoría de BBC News?","external_knowledge":null}
{"instance_id":"bq413","db":"dimensions_ai_covid19","question":"Recupera los títulos de venue de las publicaciones que tengan un `date_inserted` a partir del año 2021 y que estén asociadas con una cuadrícula cuya ciudad de la dirección sea 'Qianjiang'. Para cada publicación, prioriza el título de la venue escogiendo primero el título de la revista si existe; si no, entonces el título de las actas; si eso tampoco está disponible, entonces el título del libro; y finalmente, si ninguno de esos está disponible, entonces el título de la serie de libros.","external_knowledge":null}
{"instance_id":"bq425","db":"ebi_chembl","question":"Usando datos de ChEMBL Release 23, obtenga todas las moléculas distintas asociadas a la empresa 'SanofiAventis', enumerando el nombre comercial y la fecha de aprobación más reciente para cada molécula. Asegúrese de conservar solo la fecha de aprobación más reciente por molécula y de que el campo de la empresa coincida exactamente con 'SanofiAventis' sin depender de otros campos.","external_knowledge":null}
{"instance_id":"bq430","db":"ebi_chembl","question":"Encuentre pares de moléculas distintas probadas en el mismo ensayo y tipo estándar, donde ambas tienen 10–15 átomos pesados, menos de 5 actividades en ese ensayo, menos de 2 actividades duplicadas, valores estándar no nulos y valores pChEMBL superiores a 10. Para cada par, informe el recuento máximo de átomos pesados, la fecha de publicación más reciente (calculada en función del rango del documento dentro de la misma revista y año, y mapeada a un mes y día sintéticos), el ID de documento más alto, clasifique el cambio en los valores estándar como 'aumento', 'disminución' o 'sin-cambio' basado en sus valores y relaciones, y genere UUIDs a partir de sus IDs de actividad y SMILES canónico.","external_knowledge":"chembl.md"}
{"instance_id":"bq023","db":"fec","question":"Usando la Encuesta de la Comunidad Estadounidense de 5 años de 2018 (ACS) para los ingresos medianos a nivel de tracto censal y el conjunto de datos de contribuciones individuales de la Comisión Federal de Elecciones (FEC) de 2020 filtrado para donantes en Nueva York, emparejado con las geografías de tractos censales mediante una correspondencia de código ZIP a tracto censal, calcule y liste el monto promedio de las donaciones políticas y el ingreso mediano para cada tracto censal ubicado en el Condado de Kings (Brooklyn), Nueva York.","external_knowledge":null}
{"instance_id":"bq094","db":"fec","question":"Por favor, proporcione una lista de todos los comités de 2016 que respaldaron al menos a un candidato y que recibieron un monto total de aportes individuales entre $0 y $200 (incluyendo más de $0 y menos de $200), donde estas contribuciones de bajo monto suman más de $0 en total. Para cada comité que cumpla los requisitos, incluya su nombre, el número de candidatos únicos a los que apoyó, los nombres de los candidatos en orden alfabético (separados por comas) y la suma total de estas donaciones de bajo monto recibidas por el comité.","external_knowledge":null}
{"instance_id":"bq287","db":"fda","question":"Entre todos los códigos postales de Utah, ¿cuál es la tasa de empleo de la Encuesta de la Comunidad Estadounidense de 2017 para la población de 16 años o más en el código postal que tiene la menor cantidad de ubicaciones de bancos asegurados por la FDIC?","external_knowledge":null}
{"instance_id":"bq432","db":"fda","question":"Por favor proporcione los datos de eventos de comida donde tanto \"date_created\" como \"date_started\" estén entre January 1 y January 31, 2015, aplique los siguientes pasos de limpieza de datos: dividir los campos reactions y outcomes en arreglos por comas, manejar patrones numéricos especiales en el campo products_brand_name (donde un dígito es seguido por una coma y otro dígito) conservando esos patrones numéricos mientras se reemplaza el resto de \", \" por \" -- \", reemplazar \", \" por \" -- \" en los campos products_industry_code, products_role y products_industry_name, y calcular industry_code_length y brand_name_length como las longitudes de los arreglos tras dividir.","external_knowledge":"Food_Event_Cleansing_Logic.md"}
{"instance_id":"bq285","db":"fda","question":"¿Podría proporcionarme el código postal de la ubicación que tiene la mayor cantidad de instituciones bancarias en Florida?","external_knowledge":null}
{"instance_id":"bq288","db":"fda","question":"¿Cuál es el número total de todas las instituciones bancarias en el estado que tiene la mayor suma de activos de bancos establecidos entre el 1 de enero de 1900 y el 31 de diciembre de 2000, cuyos nombres de instituciones comienzan con 'Bank'?","external_knowledge":null}
{"instance_id":"sf_bq412","db":"GOOGLE_ADS","question":"Por favor, recupere las URLs de las páginas, la primera vez que se mostró, la última vez que se mostró, la razón de eliminación, la categoría de violación y los límites inferior y superior de los tiempos mostrados para los cinco anuncios eliminados más recientemente en la región de Croacia (código de región 'HR'), donde la fecha de disponibilidad mostrada es nula, el límite inferior mostrado de los tiempos excede 10,000, el límite superior mostrado de los tiempos está por debajo de 25,000, y los anuncios utilizaron al menos un enfoque de selección de audiencia entre demografía, ubicación geográfica, señales contextuales, listas de clientes o temas de interés, ordenando los anuncios resultantes por su última vez mostrada en orden descendente.","external_knowledge":null}
{"instance_id":"sf_bq423","db":"GOOGLE_ADS","question":"Entre January 1, 2023 y January 1, 2024, ¿qué anuncio de tipo imagen sobre el tema de Salud, publicado por un anunciante verificado ubicado en Chipre, se mostró en Croacia, tiene times_shown_availability_date as NULL (lo que significa que los datos de las veces mostradas están disponibles), utilizó información demográfica, segmentación por geolocalización, señales contextuales, listas de clientes y temas de interés sin que ninguno de estos métodos de selección quedara sin usar, y además tuvo su fecha de primera visualización estrictamente posterior a January 1, 2023, y su fecha de última visualización estrictamente anterior a January 1, 2024? Entre dichos anuncios, proporciona la URL de la página del anuncio que tenga el límite superior más alto de veces mostradas.","external_knowledge":null}
{"instance_id":"sf_bq070","db":"IDC","question":"¿Podría proporcionar un conjunto de datos limpio y estructurado a partir de la tabla dicom_all que solo incluya imágenes SM marcadas como VOLUME de las colecciones TCGA-LUAD y TCGA-LUSC, excluyendo cualquier diapositiva con tipo de compresión “other,” donde el paso de preparación de la muestra indique explícitamente que “Embedding medium” se establece en “Tissue freezing medium,” y asegurando que el tipo de tejido sea solo “normal” o “tumor” y que se reporte el subtipo de cáncer en consecuencia?","external_knowledge":"dicom_dataset_selection.md"}
{"instance_id":"sf_bq320","db":"IDC","question":"En la tabla dicom_pivot, ¿cuántos valores únicos de StudyInstanceUID coinciden exactamente con SegmentedPropertyTypeCodeSequence de \"15825003\" (sin distinguir mayúsculas/minúsculas) y además tienen una collection_id de cualquiera de \"Community\" o \"nsclc_radiomics\"?","external_knowledge":null}
{"instance_id":"sf_bq321","db":"IDC","question":"¿Cuántos StudyInstanceUIDs únicos hay de las series DWI, T2 Weighted Axial, Apparent Diffusion Coefficient series y T2 Weighted Axial Segmentations en la colección 'qin_prostate_repeatability'?","external_knowledge":null}
{"instance_id":"sf_bq323","db":"IDC","question":"Dentro de la colección 'prostatex', para las secuencias de RM donde la Modalidad sea 'MR', asigne la etiqueta 't2w_prostateX' a las secuencias cuyas SeriesDescription contengan 't2_tse_tra' y 'adc_prostateX' a las secuencias cuyas SeriesDescription contengan 'ADC'. Para todas las secuencias etiquetadas como 't2w_prostateX' o 'adc_prostateX', calcule la media del Tiempo de Repetición, la media del Tiempo de Eco y la media del Espesor de Corte, y luego calcule la suma de estas medias para obtener la media global combinada.","external_knowledge":null}
{"instance_id":"sf_bq417","db":"IDC","question":"Por favor proporcione detalles de identificación, información de estudio y de serie, ubicación de almacenamiento y tamaño total en MB para las imágenes médicas pertenecientes a pacientes masculinos que tienen exactamente 18 años, de acuerdo con la porción numérica del campo PatientAge, donde BodyPartExamined está establecido en 'MEDIASTINUM' y la fecha del estudio es estrictamente posterior al September 1, 2014.","external_knowledge":"IDC_data_model.md"}
{"instance_id":"sf_bq455","db":"IDC","question":"Identifica las cinco series de TC por tamaño (en MiB), incluyendo sus SeriesInstanceUID, número de serie, ID del paciente y tamaño de la serie. Estas series deben ser de la modalidad TC y no formar parte de la colección 'nlst'. Excluya cualquier serie donde el ImageType se clasifique como 'LOCALIZER' o donde el TransferSyntaxUID sea '1.2.840.10008.1.2.4.70' o '1.2.840.10008.1.2.4.51' (es decir, JPEG comprimido). Las series seleccionadas deben tener intervalos de corte consistentes, niveles de exposición, orientación de la imagen (con solo un valor único de ImageOrientationPatient), espaciado de píxeles, posiciones de la imagen (tanto en eje z como en xy) y dimensiones de píxeles (filas y columnas). Asegúrese de que el número de imágenes coincida con el número de posiciones únicas en el eje z, lo que indica que no hay cortes duplicados. Además, el componente en eje z del producto cruzado de los cosenos de dirección x e y de ImageOrientationPatient debe tener un valor absoluto entre 0.99 y 1.01, lo que garantiza la alineación con el plano de imagen esperado. Finalmente, ordene los resultados por tamaño de la serie en orden descendente y limite la salida a las cinco series principales que cumplan estas condiciones.","external_knowledge":null}
{"instance_id":"sf_bq456","db":"IDC","question":"Por favor, obtenga de la tabla dicom_all cada PatientID, StudyInstanceUID, StudyDate y el CodeMeaning de FindingSite para pacientes cuyo StudyDate se encuentre en el año 2001, junto con los valores máximos de cada una de las siguientes mediciones identificadas por su CodeMeaning (Alargamiento, Aplanamiento, Eje menor en la longitud 3D, Eje mayor en la longitud 3D, Diámetro 3D máximo de una malla, Eje menor en la longitud 3D, Esfericidad, Área superficial de la malla, Relación superficie-volumen, Volumen a partir de la suma de vóxeles y Volumen de la malla), asegurando que la tabla quantitative_measurements se una por segmentationInstanceUID que coincida con el SOPInstanceUID en dicom_all, y agrupando por PatientID, StudyInstanceUID, StudyDate y FindingSite CodeMeaning.","external_knowledge":null}
{"instance_id":"sf_bq324","db":"IDC","question":"¿Cuántos fotogramas en total están presentes en todas las imágenes de microscopía de diapositivas completas de la colección TCGA-BRCA que utilizan la modalidad SM y que incluyen un paso de tinción basado en eosina en su SpecimenPreparationSequence?","external_knowledge":null}
{"instance_id":"bq418","db":"targetome_reactome","question":"Determine cuáles son las tres vías de Reactome de nivel más bajo (con evidencia TAS) que tienen los valores chi-cuadrado más altos, considerando solo los objetivos de Homo sapiens asociados con sorafenib bajo las condiciones de que el valor mediano del ensayo sea ≤ 100 y que tanto los valores del ensayo bajos como altos sean ≤ 100 o nulos. Para cada una de estas tres vías, ¿cuántos de estos objetivos y no objetivos se encuentran dentro de la vía y fuera de ella?","external_knowledge":null}
{"instance_id":"bq330","db":"fda","question":"¿Qué código postal de Colorado tiene la mayor concentración de sucursales bancarias por grupo de bloques, basado en la superposición entre códigos postales y grupos de bloques?","external_knowledge":"overlap_ratio.md"}
{"instance_id":"bq398","db":"world_bank","question":"¿cuáles son los tres principales indicadores de deuda para Rusia basados en los valores de deuda más altos?","external_knowledge":null}
{"instance_id":"bq399","db":"world_bank","question":"¿Qué país de ingresos altos tuvo la tasa de natalidad bruta promedio más alta en cada región, respectivamente, y cuáles son sus tasas medias de natalidad correspondientes durante la década de 1980?","external_knowledge":null}
{"instance_id":"bq457","db":"libraries_io","question":"Obtenga detalles de repositorios que usan bibliotecas específicas de banderas de características. Para cada repositorio, incluya el nombre completo con el propietario, el tipo de plataforma de hosting, el tamaño en bytes, el lenguaje de programación principal, el nombre de la fuente de bifurcación (si existe), la marca de tiempo de la última actualización, los nombres del artefacto y de la biblioteca de la bandera de características utilizada, y los lenguajes de programación de la biblioteca. Incluya repositorios que dependan de las bibliotecas de banderas de características especificadas, definidas por sus nombres de artefacto, nombres de biblioteca, plataformas y lenguajes.","external_knowledge":"feature_toggle_libraries.md"}
{"instance_id":"bq227","db":"london","question":"¿Podrías proporcionar las participaciones porcentuales anuales, redondeadas a dos decimales, de las cinco principales categorías de delitos menores desde 2008 en el total de crímenes de Londres, con cada año mostrado en una fila?","external_knowledge":null}
{"instance_id":"bq232","db":"london","question":"¿Podría proporcionar el número total de incidentes de 'Other Theft' dentro de la categoría 'Theft and Handling' para cada año en el distrito de Westminster?","external_knowledge":null}
{"instance_id":"bq228","db":"london","question":"Por favor, proporcione una lista de las tres principales categorías de crimen en el distrito de Barking y Dagenham, junto con el número de incidentes en cada categoría.","external_knowledge":null}
{"instance_id":"bq229","db":"open_images","question":"Utilizando el conjunto de datos bigquery-public-data.open_images, ¿puede proporcionar un recuento de cuántas URLs distintas de imágenes están categorizadas como 'cat' (donde la imagen tiene la etiqueta '/m/01yrx' con confianza=1) y cuántas URLs distintas de imágenes están categorizadas como 'other' (lo que significa que no tienen ninguna etiqueta de gato '/m/01yrx' en absoluto)?","external_knowledge":null}
{"instance_id":"bq230","db":"usda_nass_agriculture","question":"Usando el conjunto de datos crops, encuentra las cifras totales de producción de 2022, medidas en bushels, para maíz de la categoría 'FIELD CROPS' y champiñones del grupo 'HORTICULTURE' para cada estado de EE. UU. Solo incluye filas de datos donde 'statisticcat_desc' es 'PRODUCTION', 'agg_level_desc' es 'STATE', 'value' no es nulo, y asegúrate de que para maíz 'unit_desc' sea 'BU'. Combina ambos resultados para que los totales de 2022 de maíz y champiñones de cada estado se presenten.","external_knowledge":null}
{"instance_id":"bq326","db":"world_bank","question":"Con base en el conjunto de datos de población mundial y en el conjunto de datos de población de salud y nutrición del World Bank, ¿cuántos países experimentaron un aumento de más del 1% respecto al año anterior en 2018, tanto en su población total como en el gasto de salud corriente por habitante (PPP)?","external_knowledge":null}
{"instance_id":"bq424","db":"world_bank","question":"Enumera los 10 países con el mayor total de deuda externa a largo plazo, en orden descendente, excluyendo aquellos sin una región especificada.","external_knowledge":null}
{"instance_id":"bq327","db":"world_bank","question":"¿Cuántos indicadores de deuda para Rusia tienen un valor de 0, excluyendo valores NULL?","external_knowledge":null}
{"instance_id":"bq328","db":"world_bank","question":"¿Qué región tiene el valor mediano del PIB (constante en US$ de 2015)?","external_knowledge":null}
{"instance_id":"sf_bq331","db":"META_KAGGLE","question":"Encuentra a los tres usuarios que han escrito el primer mensaje en los temas del foro, clasificados en orden descendente por sus puntuaciones de mensajes, donde una puntuación de mensaje se define como el número de usuarios distintos que votaron en ese mensaje. Para cada uno de estos usuarios, proporciona su nombre de usuario y la diferencia absoluta entre su puntuación de mensaje y la puntuación promedio de todos los primeros mensajes en temas del foro.","external_knowledge":null}
{"instance_id":"sf_bq380","db":"META_KAGGLE","question":"Utilizando los datos de las tablas Forum Message Votes y Users, encuentra a los tres primeros usuarios que han recibido la mayor cantidad de votos positivos distintos en el foro Kaggle. Para cada uno de estos usuarios, enumera su nombre de usuario, el número total de votos positivos distintos que han recibido (basado en el campo ToUserId) y el número total de votos positivos distintos que han dado (basado en el campo FromUserId), ordenados por el número de votos positivos recibidos en orden descendente y limitados a solo los tres primeros resultados.","external_knowledge":null}
{"instance_id":"sf_bq370","db":"WIDE_WORLD_IMPORTERS","question":"¿Cuántos clientes tienen pedidos y facturas que coinciden a nivel de ítem de línea y, cuando se agregan, dan como resultado que cada cliente tenga una cantidad igual de pedidos y facturas, así como un valor total idéntico para los pedidos y las facturas?","external_knowledge":null}
{"instance_id":"sf_bq371","db":"WIDE_WORLD_IMPORTERS","question":"En el año 2013, considerando el valor total de cada factura como el producto del precio unitario y la cantidad, y agrupando por el trimestre (Q1, Q2, Q3, Q4) en el que ocurre la fecha de la factura, ¿cuál es la diferencia entre el valor promedio máximo y el valor promedio mínimo de las facturas a lo largo de estos trimestres?","external_knowledge":null}
{"instance_id":"sf_bq372","db":"WIDE_WORLD_IMPORTERS","question":"Entre todos los pedidos que no figuran en la tabla de facturas, para cada categoría de cliente calcule el valor máximo de pedido perdido, luego determine cuál es la categoría de cliente cuyo valor máximo de pedido perdido está más cercano al promedio general de estos valores máximos de pedido perdido entre todas las categorías?","external_knowledge":null}
{"instance_id":"sf_bq373","db":"WIDE_WORLD_IMPORTERS","question":"Usando la fecha de la factura para determinar cada mes del año 2014, y sumando los importes totales de las líneas de factura para cada cliente a lo largo de estos meses, ¿cuál es la mediana del gasto mensual promedio resultante entre todos los clientes?","external_knowledge":null}
{"instance_id":"bq393","db":"hacker_news","question":"Quiero identificar a los usuarios que tuvieron actividad seguida de inactividad. Específicamente, identifica el ID de usuario y su número de mes correspondiente (contando desde el mes de su primera actividad) para el usuario con el mayor número de meses que se volvió inactivo (sin actividad registrada) después de su último mes de actividad registrado. Para este análisis, solo considera datos hasta el 10 de septiembre de 2024 y asegúrate de que el número de mes represente la cantidad de meses transcurridos desde la primera actividad del usuario. El usuario debe haber tenido al menos un mes en el que se esperaba que estuviera activo (dentro de su intervalo de actividad), pero en realidad no hubo registros.","external_knowledge":null}
{"instance_id":"bq403","db":"irs_990","question":"¿Qué tres años entre 2012 y 2017 tienen la menor diferencia absoluta entre la mediana de los ingresos y la mediana de los gastos funcionales para las organizaciones que presentan los formularios IRS 990? Por favor, indique tres años y sus diferencias correspondientes.","external_knowledge":null}
{"instance_id":"bq397","db":"ecommerce","question":"Después de eliminar cualquier registro duplicado del conjunto de datos rev_transactions, identifique cada agrupación de canales que tenga transacciones de más de un país. Para cada agrupación de canales de ese tipo, identifique el país con el mayor número total de transacciones y reporte tanto el nombre del país como la suma de transacciones para esa agrupación de canales.","external_knowledge":null}
{"instance_id":"bq402","db":"ecommerce","question":"Calcule la tasa de conversión de visitantes únicos a compradores utilizando exclusivamente datos de la tabla `web_analytics` en el conjunto de datos `data-to-insights.ecommerce`. Un visitante se define como un `fullVisitorId` único presente en la tabla, mientras que un comprador es un visitante que tiene al menos una transacción registrada (`totals.transactions` no es nulo). La tasa de conversión se obtiene dividiendo el número de compradores únicos entre el número total de visitantes únicos. Además, calcule el número promedio de transacciones por comprador, considerando únicamente a aquellos visitantes que han realizado al menos una transacción.","external_knowledge":null}
{"instance_id":"sf_bq160","db":"META_KAGGLE","question":"Por favor proporciona la fecha de creación, el título, el título del foro padre, el recuento de respuestas, el recuento de respuestas de usuarios distintos, el total de votos positivos y las vistas para los primeros cinco temas del foro que pertenezcan a cualquier subforo bajo el foro padre titulado \"General\". El recuento de respuestas debe calcularse como el número total de mensajes asociados a cada tema, y el recuento de respuestas de usuarios distintos debe ser el número de usuarios únicos que han publicado mensajes en el tema. Los votos positivos deben calcularse como el total de votos positivos en todos los mensajes dentro de cada tema. Si alguno de los valores falta o es None, trátalo como cero.","external_knowledge":null}
{"instance_id":"sf_bq167","db":"META_KAGGLE","question":"Identifica el par de usuarios de Kaggle involucrados en ForumMessageVotes, de modo que un usuario haya dado al otro la mayor cantidad distinta de votos positivos, y además muestre cuántos votos positivos devolvió ese destinatario. Presenta los nombres de usuario de ambos usuarios, el total de votos positivos distintos que uno recibió del otro y los votos positivos que ellos devolvieron, ordenando por el recuento más alto recibido y luego por el recuento más alto dado, y muestra solo el mejor resultado.","external_knowledge":null}
{"instance_id":"sf_bq171","db":"META_KAGGLE","question":"¿De quién son los votos positivos de los mensajes del Foro más cercanos al promedio en 2019? Si hay empate, dime el usuario cuyo nombre de usuario sea el primero alfabéticamente.","external_knowledge":null}
{"instance_id":"sf_bq118","db":"DEATH","question":"Entre individuos identificados como blancos, ¿cuánto mayor es el promedio de muertes de los códigos ICD-10 cuyas descripciones contienen la palabra “discharge” (excluyendo específicamente “Urethral discharge,” “Discharge of firework,” y “Legal intervention involving firearm discharge”) en comparación con el promedio de muertes de los códigos ICD-10 cuyas descripciones contienen la palabra “vehicle,” cuando se agrupan por grupos de edad?","external_knowledge":null}
{"instance_id":"sf_bq072","db":"DEATH","question":"Por favor, proporcione, para cada edad de 12 a 18 años (incluidas), el número total de muertes y el número de muertes entre individuos identificados como negro (basado en descripciones de raza que contienen la palabra 'negro'), específicamente para muertes asociadas con códigos ICD-10 cuyas descripciones incluyen la palabra 'vehículo' y para muertes asociadas con códigos ICD-10 cuyas descripciones incluyen la palabra 'arma de fuego'. Utilice la tabla EntityAxisConditions para determinar qué códigos ICD-10 estuvieron involucrados en cada muerte, en lugar de unir la información del código ICD-10 directamente en los registros de muertes.","external_knowledge":null}
{"instance_id":"ga001","db":"ga4","question":"Quiero conocer las preferencias de los clientes que compraron el Google Navy Speckled Tee en diciembre de 2020. ¿Qué otro producto fue comprado con la mayor cantidad total junto a este artículo?","external_knowledge":null}
{"instance_id":"ga002","db":"ga4","question":"Dime cuáles son los otros productos más vendidos y sus cantidades por parte de los clientes que compraron Google Red Speckled Tee cada mes durante los tres meses a partir de noviembre de 2020.","external_knowledge":null}
{"instance_id":"ga003","db":"firebase","question":"Estoy tratando de evaluar qué tipos de tableros fueron los más efectivos el 15 de septiembre de 2018. ¿Puedes averiguar los puntajes promedio para cada tipo de tablero a partir de las finalizaciones del modo de juego rápido en ese día?","external_knowledge":null}
{"instance_id":"ga004","db":"ga4","question":"¿Puedes calcular la diferencia promedio de páginas vistas entre los usuarios que compraron algo y aquellos que no lo hicieron en diciembre de 2020? Simplemente etiqueta a cualquiera que haya estado involucrado en eventos de compra como comprador.","external_knowledge":null}
{"instance_id":"ga008","db":"ga4","question":"¿Podrías proporcionar el número total de vistas de página para cada día en noviembre de 2020, así como el promedio de vistas de página por usuario en esos días, limitado a los usuarios que realizaron al menos una compra en noviembre de 2020?","external_knowledge":null}
{"instance_id":"ga017","db":"ga4","question":"¿Cuántos usuarios distintos visitaron la página más visitada durante enero de 2021?","external_knowledge":null}
{"instance_id":"ga007","db":"ga4","question":"Por favor, averigüe qué porcentaje de las vistas de página en January 2, 2021, fueron para páginas tipo PDP.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga013","db":"ga4","question":"Quiero saber todas las páginas visitadas por el usuario 1402138.5184246691 on January 2, 2021. Por favor muestre los nombres de estas páginas y ajuste los nombres a PDP o PLP cuando sea necesario.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga018","db":"ga4","question":"El 2 de enero de 2021, quiero determinar el porcentaje de veces que los usuarios pasan de una vista de la lista de productos (PLP) a una vista de la página de detalle del producto (PDP) dentro de la misma sesión, utilizando solo los eventos page_view. ¿Podrías calcular cuántas vistas de PLP llevaron eventualmente a una vista de PDP en la misma sesión en esa fecha y, a continuación, proporcionar el porcentaje resultante de las transiciones PLP a PDP?","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga032","db":"ga4","question":"¿Puedes generar el flujo de navegación para el usuario con pseudo_id '1362228.4966015575' en January 28th 2021, mostrando solo los eventos page_view? Por favor, conecta los títulos de las páginas con '>>' entre cada paso, convierte las páginas de detalle de producto a 'PDP' y las páginas de listado de productos a 'PLP' según la estructura de URL, y fusiona las páginas adyacentes idénticas para que aparezcan solo una vez en la secuencia. Necesito entender cómo navegó este usuario específico por nuestro sitio web ese día.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga031","db":"ga4","question":"Quiero conocer la tasa de conversión de sesiones de usuario el 2 de enero de 2021, usando solo eventos 'page_view'. La tasa de conversión debe calcularse como el porcentaje de visitas de usuario que alcanzaron tanto la página de Inicio como la página de Confirmación de Compra en una sola sesión, en relación con aquellas que llegaron a la página de Inicio.","external_knowledge":null}
{"instance_id":"ga006","db":"ga4","question":"Para el rango de fechas del 1 al 30 de noviembre de 2020, ¿puedes recuperar cada user_pseudo_id y su ingreso promedio por compra en USD por sesión para usuarios que hayan tenido más de una sesión de compra, considerando solo eventos con event_name='purchase' y un ecommerce.purchase_revenue_in_usd no nulo, agrupando las sesiones por el ga_session_id de event_params","external_knowledge":null}
{"instance_id":"ga009","db":"ga4","question":"¿Podrías decirme el promedio de sesiones con interacción por usuario para diciembre de 2020, contando solo aquellas sesiones en las que el parámetro del evento 'session_engaged' es igual a '1' y utilizando 'user_pseudo_id' junto con el 'ga_session_id' para identificar sesiones distintas?","external_knowledge":null}
{"instance_id":"ga010","db":"ga4","question":"¿Puedes darme un resumen del tráfico de nuestro sitio web para diciembre de 2020? Me interesa especialmente el canal con el cuarto mayor número de sesiones.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga014","db":"ga4","question":"¿Puede proporcionar el número total de sesiones para cada canal de tráfico en diciembre de 2020, utilizando la información de 'event_params'?","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga011","db":"ga4","question":"¿Cuál es la página con la segunda mayor cantidad de vistas de página totales, después de limpiar su URL (eliminando barras dobles) y de extraer la ruta de página correcta, en el sitio web 'shop.googlemerchandisestore.com' durante diciembre de 2020?","external_knowledge":null}
{"instance_id":"ga012","db":"ga4","question":"El 30 de noviembre de 2020, identifique la categoría de artículo con la tasa de impuesto más alta dividiendo el valor del impuesto en USD entre los ingresos por compra en USD para eventos de compra, y luego recupere los IDs de transacción, las cantidades totales de artículos y tanto los ingresos por compra en USD como los ingresos por compra para esos eventos de compra en esa categoría de tasa de impuesto más alta.","external_knowledge":null}
{"instance_id":"ga019","db":"firebase","question":"¿Podrías determinar qué porcentaje de usuarios que no desinstalaron nuestra app dentro de los siete días o que nunca la desinstalaron después de instalarla durante agosto y septiembre de 2018?","external_knowledge":null}
{"instance_id":"ga030","db":"firebase","question":"¿Puede agrupar a los usuarios por la semana de inicio de su primera sesión, empezando desde July 2, 2018? Para cada grupo, calcule la tasa de retención en la cuarta semana (es decir, el porcentaje de usuarios del grupo original que regresaron en la cuarta semana después de su primera sesión). Por favor identifique la cohorte con la tasa de retención más alta en la cuarta semana y nombre el grupo por la fecha del lunes de la semana de inicio de la primera sesión de la cohorte. Devuelva el resultado en el formato \"YYYY-MM-DD\".","external_knowledge":"retention_rate.md"}
{"instance_id":"ga005","db":"firebase","question":"Realice un análisis de cohorte semanal para la retención de usuarios, a partir de July 9, 2018 y terminando el October 2, 2018. Agrupe a los usuarios por la semana de su primer evento session_start (con las semanas que comienzan el lunes), y identifique a los nuevos usuarios como aquellos para los cuales event_date coincide con la fecha de su user_first_touch_timestamp. Calcule la tasa de retención de la Semana 2 para cada cohorte semanal, definida como el porcentaje de usuarios que tuvieron un evento session_start exactamente 2 semanas después de su primera semana. Solo incluya cohortes desde July 9, 2018 hasta September 17, 2018 (la última cohorte que puede analizarse para la retención de 2 semanas, dada la disponibilidad de datos). Presente los resultados con cada cohorte semanal y su correspondiente tasa de retención de la Semana 2, ordenados por la fecha de la cohorte.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga028","db":"firebase","question":"Por favor, realice un análisis de retención de 7 días para los usuarios que iniciaron su primera sesión en la app durante la semana que comienza el 2 de julio de 2018. Para cada semana desde Semana 0 (la semana de su primera sesión) hasta Semana 4, proporcione el número total de nuevos usuarios en Semana 0 y el número de usuarios retenidos para cada semana posterior. Asegúrese de contar solo los eventos hasta el 2 de octubre de 2018 y agrupar las fechas por semanas que comienzan los lunes.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga020","db":"firebase","question":"¿Qué tipo de evento de quickplay tuvo la tasa de retención de usuarios más baja durante la segunda semana después de su compromiso inicial, para los usuarios que se involucraron por primera vez entre el 1 y el 15 de agosto de 2018, medido por la presencia de eventos session_start?","external_knowledge":"retention_rate.md"}
{"instance_id":"ga021","db":"firebase","question":"¿Cuál es la tasa de retención de los usuarios dos semanas después de su evento inicial de quickplay, calculada por separado para cada tipo de evento de quickplay, dentro del periodo desde July 2, 2018, hasta July 16, 2018? Por favor, concéntrese en los usuarios que iniciaron una sesión (session_start) durante este periodo.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga022","db":"firebase","question":"¿Podrías ayudarme a obtener la tasa de retención semanal de clientes en septiembre de 2018 para los nuevos clientes que usaron nuestra aplicación por primera vez (evento first_open) dentro de la primera semana que comienza el 1 de septiembre de 2018 (zona horaria de Shanghai)? Las tasas de retención deben cubrir las semanas 1, 2 y 3 del periodo posterior al uso inicial y mostrarlas en formato de columna.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga025","db":"firebase","question":"Para todos los usuarios que abrieron la aplicación por primera vez en septiembre de 2018 y luego se desinstalaron dentro de siete días, quiero saber qué porcentaje de ellos experimentó un fallo de la aplicación (app_exception). El cálculo debe realizarse convirtiendo primero las marcas de tiempo a fechas, y luego calculando los días hasta la desinstalación basándose en las fechas. Solo se deben considerar en el porcentaje final los usuarios que se desinstalaron dentro de 7 días y experimentaron un fallo.","external_knowledge":null}
{"instance_id":"local002","db":"E_commerce","question":"¿Puedes calcular la media móvil simétrica de 5 días de las ventas de juguetes previstas para el periodo del 5 al 8 de diciembre de 2018, utilizando datos de ventas diarios desde el 1 de enero de 2017 hasta el 29 de agosto de 2018, con un modelo de regresión lineal simple? Finalmente proporciona la suma de esas cuatro medias móviles de 5 días?","external_knowledge":null}
{"instance_id":"local003","db":"E_commerce","question":"Según el documento de definición de RFM, calcule la venta promedio por pedido para cada cliente dentro de segmentos RFM distintos, considerando solo pedidos 'entregados'. Utilice el identificador único del cliente. Defina claramente cómo calcular la Recencia basándose en la marca de tiempo de la última compra y especifique los criterios para clasificar los segmentos RFM. La venta promedio debe calcularse como el gasto total dividido por el número total de pedidos. Por favor, analice e informe las diferencias en las ventas promedio entre los segmentos RFM.","external_knowledge":"RFM.md"}
{"instance_id":"local004","db":"E_commerce","question":"¿Podría decirme el número de pedidos, el pago medio por pedido y la duración de la relación con el cliente en semanas de los 3 clientes con el pago medio por pedido más alto, donde la duración se calcula restando la fecha de la compra más temprana de la fecha de la compra más tardía en días, dividiendo entre siete, y si el resultado es menor que siete días, asignándolo a 1.0?","external_knowledge":null}
{"instance_id":"local007","db":"Baseball","question":"¿Podrías ayudarme a calcular el promedio de la duración de una carrera en años para todos los jugadores de béisbol? Por favor, precise el resultado como un número de punto flotante. Primero, calcule la diferencia en años, meses y días entre las fechas de debut y el último partido. Para cada jugador, la duración de la carrera se calcula como la suma del valor absoluto de los años, más el valor absoluto de los meses dividido entre 12, más el valor absoluto de los días dividido entre 365. Redondee cada parte a dos decimales antes de sumar. Por último, promedie las duraciones de la carrera y redondee el resultado a un número de punto flotante.","external_knowledge":null}
{"instance_id":"local008","db":"Baseball","question":"Me gustaría conocer los nombres de pila de los jugadores de béisbol que han alcanzado el valor más alto en juegos disputados, carreras, hits y jonrones, junto con sus valores de puntuación correspondientes.","external_knowledge":null}
{"instance_id":"local009","db":"Airlines","question":"¿Cuál es la distancia de la ruta más larga en la que Abakan sea la ciudad de salida o de destino (en kilómetros)?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local010","db":"Airlines","question":"Distribuya todos los pares únicos de ciudades en los rangos de distancia 0, 1000, 2000, 3000, 4000, 5000 y 6000+, basándose en su distancia promedio de todas las rutas entre ellas. Luego, ¿cuántos pares hay en el rango de distancia con la menor cantidad de pares únicos de ciudades?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local015","db":"California_Traffic_Collision","question":"Por favor calcule la tasa de letalidad para colisiones de motocicletas, separadas por el uso de casco. Específicamente, calcule dos porcentajes: 1) el porcentaje de fallecimientos de motociclistas en colisiones donde las partes (conductores o pasajeros) llevaban casco puesto, y 2) el porcentaje de fallecimientos de motociclistas en colisiones donde las partes no llevaban casco. Para cada grupo, calcule esto dividiendo el número total de fallecimientos de motociclistas entre el número total de colisiones que involucraron a ese grupo. Use la tabla parties para determinar el uso del casco (a partir de los campos party_safety_equipment).","external_knowledge":null}
{"instance_id":"local017","db":"California_Traffic_Collision","question":"¿En qué año fueron diferentes las dos causas más comunes de los accidentes de tráfico respecto a las de otros años?","external_knowledge":null}
{"instance_id":"local018","db":"California_Traffic_Collision","question":"Para la categoría de infracción del factor de colisión primaria que fue la causa más frecuente de accidentes de tráfico en 2021, ¿en cuántos puntos porcentuales disminuyó su participación en los incidentes viales anuales en 2021 en comparación con su participación en 2011?","external_knowledge":null}
{"instance_id":"local019","db":"WWE","question":"Para el título de NXT que tuvo el combate más corto (excluyendo títulos con \"title change\"), ¿cuáles eran los nombres de los dos luchadores involucrados?","external_knowledge":null}
{"instance_id":"local026","db":"IPL","question":"Por favor, ayúdame a identificar a los 3 mejores lanzadores que, en los overs en los que se concedieron la mayor cantidad de carreras en cada partido, concedieron la mayor cantidad de carreras en un solo over a lo largo de todos los partidos. Para cada uno de estos lanzadores, proporciona el partido en el que concedieron estas carreras máximas. Solo considera los overs que tuvieron la mayor cantidad de carreras concedidas dentro de sus respectivos partidos, y entre estos, determina qué lanzadores concedieron la mayor cantidad de carreras en un solo over en conjunto.","external_knowledge":null}
{"instance_id":"local020","db":"IPL","question":"¿Qué lanzador tiene el menor promedio de bolos por wicket tomado?","external_knowledge":null}
{"instance_id":"local021","db":"IPL","question":"¿Podrías calcular el promedio de las carreras totales anotadas por todos los bateadores que hayan anotado más de 50 carreras en un único partido?","external_knowledge":null}
{"instance_id":"local022","db":"IPL","question":"Obtenga los nombres de los jugadores que anotaron al menos 100 carreras en un partido mientras jugaban para el equipo que perdió ese partido.","external_knowledge":null}
{"instance_id":"local023","db":"IPL","question":"Por favor, ayúdame a encontrar los nombres de los 5 jugadores con el promedio más alto de carreras por partido en la temporada 5, junto con sus promedios de bateo.","external_knowledge":null}
{"instance_id":"local024","db":"IPL","question":"¿Podrías ayudarme a encontrar los 5 países cuyos jugadores tienen los promedios más altos de sus promedios individuales de carreras por partido a lo largo de todas las temporadas? Específicamente, para cada jugador, calcule su promedio de carreras por partido en todos los partidos que disputaron, luego calcule el promedio de estos promedios de jugadores para cada país, y que estos promedios de bateo por país aparezcan en el resultado.","external_knowledge":null}
{"instance_id":"local025","db":"IPL","question":"Para cada partido, considerando cada innings, por favor combine las carreras anotadas por ambos bateadores y las carreras extras para cada over, luego identifique el único over con el mayor total de carreras, obtenga el lanzador para ese over desde la ball by ball table, y calcule el promedio de estos totales máximos de over entre todos los partidos, asegurando que todas las carreras y los detalles del lanzador se reflejen con precisión.","external_knowledge":null}
{"instance_id":"local028","db":"Brazilian_E_Commerce","question":"¿Podría generar un informe que muestre el número de pedidos entregados para cada mes en los años 2016, 2017 y 2018? Cada columna representa un año y cada fila representa un mes.","external_knowledge":null}
{"instance_id":"local031","db":"Brazilian_E_Commerce","question":"¿Cuál es el mayor volumen mensual de pedidos entregados en el año con el menor volumen anual de pedidos entregados entre 2016, 2017 y 2018?","external_knowledge":null}
{"instance_id":"local029","db":"Brazilian_E_Commerce","question":"Por favor identifique a los tres clientes principales, basándose en su customer_unique_id, que tienen el mayor número de pedidos entregados, y proporcione el valor medio de pago, la ciudad y el estado para cada uno de estos clientes.","external_knowledge":null}
{"instance_id":"local030","db":"Brazilian_E_Commerce","question":"Entre todas las ciudades con pedidos entregados, encuentre las cinco ciudades cuyas sumas de pagos son las más bajas, luego calcule el promedio de sus pagos totales y el promedio del número total de pedidos entregados.","external_knowledge":null}
{"instance_id":"local032","db":"Brazilian_E_Commerce","question":"¿Podrías ayudarme a encontrar a los vendedores que se destaquen en las siguientes categorías, considerando solo los pedidos entregados: el vendedor con la mayor cantidad de DISTINCT IDs de cliente, el vendedor con la mayor ganancia (calculada como precio menos valor de flete), el vendedor con la mayor cantidad de DISTINCT pedidos y el vendedor con la mayor cantidad de valoraciones de 5 estrellas? Para cada categoría, por favor proporciona el ID del vendedor y el valor correspondiente, etiquetando cada fila con una descripción del logro.","external_knowledge":null}
{"instance_id":"local034","db":"Brazilian_E_Commerce","question":"¿Podrías ayudarme a calcular el promedio del total de pagos realizados utilizando el método de pago más preferido para cada categoría de producto, donde el método de pago más preferido en una categoría es aquel con el mayor número de pagos?","external_knowledge":null}
{"instance_id":"local037","db":"Brazilian_E_Commerce","question":"Identifica las tres principales categorías de productos cuyas formas de pago más utilizadas registran el mayor número de pagos entre todas las categorías, y especifica el número de pagos realizados en cada categoría utilizando ese tipo de pago.","external_knowledge":null}
{"instance_id":"local035","db":"Brazilian_E_Commerce","question":"En la tabla “olist_geolocation”, por favor identifique cuáles son las dos ciudades consecutivas, cuando se ordenan por geolocation_state, geolocation_city, geolocation_zip_code_prefix, geolocation_lat y geolocation_lng, que tengan la mayor distancia entre ellas basada en la diferencia de distancia calculada entre cada ciudad y su predecesor inmediato en ese orden.","external_knowledge":"spherical_law.md"}
{"instance_id":"local038","db":"Pagila","question":"¿Podrías ayudarme a determinar qué actor protagonizó con mayor frecuencia en películas infantiles en inglés que fueron clasificadas como G o PG, con una duración de 120 minutos o menos, y que fueron estrenadas entre 2000 y 2010? Por favor, proporciona el nombre completo del actor.","external_knowledge":null}
{"instance_id":"local039","db":"Pagila","question":"Por favor, ayúdame a encontrar la categoría de películas con las horas totales de alquiler más altas en ciudades donde el nombre de la ciudad empieza con \"A\" o contiene un guion.","external_knowledge":null}
{"instance_id":"local040","db":"modern_data","question":"En el conjunto de datos combinado que unifica los datos de árboles con los datos de ingresos por código ZIP, rellenando los valores ZIP faltantes cuando sea necesario, ¿qué tres distritos, restringidos a registros con ingreso mediano y ingreso medio, ambos mayores que cero y con un nombre de distrito válido, contienen el mayor número de árboles, y cuál es el ingreso medio para cada uno de estos tres distritos?","external_knowledge":null}
{"instance_id":"local041","db":"modern_data","question":"¿Qué porcentaje de árboles en el Bronx tienen un estado de salud bueno?","external_knowledge":null}
{"instance_id":"local049","db":"modern_data","question":"¿Puedes ayudarme a calcular el promedio del número de nuevas empresas unicornio por año en la industria principal entre 2019 y 2021?","external_knowledge":null}
{"instance_id":"local054","db":"chinook","question":"¿Podrías decirme los nombres de pila de los clientes que gastaron menos de $1 en álbumes del artista más vendido, junto con las cantidades que gastaron?","external_knowledge":null}
{"instance_id":"local055","db":"chinook","question":"Identifica al artista con las ventas totales de álbumes más altas (los empates se resuelven por orden alfabético) y al artista con las ventas totales de álbumes más bajas (los empates se resuelven por orden alfabético), luego calcula la cantidad que cada cliente gastó específicamente en los álbumes de esos dos artistas. A continuación, calcula el gasto promedio de los clientes que compraron al artista de mayores ventas y el gasto promedio de los clientes que compraron al artista de menores ventas, y finalmente devuelve la diferencia absoluta entre estos dos promedios.","external_knowledge":null}
{"instance_id":"local198","db":"chinook","question":"Utilizando los datos de ventas, ¿cuál es la mediana de las ventas totales realizadas en los países donde el número de clientes es mayor que 4?","external_knowledge":null}
{"instance_id":"local056","db":"sqlite-sakila","question":"¿Qué cliente tiene el mayor cambio promedio mensual en los importes de pago? Proporcione el nombre completo del cliente.","external_knowledge":null}
{"instance_id":"local058","db":"education_business","question":"¿Puede proporcionar una lista de segmentos de productos de hardware junto con sus recuentos únicos de productos para 2020 en la salida, ordenada por el mayor incremento porcentual en los productos de ventas de hechos únicos desde 2020 hasta 2021?","external_knowledge":null}
{"instance_id":"local059","db":"education_business","question":"Para el año calendario 2021, ¿cuál es el promedio general de la cantidad vendida de los tres productos de hardware más vendidos (por cantidad total vendida) en cada división?","external_knowledge":null}
{"instance_id":"local060","db":"complex_oracle","question":"En los Estados Unidos, para Q4 2019 y Q4 2020, primero seleccione solo aquellas ciudades cuyas ventas totales (sin promociones) hayan aumentado al menos un 20% desde Q4 2019 hasta Q4 2020. Entre estas ciudades, clasifique los productos por sus ventas totales (aún sin promociones) en esos trimestres y tome los 20% superiores. Luego calcule la participación de cada producto de los 20% superiores en las ventas totales en Q4 2019 y Q4 2020 y calcule la diferencia de participación desde Q4 2019 a Q4 2020, devolviendo los resultados en orden descendente de ese cambio de participación.","external_knowledge":null}
{"instance_id":"local063","db":"complex_oracle","question":"Entre todos los productos vendidos en los Estados Unidos con promo_id=999, considerando únicamente aquellas ciudades cuyas ventas aumentaron al menos un 20% desde el cuarto trimestre de 2019 (calendar_quarter_id=1772) hasta el cuarto trimestre de 2020 (calendar_quarter_id=1776), ¿qué producto que ocupa el 20% superior de las ventas totales tiene el menor cambio en puntos porcentuales de su participación de las ventas totales entre estos dos trimestres?","external_knowledge":null}
{"instance_id":"local061","db":"complex_oracle","question":"¿Cuál es la venta promedio proyectada mensual en USD para Francia en 2021, considerando solo las ventas de productos con promociones donde promo_total_id = 1 y en los canales donde channel_total_id = 1, tomando las ventas mensuales de cada producto de 2019 y 2020, calculando la tasa de crecimiento de 2019 a 2020 para ese mismo producto y mes, aplicando esta tasa de crecimiento para proyectar las ventas mensuales de 2021, convirtiendo todas las cantidades proyectadas de 2021 a USD con los tipos de cambio de 2021, y finalmente promediándolas y listándolas por mes?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local050","db":"complex_oracle","question":"¿Cuál es la mediana de las ventas mensuales promedio proyectadas en USD para Francia en 2021, calculada utilizando los datos de ventas mensuales de 2019 y 2020 (filtrados por promo_total_id=1 y channel_total_id=1), aplicando la tasa de crecimiento de 2019 a 2020 para proyectar 2021, convirtiéndolas a USD según la tabla de divisas, y luego determinando los promedios mensuales antes de encontrar su mediana?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local062","db":"complex_oracle","question":"Por favor, agrupe a todos los clientes italianos en diez intervalos para diciembre de 2021 sumando sus ganancias de todos los productos comprados (donde la ganancia se calcula como quantity_sold multiplicado por la diferencia entre unit_price y unit_cost), luego divida el rango total de las ganancias mensuales en diez intervalos iguales. Para cada intervalo, proporcione el número de clientes e identifique las ganancias totales mínimas y máximas dentro de ese intervalo.","external_knowledge":null}
{"instance_id":"local067","db":"complex_oracle","question":"¿Puede proporcionar las ganancias más altas y las más bajas para los clientes italianos, segmentados en diez tramos distribuidos de forma uniforme basados en sus ganancias por ventas de diciembre de 2021?","external_knowledge":null}
{"instance_id":"local070","db":"city_legislation","question":"Por favor, examine nuestros registros de la base de datos de ciudades chinas (country_code_2 = 'cn') durante julio de 2021 e identifique tanto la racha más corta como la más larga de entradas de fechas consecutivas. Para cada fecha en estas rachas, devuelva exactamente un registro por fecha junto con el nombre de la ciudad correspondiente. En su salida, asegúrese de que la primera letra de cada nombre de ciudad esté en mayúscula y el resto en minúscula. Muestre las fechas y los nombres de las ciudades para tanto las rachas de fechas consecutivas más cortas como las más largas, ordenadas por fecha.","external_knowledge":null}
{"instance_id":"local071","db":"city_legislation","question":"¿Podría revisar nuestros registros en junio de 2022 y identificar qué países tienen la racha más larga de fechas consecutivas de ciudades insertadas? Por favor, enumere los códigos de país de 2 letras de estos países.","external_knowledge":null}
{"instance_id":"local072","db":"city_legislation","question":"Identifica el país con datos insertados en nueve días diferentes en enero de 2022. Luego, encuentra el período consecutivo más largo con inserciones de datos para este país durante enero de 2022, y calcula la proporción de entradas que provienen de su ciudad capital dentro de este período de inserciones consecutivas más largo.","external_knowledge":null}
{"instance_id":"local068","db":"city_legislation","question":"Calcule el número de nuevas ciudades insertadas en abril, mayo y junio para cada año de 2021 a 2023. Para cada mes, calcule el total acumulado de ciudades añadidas para ese mes específico a lo largo de los años hasta e incluyendo el año dado (es decir, sume los recuentos de ese mes a lo largo de los años). Además, calcule los porcentajes de crecimiento interanual tanto para el total mensual como para el total acumulado de cada mes, comparando cada año con el año anterior. Presente los resultados únicamente para 2022 y 2023, indicando el año, el mes, el número total de ciudades añadidas en ese mes, el total acumulado para ese mes y los porcentajes de crecimiento interanual tanto para el total mensual como para el total acumulado. Utilice los datos de 2021 únicamente como base para calcular los crecimientos y exclúyalos del resultado final.","external_knowledge":null}
{"instance_id":"local073","db":"modern_data","question":"Para cada pedido de pizza, proporcione una única fila de resultado con el ID de fila, el ID de pedido, el ID de cliente, el nombre de la pizza y el conjunto final de ingredientes. Los ingredientes finales se determinan partiendo de las coberturas estándar de la receta de la pizza, eliminando las coberturas excluidas y añadiendo las coberturas extra. Presente los ingredientes en una cadena que comience con el nombre de la pizza seguido de ': ', con los ingredientes listados en orden alfabético. Los ingredientes que aparezcan varias veces (p. ej., de coberturas estándar y extra) deben ir precedidos de '2x' y listados primero, seguidos de ingredientes de ocurrencia única, ambos en orden alfabético. Group by ID de fila, ID de pedido, nombre de la pizza y hora del pedido para asegurar que cada pedido aparezca una vez. Ordene los resultados por el ID de fila en orden ascendente. Asigne pizza_id 1 a las pizzas 'Meatlovers' y pizza_id 2 a todas las demás.","external_knowledge":null}
{"instance_id":"local066","db":"modern_data","question":"Con base en nuestra información de pedidos de pizzas de los clientes, resuma la cantidad total de cada ingrediente utilizado en las pizzas que entregamos. Muestre el nombre y la cantidad de cada ingrediente.","external_knowledge":null}
{"instance_id":"local065","db":"modern_data","question":"Calcule los ingresos totales de las pizzas Meat Lovers con precio de $12 y pizzas Vegetarian a $10. Incluya cualquier topping extra cobrado a $1 cada uno. Asegúrese de que los pedidos cancelados estén filtrados. ¿Cuánto dinero ha ganado en total Pizza Runner?","external_knowledge":null}
{"instance_id":"local074","db":"bank_sales_trading","question":"Por favor genere un resumen de los saldos de cierre al final de cada mes para las transacciones de cada cliente, muestre los cambios mensuales y los saldos acumulados mensuales de la cuenta bancaria. Asegúrese de que, incluso si un cliente no tiene actividad en la cuenta en un mes dado, el saldo de ese mes también se incluya en la salida.","external_knowledge":null}
{"instance_id":"local064","db":"bank_sales_trading","question":"Para cada cliente y cada mes de 2020, primero calcule el saldo de fin de mes sumando todos los montos de depósito y restando todos los montos de retiro que ocurrieron durante ese mes específico. Luego determine cuál mes de 2020 tiene el mayor número de clientes con un saldo de fin de mes positivo y cuál mes tiene el menor número. Para cada uno de estos dos meses, calcule el saldo promedio de fin de mes entre todos los clientes y proporcione la diferencia entre estos dos promedios","external_knowledge":null}
{"instance_id":"local297","db":"bank_sales_trading","question":"Para cada cliente, agrupe todos los depósitos y retiros por el primer día de cada mes para obtener un monto neto mensual, luego calcule el saldo de cierre de cada mes sumando acumulativamente estos montos netos mensuales. A continuación, determine la tasa de crecimiento del mes más reciente comparando su saldo de cierre con el del mes anterior, tratando los depósitos como positivos y los retiros como negativos, y si el saldo del mes anterior es cero, la tasa de crecimiento debe ser el saldo del mes actual multiplicado por 100. Finalmente, calcule el porcentaje de clientes cuyo mes más reciente muestra una tasa de crecimiento superior al 5%.","external_knowledge":null}
{"instance_id":"local298","db":"bank_sales_trading","question":"Para cada mes, calcule el saldo total de todos los usuarios para el mes anterior (medido a partir del 1 de cada mes), sustituyendo cualquier saldo negativo por cero. Asegúrese de que los datos del primer mes se utilicen únicamente como referencia para calcular el saldo total anterior, y exclúyalos del resultado final. Ordene los resultados en orden ascendente por mes.","external_knowledge":null}
{"instance_id":"local299","db":"bank_sales_trading","question":"Para una base de datos bancaria con transacciones de clientes, calcule el saldo diario acumulado de cada cliente (donde los depósitos aumentan el saldo y otros tipos de transacciones lo restan). Para cada cliente y cada día, calcule el promedio móvil de 30 días del saldo (solo después de contar con 30 días de datos, y tratando los promedios negativos como cero). Luego agrupe estos promedios diarios por mes y encuentre el saldo promedio móvil de 30 días máximo de cada cliente dentro de cada mes. Sume estos valores máximos entre todos los clientes para cada mes. Considere el primer mes del historial de transacciones de cada cliente como el período base y exclúyalo de los resultados finales, presentando totales mensuales de estos valores máximos de 30 días sumados.","external_knowledge":null}
{"instance_id":"local300","db":"bank_sales_trading","question":"Para cada cliente, calcule sus saldos diarios para cada día entre sus fechas de transacción más temprana y más reciente, incluyendo los días sin transacciones al llevar hacia adelante el saldo del día anterior. Trate cualquier saldo diario negativo como cero. Luego, para cada mes, determine el saldo diario más alto que cada cliente tuvo durante ese mes. Finalmente, para cada mes, sume estos saldos diarios máximos entre todos los clientes para obtener un total mensual.","external_knowledge":null}
{"instance_id":"local075","db":"bank_sales_trading","question":"¿Puedes proporcionar un desglose de cuántas veces se visualizó cada producto, cuántas veces se añadieron al carrito de compras y cuántas veces se dejaron en el carrito sin ser comprado? Además, dime el recuento de compras reales para cada producto. Asegúrate de que los productos con un ID de página en (1, 2, 12, 13) sean filtrados.","external_knowledge":null}
{"instance_id":"local077","db":"bank_sales_trading","question":"Por favor analice nuestros datos de interés desde septiembre de 2018 hasta agosto de 2019. Para cada mes, calcule la composición promedio de cada interés dividiendo la composición por el valor del índice. Identifique el interés con el valor de composición promedio más alto de cada mes y reporte su composición promedio como la composición máxima del índice para ese mes. Calcule la media móvil de tres meses de estas composiciones máximas mensuales del índice. Asegúrese de que la salida incluya la fecha, el nombre del interés, la composición máxima del índice para ese mes, la media móvil y los nombres y las composiciones máximas del índice de los intereses principales de hace un mes y de hace dos meses.","external_knowledge":null}
{"instance_id":"local078","db":"bank_sales_trading","question":"Identifica las 10 categorías de interés superiores y las 10 inferiores basadas en sus valores de composición más altos a lo largo de todos los meses. Para cada categoría, muestra el tiempo (MM-YYYY), el nombre de interés y el valor de la composición","external_knowledge":null}
{"instance_id":"local081","db":"northwind","question":"Considerando únicamente a los clientes que realizaron pedidos en 1998, calcule el importe total que cada cliente gastó sumando el precio unitario multiplicado por la cantidad de todos los productos en sus pedidos, excluyendo cualquier descuento. Asigne a cada cliente a un grupo de gasto basado en los umbrales de gasto de los clientes, y determine cuántos clientes hay en cada grupo de gasto y qué porcentaje del número total de clientes que realizaron pedidos en 1998 representa cada grupo.","external_knowledge":null}
{"instance_id":"local085","db":"northwind","question":"Entre los empleados que tienen más de 50 pedidos totales, ¿cuáles tres tienen el mayor porcentaje de pedidos atrasados, donde se considera que un pedido está atrasado si la fecha de envío es igual o posterior a su fecha requerida? Por favor, enumere el ID de cada empleado, el número de pedidos atrasados y el porcentaje correspondiente de pedidos atrasados.","external_knowledge":null}
{"instance_id":"local096","db":"Db-IMDB","question":"Para cada año, calcule el porcentaje de películas que tuvieron actores exclusivamente femeninos (lo que significa sin actores masculinos y sin actores con género desconocido/no especificado). Considere a los actores cuyo género esté marcado como 'Male' o 'None' como no femeninos. Para los resultados, muestre el año, el número total de películas en ese año y el porcentaje de películas con actores exclusivamente femeninos. Extraiga el año del campo Movie.year tomando los últimos 4 caracteres y convirtiéndolos en un número.","external_knowledge":null}
{"instance_id":"local097","db":"Db-IMDB","question":"¿Podrías analizar nuestros datos e identificar qué periodo de diez años, a partir de cualquier año de estreno de película presente en los datos, tuvo la mayor cantidad de películas, considerando periodos consecutivos de diez años que comienzan en cada año único? Solo muestra el año de inicio y la cantidad total para ese periodo específico.","external_knowledge":null}
{"instance_id":"local098","db":"Db-IMDB","question":"Desde el primer año en que cada actor apareció en una película hasta el último año, ¿cuántos actores en la base de datos nunca han tenido una brecha mayor de tres años consecutivos sin al menos una aparición en una nueva película, lo que significa que no existe ningún periodo de cuatro años en ninguna parte de su carrera activa sin al menos un crédito cinematográfico?","external_knowledge":null}
{"instance_id":"local099","db":"Db-IMDB","question":"Necesito que analices las colaboraciones entre actores y me digas cuántos actores han hecho más películas con Yash Chopra que con cualquier otro director. Esto nos ayudará a entender mejor su influencia en la industria.","external_knowledge":null}
{"instance_id":"local100","db":"Db-IMDB","question":"Descubre cuántos actores tienen un 'Shahrukh number' de 2? Esto significa que actuaron en una película con alguien que actuó con Shahrukh Khan, pero no directamente con él.","external_knowledge":null}
{"instance_id":"local114","db":"education_business","question":"Proporcione un informe detallado de ventas web para cada región, que incluya el número de pedidos, el importe total de ventas y el nombre y el importe de ventas de todos los representantes de ventas que hayan logrado el importe total de ventas más alto en esa región (incluya a todos los representantes en caso de empate).","external_knowledge":null}
{"instance_id":"local128","db":"BowlingLeague","question":"Enumera a los jugadores de bolos (incluyendo su ID, nombre y apellido), el número de partido, el número de juego, el puntaje de hándicap, la fecha del torneo y la ubicación solo para aquellos jugadores que hayan ganado juegos con un puntaje de hándicap de 190 o menos en los tres locales: Thunderbird Lanes, Totem Lanes y Bolero Lanes. Incluye únicamente los registros de juego específicos en los que ganaron con un puntaje de hándicap de 190 o menos en estas tres ubicaciones.","external_knowledge":null}
{"instance_id":"local130","db":"school_scheduling","question":"¿Podrías proporcionar una lista de los apellidos de todos los estudiantes que han completado los cursos de Inglés (donde la finalización se define como tener un ClassStatus de 2), junto con sus rangos de quintiles basados en sus calificaciones individuales en esos cursos? El quintil debe determinarse calculando cuántos estudiantes tienen calificaciones mayores o iguales a la calificación de cada estudiante, y luego dividiendo este ranking por el número total de estudiantes que completaron los cursos de Inglés. Los quintiles deben etiquetarse como \"Primero\" (los 20% superiores), \"Segundo\" (del 21 al 40%), \"Tercero\" (del 41 al 60%), \"Cuarto\" (del 61 al 80%), y \"Quinto\" (los 20% inferiores). Por favor, ordene los resultados de quintil de mayor rendimiento a menor (Primero a Quinto).","external_knowledge":null}
{"instance_id":"local131","db":"EntertainmentAgency","question":"¿Podrías listar cada estilo musical con el número de veces que aparece como preferencia de 1º, 2º o 3º en una sola fila por estilo?","external_knowledge":null}
{"instance_id":"local133","db":"EntertainmentAgency","question":"Dado una base de datos de estilos musicales y preferencias de los usuarios, donde Musical_Preferences contiene las clasificaciones de los estilos musicales por parte de los usuarios (PreferenceSeq=1 para la primera opción, PreferenceSeq=2 para la segunda opción, PreferenceSeq=3 para la tercera opción): Calcule una puntuación ponderada para cada estilo musical asignando 3 puntos por cada vez que se clasifique como la primera opción, 2 puntos por cada segunda opción y 1 punto por cada clasificación de la tercera opción. Calcule la puntuación total ponderada para cada estilo musical que haya sido clasificado por al menos un usuario. Luego, calcule la diferencia absoluta entre la puntuación ponderada total de cada estilo y la puntuación ponderada total promedio entre todos esos estilos.","external_knowledge":null}
{"instance_id":"local132","db":"EntertainmentAgency","question":"","external_knowledge":null}
{"instance_id":"local141","db":"AdventureWorks","question":"¿Cómo se compararon las ventas totales anuales de cada vendedor con su cuota de ventas anual? Proporcione la diferencia entre sus ventas totales y la cuota para cada año, organizada por vendedor y año.","external_knowledge":null}
{"instance_id":"local152","db":"imdb_movies","question":"¿Podrías proporcionar los 9 directores con mayor número de películas, incluyendo su ID, nombre, número de películas, duración promedio entre películas (redondeada al entero más cercano), calificación promedio (redondeada a 2 decimales), votos totales, calificaciones mínimas y máximas, y la duración total de las películas? Ordena la salida primero por el número de películas en orden descendente y luego por la duración total de las películas en orden descendente.","external_knowledge":null}
{"instance_id":"local230","db":"imdb_movies","question":"Determina los tres géneros con más películas con calificación superior a 8, y luego identifica a los cuatro directores que han dirigido la mayor cantidad de películas con calificación superior a 8 dentro de esos géneros. Enumera a estos directores y sus respectivos recuentos de películas.","external_knowledge":null}
{"instance_id":"local156","db":"bank_sales_trading","question":"Analice el precio de compra promedio anual por Bitcoin por región, calculado como el monto total en dólares gastado dividido por la cantidad total comprada cada año, excluyendo los datos del primer año de cada región. Luego, para cada año, clasifique las regiones según estos precios promedio de compra y calcule el cambio porcentual anual en el costo para cada región en comparación con el año anterior.","external_knowledge":null}
{"instance_id":"local157","db":"bank_sales_trading","question":"Usando la tabla \"bitcoin_prices\", por favor calcule el cambio porcentual diario en el volumen de negociación para cada ticker desde August 1 hasta August 10, 2021, asegurándose de que cualquier volumen que termine en \"K\" o \"M\" se convierta con precisión a miles o millones, cualquier volumen \"-\" se trate como cero, solo volúmenes no nulos se utilicen para determinar el volumen del día anterior, y los resultados se ordenen por ticker y fecha.","external_knowledge":null}
{"instance_id":"local163","db":"education_business","question":"¿Qué salarios de los miembros de la facultad de la universidad están más cercanos al salario medio para sus respectivos rangos? Por favor, proporcione los rangos, los nombres de pila, los apellidos y salaries.university","external_knowledge":null}
{"instance_id":"local168","db":"city_legislation","question":"Entre las ofertas de trabajo que específicamente incluyen al Analista de Datos, requieren un salario anual promedio no nulo y son remotas, ¿cuál es el salario promedio general al considerar solo las tres habilidades más demandadas para estos puestos?","external_knowledge":null}
{"instance_id":"local169","db":"city_legislation","question":"¿Cuál es la tasa anual de retención de los legisladores que comenzaron su primer mandato entre January 1, 1917 y December 31, 1999, medida como la proporción de esta cohorte que aún se encuentra en el cargo al December 31st de cada uno de los primeros 20 años siguientes al inicio de su primer mandato? Los resultados deben mostrar los 20 periodos en secuencia, independientemente de si algún legislador fue retenido en un año particular.","external_knowledge":null}
{"instance_id":"local171","db":"city_legislation","question":"Para los legisladores masculinos de Luisiana, ¿cuántos legisladores distintos estaban sirviendo activamente el 31 de diciembre de cada año, desde más de 30 años desde el inicio de su primer mandato hasta menos de 50 años, agrupando los resultados por el número exacto de años transcurridos desde su primer mandato?","external_knowledge":null}
{"instance_id":"local167","db":"city_legislation","question":"Según el estado que cada legisladora representó por primera vez, ¿qué estado tiene el mayor número de legisladoras cuyas legislaturas incluyeron el 31 de diciembre en algún momento, y cuál es ese recuento? Por favor, proporciona la abreviatura del estado.","external_knowledge":null}
{"instance_id":"local170","db":"city_legislation","question":"Identifica las abreviaturas de estados en las que, para ambos legisladores, hombres y mujeres, la tasa de retención permanece mayor que cero en intervalos específicos de 0, 2, 4, 6, 8 y 10 años después de la fecha de inicio de su primer mandato. Un legislador se considera retenido si está desempeñando funciones el 31 de diciembre del año correspondiente. Solo incluye estados donde ambas cohortes de género mantengan tasas de retención distintas de cero en los seis puntos de tiempo durante la primera década de servicio.","external_knowledge":null}
{"instance_id":"local193","db":"sqlite-sakila","question":"¿Podrías determinar el porcentaje promedio de las ventas totales de por vida (LTV) que ocurren en los primeros 7 y 30 días después de la compra inicial de un cliente? Además, incluye el promedio de las ventas totales de por vida (LTV). Por favor, excluye a los clientes con ventas de por vida cero. Los períodos de 7 y 30 días deben basarse en el número exacto de horas, minutos y segundos, y no en días calendario.","external_knowledge":null}
{"instance_id":"local194","db":"sqlite-sakila","question":"Por favor, proporcione una lista de las tres películas que generan más ingresos para cada actor, junto con el ingreso medio por actor en esas películas, calculado dividiendo los ingresos totales de la película entre los actores de cada película de forma equitativa.","external_knowledge":null}
{"instance_id":"local195","db":"sqlite-sakila","question":"Por favor, averigüe cuán amplia es la aceptación de nuestros cinco actores principales. ¿Qué porcentaje de nuestros clientes ha alquilado películas en las que aparecen estos actores?","external_knowledge":null}
{"instance_id":"local196","db":"sqlite-sakila","question":"Para cada categoría de calificación de la primera película alquilada por los clientes, donde la primera película se identifica en función de la fecha de pago más temprana por cliente, proporcione el gasto total promedio por cliente y el número promedio de alquileres posteriores (calculado como el número total de alquileres menos uno) para los clientes cuya primera película alquilada cae en esa categoría de calificación.","external_knowledge":null}
{"instance_id":"local197","db":"sqlite-sakila","question":"Entre nuestros 10 principales clientes que pagan, ¿puedes identificar el mayor cambio en los importes de pago de un mes al mes inmediatamente siguiente? Específicamente, por favor determina para qué cliente y durante qué mes ocurrió esta diferencia máxima mes a mes, y proporciona la diferencia redondeada a dos decimales.","external_knowledge":null}
{"instance_id":"local199","db":"sqlite-sakila","question":"¿Puedes identificar el año y el mes con la mayor cantidad de pedidos de alquiler creados por el personal de la tienda para cada tienda? Por favor, enumere el ID de la tienda, el año, el mes y el total de alquileres para esas fechas.","external_knowledge":null}
{"instance_id":"local201","db":"modern_data","question":"Identifica las primeras 10 palabras, ordenadas alfabéticamente, que tengan entre 4 y 5 caracteres, comiencen con 'r' y tengan al menos un anagrama de la misma longitud, teniendo en cuenta letras sensibles a mayúsculas y minúsculas. Proporciona la cantidad de tales anagramas para cada palabra.","external_knowledge":null}
{"instance_id":"local202","db":"city_legislation","question":"Para los datos de alienígenas, ¿cuántos de los 10 estados con mayor población de alienígenas tienen un porcentaje mayor de alienígenas amistosos que de alienígenas hostiles, con una edad media de alienígenas que exceda los 200?","external_knowledge":null}
{"instance_id":"local209","db":"delivery_center","question":"En el conjunto de datos de pedidos combinados con información de la tienda, ¿qué tienda tiene el mayor número total de pedidos y, entre los pedidos de esa tienda, cuál es la proporción de pedidos que aparecen en la tabla deliveries con un estado de 'DELIVERED' respecto al total de pedidos de esa tienda?","external_knowledge":null}
{"instance_id":"local210","db":"delivery_center","question":"¿Puedes identificar los centros que experimentaron un aumento de más del 20% en los pedidos terminados de febrero a marzo?","external_knowledge":null}
{"instance_id":"local212","db":"delivery_center","question":"¿Puedes encontrar 5 repartidores con el promedio más alto de entregas diarias?","external_knowledge":null}
{"instance_id":"local218","db":"EU_soccer","question":"¿Puedes calcular la mediana a partir de los máximos de goles por temporada de cada equipo?","external_knowledge":null}
{"instance_id":"local219","db":"EU_soccer","question":"En cada liga, considerando todas las temporadas, ¿qué único equipo tiene la menor cantidad de victorias totales de los partidos basándose en la comparación de los goles de local y de visitante, incluyendo a los equipos con cero victorias, asegurando que si varios equipos empatan en la menor cantidad de victorias, solo se devuelva un equipo por cada liga?","external_knowledge":null}
{"instance_id":"local221","db":"EU_soccer","question":"Dime los 10 equipos con más victorias en toda la liga.","external_knowledge":null}
{"instance_id":"local220","db":"EU_soccer","question":"¿Qué jugador ha participado en el mayor número de partidos ganados y qué jugador ha participado en el mayor número de partidos perdidos, considerando solo los partidos en los que realmente jugaron (excluyendo entradas nulas) y en los que su equipo ganó o perdió (excluyendo empates)?","external_knowledge":null}
{"instance_id":"local228","db":"IPL","question":"Para cada temporada de la IPL, identifica a los tres bateadores con el mayor total de carreras anotadas y a los tres lanzadores con la mayor cantidad de wickets tomados, excluyendo las eliminaciones por 'run out', 'hit wicket' y 'retired hurt'. En caso de empates en carreras o wickets, desempata usando el identificador de jugador más pequeño. Luego presenta a estos seis jugadores en posiciones emparejadas—bateador 1 con lanzador 1, bateador 2 con lanzador 2 y bateador 3 con lanzador 3—en orden ascendente por el ID de la temporada, junto con las carreras totales o wickets de cada jugador.","external_knowledge":null}
{"instance_id":"local229","db":"IPL","question":"Encuentra los identificadores de los jugadores que anotaron la mayor cantidad de carreras de asociación para cada partido. La salida debe incluir los identificadores de dos jugadores, cada uno con sus puntuaciones individuales y la puntuación total de la asociación. Para cada par, el jugador con la puntuación individual más alta debe figurar como jugador 1, y el jugador con la puntuación más baja como jugador 2. En los casos en que ambos jugadores tengan la misma puntuación, el jugador con el ID más alto debe ser jugador 1, y el jugador con el ID más bajo debe ser jugador 2. Puede haber varias filas para un solo partido.","external_knowledge":null}
{"instance_id":"local244","db":"music","question":"Calcula la duración de cada pista, clasifícalas como corta, mediana o larga, muestra el tiempo mínimo y máximo para cada tipo (en minutos) y los ingresos totales para cada categoría, agrupa por la categoría.","external_knowledge":"music_length_type.md"}
{"instance_id":"local253","db":"education_business","question":"Usando un conjunto de datos de salarios en el que los valores de salario deben limpiarse eliminando caracteres no numéricos y convirtiéndolos a un tipo numérico, escriba una consulta SQL detallada que identifique las 5 empresas con mayor salario medio en Mumbai, Pune, New Delhi y Hyderabad, y luego compare el salario medio de cada empresa en esas ciudades con el salario medio nacional. El resultado final debe mostrar cuatro columnas: Location, Company Name, Average Salary in State, y Average Salary in Country, enumerando solo las 5 empresas principales en cada una de las ubicaciones especificadas.","external_knowledge":null}
{"instance_id":"local258","db":"IPL","question":"Calcule el número total de wickets obtenidos por cada lanzador (excluyendo run-outs y otras eliminaciones no atribuidas al lanzador), su economía (carreras concedidas totales divididas por overs lanzados, considerando solo las carreras anotadas fuera del bate e ignorando cualquier carrera adicional como wides y no-balls), su strike rate (promedio de bolas lanzadas por wicket), y su mejor rendimiento de bolos en un solo partido (el partido con la mayor cantidad de wickets obtenidos por el lanzador, formateado como \"wickets-runs\" donde las carreras son las concedidas sin extras).","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local259","db":"IPL","question":"Para cada jugador, liste su ID, nombre, su rol más frecuente en todos los partidos, mano de bateo, habilidad de bolos, carreras totales anotadas, partidos totales jugados, veces que fue eliminado, promedio de bateo (carreras totales divididas por eliminaciones totales), puntuación más alta en un solo partido, la cantidad de partidos en los que anotó al menos 30 carreras, al menos 50 carreras y al menos 100 carreras, total de bolas enfrentadas en su carrera, tasa de strike (carreras totales divididas por bolas enfrentadas, multiplicado por 100), total de wickets tomados, economía (promedio de carreras concedidas por over), y su mejor rendimiento de bolos en un solo partido (la mayor cantidad de wickets tomados en un partido, formateado como \"wickets taken-runs given\", donde el mejor rendimiento es el de mayor cantidad de wickets, y si hay empate, las carreras concedidas son las mínimas). Ignorar los datos de carreras extras.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local262","db":"stacking","question":"Qué problemas superan el número total de veces que aparecen en la tabla de soluciones al contar todas las ocurrencias, a lo largo de los pasos 1, 2 y 3, cuando el puntaje máximo de la prueba de cualquier modelo que no sea \"Stack\" es menor que el puntaje de la prueba del modelo \"Stack\" para el mismo paso y versión?","external_knowledge":null}
{"instance_id":"local263","db":"stacking","question":"Identifica el L1_model asociado con cada modelo (especificado por nombre y versión) que ocurre con mayor frecuencia para cada estado ('fuerte' o 'suave'), junto con la cantidad de veces que ocurre. Un modelo tiene un estado de 'fuerte' si, para cualquiera de sus pasos, la puntuación de prueba máxima entre modelos que no son 'Stack' es menor que la puntuación de prueba del modelo 'Stack'. Tiene un estado de 'suave' si la puntuación de prueba máxima entre los modelos que no son 'Stack' es igual a la puntuación de prueba del modelo 'Stack'. Cuenta cuántas veces cada L1_model está asociado con un estado de 'fuerte' o 'suave' a través de todos los modelos, y determina qué L1_model tiene la mayor ocurrencia para cada estado.","external_knowledge":null}
{"instance_id":"local264","db":"stacking","question":"¿Qué categoría de modelo (L1_model) aparece con mayor frecuencia en todos los pasos y versiones al comparar modelos tradicionales con el modelo Stack, y cuál es el recuento total de sus ocurrencias?","external_knowledge":null}
{"instance_id":"local269","db":"oracle_sql","question":"¿Cuál es el promedio de la cantidad total en todas las combinaciones de empacado final, considerando solo los elementos de nivel hoja dentro de cada combinación después de expandir completamente cualquier relación de empaque anidada?","external_knowledge":null}
{"instance_id":"local270","db":"oracle_sql","question":"¿Qué contenedores de embalaje de nivel superior, es decir, aquellos que no están contenidos dentro de ningún otro embalaje, tienen algún artículo para el cual la cantidad total acumulada a través de todos los niveles anidados en la jerarquía supera las 500, y cuáles son los nombres de estos contenedores y de los artículos correspondientes?","external_knowledge":null}
{"instance_id":"local272","db":"oracle_sql","question":"Para la orden 423, identifique los identificadores de producto, los pasillos y las posiciones desde las que se deben recoger las cantidades exactas necesarias para cada línea de pedido, asegurándose de que la cantidad total recogida para cada producto coincida con las cantidades acumuladas solicitadas sin exceder el inventario disponible en el almacén 1. Calcule las cantidades a recoger desde cada ubicación priorizando el inventario con fechas de compra anteriores y cantidades más pequeñas, y asegúrese de que la recogida respete la secuencia y las cantidades acumuladas de las líneas de pedido para productos con múltiples entradas.","external_knowledge":null}
{"instance_id":"local273","db":"oracle_sql","question":"Calcule el porcentaje medio de picking para cada nombre de producto, utilizando un enfoque FIFO, de primero en entrar, primero en salir, que selecciona de ubicaciones de inventario basándose en la fecha de compra más temprana y la menor cantidad disponible, asegurando que la cantidad recogida refleje solo el rango superpuesto entre la cantidad requerida de cada pedido y la cantidad disponible del inventario, y luego agrupando y ordenando los resultados por nombre de producto?","external_knowledge":null}
{"instance_id":"local274","db":"oracle_sql","question":"¿Qué productos se recogieron para la orden 421, y cuál es el promedio de unidades recogidas por cada producto, usando el método FIFO (Primero en entrar, primero en salir)?","external_knowledge":null}
{"instance_id":"local275","db":"oracle_sql","question":"Con datos de ventas mensuales a partir de enero de 2016 y utilizando una media móvil centrada para ajustar la estacionalidad, ¿qué productos tuvieron un ratio de ventas ajustado por estacionalidad que se mantuvo consistentemente por encima de 2 en cada mes del año 2017?","external_knowledge":"calculation_method.md"}
{"instance_id":"local277","db":"oracle_sql","question":"¿Cuál es el promedio de las ventas anuales pronosticadas para los productos 4160 y 7790 durante 2018, utilizando datos de ventas mensuales a partir de enero de 2016 para los primeros 36 meses, aplicando ajustes estacionales desde los pasos de tiempo 7 a 30 y empleando un método de regresión ponderada para estimar las ventas?","external_knowledge":"calculation_method.md"}
{"instance_id":"local279","db":"oracle_sql","question":"Utilizando un modelo de ajuste de inventario mensual recursivo, partiendo de los niveles de inventario de diciembre de 2018, donde reponemos un producto si su inventario final cae por debajo del nivel mínimo requerido, determine para cada producto el mes de 2019 en el que la diferencia absoluta entre su inventario final y el nivel mínimo requerido es la menor, y devuelva el product_id, ese mes y la diferencia absoluta.","external_knowledge":null}
{"instance_id":"local283","db":"EU_soccer","question":"Analizar el conjunto de datos de partidos de fútbol para determinar el equipo campeón de cada temporada en todos los países y ligas, otorgando 3 puntos por cada victoria, 1 punto por cada empate y 0 puntos por cada derrota. Para cada temporada, devolver el nombre del equipo campeón, la liga, el país y los puntos totales acumulados.","external_knowledge":null}
{"instance_id":"local284","db":"bank_sales_trading","question":"Para veg whsle data, ¿puedes generar un resumen de las tasas de pérdida de nuestros artículos? Incluye la tasa de pérdida promedio y desglosa también el recuento de artículos que están por debajo, por encima y dentro de una desviación estándar de este promedio.","external_knowledge":null}
{"instance_id":"local285","db":"bank_sales_trading","question":"Para los datos de verduras al por mayor, ¿puedes analizar nuestro rendimiento financiero entre 2020 y 2023? Necesito información sobre el precio mayorista promedio, el precio mayorista máximo, el precio mayorista mínimo, la diferencia de precio mayorista, el precio mayorista total, el precio de venta total, la tasa de pérdida promedio, la pérdida total y el beneficio para cada categoría dentro de cada año. Redondea todos los valores calculados a dos decimales.","external_knowledge":null}
{"instance_id":"local286","db":"electronic_sales","question":"Elabore un informe de rendimiento integral sobre nuestros vendedores, centrado en las ventas totales, el precio medio por artículo, las calificaciones promedio de las reseñas y los tiempos de embalaje. Asegúrese de que el informe incluya únicamente a aquellos vendedores que hayan vendido más de 100 productos y resalte los nombres de las categorías de productos en inglés con el mayor volumen de ventas.","external_knowledge":null}
{"instance_id":"local301","db":"bank_sales_trading","question":"Para datos de ventas semanales, necesito un análisis de nuestro rendimiento de ventas alrededor de mediados de junio para los años 2018, 2019 y 2020. Específicamente, calcule el cambio porcentual en las ventas entre las cuatro semanas previas al 15 de junio y las cuatro semanas siguientes al 15 de junio para cada año.","external_knowledge":null}
{"instance_id":"local302","db":"bank_sales_trading","question":"Analice el cambio porcentual medio en las ventas entre las 12 semanas previas y posteriores al 15 de junio de 2020, para cada tipo de atributo: región, plataforma, rango de edad, demografía y tipo de cliente. Para cada tipo de atributo, calcule el cambio porcentual medio en las ventas para todos sus valores de atributo. Identifique el tipo de atributo con el mayor impacto negativo en las ventas y proporcione su cambio porcentual medio en las ventas.","external_knowledge":null}
{"instance_id":"local329","db":"log","question":"¿Cuántas sesiones únicas visitaron la página /regist/input y luego la página /regist/confirm, en ese orden?","external_knowledge":null}
{"instance_id":"local330","db":"log","question":"Utilizando la tabla de registro de actividad, calcule el número total de sesiones de usuario únicas en las que cada página web aparece como una página de aterrizaje (la primera página visitada en una sesión basada en la marca de tiempo) o como una página de salida (la última página visitada en una sesión basada en la marca de tiempo), o ambas. Cuente cada sesión solo una vez por página, incluso si la página sirve como página de aterrizaje y de salida para esa sesión.","external_knowledge":null}
{"instance_id":"local331","db":"log","question":"¿Qué tres visitas distintas a la tercera página se observan con mayor frecuencia inmediatamente después de dos visitas consecutivas a la página '/detail', y cuántas veces ocurre cada una de estas visitas a la tercera página?","external_knowledge":null}
{"instance_id":"local358","db":"log","question":"¿Cuántos usuarios hay en cada categoría de edad (20s, 30s, 40s, 50s y otros)?","external_knowledge":null}
{"instance_id":"local360","db":"log","question":"Para cada sesión de usuario en la tabla de registro de actividad, identifique el número de eventos que ocurrieron antes de la primera interacción '/detail' o de la conversión '/complete', contando solo los eventos que tienen un tipo de búsqueda no vacío. Encuentre las sesiones con el recuento mínimo de tales eventos previos a la interacción '/detail' o a la conversión '/complete'. Si varias sesiones comparten este recuento mínimo, inclúyalas todas en los resultados. Devuelva cada sesión que cumpla los criterios junto con la ruta correspondiente y el tipo de búsqueda.","external_knowledge":null}
{"instance_id":"local344","db":"f1","question":"Considerando todas las carreras para las que están disponibles datos de paradas en boxes, y enfocándose en los casos en los que un piloto no estaba detrás de otro coche en la vuelta anterior pero sí está detrás en la vuelta actual (teniendo en cuenta retiros, entradas a paradas en boxes, salidas de paradas en boxes y salidas de carrera), ¿cuántas veces ha ocurrido cada tipo de adelantamiento en la Fórmula 1?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local336","db":"f1","question":"En las primeras cinco vueltas de la carrera, ¿cuántos sobrepasos ocurrieron en cada categoría: retiros, paradas en boxes, rebases relacionados con la salida y pases en pista?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local335","db":"f1","question":"En las temporadas de Formula 1 desde 2001, considerando solo a los pilotos que obtuvieron puntos en una temporada, ¿qué cinco constructores han tenido la mayor cantidad de temporadas en las que sus pilotos obtuvieron la menor cantidad de puntos totales entre todos los pilotos que obtuvieron puntos en esa temporada?","external_knowledge":null}
{"instance_id":"local309","db":"f1","question":"¿Para cada año, qué piloto y qué constructor obtuvieron la mayor cantidad de puntos? Quiero el nombre completo de cada piloto.","external_knowledge":null}
{"instance_id":"local310","db":"f1","question":"Usando únicamente los datos de la tabla ‘results’, encuentra los tres años en los que la suma de los puntos totales más altos obtenidos por cualquier piloto y los puntos totales más altos obtenidos por cualquier constructor en ese año (ambos calculados sumando puntos de la tabla ‘results’) sea la menor, y lista esos tres años en orden de menor a mayor.","external_knowledge":null}
{"instance_id":"local311","db":"f1","question":"¿Qué constructores obtuvieron los 3 puntos combinados más altos de su mejor piloto y equipo, y en qué años los lograron?","external_knowledge":null}
{"instance_id":"local354","db":"f1","question":"Entre los pilotos de Fórmula 1 que compitieron durante la década de 1950, ¿qué pilotos completaron una temporada en esa década con el mismo constructor en la primera y la última carrera en las que participaron, además de tomar parte en al menos dos rondas de carrera distintas durante esa temporada?","external_knowledge":null}
{"instance_id":"local355","db":"f1","question":"Calcule el promedio general de la primera ronda y el promedio de la última ronda de carreras perdidas por los pilotos de Formula 1 a lo largo de todos los años. Incluya solo a los pilotos que perdieron menos de tres carreras en un año dado y que cambiaron de equipo entre sus apariciones inmediatamente antes y después de su hiato (es decir, el ID del constructor para la carrera justo antes de su primera carrera perdida debe ser diferente del ID del constructor para la carrera justo después de su última carrera perdida en ese año). No agrupe los resultados por año; devuelva únicamente los promedios generales a lo largo de todo el conjunto de datos.","external_knowledge":null}
{"instance_id":"local356","db":"f1","question":"Proporciona los nombres completos de los pilotos que han sido adelantados en pista más veces de las que han adelantado a otros en pista durante las vueltas de carrera, excluyendo los cambios de posición debidos a paradas en boxes (tanto al entrar como al salir), retiros, o cambios de posición que ocurrieron durante la primera vuelta de una carrera (considerados como movimientos de inicio).","external_knowledge":null}
{"instance_id":"sf001","db":"GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI","question":"Suponiendo que hoy es April 1, 2024, me gustaría conocer las cantidades diarias de nieve que caen por encima de 6 pulgadas para cada código postal de EE. UU. durante la semana que termina después de las dos primeras semanas completas del año anterior. Muestre el código postal, la fecha y la cantidad de nieve.","external_knowledge":null}
{"instance_id":"sf003","db":"GLOBAL_GOVERNMENT","question":"Para cada año entre 2015 y 2020, ¿qué Área de Tabulación de Código Postal del Censo (ZCTA) tuvo la segunda tasa de crecimiento poblacional anual más alta? Incluya solo las áreas con una estimación de población de al menos 25,000 personas en ese año (según estimaciones de la ACS de 5 años). Para cada año, proporcione el código postal, la abreviatura del estado y el porcentaje de crecimiento anual.","external_knowledge":null}
{"instance_id":"sf002","db":"FINANCE__ECONOMICS","question":"A partir del 31 de diciembre de 2022, enumere los 10 bancos activos principales con activos superiores a $10 billion, clasificados por el mayor porcentaje de activos no asegurados, donde el porcentaje se calcula como uno menos el valor de la variable '% Insured (Estimated)' a partir de estimaciones trimestrales. Proporcione los nombres de estos bancos y sus respectivos porcentajes de activos no asegurados.","external_knowledge":null}
{"instance_id":"sf044","db":"FINANCE__ECONOMICS","question":"¿Cuál fue el cambio porcentual en los precios de cierre post-mercado de las empresas tecnológicas Magnificent 7 desde el 1 de enero al 30 de junio de 2024?","external_knowledge":null}
{"instance_id":"sf006","db":"FINANCE__ECONOMICS","question":"Para cada estado de los EE. UU., determine cómo ha cambiado el número de entidades de sucursales financieras activas desde March 1, 2020 hasta December 31, 2021. Una entidad se considera activa en una fecha específica si su fecha de inicio es igual o anterior a esa fecha y su fecha de finalización es nula o igual o posterior a esa fecha. Para cada estado, calcule el número de entidades activas en March 1, 2020, el número de entidades activas en December 31, 2021, y el cambio porcentual en estas cifras.","external_knowledge":null}
{"instance_id":"sf008","db":"US_REAL_ESTATE","question":"Determine el cambio porcentual en el flujo de ingresos brutos y en el índice de precios de la vivienda para compra, ajustado estacionalmente, para el Phoenix-Mesa-Scottsdale, AZ Metro Area desde el 1 de enero de 2023 hasta el 31 de diciembre de 2023. El flujo de ingresos brutos se refiere al ingreso bruto ajustado total de todas las entidades financieras dentro del área metropolitana especificada.","external_knowledge":null}
{"instance_id":"sf010","db":"US_REAL_ESTATE","question":"¿Cuáles son las proporciones acumuladas de hipotecas cercanas al incumplimiento en California para cada fecha registrada en 2023, incluyendo aquellas que tienen entre 90 y 180 días de atraso, en moratoria, o en procesos de ejecución hipotecaria, bancarrota, o cesión del título en lugar de la ejecución?","external_knowledge":null}
{"instance_id":"sf037","db":"US_REAL_ESTATE","question":"¿Cómo podemos encontrar la distancia en línea recta más corta en millas entre cada tienda de 'The Home Depot' y su ubicación más cercana de 'Lowe's Home Improvement'? Usando la base de datos US_REAL_ESTATE.CYBERSYN, join la tabla point_of_interest_index con point_of_interest_addresses_relationships y us_addresses para obtener coordenadas geográficas. Para cada ubicación de 'The Home Depot' (identificada por su poi_id), calcule su distancia en línea recta a todas las tiendas de 'Lowe's Home Improvement' usando las funciones ST_DISTANCE y ST_MAKEPOINT, convierta la distancia de metros a millas (dividiendo por 1609), y devuelva solo el registro con la distancia mínima para cada tienda de 'The Home Depot' usando QUALIFY con ROW_NUMBER().","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf012","db":"WEATHER__ENVIRONMENT","question":"Usando datos del FEMA National Flood Insurance Program Claim Index, para cada año desde 2010 hasta 2019, ¿cuáles fueron los montos totales de daños a edificios y montos totales de daños a contenidos reportados bajo el National Flood Insurance Program para la comunidad NFIP llamada 'City Of New York', agrupados por cada año de pérdida?","external_knowledge":null}
{"instance_id":"sf018","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Examine la participación de los usuarios en las notificaciones push dentro de una ventana de una hora especificada en June 1, 2023.","temporal":"Yes","external_knowledge":"PushNotificationAnalysis.md"}
{"instance_id":"sf035","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"¿Cuántos usuarios únicos iniciaron sesiones cada día dentro de cada grupo de aplicaciones entre el 1 de junio de 2023 y el 7 de junio de 2023? También muestre el ID del grupo de aplicaciones y el día de inicio de la sesión.","external_knowledge":null}
{"instance_id":"sf029","db":"AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET","question":"Genere un informe diario detallado de ventas para cada producto bajo la vista del distribuidor 'Manufacturing', cubriendo los 30 días previos al 6 de febrero de 2022, mediante la unión de los datos de ventas, tráfico, inventario y net PPM sobre date, ASIN, program, period, y distributor_view. El informe debe incluir: unidades ordenadas totales, ingreso por pedidos, precio de venta medio, vistas rápidas, tasa de conversión, unidades enviadas, ingreso por envío, net PPM medio, promedio de OOS de producto procurable, total de unidades en inventario y su valor, unidades netas recibidas y su valor, cantidades de órdenes de compra abiertas, unidades pedidas por clientes sin cumplir, y tasa media de confirmación del proveedor, tasa de llenado de recepción, tasa de sell-through y tiempo de entrega del proveedor.","external_knowledge":null}
{"instance_id":"sf040","db":"US_ADDRESSES__POI","question":"Encuentra las 10 direcciones más al norte en la zona de códigos postales más grande de Florida. ¿Cuáles son sus números de dirección, nombres de las calles y tipos de direcciones?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf009","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Una empresa inmobiliaria necesita una comparación detallada lado a lado de los edificios en Ámsterdam y Rotterdam. Requieren un informe que muestre cada clase y subclase de edificio, con la superficie total (en metros cuadrados) y el número total de edificios para cada categoría de clasificación en ambas ciudades. Los datos deben estar organizados por clase de edificio y subclase en orden ascendente, con las estadísticas de Ámsterdam y Rotterdam presentadas en columnas paralelas para facilitar la comparación directa. ¿Puedes generar este informe completo de comparación de la clasificación de edificios?","external_knowledge":null}
{"instance_id":"sf013","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Compara las longitudes totales de las carreteras en Ámsterdam y Rotterdam creando un análisis lado a lado de ambas ciudades. Para cada combinación de clase de carretera y subclase, calcula la longitud total de las carreteras (en metros) específicamente para los segmentos QUADKEY '12020210' y '12020211'. Presenta los resultados con columnas para clase, subclase, las longitudes de las carreteras de Ámsterdam y de Rotterdam.","external_knowledge":null}
{"instance_id":"sf041","db":"YES_ENERGY__SAMPLE_DATA","question":"Elabore un informe para ERCOT para el 1 de octubre de 2022, que combine datos horarios sobre precios de day-ahead y precios en tiempo real desde node ID 10000697078, pronósticos de carga (datatypeid 19060) y cargas reales, además de pronósticos de generación eólica (pronóstico datatypeid 9285, real datatypeid 16) y solar (pronóstico datatypeid 662, real datatypeid 650) desde object ID 10000712973. Este informe debe incluir alineaciones de husos horarios, clasificaciones de picos y cálculos de carga neta, proporcionando ideas sobre la dinámica operativa diaria y la eficiencia.","temporal":"Yes","external_knowledge":"ERCOT_Daily_Market_Dynamics_Report.md"}
{"instance_id":"sf011","db":"CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE","question":"Determine la distribución de la población dentro de cada grupo de bloques en relación con su tramo censal en el estado de Nueva York utilizando datos ACS de 2021. Incluya el ID del grupo de bloques, el valor censal, el ID del tramo censal del estado y del condado, la población total del tramo y la proporción poblacional de cada grupo de bloques.","external_knowledge":null}
{"instance_id":"sf014","db":"CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE","question":"¿Cuál es el código postal del estado de Nueva York con el mayor número de viajeros que viajan más de una hora, según los datos del ACS 2021? Incluya el código postal, el total de viajeros, la referencia estatal para esta duración y la población del estado.","external_knowledge":null}
