{"instance_id":"bq011","db":"ga4","question":"Combien de pseudo-utilisateurs distincts ont eu un temps d'engagement positif au cours de la période de 7 jours se terminant le January 7, 2021 at 23:59:59, mais n'ont pas eu de temps d'engagement positif au cours de la période de 2 jours se terminant à la même date (January 7, 2021 at 23:59:59) ?","external_knowledge":"ga4_obfuscated_sample_ecommerce.events.md"}
{"instance_id":"bq010","db":"ga360","question":"Trouver le produit le mieux vendu parmi les clients qui ont acheté 'Youtube Men’s Vintage Henley' en juillet 2017, en excluant ce produit.","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq009","db":"ga360","question":"Quelle source de trafic affiche le chiffre d'affaires total des transactions le plus élevé pour l'année 2017, et quelle est la différence, en millions (arrondie à deux décimales), entre le chiffre d'affaires mensuel total le plus élevé et le plus bas pour cette source de trafic ?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq001","db":"ga360","question":"Pour chaque visiteur ayant effectué au moins une transaction en février 2017, combien de jours se sont écoulés entre la date de leur première visite en février et la date de leur première transaction en février, et sur quel type d'appareil ont-ils effectué cette première transaction ?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq002","db":"ga360","question":"Pendant la première moitié de 2017, en se concentrant sur le revenu des produits hits, quelle source de trafic a généré le revenu total des produits le plus élevé, et quels furent les revenus maximaux quotidiens, hebdomadaires et mensuels des produits pour cette source la plus performante au cours de cette période ?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq003","db":"ga360","question":"Entre le 1er avril et le 31 juillet 2017, en utilisant les données de revenus des produits hits ainsi que le total des transactions pour classer les sessions en achat (transactions ≥ 1 and productRevenue not null) ou non-achat (transactions null and productRevenue null), comparer le nombre moyen de pages vues par visiteur pour chaque groupe par mois","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq004","db":"ga360","question":"En juillet 2017, parmi tous les visiteurs qui ont acheté n'importe quel produit lié à YouTube, quel produit distinct — dont le nom ne contient pas ‘YouTube’ — avait la plus grande quantité totale achetée ?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq008","db":"ga360","question":"En janvier 2017, parmi les visiteurs dont le nom de campagne contient 'Data Share' et qui ont accédé à toute page commençant par '/home', quelle page ont-ils le plus visité ensuite, et quelle est la durée maximale (en secondes) qu'ils ont passée sur la page '/home' avant de passer à autre chose ?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq269","db":"ga360","question":"Entre le 1er juin 2017 et le 31 juillet 2017, considérez uniquement les sessions qui ont des pageviews non-nulles. Classifiez chaque session comme ‘purchase’ si elle a au moins une transaction, ou ‘non_purchase’ sinon. Pour chaque mois, additionnez les pageviews totales de chaque visiteur selon chaque classification, puis calculez la moyenne des pageviews par visiteur pour les groupes ‘purchase’ et ‘non_purchase’ dans chaque mois, et présentez les résultats côte à côte.","external_knowledge":null}
{"instance_id":"bq268","db":"ga360","question":"Identifier le plus grand nombre de jours entre la première visite et le dernier événement enregistré (soit la dernière visite ou la première transaction) pour un utilisateur, lorsque le dernier événement enregistré est associé à un appareil mobile. Le dernier événement enregistré pourrait être soit la dernière visite ou la première transaction, et vous devriez vous concentrer sur les utilisateurs dont le dernier événement enregistré a eu lieu sur un appareil mobile.","external_knowledge":null}
{"instance_id":"bq270","db":"ga360","question":"Quels étaient les taux mensuels de conversion pour l'ajout au panier et pour l'achat, calculés comme un pourcentage du nombre de pages vues sur les détails du produit, de janvier à mars 2017 ?","external_knowledge":"ga360_hits.eCommerceAction.action_type.md"}
{"instance_id":"bq275","db":"ga360","question":"Quels identifiants des visiteurs appartiennent aux utilisateurs dont la première transaction a eu lieu sur un appareil explicitement étiqueté comme 'mobile' à une date ultérieure à leur première visite ?","external_knowledge":null}
{"instance_id":"bq374","db":"ga360","question":"Calcule le pourcentage des nouveaux utilisateurs qui, entre August 1, 2016 et April 30, 2017, sont restés sur le site pendant plus de 5 minutes lors de leur visite initiale et ont effectué un achat lors d'une visite ultérieure à tout moment, par rapport au nombre total de nouveaux utilisateurs dans la même période.","external_knowledge":null}
{"instance_id":"sf_bq029","db":"PATENTS","question":"Obtenez le nombre moyen d'inventeurs par brevet et le nombre total de publications de brevets au Canada (CA) pour chaque période de 5 ans allant de 1960 à 2020, sur la base des dates de publication. N'incluez que les brevets pour lesquels au moins un inventeur est répertorié, et regroupez les résultats par intervalles de 5 ans (1960-1964, 1965-1969, etc.).","external_knowledge":null}
{"instance_id":"sf_bq026","db":"PATENTS","question":"Pour l'ayant droit qui a été le plus actif dans la catégorie de brevets 'A61', j'aimerais connaître les cinq codes de juridiction des brevets où l'ayant droit a déposé le plus de brevets au cours de son année la plus active, séparés par des virgules.","external_knowledge":null}
{"instance_id":"sf_bq091","db":"PATENTS","question":"Dans quelle année l'ayant droit ayant le plus grand nombre de demandes dans la catégorie de brevets 'A61' en a-t-il déposé le plus ?","external_knowledge":null}
{"instance_id":"sf_bq099","db":"PATENTS","question":"Pour la classe de brevets A01B3, je souhaite analyser les informations des 3 principaux ayants droit en fonction du nombre total de demandes. Veuillez fournir les cinq éléments d'information suivants : le nom de cet ayant droit, le nombre total de demandes, l'année présentant le plus grand nombre de demandes, le nombre de demandes dans cette année et le code pays ayant le plus de demandes au cours de cette année.","external_knowledge":null}
{"instance_id":"sf_bq033","db":"PATENTS","question":"Combien de publications américaines liées à l'IoT (où le résumé inclut l'expression 'Internet des objets') ont été déposées chaque mois de 2008 à 2022, y compris les mois sans dépôts?","external_knowledge":null}
{"instance_id":"sf_bq209","db":"PATENTS","question":"Pouvez-vous calculer le nombre de brevets d'utilité qui ont été délivrés en 2010 et qui présentent exactement une citation en avant dans une fenêtre de 10 ans suivant leur date de dépôt de la demande ? Pour cette analyse, les citations en avant doivent être comptées comme des numéros de demande citants distincts qui ont cité le brevet dans les 10 ans après la date de dépôt du brevet lui-même.","external_knowledge":null}
{"instance_id":"sf_bq027","db":"PATENTS","question":"Pour les brevets délivrés entre 2010 et 2018, fournissez le numéro de publication de chaque brevet et le nombre de citations antérieures qu'il a reçues dans la catégorie SEA.","external_knowledge":null}
{"instance_id":"sf_bq210","db":"PATENTS","question":"Combien de brevets US B2 délivrés entre 2008 et 2018 contiennent des revendications qui n'incluent pas le mot 'claim' ?","external_knowledge":null}
{"instance_id":"sf_bq211","db":"PATENTS","question":"Parmi les brevets délivrés entre 2010 et 2023 en CN, combien d'entre eux appartiennent à des familles qui totalisent plus d'une demande distincte ?","external_knowledge":null}
{"instance_id":"sf_bq213","db":"PATENTS","question":"Quel est le code IPC à 4 chiffres le plus courant parmi les brevets d'utilité américains B2 octroyés de juin à août 2022 ?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq212","db":"PATENTS","question":"Pour les brevets d'utilité des États-Unis sous la classification B2 délivrés entre June et September de 2022, identifiez le code IPC à 4 chiffres le plus fréquent pour chaque brevet. Ensuite, listez les numéros de publication et les codes IPC4 des brevets où ce code apparaît 10 fois ou plus.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq214","db":"PATENTS_GOOGLE","question":"Pour les brevets d’utilité des États-Unis classés B2 et délivrés entre 2010 et 2014, trouvez celui qui a le plus grand nombre de citations en avant dans un délai d’un mois à compter de sa date de dépôt, et identifiez le brevet le plus similaire issu de la même année de dépôt, quel que soit son type.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq216","db":"PATENTS_GOOGLE","question":"Identifiez les cinq principaux brevets déposés dans la même année que `US-9741766-B2` qui présentent les plus grandes similitudes technologiques. Veuillez fournir les numéros de publication.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq247","db":"PATENTS_GOOGLE","question":"À partir de l'ensemble de données des publications, identifiez d'abord les six familles comptant le plus grand nombre de publications dont le family_id n'est pas '-1'. Puis, en utilisant la table abs_and_emb (jointure sur publication_number), fournissez les identifiants de chacune de ces familles ainsi que chaque résumé non vide associé à leurs publications.","external_knowledge":null}
{"instance_id":"sf_bq127","db":"PATENTS_GOOGLE","question":"Pour chaque famille de publications dont la première publication a été publiée en janvier 2015, veuillez fournir la date de publication la plus ancienne, les numéros de publication distincts, leurs codes pays, les codes CPC et IPC distincts, les familles distinctes (à savoir les identifiants) qui citent et sont citées par cette famille de publications. Veuillez présenter toutes les listes sous forme de valeurs séparées par des virgules, triées par ordre alphabétique.","external_knowledge":null}
{"instance_id":"sf_bq215","db":"PATENTS","question":"Quel brevet américain (avec un code de type B2 et une date de délivrance comprise entre 2015 et 2018) présente le score d'originalité le plus élevé calculé comme 1 - (la somme des occurrences au carré des codes IPC à 4 chiffres distincts dans ses citations en arrière divisée par le carré du nombre total d'occurrences de ces codes IPC à 4 chiffres) ?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq222","db":"PATENTS","question":"Trouver les domaines technologiques CPC en Allemagne qui avaient la moyenne mobile exponentielle (facteur de lissage 0.1) des dépôts de brevets par an, spécifiquement pour les brevets délivrés en décembre 2016. Pour chaque groupe CPC au niveau 4, afficher le titre complet, le groupe CPC et l'année avec la moyenne mobile exponentielle des dépôts de brevets la plus élevée.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq221","db":"PATENTS","question":"Identifiez les domaines technologiques CPC présentant la plus haute moyenne mobile exponentielle des dépôts de brevets pour chaque année (avec un facteur de lissage de 0.2), en ne tenant compte que du premier code CPC pour chaque brevet qui possède une date de dépôt valide et un numéro de demande non vide, et reportez l'intitulé CPC complet ainsi que la meilleure année associée à la moyenne mobile exponentielle la plus élevée pour chaque groupe CPC au niveau 5.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq223","db":"PATENTS","question":"Quels cessionnaires, à l'exclusion de DENSO CORP lui-même, ont cité des brevets attribués à DENSO CORP, et quels sont les titres des sous-classes CPC primaires associées à ces citations ? Fournissez le nom de chaque cessionnaire citant (à l'exclusion de DENSO CORP), le titre complet de la sous-classe CPC principale (basé sur le premier code CPC), et le nombre de citations regroupées par le cessionnaire citant et par le titre de la sous-classe CPC. Veillez à ce que seules les citations de brevets comportant des dates de dépôt valides soient prises en compte, et concentrez-vous sur le premier code CPC pour chaque brevet cité. Les résultats doivent exclure spécifiquement DENSO CORP en tant que cessionnaire citant.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq420","db":"PATENTS_USPTO","question":"Pouvez-vous identifier les 5 principaux brevets qui ont été initialement rejetés en vertu de la section 101 sans revendications autorisées, en se basant sur la longueur de leurs revendications accordées ? Les brevets doivent avoir été délivrés aux États-Unis entre 2010 et 2023. De plus, assurez-vous de sélectionner la première date d'action de l'Office pour chaque demande. Veuillez inclure leurs numéros de première publication, ainsi que leurs dates de première publication, la longueur des revendications déposées et les dates de délivrance.","external_knowledge":null}
{"instance_id":"sf_bq207","db":"PATENTS_USPTO","question":"Pourriez-vous fournir les numéros de publication les plus précoces, les numéros de demande correspondants, les numéros de revendication et le nombre de mots pour les 100 premières revendications indépendantes de brevets, basés sur le plus grand nombre de mots, récupérés à partir des statistiques de revendications dans uspto_oce_claims (filtré par ind_flg='1'), appariés avec leurs numéros de publication à partir de uspto_oce_claims match, et en outre jointes aux publications de brevets afin de garantir que seule la publication la plus ancienne pour chaque demande est incluse, triés par ordre décroissant du nombre de mots, et limités aux 100 premiers résultats?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq128","db":"PATENTSVIEW","question":"Récupérez les informations suivantes pour les brevets américains déposés entre le 1er janvier 2014 et le 1er février 2014. Le titre et le résumé du brevet. La date de publication du brevet. Le nombre de citations en arrière pour chaque brevet (c.-à-d. le nombre de brevets cités par le brevet actuel avant sa date de dépôt). Le nombre de citations en avant pour chaque brevet dans les cinq premières années suivant sa publication (c.-à-d. le nombre de brevets qui ont cité le brevet actuel dans les 5 ans après sa publication). Pour chaque brevet, assurez-vous que les citations en avant ne sont comptées que pour les citations dans les 5 ans après la date de publication, et que les citations en arrière sont comptées pour les citations avant la date de dépôt.","external_knowledge":"forward_backward_citation.md"}
{"instance_id":"sf_bq246","db":"PATENTSVIEW","question":"Récupérer des brevets américains avec le nombre de citations en avant dans les 3 premières années après la date de dépôt de la demande de brevet (c.-à-d. des brevets citant le brevet en cours dans les 3 ans). N'inclure que les brevets présentant à la fois des citations en arrière dans l'année qui précède la date de dépôt et des citations en avant dans l'année qui suit la date de dépôt. La requête devrait se concentrer sur des catégories CPC spécifiques, trier les résultats par citations en arrière par ordre décroissant, et retourner le brevet ayant le plus grand nombre de citations en arrière, en limitant à un seul résultat.","external_knowledge":null}
{"instance_id":"sf_bq052","db":"PATENTSVIEW","question":"Extraire les informations suivantes pour les brevets américains : l’identifiant du brevet, le titre et la date de dépôt. Le nombre de citations en amont dans le mois précédant la date de dépôt (c’est‑à‑dire des brevets qui ont cité le brevet en question avant son dépôt). Le nombre de citations en aval dans le mois suivant la date de dépôt (c’est‑à‑dire des brevets qui ont cité le brevet après son dépôt). Le texte du résumé du brevet. N’incluez que les brevets appartenant à des catégories CPC spécifiques, telles que la sous-section 'C05' ou le groupe 'A01G'. La requête doit filtrer les brevets afin qu’ils incluent uniquement ceux qui ont au moins une citation en amont ou une citation en aval dans la période d’un mois spécifiée. Triez les résultats par date de dépôt et renvoyez tous les enregistrements correspondants.","external_knowledge":null}
{"instance_id":"sf_bq036","db":"GITHUB_REPOS","question":"Quel était le nombre moyen de commits effectués sur GitHub par mois en 2016 pour des dépôts contenant du code Python ?","external_knowledge":null}
{"instance_id":"sf_bq100","db":"GITHUB_REPOS","question":"Comment pouvons-nous identifier les 10 packages les plus fréquemment utilisés dans le contenu d'un dépôt GitHub en recherchant les déclarations d'importation entourées de parenthèses, en séparant les imports multi-lignes par des sauts de ligne, en extrayant les noms de packages qui apparaissent entre guillemets doubles, en comptant leur fréquence d'apparition, en ignorant les résultats nuls, et enfin en les ordonnant par fréquence décroissante ? La réponse finale doit retirer les guillemets.","external_knowledge":null}
{"instance_id":"sf_bq101","db":"GITHUB_REPOS","question":"À partir du contenu des dépôts GitHub, comment pouvons-nous identifier les 10 noms de packages importés les plus fréquents dans les fichiers source Java en divisant le contenu de chaque fichier en lignes, en filtrant les instructions d'importation valides, en extrayant uniquement la portion du package à l'aide d'une expression régulière adaptée, en regroupant par ces noms de packages extraits, en comptant leurs occurrences, et enfin en retournant les 10 packages qui apparaissent le plus souvent par ordre décroissant de fréquence?","external_knowledge":null}
{"instance_id":"sf_bq182","db":"GITHUB_REPOS_DATE","question":"Quels langages de programmation principaux, déterminés par le plus grand nombre d'octets dans chaque dépôt, ont au moins 5 PullRequestEvents le 18 janvier 2023 à travers tous leurs dépôts ?","external_knowledge":null}
{"instance_id":"sf_bq217","db":"GITHUB_REPOS_DATE","question":"Le 18 janvier 2023, combien d'événements de création de pull request se sont produits dans des dépôts GitHub qui incluent JavaScript comme l'un de leurs langages de programmation ? Utilisez les données de la table githubarchive pour les événements et de la table languages pour les informations sur les langages des dépôts.","external_knowledge":null}
{"instance_id":"sf_bq191","db":"GITHUB_REPOS_DATE","question":"À partir des données GitHub WatchEvent de 2017, trouvez les deux dépôts principaux qui ont plus de 300 observateurs distincts, en veillant à ce que les résultats soient joints à la table 'sample_files' afin que nous retournions le nom de chaque dépôt ainsi que son nombre d'observateurs distincts, et limitez la sortie aux deux dépôts ayant le plus grand nombre d'observateurs.","external_knowledge":null}
{"instance_id":"sf_bq224","db":"GITHUB_REPOS_DATE","question":"Quel dépôt disposant d'une licence approuvée dans `licenses.md` a eu le total cumulé le plus élevé des forks, des issues et des watches en avril 2022 ?","external_knowledge":null}
{"instance_id":"sf_bq192","db":"GITHUB_REPOS_DATE","question":"Trouvez le dépôt Python le plus actif sur GitHub en vous basant sur le nombre d'observateurs, les issues et les forks. La requête doit sélectionner les dépôts sous des licences open-source spécifiques (`artistic-2.0`, `isc`, `mit`, `apache-2.0`), compter le nombre distinct d'observateurs, d'événements d'issues et de forks pour chaque dépôt en avril 2022, et inclure uniquement ceux qui possèdent des fichiers `.py` sur la branche `master`. Joindre les données de licence aux comptes d'observateurs, d'événements d'issues et de forks, puis trier selon une métrique combinée de forks, d'issues et d'observateurs, retournant le nom et le compte du dépôt le plus actif.","external_knowledge":null}
{"instance_id":"sf_bq225","db":"GITHUB_REPOS","question":"À partir des fichiers du dépôt GitHub dans 'github_repos.sample_files' jointés avec 'github_repos.sample_contents', quels sont les 10 langages de programmation qui apparaissent le plus fréquemment (basé sur les extensions de fichiers reconnues) dans les fichiers dont le contenu n'est pas vide, triés par leur nombre de fichiers par ordre décroissant ?","external_knowledge":"lang_and_ext.md"}
{"instance_id":"sf_bq180","db":"GITHUB_REPOS","question":"Obtenez les 5 noms de modules les plus fréquemment utilisés à partir des scripts Python (`.py`) et R (`.r`), en comptant les occurrences de modules dans les instructions `import` et `from` pour Python, et les appels `library()` pour R. La requête doit considérer uniquement les fichiers Python et R, regrouper par nom de module et retourner les 5 modules les plus fréquents triés par fréquence.","external_knowledge":null}
{"instance_id":"sf_bq233","db":"GITHUB_REPOS","question":"Pouvez-vous analyser les données réunies des fichiers des dépôts GitHub et du contenu de github_repos, en vous concentrant uniquement sur les fichiers se terminant par '.py' ou '.r', puis extraire les modules Python à partir des lignes 'import' ou 'from ... import', et les bibliothèques R à partir des lignes 'library(...)', compter leurs occurrences, et enfin lister les résultats triés par langue et par le nombre d'occurrences en ordre décroissant ?","external_knowledge":null}
{"instance_id":"sf_bq248","db":"GITHUB_REPOS","question":"Parmi tous les dépôts qui n'utilisent aucun langage de programmation dont le nom (insensible à la casse) contient la sous-chaîne \"python,\" quelle est la proportion des fichiers dont les chemins contiennent \"readme.md\" et dont le contenu contient l'expression \"Copyright (c)\"?","external_knowledge":null}
{"instance_id":"sf_bq193","db":"GITHUB_REPOS","question":"Récupérez toutes les lignes non vides et non commentées à partir des fichiers `README.md` dans les dépôts GitHub, en excluant les lignes qui sont des commentaires (soit commençant par `#` pour Markdown ou `//` pour les commentaires de code). Pour chaque ligne, calculez combien de fois chaque ligne unique apparaît dans l'ensemble des dépôts et renvoyez une liste séparée par des virgules des langages de programmation utilisés dans chaque dépôt contenant cette ligne, triée par ordre alphabétique, les résultats étant ordonnés selon la fréquence d'apparition en ordre décroissant.","external_knowledge":null}
{"instance_id":"sf_bq295","db":"GITHUB_REPOS_DATE","question":"En utilisant les données de l'archive GitHub de 2017 pour les événements de surveillance, quels sont les trois dépôts qui incluent au moins un fichier Python (avec l'extension .py) de moins de 15 000 octets et contenant la sous-chaîne \"def \" dans leur contenu, et qui ont le nombre total d'événements de surveillance le plus élevé pour cette année ?","external_knowledge":null}
{"instance_id":"sf_bq249","db":"GITHUB_REPOS","question":"Veuillez fournir un rapport sur le nombre d'occurrences de types de ligne spécifiques à travers les fichiers du dépôt GitHub. Classez une ligne comme 'à la fin' si elle se termine par un caractère blanc, comme 'Espace' si elle commence par un espace, et comme 'Autre' si elle ne satisfait aucune de ces conditions. Le rapport doit inclure le nombre total d'occurrences pour chaque catégorie, en tenant compte de toutes les lignes de tous les fichiers.","external_knowledge":null}
{"instance_id":"sf_bq375","db":"GITHUB_REPOS","question":"Déterminez quel type de fichier parmi Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java) et JavaScript (.js) dans la base de code GitHub possède le plus grand nombre de fichiers dont la profondeur de répertoire est supérieure à 10, et indiquez le nombre de fichiers.","external_knowledge":null}
{"instance_id":"sf_bq255","db":"GITHUB_REPOS","question":"Combien de messages de commit y a-t-il dans les dépôts qui utilisent le langage de programmation 'Shell' et la licence 'apache-2.0', lorsque la longueur du message de commit est supérieure à 5 caractères mais inférieure à 10 000 caractères, et que les messages ne commencent pas par le mot 'merge', 'update' ou 'test' ?","external_knowledge":null}
{"instance_id":"sf_bq194","db":"GITHUB_REPOS","question":"Parmi tous les fichiers Python (*.py), R (*.r, *.R, *.Rmd, *.rmd), et les notebooks IPython (*.ipynb) dans le jeu de données d'exemple GitHub, quelle bibliothèque ou quel module est identifié comme le deuxième plus fréquemment importé ou chargé sur la base des déclarations d'importation extraites ?","external_knowledge":null}
{"instance_id":"sf_bq377","db":"GITHUB_REPOS","question":"Extraire et compter la fréquence de tous les noms de paquets listés dans la section require du contenu au format JSON","external_knowledge":null}
{"instance_id":"sf_bq359","db":"GITHUB_REPOS","question":"Énumérez les noms des dépôts et les nombres de commits pour les deux dépôts GitHub dont le langage principal est JavaScript et qui ont le plus grand nombre de commits.","external_knowledge":null}
{"instance_id":"sf_bq252","db":"GITHUB_REPOS","question":"Pourriez-vous s'il vous plaît trouver le nom du dépôt qui contient le fichier Swift non binaire le plus copié dans l'ensemble de données, en veillant à ce que chaque fichier soit identifié de manière unique par son ID ?","external_knowledge":null}
{"instance_id":"sf_bq251","db":"PYPI","question":"Je veux connaître les URL de projet GitHub pour les 3 paquets PyPI les plus téléchargés selon le nombre de téléchargements. Tout d'abord, extrayez les métadonnées des paquets PyPI, y compris le nom, la version et les URL de projet. Filtrer ces URL pour ne conserver que celles qui pointent vers des dépôts GitHub. Utilisez une expression régulière pour nettoyer les URL GitHub en supprimant les parties inutiles comme les chemins 'issues', 'pull', 'blob' et 'tree', en ne gardant que l'URL du dépôt principal. Pour les paquets comportant plusieurs versions, n'utiliser que la version la plus récente en fonction du temps de téléversement. Combinez ces données avec les métriques de téléchargement pour déterminer les paquets les plus téléchargés. Ne renvoyez que les URL de dépôt GitHub nettoyées (sans guillemets) pour les 3 premiers paquets par total de téléchargements, en veillant à ce que seuls les paquets avec des URL GitHub valides soient inclus dans les résultats.","external_knowledge":null}
{"instance_id":"bq019","db":"cms_data","question":"Dans les données de frais d'hospitalisation CMS Medicare de 2014, quelle définition DRG a le plus grand nombre total de sorties, et parmi les trois villes affichant le plus grand nombre de sorties pour cette définition DRG, quels sont leurs paiements totaux moyens pondérés respectifs (pondérés par le total des sorties)","external_knowledge":null}
{"instance_id":"bq234","db":"cms_data","question":"Quel est le médicament le plus prescrit dans chaque État en 2014 ?","external_knowledge":null}
{"instance_id":"bq235","db":"cms_data","question":"Pouvez-vous me dire quel prestataire de soins de santé a les coûts moyens combinés les plus élevés pour les services ambulatoires et hospitaliers en 2014 ?","external_knowledge":null}
{"instance_id":"bq172","db":"cms_data","question":"Pour le médicament affichant le plus grand nombre total d'ordonnances dans l'État de New York au cours de l'année 2014, pourriez-vous dresser la liste des cinq États affichant le plus grand nombre total de réclamations pour ce médicament ? Veuillez également indiquer leurs nombres totaux de réclamations et les coûts totaux des médicaments.","external_knowledge":null}
{"instance_id":"bq177","db":"cms_data","question":"Pour le fournisseur dont le coût total hospitalier Medicare de 2011 à 2015 est le plus élevé (calculé comme la somme de average_medicare_payments multipliée par total_discharges), veuillez indiquer le coût annuel moyen hospitalier de ce fournisseur et le coût annuel moyen ambulatoire pour chaque année civile de cette période, où le coût hospitalier est calculé comme la moyenne de (average_medicare_payments × total_discharges) et le coût ambulatoire est calculé comme la moyenne de (average_total_payments × outpatient_services).","external_knowledge":null}
{"instance_id":"bq354","db":"cms_data","question":"Pourriez-vous fournir le pourcentage de participants pour l'acné standard, la dermatite atopique, le psoriasis et le vitiligo tels que définis par la Classification internationale des maladies 10-CM (ICD-10-CM), y compris leurs sous-catégories ? Veuillez inclure tous les concepts associés mappés sur les codes ICD-10-CM standard (L70 pour l'acné, L20 pour la dermatite atopique, L40 pour le psoriasis et L80 pour le vitiligo) en utilisant les relations entre concepts, y compris les concepts descendants. Le pourcentage doit être calculé sur le nombre total de participants, en ne tenant compte que des concepts standard et de leurs descendants liés.","external_knowledge":null}
{"instance_id":"bq355","db":"cms_data","question":"Veuillez me dire le pourcentage de participants qui n'utilisent pas quinapril et les médicaments connexes (Quinapril RxCUI: 35208).","external_knowledge":null}
{"instance_id":"bq032","db":"noaa_data","question":"Pouvez-vous fournir la latitude des coordonnées finales de l'ouragan qui a parcouru la deuxième plus longue distance dans l'Atlantique Nord en 2020 ?","external_knowledge":"functions_st_distance.md"}
{"instance_id":"bq119","db":"noaa_data","question":"Veuillez afficher les informations sur l’ouragan ayant la troisième plus longue distance totale parcourue dans l’Atlantique Nord en 2020, en incluant ses coordonnées de déplacement, la distance de déplacement cumulée (en kilomètres) à chaque point, et la vitesse maximale du vent soutenu à ces moments.","external_knowledge":"functions_st_distance.md"}
{"instance_id":"sf_bq117","db":"NOAA_DATA","question":"Quel est le nombre total d'événements de tempête sévères qui se sont produits dans le mois le plus touché au cours des 15 dernières années selon les enregistrements de la NOAA, en ne tenant compte que des 100 événements de tempête ayant les dégâts matériels les plus importants.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq419","db":"noaa_data","question":"Quels sont les 5 États qui ont le plus d'événements de tempête entre 1980 et 1995, en ne considérant que les 1000 États ayant le plus grand nombre d'événements chaque année ? Veuillez utiliser les abréviations d'État.","external_knowledge":null}
{"instance_id":"sf_bq071","db":"NOAA_DATA_PLUS","question":"Pouvez-vous fournir le nombre d'ouragans et une liste des noms d'ouragans (triés par ordre alphabétique et séparés par des virgules) pour chaque city et son zip code associé, lorsque les ouragans se trouvent dans les limites des zip codes ? Veuillez exclure tout ouragan sans nom, et trier les résultats par le nombre d'ouragans en ordre décroissant. La sortie doit inclure les colonnes suivantes : city, zip code, state, count of hurricanes, et la liste des ouragans.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq236","db":"NOAA_DATA_PLUS","question":"Quels sont les cinq premiers codes postaux des zones des États-Unis qui ont connu le plus grand nombre d'événements de grêle au cours des dix dernières années ? N'utilisez pas les données de la table des rapports de grêle.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq356","db":"noaa_data","question":"Parmi toutes les stations GSOD de la NOAA qui ont enregistré des données de température quotidiennes valides (température non manquante, max, min) en 2019 et dont la période d'enregistrement a commencé au plus tard le 1er janvier 2000 et s'est poursuivie au moins jusqu'au 30 juin 2019, combien de ces stations ont atteint 90 % ou plus du nombre maximal possible de jours d'enregistrements de températures valides en 2019 ?","external_knowledge":null}
{"instance_id":"bq042","db":"noaa_data","question":"Pouvez-vous m'aider à récupérer la température moyenne, la vitesse moyenne du vent et les précipitations pour l'aéroport LaGuardia à New York, le June 12, pour chaque année de 2011 à 2020, en utilisant spécifiquement l'ID de station 725030 ?","external_knowledge":null}
{"instance_id":"bq394","db":"noaa_data","question":"Quels sont les trois mois entre 2010 et 2014 qui présentent la plus petite somme des différences absolues entre la température moyenne de l'air, la température du bulbe humide, la température du point de rosée et la température de surface de la mer, en incluant les années respectives et la somme des différences ? Veuillez présenter l'année et le mois au format numérique.","external_knowledge":null}
{"instance_id":"bq357","db":"noaa_data","question":"Quelles sont les coordonnées de latitude, de longitude et les dates entre 2005 et 2015 associées aux 5 vitesses moyennes journalières du vent les plus élevées, en excluant les enregistrements dont les valeurs de vitesse du vent sont manquantes ? En utilisant les données des tables dont le préfixe commence par \"icoads_core\".","external_knowledge":null}
{"instance_id":"bq181","db":"noaa_data","question":"Quel pourcentage des stations météorologiques ont enregistré des données de température valides (avec aucune valeur manquante ou invalide) pour au moins 90% des jours en 2022, lorsque les valeurs de température, maximale et minimale ne sont ni NULL ni égales à 9999.9, et que la station possède un identifiant valide (le code USAF n'est pas égal à '999999'), sur l'ensemble des stations disponibles dans la base de données NOAA GSOD ?","external_knowledge":null}
{"instance_id":"bq045","db":"noaa_data","question":"Quelles stations météorologiques dans l'État de Washington ont enregistré plus de 150 jours de pluie en 2023 mais moins de jours de pluie par rapport à 2022 ? En définissant un « jour de pluie » comme ayant des précipitations supérieures à zéro millimètre et n'étant pas égal à 99.99. Inclure uniquement les stations disposant de données de précipitations valides.","external_knowledge":null}
{"instance_id":"sf_bq358","db":"NEW_YORK_CITIBIKE_1","question":"Pouvez-vous me dire quel trajet à vélo à New York le 15 juillet 2015 a commencé et s'est terminé dans des zones de code postal ayant la température moyenne la plus élevée ce jour-là, telle qu'enregistrée par la station météorologique de Central Park (WBAN '94728') ? S'il existe plus d'un trajet répondant à ces critères, j'aimerais connaître celui qui commence dans le code postal le plus petit et se termine dans le code postal le plus grand. Veuillez retourner les codes postaux de départ et d'arrivée de ce trajet.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq290","db":"noaa_data","question":"Pouvez-vous calculer la différence entre la température maximale, la température minimale et la température moyenne entre les stations météorologiques des États-Unis et du Royaume-Uni pour chaque jour du mois d'octobre 2023, en utilisant le champ date, et en excluant les enregistrements présentant des valeurs de température manquantes ou invalides ?","external_knowledge":null}
{"instance_id":"bq031","db":"noaa_data","question":"Fournissez les données météorologiques quotidiennes pour Rochester from January 1 to March 31, 2019, y compris la température (en Celsius), les précipitations (en centimeters) et la vitesse du vent (en meters per second). Pour chaque variable, calculez la moyenne mobile sur 8 jours (en incluant le jour courant et les 7 jours précédents). Également, calculez la différence entre la moyenne mobile de chaque jour et les moyennes mobiles des jours précédents 1 à 8 jours (i.e., lag1 à lag8). Le résultat doit inclure: les valeurs quotidiennes pour la température, les précipitations et la vitesse du vent. Les moyennes mobiles sur 8 jours pour chaque variable. Les différences entre les moyennes mobiles pour chacun des jours précédents 1 à 8 jours (par exemple, la différence entre la moyenne mobile d'aujourd'hui et celle d'il y a 1 jour, d'il y a 2 jours, et ainsi de suite). Arrondissez toutes les valeurs à une décimale. Les données doivent être triées par date, starting from January 9, 2019.","external_knowledge":null}
{"instance_id":"bq392","db":"noaa_gsod","question":"Quelles sont les 3 dates en octobre 2009 ayant la température moyenne la plus élevée pour la station numéro 723758, au format YYYY-MM-DD?","external_knowledge":null}
{"instance_id":"sf_bq050","db":"NEW_YORK_CITIBIKE_1","question":"Je veux analyser les trajets à vélo à New York City en 2014 en reliant les données de trajets à des informations météorologiques afin de comprendre comment les conditions météorologiques (température, vitesse du vent et précipitations) influencent les trajets à vélo entre les quartiers. Pour chaque combinaison de quartiers de départ et d'arrivée, je dois obtenir ce qui suit : 1. le nombre total de trajets à vélo entre les quartiers. 2. la durée moyenne du trajet en minutes (arrondie à 1 décimale). 3. la température moyenne au départ du trajet (arrondie à 1 décimale). 4. la vitesse moyenne du vent au départ (en mètres par seconde, arrondie à 1 décimale). 5. les précipitations moyennes au départ (en centimètres, arrondies à 1 décimale). 6. le mois ayant le plus de trajets (par exemple `4` pour avril). Les données doivent être regroupées par les quartiers de départ et d'arrivée, avec `zip_codes` dans `geo_us_boundaries` utilisés pour cartographier les emplacements des trajets à vélo en fonction de la latitude et de la longitude. `zip_codes` dans `cyclistic` utilisés pour obtenir les noms des arrondissements et des quartiers. En utilisant les données météorologiques de la station Central Park pour la date du trajet, couvrant tous les trajets en 2014.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq426","db":"NEW_YORK_CITIBIKE_1","question":"Quel type d'utilisateur a enregistré la température moyenne la plus élevée pour des trajets commençant et se terminant dans le code postal 10019 de New York en 2018 ? Incluez les précipitations moyennes, la vitesse du vent et la température pour ce type d'utilisateur sur la base des données météorologiques de la station Central Park de New York.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq291","db":"NOAA_GLOBAL_FORECAST_SYSTEM","question":"Pouvez-vous fournir un résumé météo quotidien pour juillet 2019 dans un rayon de 5 km autour de la latitude 26.75 et de la longitude 51.5 ? J'ai besoin des températures maximales, minimales et moyennes ; des précipitations totales ; de la couverture nuageuse moyenne entre 10 h et 17 h ; des chutes de neige totales (lorsque la température moyenne est inférieure à 32°F) ; et des précipitations totales (lorsque la température moyenne est de 32°F ou plus) pour chaque date de prévision. Les données doivent correspondre aux prévisions créées en juillet 2019 pour le lendemain.","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq208","db":"new_york_noaa","question":"Pouvez-vous fournir les stations météorologiques situées dans un rayon de 20 miles autour de Chappaqua, New York (Latitude: 41.197, Longitude: -73.764), et me dire le nombre d'observations de température valides qu'elles ont enregistrées de 2011 à 2020, en excluant toute donnée de température invalide ou manquante ?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq047","db":"new_york_noaa","question":"Pourriez-vous analyser la relation entre chaque type de plainte et la température quotidienne à New York, en utilisant spécifiquement les données de température des aéroports de LaGuardia (STN=725030) et JFK (STN=744860) sur les 10 années commençant en 2008, puis déterminer, pour chaque type de plainte qui totalise plus de 5000 occurrences au total et montre une forte corrélation (valeur absolue > 0.5) avec la température, le nombre total de plaintes, le nombre total de jours avec des relevés de température valides, et les coefficients de corrélation de Pearson (arrondis à quatre décimales) entre la température et à la fois le nombre quotidien de plaintes ainsi que le pourcentage quotidien du total des plaintes, en excluant tout jour avec des données de température manquantes ou invalides (comme 9999.9) ?","external_knowledge":null}
{"instance_id":"bq048","db":"new_york_noaa","question":"Quels types de plaintes, ayant plus de 3000 demandes au total entre 2011 et 2020, présentent les corrélations de Pearson les plus fortes positives et négatives avec la vitesse du vent moyenne quotidienne mesurée à la station 744860 (JFK Airport), basées sur les proportions quotidiennes de plaintes (le rapport entre les plaintes d'un type et le total des plaintes quotidiennes) ? Veuillez fournir les types de plaintes et leurs coefficients de corrélation, arrondis à quatre décimales.","external_knowledge":null}
{"instance_id":"bq293","db":"new_york_geo","question":"Je souhaite analyser les données des trajets des taxis jaunes de New York City, en particulier pour le 1er janvier 2015, en utilisant l'ensemble de données bigquery-public-data.new_york.tlc_yellow_trips_2015. Je dois joindre cela à la table geo_us_boundaries.zip_codes pour mapper chaque trajet à son code postal NYC respectif en fonction des coordonnées de prise en charge. L'analyse devrait créer une répartition complète heure par heure pour tous les codes postaux en croisant des codes postaux distincts avec des heures distinctes, y compris les heures sans trajets. Pour chaque combinaison code postal et heure, calculez le nombre total de trajets et les métriques temporelles suivantes : le nombre de trajets il y a 1 heure, il y a 24 heures, il y a 7 jours (168 heures) et il y a 14 jours (336 heures). De plus, calculez les moyennes mobiles sur 14 jours et 21 jours et les écarts-types des nombres de trajets, en excluant l'heure actuelle. N'incluez que les trajets pour lesquels les coordonnées de latitude et de longitude sont valides. Les résultats finaux doivent être triés par le nombre de trajets le plus élevé, n'affichant que les 5 premiers groupes ayant le plus de trajets.","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq017","db":"GEO_OPENSTREETMAP","question":"Quels sont les cinq types d'autoroutes les plus longues dans la frontière multipolygone du Danemark (tel que défini par l'identifiant Wikidata 'Q35') par longueur totale, analysés via les caractéristiques planétaires?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq131","db":"GEO_OPENSTREETMAP","question":"Quel est le nombre d'arrêts de bus pour le réseau de bus qui compte le plus d'arrêts, dans la frontière multipolygone du Danemark (tel que défini par l'ID Wikidata 'Q35'), analysé à travers les caractéristiques Planet ?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq349","db":"GEO_OPENSTREETMAP","question":"Quel identifiant OpenStreetMap de la planet features table correspond à une frontière administrative, représentée comme des multipolygons, dont le nombre total de 'amenity'-tagués Points d'intérêt (POIs), tel que dérivé de la planet nodes table, est le plus proche de la médiane du nombre total parmi toutes ces frontières ?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq007","db":"CENSUS_BUREAU_ACS_2","question":"Identifiez les 10 États américains présentant la population vulnérable la plus élevée, calculée sur la base d'une somme pondérée des secteurs d'emploi à partir des données ACS sur 5 ans de 2017, et déterminez leur variation moyenne du revenu médian entre 2015 et 2018 en utilisant les données par code postal.","external_knowledge":"total_vulnerable_weights.md"}
{"instance_id":"sf_bq429","db":"CENSUS_BUREAU_ACS_2","question":"Quels sont les cinq États qui présentent la plus grande différence moyenne du revenu médian entre 2015 et 2018 au niveau du code postal, et quel est le nombre moyen correspondant d’employés vulnérables dans les secteurs du commerce de gros, des ressources naturelles et du secteur de la construction, des arts et du divertissement, de l’information et du commerce de détail en 2017 selon les estimations quinquennales de l’ACS et les données sur les limites des codes ZIP ?","external_knowledge":"avg_vulnerable_weights.md"}
{"instance_id":"sf_bq073","db":"CENSUS_BUREAU_ACS_2","question":"En utilisant les données sur les différences de revenu médian au niveau ZIP entre 2015 et 2018, ainsi que les chiffres d'emploi ACS de 2017, dressez la liste de chaque État par ordre décroissant du nombre total de travailleurs vulnérables, où « vulnérables » est défini comme 38 % des employés du commerce de gros et 41 % des employés de la fabrication en 2017. Vos résultats doivent inclure le nom de l'État, le nombre de travailleurs vulnérables du commerce de gros, le nombre de travailleurs vulnérables de la fabrication et le total combiné de ces travailleurs vulnérables.","external_knowledge":null}
{"instance_id":"sf_bq410","db":"CENSUS_BUREAU_ACS_2","question":"Trouver les 3 premiers États ayant la plus faible population ajustée hors de la force de travail en utilisant les données ACS 2017 au niveau des tracts. Calculer la population ajustée hors de la force de travail comme (unemployed_pop + not_in_labor_force - group_quarters), en plafonnant les valeurs négatives à zéro. Pour chacun de ces États, afficher l'abréviation de l'État, la variation totale du revenu médian entre 2015 et 2018 pour l'ensemble des tracts, le total de population ajustée hors de la force de travail et la proportion moyenne ajustée à la population (calculée comme le rapport de la population ajustée hors de la force de travail à la population totale au niveau du tract). Joindre les données des tracts à celles des États en utilisant les préfixes des codes FIPS, exclure tout tract dont les différences de revenus sont nulles, et trier les résultats par la population ajustée hors de la force de travail par ordre croissant.","external_knowledge":null}
{"instance_id":"sf_bq348","db":"GEO_OPENSTREETMAP","question":"Dans la zone rectangulaire définie par les geogpoints (31.1798246, 18.4519921), (54.3798246, 18.4519921), (54.3798246, 33.6519921) et (31.1798246, 33.6519921), quels sont les trois noms d'utilisateur les plus susceptibles d'être responsables du plus grand nombre de nœuds historiques, initialement tagués avec les commodités ‘hospital’, ‘clinic’, ou ‘doctors’, qui n'apparaissent plus dans l'ensemble de données planet_nodes actuel ?","external_knowledge":"functions_st_intersects_polygon_line.md"}
{"instance_id":"sf_bq253","db":"GEO_OPENSTREETMAP","question":"Trouvez le nom de la relation OpenStreetMap qui englobe le plus d'entités dans la même zone géographique que le multipolygone étiqueté par l'élément Wikidata 'Q1095'. La relation doit avoir un nom spécifié et ne pas comporter de tag 'wikidata', et au moins une des entités incluses doit posséder un tag 'wikidata'. L'analyse doit être effectuée en utilisant la table planet_features. Retournez le nom de cette relation.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq254","db":"GEO_OPENSTREETMAP","question":"Parmi tous les multipolygones situés dans la même zone géographique que le multipolygone associé à l’élément Wikidata Q191, mais ne possédant pas eux-mêmes une étiquette 'wikidata', lesquels deux se classent en tête du classement selon le nombre de points qui se trouvent à l’intérieur de leurs limites, et quels sont leurs noms ?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq056","db":"GEO_OPENSTREETMAP_BOUNDARIES","question":"Combien de paires différentes de routes classées comme autoroute, tronçon, primaire, secondaire ou résidentielle en Californie se chevauchent sans partager de nœuds et ne possèdent pas l'étiquette 'bridge', lorsque ces routes sont taguées avec 'highway', analysées via planet ways","external_knowledge":"functions_st_intersects.md"}
{"instance_id":"sf_bq289","db":"GEO_OPENSTREETMAP_CENSUS_PLACES","question":"Pouvez-vous trouver la distance la plus courte entre deux commodités (soit une bibliothèque, un lieu de culte ou un centre communautaire) situées à Philadelphie, analysée via la table pennsylvania et les points de caractéristiques planétaires ?","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq250","db":"GEO_OPENSTREETMAP_WORLDPOP","question":"En se basant sur les données les plus récentes de grilles de population 1 km à Singapour avant janvier 2023, en utilisant ST_CONVEXHULL pour agréger tous les centroïdes des grilles de population en une région bornée et ST_INTERSECTS pour identifier les hôpitaux à partir de la couche planète d'OpenStreetMap (layer_code in (2110, 2120)) qui se trouvent dans cette région, puis calculer la distance de chaque cellule de grille à son hôpital le plus proche, quelle est la population totale de la cellule de grille qui est la plus éloignée de tout hôpital ?","external_knowledge":"OpenStreetMap_data_in_layered_GIS_format.md"}
{"instance_id":"sf_bq083","db":"CRYPTO","question":"Pouvez-vous calculer la variation journalière de la valeur marchande des jetons USDC (adresse `0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48`) pour l'année 2023, sur la base des transactions Ethereum ? La variation doit être calculée à partir des opérations d'émission (modèle d'entrée `0x40c10f19%`) et de destruction (modèle d'entrée `0x42966c68%`). Pour chaque transaction, l'émission doit être positive et la destruction négative. Extraire le montant pertinent du champ 'input' sous forme hexadécimale, le convertir en millions, l'exprimer au format USD. Regrouper les résultats par date et les classer par ordre décroissant.","external_knowledge":"Total_Market_Value_Change.md"}
{"instance_id":"sf_bq184","db":"CRYPTO","question":"En utilisant uniquement les traces, pouvez-vous calculer les comptes cumulés quotidiens des contrats intelligents créés par des adresses externes (où le trace_address est NULL) par rapport à ceux créés par d'autres contrats (où le trace_address est NOT NULL) pour chaque date du 2017-01-01 au 2021-12-31, en veillant à inclure toutes les dates de cette plage même si aucun nouveau contrat n'a été créé certains jours, et en affichant des totaux cumulés qui augmentent de manière monotone pour les deux catégories ?","external_knowledge":null}
{"instance_id":"sf_bq195","db":"CRYPTO","question":"Quelles sont les 10 adresses Ethereum ayant les soldes les plus élevées, en tenant compte à la fois des transactions de valeur et des frais de gaz, avant le 1er septembre 2021 ? Ne conservez que les transactions réussies sans type d'appel ou lorsque le type d'appel est 'call'.","external_knowledge":null}
{"instance_id":"sf_bq256","db":"CRYPTO","question":"Déterminez le solde final d'Ether de l’adresse Ethereum qui a initié le plus grand nombre de transactions réussies avant le 1er septembre 2021 (UTC), en excluant les appels du type delegatecall, callcode ou staticcall et en incluant tous les transferts entrants et sortants pertinents, les récompenses des mineurs et les déductions des frais de gaz, le solde final étant exprimé en Ether après conversion à partir de l’unité native.","external_knowledge":null}
{"instance_id":"sf_bq080","db":"CRYPTO","question":"En utilisant uniquement la table des traces Ethereum, pouvez-vous fournir un décompte cumulé quotidien des contrats intelligents créés par des utilisateurs externes (where trace_address is null) versus les contrats créés par d'autres contrats (where trace_address is not null) entre le 30 août 2018 et le 30 septembre 2018 ? Assurez-vous que les résultats incluent chaque date de cette plage, même si aucun nouveau contrat n'a été créé, et que les totaux cumulatifs soient strictement croissants.","external_knowledge":null}
{"instance_id":"sf_bq342","db":"CRYPTO","question":"Quelle est la différence entre les variations horaires moyennes des valeurs des transactions pour le jeton Ethereum 0x68e54af74b22acaccffa04ccaad13be16ed14eac, en particulier en ne considérant que les transactions où l'adresse 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d était l'expéditeur ou l'adresse 0xfbd6c6b112214d949dcdfb1217153bc0a742862f était le destinataire, entre le 1er janvier 2019 et le 31 décembre 2020, lors de la comparaison entre 2019 et 2020 ?","external_knowledge":null}
{"instance_id":"sf_bq341","db":"CRYPTO","question":"Quelle adresse Ethereum détient les 3 soldes positifs les plus faibles parmi les transactions impliquant le jeton à l'adresse \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\" ?","external_knowledge":null}
{"instance_id":"sf_bq444","db":"CRYPTO","question":"Pouvez-vous récupérer l’horodatage de la blockchain, le numéro de bloc et le hash de transaction pour les cinq premiers événements de mint et burn à partir des logs Ethereum pour l’adresse '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8' ? Veuillez inclure les événements de mint identifiés par le topic '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' et les événements de burn par '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c', et les classer par horodatage du bloc du plus ancien au plus récent.","external_knowledge":"ethereum_logs_and_events_overview.md"}
{"instance_id":"sf_bq340","db":"CRYPTO","question":"Quelles sont les six adresses Ethereum, à l'exclusion de l'adresse '0x0000000000000000000000000000000000000000', qui présentent les plus grandes différences absolues entre leurs soldes antérieurs et actuels des jetons situés aux adresses '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' et '0x1e15c05cbad367f044cbfbafda3d9a1510db5513' ?","external_knowledge":null}
{"instance_id":"sf_bq005","db":"CRYPTO","question":"Calculer l'intervalle moyen quotidien entre les blocs Bitcoin (en secondes) pour 2023 en joignant des blocs consécutifs via des jointures sur soi-même numérotées par ligne (y compris les intervalles inter-journaliers), en excluant le bloc de genèse, et lister les 10 premières dates avec leurs moyennes non ajustées.","external_knowledge":null}
{"instance_id":"sf_bq334","db":"CRYPTO","question":"Calculer les différences annuelles entre les moyennes de la valeur de sortie du Bitcoin selon deux méthodes : enregistrements d'entrée/sortie fusionnés : Fusionner les tables inputs et outputs, filtrer pour ne conserver que les enregistrements de sortie et calculer les moyennes annuelles. Table Transactions : utiliser directement le champ output_value de la table transactions pour les moyennes annuelles. Afficher la différence (moyenne des outputs fusionnés moins moyenne des transactions) uniquement pour les années où des données existent dans les deux méthodes.","external_knowledge":null}
{"instance_id":"sf_bq335","db":"CRYPTO","question":"Parmi toutes les adresses Bitcoin qui ont au moins une transaction en octobre 2017 (en combinant à la fois les entrées et les sorties), quelle adresse a effectué sa transaction finale à la date la plus récente de ce mois et, parmi les adresses partageant cette même date la plus récente, laquelle présente la plus haute somme des valeurs des transactions ?","external_knowledge":null}
{"instance_id":"sf_bq057","db":"CRYPTO","question":"Quel mois (par exemple 3 pour mars) en 2021 a enregistré le pourcentage le plus élevé du volume des transactions Bitcoin se produisant dans les transactions CoinJoin (définies comme des transactions comportant >2 sorties, une valeur de sortie ≤ valeur d'entrée, et ayant plusieurs sorties de valeur égale) ? Fournissez également le pourcentage de toutes les transactions Bitcoin qui étaient des CoinJoins, le pourcentage de UTXOs impliqués dans les transactions CoinJoin (moyenne des pourcentages d'entrée et de sortie), et le pourcentage du volume total de Bitcoin qui s'est produit dans les transactions CoinJoin pour ce mois. Arrondissez tous les pourcentages à 1 chiffre après la virgule.","external_knowledge":null}
{"instance_id":"sf_bq068","db":"CRYPTO","question":"En utilisant les principes de la comptabilité en double entrée en traitant les entrées de transactions comme des débits (valeurs négatives) et les sorties comme des crédits (valeurs positives) pour toutes les transactions Bitcoin Cash entre le 2014-03-01 et le 2014-04-01, comment pouvons-nous calculer les soldes finaux maximum et minimum regroupés par type d'adresse à partir de ces transactions ?","external_knowledge":null}
{"instance_id":"sf_bq092","db":"CRYPTO","question":"En avril 2023, quels sont les soldes les plus élevées et les plus basses sur toutes les adresses Dash lors du calcul du solde net pour chaque adresse en utilisant la comptabilité en double entrée (où les entrées sont traitées comme des débits/valeurs négatives et les sorties comme des crédits/valeurs positives) ? Considérez toutes les transactions filtrées par block_timestamp_month='2023-04-01', et lorsque une adresse apparaît sous forme de tableau dans les données, concaténez les éléments du tableau en une chaîne séparée par des virgules. Pour chaque adresse et combinaison de type, faites la somme de toutes les valeurs pour déterminer le solde.","external_knowledge":null}
{"instance_id":"sf_bq093","db":"CRYPTO","question":"Quelles ont été les variations nettes maximales et minimales du solde des adresses Ethereum Classic le 14 octobre 2016 ? Calculez-les en additionnant toutes les transactions où les adresses ont reçu des fonds (débites), ont envoyé des fonds (crédits), et ont payé ou reçu des frais de gaz. N'incluez que les transactions dont le statut est réussi et excluez les appels internes de types. Pour les frais de gaz, prenez en compte à la fois les frais payés par les émetteurs de transactions et ceux reçus par les mineurs, calculés en les multipliant par le prix du gaz pour les mineurs et les émetteurs.","external_knowledge":null}
{"instance_id":"sf_bq292","db":"CRYPTO","question":"Analyser les transactions Bitcoin depuis July 2023 pour déterminer les pourcentages mensuels de : (1) Transactions classées comme CoinJoins (définies par >2 sorties, valeur de sortie ≤ valeur d'entrée, et plusieurs sorties de même valeur), (2) UTXOs impliqués dans CoinJoins (calculés comme la moyenne des ratios d'entrée/sortie CoinJoin par rapport au total des UTXOs du réseau), (3) Volume des transactions (basé sur la valeur d'entrée) attribué à CoinJoins. Fournissez les résultats dans un tableau avec des métriques mensuelles pour les transactions, les UTXOs et le volume.","external_knowledge":null}
{"instance_id":"sf_bq135","db":"CRYPTO","question":"Quelle date avant 2022 a enregistré le montant total des transactions le plus élevé dans les données de la blockchain Zilliqa ?","external_knowledge":null}
{"instance_id":"sf_bq136","db":"CRYPTO","question":"Trouver tous les chemins de transaction en 2 sauts sur la blockchain Zilliqa entre l'adresse source 'zil1jrpjd8pjuv50cfkfr7eu6yrm3rn5u8rulqhqpz' et l'adresse de destination 'zil19nmxkh020jnequql9kvqkf3pkwm0j0spqtd26e', en considérant à la fois les transactions régulières et les transitions de contrat. Un chemin à 2 sauts signifie qu'il doit y avoir une adresse intermédiaire entre la source et la destination. Excluez les chemins où une adresse intermédiaire a plus de 50 transactions sortantes afin de filtrer les échanges et les portefeuilles à forte activité. Assurez-vous que les transactions dans chaque chemin suivent l'ordre chronologique (horodatages des transactions les plus anciennes en premier). Affichez les résultats au format: '<source> --(tx ABCDE..)--> <intermediate> --(tx FGHIJ..)--> <destination>' où les identifiants de transaction sont tronqués à leurs cinq premiers caractères. Incluez uniquement les transactions confirmées sur la blockchain dans les deux étapes du chemin.","external_knowledge":null}
{"instance_id":"sf_bq065","db":"CRYPTO","question":"À partir de la table des requêtes Oracle, récupérer les 10 requêtes Oracle les plus récentes avec l'ID de script 3. Pour chaque requête, extraire toutes les paires symbole-taux en faisant correspondre chaque symbole dans le tableau \"symbols\" avec son taux correspondant à la même position dans le tableau \"rates\" à partir du résultat décodé. Ajuster chaque taux en le divisant par la valeur du multiplicateur de la requête. Renvoyer l'horodatage du bloc, l'ID de la requête Oracle, le symbole et le taux ajusté pour chaque paire symbole-taux. Triez les résultats par ordre chronologique, les enregistrements les plus récents en premier.","external_knowledge":null}
{"instance_id":"sf_bq037","db":"HUMAN_GENOME_VARIANTS","question":"Concernant les variations génétiques humaines affinées collectées lors de la phase 3 le 2015-02-20, je voudrais connaître les positions de départ minimales et maximales ainsi que les proportions de ces deux valeurs respectivement pour les bases de référence 'AT' et 'TA'.","external_knowledge":null}
{"instance_id":"sf_bq012","db":"ETHEREUM_BLOCKCHAIN","question":"Calculer le solde moyen (en quadrillions, 10^15) des 10 adresses Ethereum les plus élevées par solde net, en incluant les transferts entrants et sortants à partir des traces (seulement les transactions réussies et excluant les types d'appels tels que delegatecall, callcode et staticcall), les récompenses des mineurs (somme des frais de gaz par bloc), et les déductions des frais de gaz des expéditeurs. Exclure les adresses nulles et arrondir le résultat à deux décimales.","external_knowledge":null}
{"instance_id":"sf_bq187","db":"ETHEREUM_BLOCKCHAIN","question":"Calcule l'offre totale en circulation des jetons 'BNB' (en unités divisées par 10^18) en additionnant les soldes de toutes les adresses non nulles, où le solde de chaque adresse équivaut au total des BNB reçus moins les BNB envoyés. Excluez les transactions impliquant l'adresse zéro (0x000...) pour les expéditeurs et les destinataires.","external_knowledge":null}
{"instance_id":"sf_bq450","db":"ETHEREUM_BLOCKCHAIN","question":"Générez un rapport exhaustif sur toutes les adresses Ethereum actives avant le 1er janvier 2017, en calculant leurs soldes nets (ajustés pour les frais de transaction et en excluant les transactions delegatecall/callcode/staticcall), les schémas d'activité horaires, les jours actifs, les métriques des transactions entrantes/sortantes (comptages, contreparties uniques, transferts moyens en ETH), les interactions avec les jetons ERC20 (comptages entrants/sortants, jetons uniques, contreparties), les récompenses de minage, la fréquence de création de contrats, le nombre de transactions échouées et les tailles du bytecode des contrats, le tout avec toutes les valeurs ETH converties en unités standard (divisées par 10^18) et en excluant les adresses sans historique de transactions.","external_knowledge":"ethereum_data_transformation.md"}
{"instance_id":"bq034","db":"ghcn_d","question":"Je veux connaître les identifiants et les noms des stations météorologiques situées dans un rayon de 50 km autour du centre de Chicago (41.8319°N, 87.6847°W)","external_knowledge":null}
{"instance_id":"bq383","db":"ghcn_d","question":"Pourriez-vous fournir les précipitations enregistrées les plus élevées, la température minimale et la température maximale des 15 derniers jours de chaque année entre 2013 et 2016 à la station météorologique USW00094846 ? Assurez-vous que chaque valeur représente la mesure maximale pour cette période, avec la précipitation en millimètres et les températures en degrés Celsius, en utilisant uniquement des données validées (valeurs non nulles et sans indicateurs de qualité).","external_knowledge":null}
{"instance_id":"bq051","db":"new_york_ghcn","question":"Calculer le nombre moyen quotidien de trajets Citibike à New York pendant l'année 2016, en classant les jours comme pluvieux si les précipitations totales dépassent 5 millimètres (obtenu en divisant la valeur brute des précipitations par 10), et non pluvieux sinon. Utiliser les données de la station GHCN la plus proche située à moins de 50 km de (40.7128, -74.0060) qui possède des mesures valides et non signalées, puis comparer le nombre moyen de trajets Citibike les jours pluvieux et les jours non pluvieux.","external_knowledge":null}
{"instance_id":"bq038","db":"new_york","question":"Identifiez les 10 stations Citibike ayant la plus grande proportion de trajets en groupe, définis comme des trajets qui démarrent et se terminent à la même station, où plusieurs cyclistes partent et arrivent dans la même fenêtre temporelle de 2 minutes. Calculez la proportion comme le nombre de trajets faisant partie d'un groupe divisé par le nombre total de trajets se terminant à cette station.","external_knowledge":null}
{"instance_id":"bq053","db":"new_york","question":"Calculer la variation du nombre d'arbres vivants pour chaque couleur d'automne à New York City entre 1995 et 2015 en calculant, pour chaque espèce d'arbre, la différence entre le nombre d'arbres non marqués comme morts en 1995 et le nombre d'arbres vivants en 2015, en faisant correspondre les espèces par la forme en majuscules de leurs noms scientifiques à partir de la table tree_species. Ensuite, regroupez les espèces par leur couleur d'automne et additionnez ces différences afin de déterminer le changement total du nombre d'arbres pour chaque couleur d'automne.","external_knowledge":null}
{"instance_id":"bq054","db":"new_york","question":"Veuillez fournir les 10 espèces d'arbres les plus répandues dans l'État de New York, en utilisant leurs noms latins en majuscules lorsque le nom latin n'est pas vide et en incluant leurs noms communs, en affichant le nombre total d'arbres, les nombres d'arbres vivants et morts pour chaque année, et la croissance correspondante de ces chiffres de 1995 à 2015, puis trier selon la différence des nombres totaux d'arbres entre ces années.","external_knowledge":null}
{"instance_id":"bq021","db":"new_york","question":"Pour les 20 meilleurs itinéraires Citi Bike en 2016, quel itinéraire est plus rapide que les taxis jaunes et, parmi eux, lequel a la durée moyenne des trajets à vélo la plus longue ? Veuillez fournir le nom de la station de départ de cet itinéraire. Les coordonnées sont arrondies à trois décimales.","external_knowledge":null}
{"instance_id":"bq202","db":"new_york_plus","question":"Pour la station qui a enregistré le plus grand nombre de trajets Citibike démarrés là-bas en 2018, quel jour numérique de la semaine et quelle heure de la journée ont enregistré le plus grand nombre de trajets, en se basant sur l'heure de départ de ces trajets ?","external_knowledge":null}
{"instance_id":"bq185","db":"new_york_plus","question":"Quelle est la durée moyenne du trajet en minutes pour tous les trajets de taxi Yellow valides qui ont eu lieu entre February 1, 2016 et February 7, 2016 (inclus), avec une durée de trajet positive, plus de trois passagers et une distance de trajet d'au moins dix miles, où les lieux de prise en charge et de dépose se trouvent tous deux dans Brooklyn ?","external_knowledge":null}
{"instance_id":"bq040","db":"new_york_plus","question":"Pour les trajets de taxi jaune à NYC entre le 1er janvier et le 7 janvier 2016, à l'exclusion de tout trajet pris en charge à ‘EWR’ ou à ‘Staten Island,’ déterminez la proportion des trajets qui entrent dans chaque catégorie de pourboire pour chaque arrondissement de prise en charge. N'incluez que les trajets dont l'heure d'arrivée est postérieure à l'heure de prise en charge, le nombre de passagers est supérieur à zéro, et que trip_distance, tip_amount, tolls_amount, mta_tax, fare_amount et total_amount soient tous non négatifs. Classez le pourcentage de pourboire comme suit : 0 % (aucun pourboire), jusqu'à 5 %, 5 % à 10 %, 10 % à 15 %, 15 % à 20 %, 20 % à 25 %, et plus de 25 %.","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq098","db":"new_york_plus","question":"Pour les trajets de taxi jaune de NYC où à la fois la prise en charge et la dépose ont lieu entre le 1er et le 7 janvier 2016 inclus, calculez le pourcentage des trajets sans pourboire dans chaque arrondissement de prise en charge, en veillant à ce que seuls les trajets dont la dépose survient après la prise en charge soient inclus, que le nombre de passagers soit supérieur à zéro, et que la distance du trajet, le montant du pourboire, le montant des péages, la taxe MTA, le montant de la course et le montant total soient non négatifs; définissez les trajets « sans pourboire » comme ceux dont le taux de pourboire est nul, le taux de pourboire étant calculé comme (tip_amount × 100) divisé par total_amount (et considéré comme zéro lorsque total_amount est zéro).","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq039","db":"new_york_plus","question":"Trouver les 10 trajets de taxi les plus rentables à New York City entre le 1er et le 7 juillet 2016 (en veillant à ce que les heures d'enlèvement et de dépôt soient comprises dans ces dates) où le nombre de passagers est supérieur à cinq, la distance du trajet est d'au moins dix miles, et il n'existe pas de montants négatifs liés aux tarifs (y compris le pourboire, les péages, la taxe MTA, le tarif et le coût total). Exclure tout trajet dont l'heure de dépôt n'est pas strictement après l'heure de prise en charge, puis trier les résultats par le montant total du tarif dans l'ordre décroissant. Enfin, afficher la zone de prise en charge de chaque trajet, la zone de dépôt, la durée du trajet en secondes, la vitesse de conduite en miles par heure et le taux de pourboire en pourcentage du montant total du tarif.","external_knowledge":null}
{"instance_id":"bq203","db":"new_york_plus","question":"Pour chaque arrondissement de New York, quel est le nombre total de stations de métro, combien d'entre elles ont au moins une entrée marquée à la fois comme une entrée réelle et conforme à l'ADA, et quel pourcentage du total des stations de chaque arrondissement cela représente, en listant les arrondissements du plus élevé au plus bas en pourcentage?","external_knowledge":null}
{"instance_id":"bq035","db":"san_francisco","question":"Quelle est la distance totale parcourue par chaque vélo dans le programme San Francisco Bikeshare, mesurée en mètres ? Utilisez les données des trajets et des stations Bikeshare pour calculer cela.","external_knowledge":null}
{"instance_id":"bq186","db":"san_francisco","question":"Veuillez trouver, pour chaque combinaison année-mois (au format YYYYMM) dérivée de la date de début des trajets de vélos en libre-service à San Francisco, la première durée de trajet en minutes, la dernière durée de trajet en minutes, la durée du trajet la plus élevée en minutes et la durée du trajet la plus faible en minutes, où « premier » et « dernier » sont déterminés par l'ordre chronologique de la date de début du trajet, puis regroupez vos résultats par cette année-mois et triez-les selon la même clé année-mois.","external_knowledge":null}
{"instance_id":"bq081","db":"san_francisco_plus","question":"Trouvez les données de trajet les plus récentes pour chaque région entre 2014 et 2017. Je veux connaître le nom de chaque région, l'identifiant de ce trajet, la durée du trajet, l'heure de départ, la station de départ et le sexe du cycliste.","external_knowledge":null}
{"instance_id":"sf_bq294","db":"SAN_FRANCISCO_PLUS","question":"Pourriez-vous fournir les détails des 5 trajets les plus longs du service de vélos en libre-service qui ont commencé entre le 1er juillet 2017 et le 31 décembre 2017, y compris l'ID du trajet, la durée en secondes, la date de départ, le nom de la station de départ, l'itinéraire (déduit du nom de la station de départ au nom de la station d'arrivée), le numéro de vélo, le type d'abonné, l'année de naissance du membre, l'âge actuel du membre (calculé à partir de l'année en cours), une classification d'âge basée sur si le membre est âgé de moins de 40 ans, entre 40 et 60 ans, ou plus de 60 ans, le sexe du membre et le nom de la région de la station de départ ? Veuillez exclure tout trajet dont le nom de la station de départ, l'année de naissance du membre ou le sexe du membre ne serait pas précisé.","temporal":"Yes","external_knowledge":"trip_info.md"}
{"instance_id":"bq339","db":"san_francisco_plus","question":"Quel mois en 2017 a eu la plus grande différence absolue entre les minutes d'utilisation cumulées des vélos pour les clients et les abonnés ?","external_knowledge":null}
{"instance_id":"bq400","db":"san_francisco_plus","question":"Pour les trajets où 'Clay St & Drumm St' apparaît avant 'Sacramento St & Davis St' dans la séquence d'arrêts (dans un seul sens), quelles sont les heures de départ les plus précoces à partir de 'Clay St & Drumm St' et les heures d'arrivée les plus tardives à 'Sacramento St & Davis St' au format HH:MM:SS ? Veuillez fournir l'intitulé du trajet pour chaque itinéraire.","external_knowledge":null}
{"instance_id":"bq059","db":"san_francisco_plus","question":"Quelle est la vitesse moyenne maximale (arrondie à 1 décimale, en m/s) pour les trajets à vélo à Berkeley dont la distance du trajet est supérieure à 1000 mètres ?","external_knowledge":null}
{"instance_id":"bq376","db":"san_francisco_plus","question":"Pour chaque quartier de San Francisco où il existe au moins une station de vélos en libre-service et au moins un incident criminel, fournissez le nom du quartier ainsi que le nombre total de stations de vélos en libre-service et le nombre total d'incidents criminels dans ce quartier.","external_knowledge":null}
{"instance_id":"sf_bq014","db":"THELOOK_ECOMMERCE","question":"Pouvez-vous m'aider à déterminer le chiffre d'affaires pour la catégorie de produit qui compte le plus grand nombre de clients effectuant un achat lors de leur première commande non annulée et non retournée ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq188","db":"THELOOK_ECOMMERCE","question":"Parmi toutes les catégories de produits dans l'ensemble de données, identifiez la catégorie ayant la plus grande quantité totale d'achats (basée sur la table order_items), et pour cette catégorie spécifique, quelle est la durée moyenne, en minutes, que les utilisateurs passent à chaque visite de la page produit ? La durée moyenne doit être calculée comme la différence entre l'horodatage lorsque l'utilisateur consulte la page produit et l'horodatage de l'événement suivant au sein de la même session","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq258","db":"THELOOK_ECOMMERCE","question":"Générez un rapport mensuel pour chaque catégorie de produit, où chaque ligne correspond à des commandes dont le statut est 'Terminé' et qui ont été livrées avant l'année 2022, en regroupant par le mois et l'année de la livraison. Pour chaque catégorie, calculez le revenu total (la somme de sale_price), le nombre total de commandes terminées, et calculez la croissance en pourcentage mois sur mois tant pour le revenu que pour les commandes en comparant les totaux de chaque mois à ceux du mois précédent. Ensuite, pour les mêmes commandes, agrégez et affichez le coût total (à partir des coûts des produits), le bénéfice total (revenu moins coût total), et enfin le ratio bénéfice/coût pour chaque mois.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq259","db":"THELOOK_ECOMMERCE","question":"Utilisant des données allant jusqu'à la fin de 2022 et organisées par le mois du premier achat de chaque utilisateur, pouvez-vous fournir le pourcentage d'utilisateurs ayant effectué un achat au cours de chacun des premier, deuxième, troisième et quatrième mois depuis leur achat initial, où le \"premier mois\" fait référence au mois de leur achat initial ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq189","db":"THELOOK_ECOMMERCE","question":"En se basant uniquement sur les commandes terminées, calculez le taux de croissance mensuel moyen en pourcentage du nombre de commandes uniques (en comptant les identifiants de commande distincts) pour chaque catégorie de produit en comparant le nombre de commandes de chaque mois avec le mois précédent au sein de la même catégorie. Identifiez la catégorie de produit ayant la moyenne la plus élevée de ces taux de croissance mensuels des commandes. Ensuite, pour cette catégorie de produit spécifique, calculez le taux de croissance mensuel moyen du chiffre d'affaires en calculant le pourcentage de variation du chiffre d'affaires total (somme des prix de vente) d'un mois à l'autre et en faisant la moyenne de ces valeurs sur l'ensemble de la période.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq260","db":"THELOOK_ECOMMERCE","question":"Du 1 janvier 2019 au 30 avril 2022, combien d'utilisateurs ont l'âge le plus jeune et combien d'utilisateurs ont l'âge le plus âgé pour chaque sexe sur la plateforme de commerce électronique, en comptant séparément les utilisateurs les plus jeunes et les plus âgés pour chaque sexe ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq261","db":"THELOOK_ECOMMERCE","question":"Pour chaque mois avant janvier 2024, identifiez le produit qui a enregistré le bénéfice total le plus élevé (calculé comme la somme de sale_price moins le coût du produit) sur l'ensemble des articles de commande, puis indiquez le coût total et le bénéfice total pour ce produit le plus rentable par mois, en incluant tous les articles de commande quels que soient leurs statuts, et présentez les résultats par ordre chronologique, mois par mois.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq262","db":"THELOOK_ECOMMERCE","question":"Générez un rapport d'analyse mensuel des ventes du commerce électronique de June 2019 à December 2019 qui inclut, pour chaque catégorie de produit et chaque mois, le nombre total de commandes, le chiffre d'affaires total et le bénéfice total, ainsi que leurs taux de croissance mensuelle en utilisant les données de June 2019 comme base pour calculer la croissance à partir de July 2019. Assurez-vous que toutes les commandes soient incluses, quel que soit leur statut, et présentez les résultats triés par ordre croissant par mois (formaté comme \"2019-07\") puis par catégorie de produit. En omettant June 2019 de la sortie finale mais en l'utilisant pour les calculs de croissance.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq190","db":"THELOOK_ECOMMERCE","question":"Déterminez le nombre d'utilisateurs qui sont les plus jeunes et les plus âgés pour chaque genre (homme et femme) séparément, parmi ceux qui se sont inscrits entre January 1, 2019, et April 30, 2022. Pour chaque genre, identifiez l'âge minimum et maximum dans cette plage de dates, et comptez combien d'utilisateurs appartiennent à ces groupes d'âge respectifs.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq263","db":"THELOOK_ECOMMERCE","question":"Veuillez créer un rapport mensuel pour l'année 2023 qui se concentre sur la catégorie 'Sleep & Lounge', en affichant pour chaque mois les ventes totales, le coût total, le nombre de commandes complètes, le bénéfice total et le ratio bénéfice/coût, en veillant à ce que la commande soit marquée comme 'Complete', la date de création se situe entre le 1er janvier 2023 et le 31 décembre 2023, et les données de coût soient correctement associées au produit correspondant via les éléments de commande.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq264","db":"THELOOK_ECOMMERCE","question":"Identifiez la différence entre le nombre d'utilisateurs les plus âgés et les plus jeunes inscrits entre le 1er janvier 2019 et le 30 avril 2022, à partir des données de notre plateforme de commerce électronique.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq197","db":"THELOOK_ECOMMERCE","question":"Pour chaque mois avant juillet 2024, identifiez le seul produit le mieux vendu (déterminé par le volume de ventes le plus élevé, le chiffre d'affaires total servant de critère de départage) parmi toutes les commandes ayant un statut 'Complete' et des produits dont les marques ne sont pas nulles. Renvoyez un rapport indiquant le mois, le nom du produit, la marque, la catégorie, les ventes totales, le chiffre d'affaires total arrondi et le statut de la commande pour ces meilleurs vendeurs mensuels.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq265","db":"THELOOK_ECOMMERCE","question":"Pouvez-vous dresser la liste des adresses e-mail des 10 meilleurs utilisateurs qui se sont inscrits en 2019 et ont effectué des achats en 2019, en les classant selon leur valeur moyenne de commande la plus élevée, où la valeur moyenne de commande est calculée en multipliant le nombre d'articles dans chaque commande par le prix de vente, en additionnant ce total sur toutes les commandes de chaque utilisateur, puis en divisant par le nombre total de commandes ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq266","db":"THELOOK_ECOMMERCE","question":"Veuillez fournir les noms des produits qui ont eu des ventes au cours de chaque mois de 2020 et qui avaient le bénéfice le plus faible, calculé comme la différence entre leur prix de vente au détail et leur coût, à partir des données des produits. Excluez tout mois pour lequel ces données ne sont pas disponibles. Veuillez lister les produits dans l'ordre chronologique en fonction du mois.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq333","db":"THELOOK_ECOMMERCE","question":"Quels trois navigateurs ont la durée moyenne de session la plus courte — calculée par la différence en secondes entre les horodatages les plus précoces et les plus récents pour chaque session d’utilisateur — tout en n'incluant que les navigateurs qui ont plus de 10 sessions au total, et quelles sont leurs durées moyennes de session respectives ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq361","db":"THELOOK_ECOMMERCE","question":"Pour la cohorte d'utilisateurs dont la date du premier achat est en janvier 2020, quelle proportion des utilisateurs est revenue au cours des mois suivants de 2020 ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq271","db":"THELOOK_ECOMMERCE","question":"Veuillez générer un rapport qui, pour chaque mois de 2021, fournit le nombre de commandes, le nombre d'acheteurs uniques et le bénéfice (calculé comme la somme des prix de détail des produits moins la somme des coûts des produits), où les commandes ont été passées en 2021 par des utilisateurs qui se sont inscrits en 2021 pour des articles d'inventaire créés en 2021, et regrouper les résultats par le pays des utilisateurs, le département du produit et la catégorie de produit.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq272","db":"THELOOK_ECOMMERCE","question":"Veuillez fournir les noms des trois produits les plus rentables pour chaque mois de janvier 2019 à août 2022, en excluant tout produit associé à des commandes qui ont été annulées ou retournées. Pour chaque produit dans chaque mois, le profit doit être calculé comme la somme des prix de vente de tous les articles de commande moins la somme des coûts de ces articles vendus au cours de ce mois.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq273","db":"THELOOK_ECOMMERCE","question":"Pouvez-vous lister les 5 mois entre août 2022 et novembre 2023 où le bénéfice provenant des commandes complétées sourcées sur Facebook a enregistré la plus forte hausse mensuelle ? Calculez le bénéfice comme les ventes moins les coûts, regroupez par mois de livraison et incluez uniquement les commandes créées entre août 2022 et novembre 2023. Comparez le bénéfice de chaque mois à celui du mois précédent pour trouver les augmentations les plus importantes.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq020","db":"GENOMICS_CANNABIS","question":"Quel est le nom de la séquence de référence ayant la densité de variantes la plus élevée dans l'ensemble de données du génome du cannabis ?","external_knowledge":null}
{"instance_id":"sf_bq107","db":"GENOMICS_CANNABIS","question":"Quelle est la densité des variantes de la référence de cannabis ayant la longueur de référence la plus longue ? Notez qu'une variante est présente s'il existe au moins un appel de variante avec un génotype supérieur à 0.","external_knowledge":null}
{"instance_id":"bq025","db":"census_bureau_international","question":"Fournissez une liste des 10 premiers pays pour l'année 2020, classés par le pourcentage le plus élevé de leur population âgée de moins de 20 ans. Pour chaque pays, indiquez la population totale de moins de 20 ans, la population totale à mi-année et le pourcentage de la population âgée de moins de 20 ans.","external_knowledge":null}
{"instance_id":"bq115","db":"census_bureau_international","question":"Quel pays a le pourcentage le plus élevé de la population âgée de moins de 25 ans en 2017 ?","external_knowledge":null}
{"instance_id":"bq030","db":"covid19_open_data","question":"À la date du 10 mai 2020, parmi tous les pays ayant plus de 50 000 cas confirmés de COVID-19, quels étaient les trois pays ayant les taux de récupération les plus élevés, calculés sur la base du nombre total de cas récupérés par rapport au nombre total de cas confirmés, et quels étaient leurs taux de récupération respectifs exprimés en pourcentages ?","external_knowledge":null}
{"instance_id":"bq018","db":"covid19_open_data","question":"Quel jour de mars et d'avril a eu le taux de croissance des cas confirmés de COVID-19 le plus élevé aux États-Unis ? Le format est MM-JJ.","external_knowledge":null}
{"instance_id":"bq086","db":"covid19_open_world_bank","question":"Vous devez calculer le pourcentage de la population de chaque pays qui avait été confirmé comme ayant contracté le COVID-19 jusqu'au 30 juin 2020. Les données de population pour 2018 peuvent être trouvées dans l'ensemble de données de la Banque mondiale, et les données cumulatives des cas confirmés de COVID-19 sont disponibles dans l'ensemble de données COVID-19 Open Data. Calculez le pourcentage de la population de chaque pays qui a été cumulativement confirmé comme ayant contracté le COVID-19.","external_knowledge":null}
{"instance_id":"bq085","db":"covid19_jhu_world_bank","question":"Pourriez-vous fournir, pour les États-Unis, la France, la Chine, l'Italie, l'Espagne, l'Allemagne et l'Iran, le nombre total de cas confirmés de COVID-19 au 20 avril 2020, ainsi que le nombre de cas pour 100 000 habitants sur la base de leurs populations totales en 2020 calculées en additionnant toutes les entrées de population pertinentes des données de la Banque mondiale ?","external_knowledge":null}
{"instance_id":"bq130","db":"covid19_nyt","question":"Analysez les chiffres quotidiens des nouveaux cas de COVID-19 de mars à mai 2020, en identifiant les cinq États affichant les plus fortes augmentations quotidiennes. Veuillez établir un classement basé sur la fréquence d'apparition de chaque État dans ces top 5 quotidiens. Ensuite, examinez l'État qui occupe la quatrième place au total et identifiez ses cinq comtés principaux en fonction de leur fréquence d'apparition dans le classement quotidien des top 5 nouveaux cas.","external_knowledge":null}
{"instance_id":"bq087","db":"covid19_symptom_search","question":"Veuillez calculer le pourcentage global de variation de la fréquence moyenne de recherche hebdomadaire pour le symptôme 'anosmie' à travers les cinq comtés de New York City — comté du Bronx, comté de Queens, comté de Kings, comté de New York et comté de Richmond — en comparant les données combinées du 1er janvier 2019 au 31 décembre 2019 avec les données combinées du 1er janvier 2020 au 31 décembre 2020.","external_knowledge":null}
{"instance_id":"bq088","db":"covid19_symptom_search","question":"Veuillez calculer les niveaux moyens des symptômes d'anxiété et de dépression à partir des données hebdomadaires par pays pour les États-Unis pendant les périodes du 1er janvier 2019 au 1er janvier 2020 et du 1er janvier 2020 au 1er janvier 2021. Ensuite, calculez l'augmentation en pourcentage de ces niveaux moyens de symptômes entre la période 2019 et la période 2020.","external_knowledge":null}
{"instance_id":"bq089","db":"covid19_usa","question":"Étant donné les dernières estimations de la population issues de l'Enquête sur la communauté américaine à cinq ans de 2018, quel est le nombre de sites de vaccination pour 1000 habitants dans les comtés de Californie ?","external_knowledge":null}
{"instance_id":"bq407","db":"covid19_usa","question":"Trouvez les trois comtés dont la population dépasse 50,000, en utilisant les données du recensement sur 5 ans de 2020, qui avaient les taux de létalité des cas de COVID-19 les plus élevés au 27 août 2020. Pour ces comtés, fournissez le nom, l'État, l'âge médian, la population totale, le nombre de cas confirmés de COVID-19 par 100,000 habitants, le nombre de décès par 100,000 habitants, et le taux de létalité des cas en pourcentage.","external_knowledge":null}
{"instance_id":"bq137","db":"census_bureau_usa","question":"Veuillez trouver toutes les zones de code postal situées à moins de 10 kilomètres des coordonnées (-122.3321, 47.6062) en joignant les données de population du recensement de 2010 (en additionnant uniquement les populations masculine et féminine sans contraintes d'âge) et les informations sur les zones de code postal, et retourner pour chaque zone le polygone de la zone, la surface terrestre et la surface aquatique en mètres, la latitude et la longitude, le code d'État, le nom de l'État, la ville, le comté et la population totale.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq060","db":"census_bureau_international","question":"Quels sont les trois pays ayant la plus forte migration nette en 2017 parmi ceux dont la superficie est supérieure à 500 kilomètres carrés ? Et quels sont leurs taux de migration ?","external_knowledge":null}
{"instance_id":"bq338","db":"census_bureau_acs_1","question":"Pouvez-vous trouver les unités de recensement dans la zone 36047 qui figurent parmi les 20 premiers pour les plus fortes augmentations en pourcentage de la population entre 2011 et 2018, qui figurent également parmi les 20 premiers pour les plus grandes augmentations absolues du revenu médian au cours de la même période, et qui comptaient plus de 1 000 habitants au cours de chacune de ces années ?","external_knowledge":null}
{"instance_id":"bq061","db":"census_bureau_acs_1","question":"Quel secteur de recensement a enregistré la plus forte augmentation du revenu médian entre 2015 et 2018 en Californie ? Donnez-moi le code du secteur.","external_knowledge":null}
{"instance_id":"bq064","db":"census_bureau_acs_1","question":"En utilisant les données des secteurs de recensement de 2017 des États-Unis issues des ensembles publics BigQuery, vous devez allouer proportionnellement la population et le revenu de chaque secteur de recensement aux codes ZIP en fonction de la zone de chevauchement entre leurs limites géographiques. Ensuite, filtrez les résultats pour n'inclure que les codes ZIP situés dans un rayon de 5 miles autour d'un point précis dans l'État de Washington, avec des coordonnées de latitude 47.685833°N et de longitude -122.191667°W. Enfin, calculez la population totale et le revenu individuel moyen par code ZIP (arrondis à une décimale) et triez les résultats par le revenu individuel moyen par ordre décroissant.","external_knowledge":"functions_st_intersects_area.md"}
{"instance_id":"bq461","db":"ncaa_basketball","question":"Veuillez fournir un résumé chronologique de toutes les actions scorées du match de la saison 2014 où les Wildcats étaient l'équipe à domicile et les Fighting Irish étaient l'équipe à l'extérieur. Incluez pour chaque événement scoré le chronomètre du match, les scores cumulatifs des deux équipes (Wildcats et Fighting Irish), l'équipe qui a marqué et une description de l'événement.","external_knowledge":null}
{"instance_id":"bq198","db":"ncaa_basketball","question":"Énumérez les 5 universités ayant le plus grand nombre de saisons au cours desquelles elles ont atteint le nombre maximal de victoires dans leurs saisons de basket NCAA respectives entre 1900 et 2000, en indiquant le nombre total de ces saisons de performance maximale pour chaque équipe, tout en excluant les entrées dont le nom de l'équipe est manquant.","external_knowledge":null}
{"instance_id":"bq462","db":"ncaa_basketball","question":"Veuillez générer un tableau à partir de l'ensemble de données de basketball NCAA qui répertorie les cinq premiers enregistrements dans chacune de ces quatre catégories : (1) Principales salles - les plus grandes salles par capacité avec la Date affichée comme 'N/A' ; (2) Plus grandes marges de victoire lors des finales nationales - finales nationales depuis la saison 2016 (saison > 2015) avec les plus grandes marges de victoire ; (3) Les matchs les plus prolifiques – depuis la saison 2011 (saison > 2010) avec le total de points marqués par les deux équipes combinées le plus élevé ; et (4) Total de tirs à trois points - matchs depuis la saison 2011 (saison > 2010) avec le plus grand total de tirs à trois points combinés par les deux équipes réunies. Le tableau final devrait être organisé avec des colonnes pour Catégorie, Date, Rencontre ou Lieu, et Métrique clé, avec chaque catégorie présentant 5 enregistrements classés par ordre décroissant de leur métrique clé.","external_knowledge":null}
{"instance_id":"bq427","db":"ncaa_basketball","question":"Pourriez-vous déterminer, pour chaque type de tir, les coordonnées moyennes en x et en y (ajustées pour assurer la cohérence concernant le panier de gauche ou de droite), le nombre moyen de tentatives de tir et le nombre moyen de tirs réussis, en ne considérant que les tirs effectués avant March 15, 2018, en excluant ceux dont le type de tir ou les coordonnées sont nuls, en veillant à ce que les tirs se trouvent du côté correct du terrain en fonction du panier de l'équipe.","external_knowledge":"basketball.md"}
{"instance_id":"bq428","db":"ncaa_basketball","question":"Pour les cinq principaux marchés d'équipe ayant le plus grand nombre de joueurs distincts ayant marqué au moins 15 points pendant la deuxième période des matchs entre 2010 et 2018, fournissez les détails de chaque match qu'ils ont joués dans les matches historiques du tournoi NCAA de basket-ball au cours de la même période, tel que spécifié dans le document du modèle de données.","external_knowledge":"ncaa_data_model.md"}
{"instance_id":"bq144","db":"ncaa_insights","question":"Créez un jeu de données en combinant les résultats du tournoi de basket-ball masculin NCAA à partir de la saison 2014 et au-delà, en incluant à la fois les matchs historiques du tournoi et les résultats du tournoi 2018, avec les métriques de performance de rythme et d’efficacité correspondantes pour chaque équipe et leurs adversaires à partir des données feature_engineering. Le jeu de données doit inclure la saison, les étiquettes de résultat des matchs (victoire ou défaite), les graines des équipes et des adversaires, les noms d'écoles, les classements de rythme et d’efficacité, les valeurs statistiques, et les écarts entre les métriques de l’équipe et de l’adversaire afin de permettre une analyse complète de la dynamique équipe/adversaire.","external_knowledge":"NCAA_Basketball_Tournament_SQL_Query_Variable_Guide.md"}
{"instance_id":"bq113","db":"bls","question":"Quel comté de l'Utah a enregistré la plus forte augmentation en pourcentage de l'emploi dans la construction entre 2000 et 2018, calculée en faisant la moyenne des niveaux d'emploi pendant le troisième mois de chaque trimestre au cours de ces années ? Quel est le pourcentage d'augmentation correspondant ?","external_knowledge":null}
{"instance_id":"bq112","db":"bls","question":"Entre 1998 et 2017, pour le comté d'Allegheny dans la région de Pittsburgh, les salaires annuels moyens pour toutes les industries ont-ils suivi le rythme de l'inflation des biens de consommation, et quels étaient les taux de croissance en pourcentage respectifs (à deux décimales) pour les salaires et l'IPC au cours de cette période ?","external_knowledge":null}
{"instance_id":"bq055","db":"google_dei","question":"Pouvez-vous fournir les trois groupes raciaux présentant les plus grandes différences de pourcentage entre les données d'embauche globales de Google en 2021 issues de dar non intersectional hiring et les pourcentages moyens des données BLS 2021 pour les secteurs technologiques définis comme \"l'édition et la diffusion sur Internet et les portails de recherche sur le Web\", \"éditeurs de logiciels\", \"traitement des données, hébergement et services connexes\", ou le groupe industriel \"Conception de systèmes informatiques et services connexes\", et leurs différences respectives ?","external_knowledge":null}
{"instance_id":"bq075","db":"google_dei","question":"Pourriez-vous fournir un rapport combiné pour 2021 comparant les distributions raciales (asiatiques, noirs, hispaniques/latinx, blancs) et de genre (femmes des États‑Unis, hommes des États‑Unis) à travers l’embauche de la main‑d’œuvre globale de Google, la représentation de la main‑d’œuvre globale de Google, et les données BLS spécifiquement pour les secteurs technologiques définis comme l’édition et diffusion sur Internet et les portails de recherche sur le Web ou la conception de systèmes informatiques et les services connexes ?","external_knowledge":null}
{"instance_id":"bq406","db":"google_dei","question":"Veuillez calculer les taux de croissance pour les Asiatiques, les Noirs, les personnes Latinx, les Amérindiens, les Blancs, les femmes américaines, les hommes américains, les femmes dans le monde et les hommes dans le monde sur la période 2014-2024 pour l'ensemble de la main-d'œuvre.","external_knowledge":null}
{"instance_id":"sf_bq084","db":"GOOG_BLOCKCHAIN","question":"Pour chaque mois de l'année 2023, combien de transactions totales ont eu lieu (en comptant tous les enregistrements de transactions sans supprimer les doublons des hachages de transaction), et combien de transactions par seconde ont été traitées chaque mois, où la valeur des transactions par seconde est calculée en divisant le total mensuel par le nombre exact de secondes dans ce mois, en incluant la logique correcte des années bissextiles le cas échéant, selon l'année extraite de l'horodatage de la transaction ? Affichez le nombre de transactions mensuel, les transactions par seconde calculées, l'année et le mois, et présentez les lignes dans l'ordre décroissant du nombre total de transactions mensuelles.","external_knowledge":null}
{"instance_id":"sf_bq058","db":"GOOG_BLOCKCHAIN","question":"Récupérez tous les dépôts finalisés sur Optimism dans le bloc 29815485 en utilisant l'Optimism Standard Bridge, y compris le hash de transaction, un lien Etherscan (l’URL complète), les adresses de jetons L1 et L2, les adresses d’expéditeur et de destinataire (zéros initiaux supprimés), et le montant déposé (converti de hexadécimal à décimal). Veillez à ce que les données soient correctement formatées et analysées conformément aux normes d’adresse et de jeton d’Optimism, et retirez le préfixe '0x' sauf pour le hash de transaction. Notez que le hash keccak-256 de la signature d’événement Ethereum pour DepositFinalized est \"3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".","external_knowledge":"optimism_standard_bridge_contract.md"}
{"instance_id":"sf_bq416","db":"GOOG_BLOCKCHAIN","question":"Pourriez-vous récupérer les trois transferts USDT les plus importants sur la blockchain TRON en listant les numéros de bloc, les adresses sources, les adresses de destination (au format TronLink), et les montants transférés, en utilisant l'adresse de contrat USDT '0xa614f803b6fd780986a42c78ec9c7f77e6ded13c' et la signature d'événement de transfert '0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef', en divisant la valeur brute du transfert par 1,000,000 afin d'obtenir le montant final en USDT, puis en classant les résultats par les plus gros montants transférés en premier ?","external_knowledge":"blockchain_data_transformations.md"}
{"instance_id":"sf_bq226","db":"GOOG_BLOCKCHAIN","question":"Quelle adresse d'expéditeur, représentée sous forme d'une URL complète sur https://cronoscan.com, a été utilisée le plus fréquemment sur la blockchain Cronos dans les transactions vers des champs 'to_address' non nuls, dans des blocs de plus de 4096 octets, depuis le 1er janvier 2023?","external_knowledge":null}
{"instance_id":"sf_bq016","db":"DEPS_DEV_V1","question":"En ne considérant que les versions les plus récentes des paquets NPM, quelle dépendance (paquet et sa version) apparaît le plus fréquemment parmi les dépendances de ces paquets ?","external_knowledge":null}
{"instance_id":"sf_bq062","db":"DEPS_DEV_V1","question":"Quelle est la licence la plus fréquemment utilisée par les paquets dans chaque système ?","external_knowledge":null}
{"instance_id":"sf_bq063","db":"DEPS_DEV_V1","question":"Trouver l'URL GitHub (avec l'étiquette de lien 'SOURCE_REPO') de la dernière version publiée du paquet NPM qui a le plus grand nombre de dépendances dans sa dernière version publiée, en excluant les paquets dont les noms contiennent le caractère '@' et en ne prenant en compte que les URL où l'étiquette de lien est 'SOURCE_REPO' et où l'URL contient 'github.com'.","external_knowledge":null}
{"instance_id":"sf_bq028","db":"DEPS_DEV_V1","question":"En prenant en compte uniquement les dernières versions publiées des paquets NPM, quels paquets sont les 8 plus populaires selon le nombre d'étoiles Github, ainsi que leurs versions?","external_knowledge":null}
{"instance_id":"bq022","db":"chicago","question":"Calculer les durées minimales et maximales des trajets en minutes (arrondies à l'entier le plus proche), le nombre total de trajets et le tarif moyen pour chacun des six groupes quantiles égaux basés sur la durée des trajets, en ne considérant que les trajets compris entre 0 et 60 minutes.","external_knowledge":null}
{"instance_id":"bq362","db":"chicago","question":"Quelles sont les trois entreprises qui ont enregistré la plus forte augmentation du nombre de trajets entre deux mois consécutifs en 2018 ?","external_knowledge":null}
{"instance_id":"bq363","db":"chicago","question":"Calculez le nombre total de trajets et le tarif moyen (formaté sur deux décimales) pour dix groupes quantiles de taille égale. Créez dix groupes quantiles en partitionnant la dimension de la durée du trajet (de 1 à 50 minutes) en ensembles égaux. Chaque groupe doit représenter un nombre similaire de valeurs de minute distinctes. Affichez la plage temporelle de chaque groupe formatée comme \"XXm to XXm\" (où les chiffres sont complétés par des zéros pour atteindre deux chiffres), le nombre total de trajets et le tarif moyen. Les plages de temps doivent représenter les valeurs minimales et maximales de durée au sein de chaque quantile. Triez les résultats par ordre chronologique de la plage temporelle. Utilisez NTILE(10) pour créer les quantiles à partir des durées de trajet triées.","external_knowledge":null}
{"instance_id":"bq076","db":"chicago","question":"Quel est le nombre le plus élevé d'incidents de vol de véhicules à moteur qui se sont produits au cours d'un seul mois en 2016 ?","external_knowledge":null}
{"instance_id":"bq077","db":"chicago","question":"Pour chaque année de 2010 à 2016, quel est le plus grand nombre de vols de véhicules à moteur enregistrés en un seul mois ?","external_knowledge":null}
{"instance_id":"sf_bq350","db":"OPEN_TARGETS_PLATFORM_1","question":"Pour les données moléculaires détaillées, veuillez afficher l'identifiant du médicament, le type de médicament et le statut de retrait pour les médicaments approuvés avec un avertissement de boîte noire et dont le type de médicament est connu parmi 'Keytruda', 'Vioxx', 'Premarin' et 'Humira'.","external_knowledge":null}
{"instance_id":"sf_bq379","db":"OPEN_TARGETS_PLATFORM_1","question":"Quel symbole approuvé de la cible a le score d'association global le plus proche du score moyen pour le psoriasis ?","external_knowledge":null}
{"instance_id":"sf_bq078","db":"OPEN_TARGETS_PLATFORM_2","question":"Récupérez le symbole approuvé des gènes cibles ayant le score global le plus élevé qui sont associés à la maladie 'EFO_0000676' à partir de la source de données 'IMPC'.","external_knowledge":null}
{"instance_id":"sf_bq095","db":"OPEN_TARGETS_PLATFORM_1","question":"Générer une liste de médicaments à partir de la table contenant les détails moléculaires qui ont terminé des essais cliniques pour le carcinome endocrinien du pancréas, identifiant de la maladie EFO_0007416. Veuillez inclure le nom de chaque médicament, le symbole approuvé de la cible et les liens vers les essais cliniques pertinents.","external_knowledge":null}
{"instance_id":"bq109","db":"open_targets_genetics_1","question":"Trouvez la moyenne, la variance, la différence max-min, et la source du QTL (étude de droite) du maximum de log2(h4/h3) pour des données où l'identifiant du gène droit est \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, le trait rapporté comprend \"niveaux de cholestérol\", la caractéristique biologique droite est \"IPSC\", et la variante est '1_55029009_C_T'.","external_knowledge":null}
{"instance_id":"sf_bq325","db":"OPEN_TARGETS_GENETICS_2","question":"Veuillez identifier les dix gènes présentant les associations les plus fortes entre toutes les études en commençant par sélectionner, pour chaque gène dans chaque étude, la variante ayant la valeur-p la plus faible, puis en classant toutes ces paires gène–variante pour renvoyer les dix gènes avec les valeurs-p les plus faibles dans l'ensemble.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq090","db":"CYMBAL_INVESTMENTS","question":"De combien la valeur intrinsèque moyenne des transactions utilisant la stratégie feeling-lucky est-elle supérieure à celle des transactions utilisant la stratégie momentum dans des positions longues ?","external_knowledge":null}
{"instance_id":"bq442","db":"CYMBAL_INVESTMENTS","question":"Veuillez rassembler les informations des 6 rapports de trading présentant les prix de clôture les plus élevés. Reportez-vous au document pour toutes les informations que je souhaite.","external_knowledge":"Trade_Capture_Report_Data_List.md"}
{"instance_id":"bq079","db":"usfs_fia","question":"En ne considérant que le dernier groupe d'évaluation par État pour le type d'évaluation 'EXPCURR', déterminez quel État possède la plus grande superficie totale de terrain boisable et lequel possède la plus grande superficie totale de terrain forestier. Pour le terrain boisable, incluez les parcelles dont le code d'état de condition est 1, le code d'état réservé est 0 et le code de la classe de productivité du site est compris entre 1 et 6. Pour le terrain forestier, incluez les parcelles dont le code d'état de condition est 1. Calculez les acres totaux en additionnant les facteurs d'expansion ajustés pour les macroparcelles et les sous-parcelles, en utilisant leurs bases de proportion respectives ('MACR' pour les macroparcelles et 'SUBP' pour les sous-parcelles) et les facteurs d'ajustement lorsque supérieurs à zéro. Pour chaque catégorie (terrain boisable et terrain forestier), fournissez le code d'État, le groupe d'évaluation, le nom de l'État et les acres totaux pour l'État ayant la plus grande superficie totale, en ne considérant que le dernier groupe d'évaluation par État.","external_knowledge":null}
{"instance_id":"bq024","db":"usfs_fia","question":"Pour l'année 2012, quels sont les 10 premiers groupes d'évaluation qui possèdent les plus grandes superficies de sous-plot en ne considérant que la condition ayant les plus grandes superficies de sous-plot au sein de chaque groupe ? Veuillez inclure le groupe d'évaluation, le type d'évaluation, le code d'État de la condition, la description de l'évaluation, le code d'État, les acres macroplot et les acres de sous-plot.","external_knowledge":null}
{"instance_id":"bq220","db":"usfs_fia","question":"Sur la base de la condition, plot_tree et les tables population dans bigquery-public-data.usfs_fia, pour evaluation_type égal à 'EXPCURR' et condition_status_code égal à 1, quels états ont eu la plus grande taille moyenne de subplot et la plus grande taille moyenne de macroplot, respectivement, pour chacune des années 2015, 2016 et 2017 ? Veuillez inclure le type de plot (subplot ou macroplot), l'année spécifique, l'état et la taille moyenne correspondante dans vos résultats.","external_knowledge":"subplot_macroplot_size.md"}
{"instance_id":"bq096","db":"gbif","question":"Déterminez quelle année a eu la date la plus précoce après janvier à laquelle plus de 10 observations de Sterna paradisaea ont été enregistrées au nord de 40 degrés de latitude. Pour chaque année, trouvez le premier jour après janvier avec plus de 10 observations de cette espèce dans cette région, et identifiez l'année dont la première date correspondante est la plus précoce parmi toutes les années.","external_knowledge":null}
{"instance_id":"sf_bq276","db":"NOAA_PORTS","question":"Pouvez-vous fournir une liste complète de tous les ports dans la région numéro 6585 qui se trouvent à l'intérieur des frontières des États-Unis et qui ont été touchés par des tempêtes nommées dans le bassin nord-atlantique, avec des vitesses du vent d'au moins 35 nœuds et une classification Saffir-Simpson d'au moins la force minimale d'une tempête tropicale, en incluant pour chaque port son nom, le nom de l'État, les années distinctes au cours desquelles des tempêtes se sont produites, le nombre total de tempêtes distinctes, les noms distincts des tempêtes, la catégorie moyenne des tempêtes, la vitesse moyenne du vent, et les géométries respectives pour le port et les zones des tempêtes tropicales ?","temporal":"Yes","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq277","db":"noaa_ports","question":"Quel port unique, répertorié sous le numéro de région '6585', se situe dans les limites d'un État américain et apparaît le plus fréquemment dans les zones géographiques des tempêtes tropicales nommées dont la vitesse du vent est d'au moins 35 nœuds dans le bassin de l'Atlantique Nord, à l'exclusion de celles étiquetées 'NOT_NAMED' ?","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq278","db":"sunroof_solar","question":"Veuillez fournir une comparaison détaillée du potentiel solaire pour chaque État, en distinguant les niveaux du code postal et du secteur de recensement. Pour chaque État, incluez le nombre total de bâtiments disponibles pour les installations solaires, le pourcentage moyen de la surface Google Maps couverte par Project Sunroof, le pourcentage moyen de cette couverture qui est adaptée au solaire, le nombre total potentiel de panneaux solaires, la capacité totale en kilowatts, le potentiel de production d'énergie, la compensation des émissions de dioxyde de carbone, le nombre actuel de bâtiments équipés de panneaux solaires, et l'écart dans les installations potentielles calculé en ajustant le total des bâtiments qualifiés avec les pourcentages de couverture et d'adéquation et en soustrayant les installations actuelles.","external_knowledge":null}
{"instance_id":"bq102","db":"gnomAD","question":"Identifiez quelles positions de départ sont associées à des variantes missense dans le gène BRCA1 sur le chromosome 17, lorsque la base de référence est 'C' et que la base alternative est 'T'. En utilisant les données de la version gnomAD v2.1.1.","external_knowledge":null}
{"instance_id":"bq445","db":"gnomAD","question":"À partir des données des génomes gnomAD v2.1.1 pour le chromosome 17, déterminez la plus petite position de départ et la plus grande position de fin de toute variante dont les annotations VEP imbriquées contiennent le symbole 'BRCA1'. Ensuite, pour toutes les variantes dont les positions se situent dans cette région génique, récupérez les valeurs de 'Protein_position' uniquement si le 'Consequence' inclut 'missense_variant', triez-les par ordre croissant selon 'Protein_position', et enfin affichez le premier résultat obtenu.","external_knowledge":null}
{"instance_id":"bq103","db":"gnomAD","question":"Générez des statistiques récapitulatives sur les variantes génétiques dans la région comprise entre les positions 55039447 et 55064852 sur le chromosome 1. Cela comprend le nombre de variantes, le compte total d'allèles, le nombre total d'allèles et des symboles de gènes distincts (en utilisant Variant Effect Predictor, VEP, pour l'annotation des gènes). De plus, calculez la densité de mutations en divisant la longueur de la région par le nombre de variantes. En utilisant les données de la version gnomAD v3.","external_knowledge":null}
{"instance_id":"sf_bq104","db":"GOOGLE_TRENDS","question":"En fonction de la date de mise à jour la plus récente, identifiez le terme de recherche en hausse le mieux classé pour la semaine qui est exactement un an avant la dernière semaine disponible dans l'ensemble de données.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq411","db":"GOOGLE_TRENDS","question":"Veuillez extraire les trois termes de recherche les plus recherchés sur Google Trends (rang 1, 2 et 3) à partir de top_terms pour chaque jour de la semaine (du lundi au vendredi), entre le 1er septembre 2024 et le 14 septembre 2024, regroupés par la colonne refresh_date et triés par ordre décroissant de refresh_date.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq105","db":"nhtsa_traffic_fatalities_plus","question":"Selon les données d'accidents et de distraction du conducteur pour 2015 et 2016, et en excluant les cas où le statut de distraction du conducteur est enregistré comme 'Not Distracted', 'Unknown if Distracted' ou 'Not Reported', combien d'accidents de la circulation pour 100 000 personnes ont été causés par la distraction du conducteur dans chaque État des États-Unis pour ces deux années, sur la base des données de population du recensement de 2010, et quels cinq États pour chaque année avaient les taux les plus élevés ?","external_knowledge":null}
{"instance_id":"bq108","db":"nhtsa_traffic_fatalities","question":"Dans l’ensemble de données 2015 concernant les accidents survenus de janvier à août et impliquant plus d’une personne distincte, quel pourcentage de ces accidents comportait plus d’un individu présentant une blessure grave (gravité des blessures = 4) ?","external_knowledge":null}
{"instance_id":"bq067","db":"nhtsa_traffic_fatalities","question":"Je veux créer un ensemble de données étiqueté à partir des données sur les décès liés aux accidents de la circulation de la National Highway Traffic Safety Administration qui prédit si un accident de trafic impliquant plus d'une personne distincte se termine par plus d'un décès, où l'étiquette est 1 si un accident comporte plus d'une personne avec un code de gravité des blessures de 4 (blessure mortelle) et 0 sinon. Pour chaque accident, incluez les prédicteurs numériques : state_number, the vehicle body_type, the number_of_drunk_drivers, the day_of_week, the hour_of_crash, et un indicateur binaire indiquant si l'accident s'est produit dans une zone de travaux (1 si ce n'est pas “Aucun,” sinon 0). De plus, concevez une caractéristique pour la différence absolue moyenne entre travel_speed et speed_limit par accident, en considérant uniquement les vitesses de déplacement jusqu'à 151 mph (en excluant les codes 997, 998, 999) et les limites de vitesse jusqu'à 80 mph (en excluant les codes 98, 99), et catégorisez cette différence moyenne de vitesse en niveaux de 0 à 4 par incréments de 20 mph avec les bornes inférieures inclusives et les bornes supérieures exclusives. Enfin, n'incluez que les accidents impliquant plus d'une personne distincte.","external_knowledge":"nhtsa_traffic_fatalities.md"}
{"instance_id":"bq396","db":"nhtsa_traffic_fatalities","question":"Quels sont les 3 États qui présentent les plus grandes différences dans le nombre d'accidents de la circulation entre le temps pluvieux et le temps clair pendant les week-ends en 2016 ? Veuillez également fournir les différences respectives pour chaque État.","external_knowledge":null}
{"instance_id":"bq441","db":"nhtsa_traffic_fatalities","question":"Veuillez m'aider à compiler les détails critiques sur les accidents de la route en 2015, tels qu'énumérés dans le document d'information.","external_knowledge":"Traffic_Fatalities_Info_List_2015.md"}
{"instance_id":"bq097","db":"sdoh","question":"Quelle est l'augmentation du revenu moyen par emploi entre les années 2012 et 2017 pour chaque région géographique du Massachusetts (indiquée par \"MA\" à la fin de GeoName)?","external_knowledge":null}
{"instance_id":"bq120","db":"sdoh","question":"Identifiez les 10 régions (comtés) ayant le plus grand nombre total de ménages participant au SNAP, en utilisant les données ACS 5 ans au niveau comté de 2017 et les données d'inscription SNAP à partir du 1er janvier 2017, en excluant les régions dont la participation SNAP totale est égale à zéro. Pour chacune de ces régions, calculez le rapport entre les ménages gagnant moins de 20 000 $ et le nombre total de ménages participant au SNAP.","external_knowledge":null}
{"instance_id":"bq110","db":"sdoh","question":"Quelle est la variation du nombre de vétérans sans-abri entre 2012 et 2018 pour chaque région CoC dans l'État de New York qui dispose de données disponibles dans les deux années ?","external_knowledge":null}
{"instance_id":"bq395","db":"sdoh","question":"Calculez l’évolution en pourcentage du nombre total de personnes sans domicile à la rue entre 2015 et 2018 pour chaque État en additionnant les décomptes sur l’ensemble des Continuums of Care (CoCs) au sein de chaque État. Ensuite, déterminez la moyenne nationale de ces variations en pourcentage par État. Identifiez les cinq États dont la variation en pourcentage est la plus proche de cette moyenne nationale. Veuillez fournir les abréviations des États.","external_knowledge":null}
{"instance_id":"bq352","db":"sdoh","question":"Veuillez indiquer le nombre moyen de semaines de grossesse en 2018 pour les comtés du Wisconsin où plus de 5 % de la population active avaient des trajets domicile-travail de 45 à 59 minutes en 2017.","external_knowledge":null}
{"instance_id":"bq074","db":"sdoh","question":"Comptez le nombre de comtés qui ont connu une augmentation du chômage entre 2015 et 2018, en utilisant des données ACS sur 5 ans, et une diminution du nombre d'inscrits dual-eligible entre December 1, 2015, et December 1, 2018.","external_knowledge":null}
{"instance_id":"bq066","db":"sdoh","question":"Pourriez-vous évaluer la relation entre les taux de pauvreté issus des données du recensement de l'année précédente et le pourcentage de naissances sans morbidité maternelle pour les années 2016 à 2018 ? Utilisez uniquement les données pour les naissances où aucune morbidité maternelle n'a été signalée et, pour chaque année, utilisez les données du recensement sur 5 ans de l'année précédente pour calculer le coefficient de corrélation de Pearson.","external_knowledge":null}
{"instance_id":"bq114","db":"openaq","question":"Quelles sont les trois villes qui présentent la plus grande différence entre leurs mesures PM2.5 EPA de 1990 (en utilisant units_of_measure = 'Micrograms/cubic meter (LC)' et parameter_name = 'Acceptable PM2.5 AQI & Speciation Mass') et leurs mesures PM2.5 OpenAQ de 2020 (where pollutant = 'pm25' basées sur l'année extraite du timestamp), les deux ensembles étant appariés par latitude et longitude arrondies à deux décimales, et la différence classée de la plus grande à la plus petite ?","external_knowledge":null}
{"instance_id":"bq116","db":"sec_quarterly_financials","question":"Quel État des États‑Unis a enregistré le chiffre d'affaires annuel total le plus élevé, en milliards de dollars, au cours de l'exercice fiscal 2016, en tenant compte des entreprises qui ont fourni quatre trimestres de données et qui ont rapporté des étiquettes de mesure dans ('Revenues','SalesRevenueNet','SalesRevenueGoodsNet'), en excluant toute entrée dont le champ d'État (stprba) est null ou vide ?","external_knowledge":null}
{"instance_id":"sf_bq015","db":"STACKOVERFLOW_PLUS","question":"Identifiez et classez les 10 principaux tags des questions Stack Overflow qui ont été mentionnées dans les commentaires de Hacker News à partir de 2014, en comptant combien de fois chaque question a été mentionnée, puis en séparant les chaînes de tags des questions par le délimiteur '|' et en regroupant par tag","external_knowledge":null}
{"instance_id":"bq041","db":"stackoverflow","question":"Calculez les statistiques mensuelles des nouveaux utilisateurs de StackOverflow créés en 2021. Pour chaque mois, indiquez le nombre total de nouveaux utilisateurs, le pourcentage de ces nouveaux utilisateurs ayant posé au moins une question dans les 30 jours suivant l'inscription, et parmi ceux qui ont posé une question dans les 30 jours, le pourcentage qui ont ensuite répondu à au moins une question après leur première question et dans les 30 jours qui suivent leur première question.","external_knowledge":null}
{"instance_id":"sf_bq121","db":"STACKOVERFLOW","question":"Comment les moyennes de réputation et le nombre de badges varient-elles parmi les utilisateurs de Stack Overflow en fonction du nombre d'années complètes dont ils sont membres, en ne tenant compte que de ceux qui ont rejoint au plus tard October 1, 2021?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq123","db":"stackoverflow","question":"Vous devez déterminer quel jour de la semaine a le troisième pourcentage le plus élevé de questions sur Stack Overflow qui reçoivent une réponse dans l'heure. Pour ce faire, utilisez la date de création de la question à partir de la table posts_questions et la date de création de la première réponse à partir de la table posts_answers. Une fois que vous avez calculé le pourcentage de questions qui obtiennent une réponse dans l'heure pour chaque jour, identifiez le jour ayant le troisième pourcentage le plus élevé et reportez ce pourcentage.","external_knowledge":null}
{"instance_id":"bq280","db":"stackoverflow","question":"Veuillez fournir le nom d'affichage de l'utilisateur qui a répondu au plus grand nombre de questions sur Stack Overflow, en ne tenant compte que des utilisateurs ayant une réputation supérieure à 10.","external_knowledge":null}
{"instance_id":"bq300","db":"stackoverflow","question":"Quel est le nombre le plus élevé de réponses reçues pour une seule question spécifique à Python 2 sur Stack Overflow, en excluant toutes les discussions qui impliquent Python 3 ?","external_knowledge":null}
{"instance_id":"bq301","db":"stackoverflow","question":"Récupérez les détails des réponses acceptées aux questions publiées sur Stack Overflow en January 2016 qui ont des tags incluant \"javascript\" et au moins l'un des \"xss\", \"cross-site\", \"exploit\" ou \"cybersecurity\"; les réponses elles-mêmes doivent également avoir été publiées en January 2016. Pour chaque réponse acceptée, incluez l'ID de la réponse, la réputation du répondant, le score et le nombre de commentaires, ainsi que les tags de la question associée, le score, le nombre de réponses, la réputation de l'auteur, le nombre de vues et le nombre de commentaires.","external_knowledge":null}
{"instance_id":"bq302","db":"stackoverflow","question":"Quelle est la proportion mensuelle des questions Stack Overflow étiquetées 'python' en 2022 ?","external_knowledge":null}
{"instance_id":"bq303","db":"stackoverflow","question":"Du 1er juillet 2019 au 31 décembre 2019, pour tous les utilisateurs dont l’ID se situe entre 16712208 et 18712208 sur Stack Overflow, récupérez l’ID utilisateur et les balises de la question concernée pour chacune de leurs contributions, y compris les commentaires sur les questions et les réponses, toutes les réponses qu’ils ont postées et toutes les questions qu’ils ont posées, en vous assurant d’associer correctement le commentaire ou la réponse aux balises de la question parente.","external_knowledge":null}
{"instance_id":"bq304","db":"stackoverflow","question":"Récupérez les 50 questions les plus vues pour chacun des tags liés à Android suivants sur StackOverflow : 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps' et 'android-asynctask'. Chaque question doit contenir le mot 'how' soit dans son titre ou dans son corps et ne doit contenir aucun des termes de dépannage suivants dans son titre ou son corps : 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve' ou 'trouble'. N'incluez que les tags qui comportent au moins 50 questions répondant à ces critères et, pour chacun de ces tags, sélectionnez les 50 questions les mieux classées par nombre de vues.","external_knowledge":null}
{"instance_id":"bq310","db":"stackoverflow","question":"Quel est le titre de la question « how » la plus consultée liée au développement Android sur StackOverflow, parmi les étiquettes spécifiées telles que 'android-layout', 'android-activity', 'android-intent', et d'autres","external_knowledge":null}
{"instance_id":"bq305","db":"stackoverflow","question":"Quels sont les 10 utilisateurs qui ont le total des vues combinées le plus élevé pour les questions auxquelles ils sont associés, où un utilisateur est considéré comme associé s'il possède la question, ou si sa réponse est la réponse acceptée, ou si le score de sa réponse est supérieur à 5, ou si le score de sa réponse dépasse 20 % du total des scores des réponses pour cette question (et est supérieur à 0), ou si sa réponse se situe parmi les trois réponses ayant les scores les plus élevés pour cette question ?","external_knowledge":null}
{"instance_id":"bq306","db":"stackoverflow","question":"Identifiez les 10 étiquettes principales pour l'utilisateur 1908967, en vous basant uniquement sur les réponses publiées avant le 7 juin 2018, où le score de chaque étiquette est 10 fois le nombre de votes positifs (vote_type_id=2) et 15 fois le nombre de réponses acceptées (vote_type_id=1). Dérivez les étiquettes à partir des questions associées à ces réponses, et considérez uniquement les votes positifs et les réponses acceptées pour ces réponses. Renvoyez les étiquettes ayant les scores totaux les plus élevés par ordre décroissant, limitées à 10 étiquettes.","external_knowledge":null}
{"instance_id":"sf_bq307","db":"STACKOVERFLOW","question":"Trouvez les 10 badges dorés les plus fréquemment obtenus par les utilisateurs comme leur premier badge doré sur Stack Overflow. Pour chacun de ces badges, affichez le nom du badge, le nombre d'utilisateurs qui l'ont obtenu comme leur premier badge doré, et le nombre moyen de jours entre la date de création du compte de l'utilisateur et la date à laquelle il a obtenu le badge, calculé en jours sans aucun ajustement pour les formats de date.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq308","db":"stackoverflow","question":"Afficher le nombre de questions Stack Overflow posées chaque jour de la semaine en 2021, et déterminer combien et quel pourcentage de ces questions ont reçu une réponse en une heure.","external_knowledge":null}
{"instance_id":"bq309","db":"stackoverflow","question":"Récupérez les 10 questions les plus longues sur Stack Overflow, mesurées par la longueur du texte de leur corps, où chaque question a soit une réponse acceptée, soit n'a pas de réponse acceptée mais a au moins une réponse dont le ratio score/vues dépasse 0,01. Pour chacune de ces questions, incluez la réputation de l'utilisateur qui a posé la question, les votes nets de l'utilisateur (calculés comme le total de leurs up_votes moins down_votes), et le nombre total de badges que l'utilisateur a obtenus.","external_knowledge":null}
{"instance_id":"bq124","db":"fhir_synthea","question":"Parmi tous les patients, combien d'individus restent en vie (c.-à-d. sans deceased.dateTime enregistré), ont un diagnostic de diabète ou d'hypertension et se voient prescrire au moins sept médicaments actifs distincts ?","external_knowledge":null}
{"instance_id":"bq391","db":"fhir_synthea","question":"Parmi les patients vivants dont les noms de famille commencent par \"A\" et qui ont chacun exactement une condition distincte, quelles sont les huit conditions qui ont le plus grand nombre de médicaments actifs différents prescrits à un seul patient, et quels sont leurs codes correspondants ?","external_knowledge":null}
{"instance_id":"bq126","db":"the_met","question":"Quels sont les titres, les noms d'artistes, les médiums et les URL d'images originales des objets dont le nom contient 'Photograph', issus du département 'Photographs', créés non par un artiste inconnu, avec une date de fin d’objet de 1839 ou avant ?","external_knowledge":null}
{"instance_id":"bq366","db":"the_met","question":"Quels sont les trois étiquettes les plus fréquemment associées aux œuvres d'art de chaque période historique dans la collection de The Met, en ne considérant que les étiquettes liées à 500 œuvres ou plus ? Fournissez-moi la période, l'étiquette et le nombre associé.","external_knowledge":null}
{"instance_id":"bq414","db":"the_met","question":"Récupérez l'identifiant de l'objet, le titre et la date des métadonnées formatée (sous forme de chaîne au format 'YYYY-MM-DD') pour les objets dans le département \"The Libraries\" où le cropConfidence est supérieur à 0.5, et le titre de l'objet contient le mot \"book\".","external_knowledge":null}
{"instance_id":"bq200","db":"mlb","question":"En utilisant les données de la saison régulière et des séries éliminatoires, identifiez le lanceur qui a atteint la vitesse de lancer non nulle la plus élevée pour chaque équipe en vérifiant si l’ID du lanceur apparaît dans les listes de joueurs à domicile ou à l’extérieur pertinentes pour ce match, puis récupérez le nom complet de ce lanceur ainsi que la vitesse de lancer maximale valide qu’il a atteinte en jouant pour cette équipe spécifique.","external_knowledge":null}
{"instance_id":"sf_bq458","db":"WORD_VECTORS_US","question":"Tokenisez le corps du texte de chaque article en mots, en excluant les mots vides, puis obtenez les vecteurs de mots correspondants pour ces mots à partir du vecteur GloVe. Pour chaque mot, pondérez son vecteur de mot en divisant chaque composante par la fréquence du mot à la puissance 0,4, issue des fréquences des mots. Ensuite, pour chaque article, agréguez ces vecteurs de mots pondérés en additionnant leurs composantes pour former un vecteur d'article. Normalisez chaque vecteur d'article à une longueur unitaire en le divisant par sa norme. Enfin, récupérez l'ID, la date, le titre et le vecteur d'article normalisé pour chaque article.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq459","db":"WORD_VECTORS_US","question":"Veuillez trouver les 10 articles les plus pertinents en ne traitant que le champ 'body' de chaque article, où chaque corps est tokenisé sans mots vides, chaque jeton restant est transformé en un vecteur de mots basé sur GloVe et pondéré en divisant chaque dimension par la puissance 0,4 de sa fréquence de mot, puis ces vecteurs pondérés sont additionnés et normalisés pour obtenir un vecteur unitaire pour chaque article. Effectuez le même pondération et la même normalisation sur la phrase de requête 'Epigenetics and cerebral organoids: promising directions in autism spectrum disorders' et calculez la similarité cosinus entre le vecteur de requête et chaque vecteur d'article. Enfin, renvoyez l'identifiant, la date, le titre et le score de similarité cosinus pour les 10 articles ayant la plus grande similarité.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq460","db":"WORD_VECTORS_US","question":"Veuillez traiter les articles de l'ensemble de données 'nature' en commençant par tokeniser le texte du corps en mots et en supprimant les stopwords. Pour chaque mot restant, récupérez son vecteur de mots dans la table glove_vectors et sa fréquence dans la table word_frequencies, puis divisez chaque vecteur de mots par la puissance 0,4 de la fréquence du mot afin de le pondérer. Sommez les vecteurs pondérés pour obtenir un vecteur agrégé pour chaque article, normalisez ce vecteur agrégé à une longueur unitaire, puis calculez les scores de similarité cosinus entre ces vecteurs normalisés. Enfin, renvoyez les identifiants, les dates, les titres et les scores de similarité cosinus des 10 articles les plus similaires à l’article ayant l’ID '8a78ef2d-d5f7-4d2d-9b47-5adb25cbd373'.","external_knowledge":"tokenize_func.md"}
{"instance_id":"bq204","db":"eclipse_megamovie","question":"Trouver l'utilisateur ayant le plus grand nombre total de clics parmi tous les enregistrements de toutes les collections de photos disponibles.","external_knowledge":null}
{"instance_id":"bq389","db":"epa_historical_air_quality","question":"Veuillez calculer les niveaux moyens mensuels de PM10, PM2.5 FRM, PM2.5 non-FRM, émissions de composés organiques volatils, SO2 (multiplié par un facteur de 10) et plomb (multiplié par un facteur de 100) des polluants atmosphériques en Californie pour l'année 2020.","external_knowledge":null}
{"instance_id":"sf_bq345","db":"IDC","question":"Quelle est la taille des fichiers image DICOM utilisant les modalités SEG ou RTSTRUCT et l'UID de la classe SOP \"1.2.840.10008.5.1.4.1.1.66.4\", lorsqu'ils sont regroupés par les identifiants de collection, d'étude et de série, s'ils n'ont pas de références à d'autres séries, images ou sources ? Pouvez-vous également fournir une URL de visualisation formatée comme \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" suivie de l'identifiant d'étude, et répertorier ces tailles en kilo-octets, triées du plus grand au plus petit ?","external_knowledge":null}
{"instance_id":"sf_bq346","db":"IDC","question":"Dans des données DICOM accessibles au public où la Modalité est 'SEG' et le SOPClassUID est '1.2.840.10008.5.1.4.1.1.66.4', et chaque segmentation se réfère à son SOPInstanceUID d'origine, quelles cinq catégories de segmentation (par 'SegmentedPropertyCategory.CodeMeaning') apparaissent le plus fréquemment ?","external_knowledge":null}
{"instance_id":"sf_bq347","db":"IDC","question":"À partir de l'union des séries IRM spécifiées avec SeriesInstanceUID 1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147 et de toutes les instances de segmentation associées, quelle modalité a le plus grand nombre d'instances SOP au total et combien y en a-t-il ?","external_knowledge":null}
{"instance_id":"sf_bq390","db":"IDC","question":"Dans la collection \"qin_prostate_repeatability\", veuillez fournir les StudyInstanceUIDs distincts pour les études qui incluent l'IRM axiale pondérée en T2 et qui contiennent également des segmentations de structures anatomiques étiquetées comme \"zone périphérique\".","external_knowledge":null}
{"instance_id":"sf_bq421","db":"IDC","question":"Pouvez-vous lister toutes les paires uniques de significations des codes du milieu d'inclusion et de la substance colorante, ainsi que le nombre d'occurrences pour chaque paire, en vous basant sur des codes distincts de milieu d'inclusion et de colorant issus de la modalité 'SM' du jeu de données DICOM, dans les séquences de préparation du spécimen non imbriquées, en veillant à ce que les codes proviennent du schéma de codage SCT ?","external_knowledge":null}
{"instance_id":"sf_bq422","db":"IDC","question":"En utilisant les images CT de la collection 'nlst', calculez et comparez deux métriques distinctes : 1) la taille moyenne des séries en MiB pour les 3 patients ayant la plus grande tolérance de différence d'intervalle de coupe (définie comme la différence entre les intervalles de coupe uniques maximum et minimum sur l'ensemble de leurs séries), et 2) la taille moyenne des séries en MiB pour les 3 patients ayant la plus grande différence d'exposition (définie comme la différence entre les valeurs d'exposition uniques maximum et minimum sur l'ensemble de leurs séries). Pour chaque patient, calculez la taille de la série en additionnant les tailles d'instance de toutes les images de cette série et en les convertissant en MiB. Retournez les résultats sous deux groupes distincts intitulés \"Top 3 par Intervalle de Coupe\" et \"Top 3 par Exposition Maximale\" avec leurs tailles moyennes de série respectives.","external_knowledge":null}
{"instance_id":"sf_bq069","db":"IDC","question":"Pourriez-vous m'aider à générer un rapport des séries CT à partir de la table dicom_all, de sorte que toutes les séries de la collection NLST soient exclues, que les localizers ou les séries compressées en JPEG (syntaxes de transfert 1.2.840.10008.1.2.4.70 ou 1.2.840.10008.1.2.4.51) soient ignorées, et que seules celles qui passent certains contrôles de géométrie — à savoir une orientation unique, un espacement des pixels identique, des comptages d'instances SOP et de positions correspondants, des rangées et des colonnes de pixels uniformes, et un produit scalaire proche de l'unité des vecteurs d'orientation d'image — soient incluses, tout en calculant les différences d'intervalle de coupe, les différences d'exposition, et la taille approximative de la série en MB pour chaque série qualifiée ?","external_knowledge":"nonNlstCohort.md"}
{"instance_id":"sf_bq219","db":"IOWA_LIQUOR_SALES","question":"Dans le jeu de données Iowa Liquor Sales, à partir du January 1, 2022 jusqu'au dernier mois entièrement terminé, quelles sont les deux catégories de spiritueux, chacune contribuant en moyenne à au moins 1% du volume des ventes mensuelles sur au moins 24 mois de données disponibles, qui présentent le coefficient de corrélation de Pearson le plus faible lorsque l'on compare leurs pourcentages mensuels des ventes totales de spiritueux au cours de ces mois, et quels sont leurs noms ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq199","db":"iowa_liquor_sales","question":"Identifier les 10 principales catégories de spiritueux dans l'État de l'Iowa en 2021 en calculant, pour chaque catégorie, la moyenne des prix de détail par litre sur l'ensemble des transactions de vente dans cette catégorie pendant l'année 2021. Pour ces catégories les plus performantes, fournissez leurs prix de détail moyens par litre calculés de la même manière pour les années 2019, 2020 et 2021.","external_knowledge":null}
{"instance_id":"bq218","db":"iowa_liquor_sales","question":"Quels sont les 5 produits ayant le plus fort taux de croissance année sur année du chiffre d'affaires total pour l'année 2023 ?","external_knowledge":null}
{"instance_id":"bq049","db":"iowa_liquor_sales_plus","question":"Veuillez afficher les ventes mensuelles par habitant de Bourbon Whiskey pendant l'année 2022 dans le comté de Dubuque pour le code postal qui se classe troisième en termes de ventes totales de Bourbon Whiskey, en utilisant uniquement la population âgée de 21 ans et plus.","external_knowledge":null}
{"instance_id":"bq360","db":"nppes","question":"Parmi les prestataires de soins de santé dont le lieu d'exercice est à Mountain View, CA, et qui disposent d'une spécialisation spécifiée dans le domaine de la taxonomie des prestataires de soins, identifiez les 10 spécialités les plus fréquentes en se basant sur le nombre de NPIs distincts. Puis déterminez laquelle de ces 10 premières a un nombre de NPIs distincts le plus proche de la moyenne du nombre de NPIs pour ces 10 spécialités.","external_knowledge":null}
{"instance_id":"bq286","db":"usa_names","question":"Pouvez-vous me dire quel est le prénom féminin le plus populaire du Wyoming pour l'année 2021, basé sur la proportion des bébés féminins portant ce prénom par rapport au nombre total de bébés féminins portant le même prénom dans tous les États ?","external_knowledge":null}
{"instance_id":"sf_bq044","db":"TCGA","question":"Pour les patients atteints d'un cancer de la vessie présentant des mutations dans le gène CDKN2A (inhibiteur de la kinase dépendante de la cycline 2A), en utilisant les données cliniques du Genomic Data Commons Release 39, quels types de mutations sont-ils, quel est leur sexe, leur statut vital et le nombre de jours jusqu’au décès – et pour quatre gènes en aval (MDM2 (MDM2 proto-oncogène), TP53 (protéine tumorale p53), CDKN1A (inhibiteur de la kinase dépendante de la cycline 1A) et CCNE1 (Cycline E1)), quels sont les niveaux d’expression génique pour chaque patient ?","external_knowledge":"TCGA_Study_Abbreviations.md"}
{"instance_id":"sf_bq043","db":"TCGA","question":"Quels sont les niveaux d'expression de l'ARN des gènes MDM2, TP53, CDKN1A et CCNE1, ainsi que les informations cliniques associées, chez les patients atteints de cancer de la vessie présentant des mutations de CDKN2A dans le projet 'TCGA-BLCA' ? Utilisez les données cliniques du Genomic Data Commons Release 39, des données sur les mutations somatiques dérivées de la référence du génome humain hg19 en février 2017.","external_knowledge":null}
{"instance_id":"bq143","db":"CPTAC_PDC","question":"Utilisez les données de protéomique CPTAC et de RNAseq pour le carcinome rénal à cellules claires afin de sélectionner les échantillons 'Primary Tumor' et 'Solid Tissue Normal'. Joignez les ensembles de données sur les identifiants de soumission des échantillons et les symboles de gènes. Calculez la corrélation entre l'abondance protéique (rapport log2) et les niveaux d'expression génique (FPKM log-transformé + 1) pour chaque gène et chaque type d'échantillon. Filtrez les corrélations dont la valeur absolue est supérieure à 0,5, et calculez la corrélation moyenne pour chaque type d'échantillon.","external_knowledge":null}
{"instance_id":"sf_bq147","db":"TCGA","question":"Pouvez-vous identifier les cas de cancer du sein TCGA à partir du séquençage de l'ARN hg38 r35`, où le gène protein_coding et le projet TCGA-BRCA sont présents, et qui possèdent des échantillons de séquençage de l'ARN de plusieurs types de tissus — y compris \"Solid Tissue Normal\" — dans le même cas ?","external_knowledge":null}
{"instance_id":"sf_bq148","db":"TCGA","question":"Pourriez-vous identifier les cinq principaux gènes codants pour des protéines qui présentent la plus grande variance dans leurs niveaux d'expression (mesurés comme fpkm_uq_unstranded), spécifiquement dans les échantillons 'Solid Tissue Normal' ? Veuillez limiter l'analyse aux cas du projet TCGA-BRCA qui incluent au moins un type d'échantillon 'Solid Tissue Normal'.","external_knowledge":null}
{"instance_id":"sf_bq175","db":"TCGA_MITELMAN","question":"Identifier les noms de cytobandes sur le chromosome 1 dans le jeu de données des segments alléliques TCGA-KIRC où la fréquence des amplifications, des gains et des délétions hétérozygotes se situe parmi les onze premiers. Calculez ces classements sur la base du nombre de copies maximal observé dans diverses études génomiques du cancer du rein, reflétant la gravité des altérations génétiques.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"sf_bq176","db":"TCGA_MITELMAN","question":"Identifiez les codes-barres des cas de l’étude TCGA-LAML qui présentent le nombre de copies moyen pondéré le plus élevé dans la cytobande 15q11 sur le chromosome 15, en utilisant les données de segments et les chevauchements de cytobandes issus des bases de données génomiques de TCGA et Mitelman.","external_knowledge":null}
{"instance_id":"sf_bq170","db":"TCGA_MITELMAN","question":"Pour les cas de cancer du sein (TCGA-BRCA) issus de Release 23 de l'archive GDC active, identifiez et catégorisez les variations du nombre de copies (CNVs) sur tous les cytobandes de chaque chromosome. Pour chaque cytobande et pour chaque cas, déterminez le chevauchement entre la région du cytobande et les segments du nombre de copies du cas, et calculez la moyenne pondérée par le chevauchement du nombre de copies pour ce cytobande dans le cas, en arrondissant à l'entier le plus proche. Classez le nombre de copies arrondi en types de CNV comme suit : délétions homozygotes (0), délétions hétérozygotes (1), état diploïde normal (2), gains (3), et amplifications (supérieures à 3). Pour chaque cytobande, fournissez son nom et ses positions de début et de fin, et calculez la fréquence de chaque type de CNV sur l'ensemble des cas en pourcentage du nombre total de cas, arrondi à deux décimales.","external_knowledge":"copy_number_variations.md"}
{"instance_id":"sf_bq150","db":"TCGA_HG19_DATA_V0","question":"Évaluez si différentes variantes génétiques influencent les niveaux d’expression de TP53 transformés en log10 dans les échantillons TCGA-BRCA à l’aide de données de séquençage et de mutation. Fournissez le nombre total d'échantillons, le nombre de types de mutations, la moyenne des carrés entre les groupes, la moyenne des carrés intra-groupes et la statistique F.","external_knowledge":"TCGA_F_Score.md"}
{"instance_id":"sf_bq152","db":"TCGA_HG38_DATA_V0","question":"Pour les cas de cancer du sein (TCGA-BRCA) issus de la Release 23 de l'archive GDC active, identifiez et catégorisez les variations du nombre de copies (CNV) à travers tous les cytobandes sur chaque chromosome. Pour chaque cytobande et chaque cas, déterminez le chevauchement entre la région du cytobande et les segments du nombre de copies du cas, et calculez la moyenne du nombre de copies pondérée par le chevauchement pour ce cytobande dans le cas, en l'arrondissant à l'entier le plus proche. Classez le nombre de copies arrondi en types de CNV comme suit : délétions homozygotes (0), délétions hétérozygotes (1), état diploïde normal (2), gains (3), et amplifications (supérieures à 3). Pour chaque cytobande, fournissez son nom et ses positions de départ et de fin, et calculez la fréquence de chaque type de CNV à travers tous les cas en pourcentage du nombre total de cas, arrondie à deux décimales.","external_knowledge":null}
{"instance_id":"sf_bq155","db":"TCGA_HG38_DATA_V0","question":"Dans la cohorte TCGA-BRCA de patients âgés de 80 ans ou moins au moment du diagnostic et présentant un stade pathologique de Stade I, Stade II ou Stade IIA, calculez la t-statistique dérivée de la corrélation de Pearson entre les niveaux d'expression RNA-Seq moyens transformés en log10 (en utilisant HTSeq__Counts + 1) du gène SNORA31 et les niveaux d'expression microRNA-Seq moyens de tous les microARN uniques, en ne considérant que les paires comportant plus de 25 échantillons et lorsque le coefficient de corrélation de Pearson absolu est compris entre 0,3 et 1,0","external_knowledge":null}
{"instance_id":"sf_bq141","db":"TCGA_HG38_DATA_V0","question":"En utilisant le jeu de données TCGA-KIRP, sélectionnez les patients à partir de la table 'TCGA_bioclin_v0.Clinical' qui ont un clinical_stage non nul et un disease_code de 'KIRP'. Récupérez leurs données d'expression génique à partir de la table 'TCGA_hg38_data_v0.RNAseq_Gene_Expression' pour les gènes 'MT-CO3,' 'MT-CO1,' et 'MT-CO2,' et répartissez aléatoirement les patients en un ensemble d'entraînement (90%) et un ensemble de test (10%) basé sur leur case_barcode via la méthode FARM_FINGERPRINT. Pour chaque clinical stage dans l'ensemble d'entraînement, calculez l'expression moyenne HTseq__FPKM_UQ des trois gènes. Pour chaque patient dans l'ensemble de test, calculez la distance euclidienne entre les valeurs d'expression du patient et les moyennes spécifiques au stade, et assignez ce patient au stade clinique dont la moyenne est la plus proche. Enfin, affichez le case_barcode et le stade clinique prédit.","external_knowledge":null}
{"instance_id":"bq046","db":"TCGA_bioclin_v0","question":"Trouver les codes-barres des cas et leurs URL de fichiers GDC correspondantes pour les patientes âgées de 30 ans ou moins diagnostiquées d'un cancer du sein (BRCA) dans la base de données TCGA. La requête doit d'abord identifier les patients à partir de la table Annotations où entity_type est \"Patient\" et soit category est \"History of unacceptable prior treatment related to a prior/other malignancy\" ou classification est \"Redaction\". Identifiez également les patients à partir de la table Clinical avec disease_code \"BRCA\", age_at_diagnosis inférieur ou égal à 30, et gender \"FEMALE\". Effectuer une FULL JOIN entre ces deux ensembles, mais ne conserver que les patients pour lesquels à la fois categoryName et classificationName sont NULL dans le résultat final. Utiliser les métadonnées GDC à partir de l'archive release 14 (plus précisément les tables rel14_caseData, rel14_fileData_current et rel14_GDCfileID_to_GCSurl_NEW) pour obtenir les URL des fichiers correspondants.","external_knowledge":null}
{"instance_id":"sf_bq153","db":"PANCANCER_ATLAS_1","question":"Calculez, pour chaque type d'histologie spécifié dans le champ 'icd_o_3_histology' (à l'exclusion de ceux entourés de crochets), la moyenne des niveaux d'expression moyens par patient calculés comme log10(normalized_count + 1) du gène IGF2 chez les patients LGG ayant des données d'expression IGF2 valides. Faites correspondre les données d'expression génique et les données cliniques en utilisant le champ ParticipantBarcode.","external_knowledge":null}
{"instance_id":"sf_bq154","db":"PANCANCER_ATLAS_1","question":"Calculez le score H de Kruskal-Wallis parmi les groupes de patients LGG pour l'expression du gène IGF2, où l'expression IGF2 de chaque patient est déterminée en appliquant log10(normalized_count + 1) puis en faisant la moyenne sur les échantillons. Regroupez les patients par les codes d'histologie ICD-O-3, excluez tout code entièrement entouré de crochets, n'incluez que les groupes comportant plus d'un patient, et assurez-vous que normalized_count n'est pas null. Enfin, renvoyez le nombre total de groupes, le nombre total d'échantillons et le score H de Kruskal-Wallis en ordre décroissant.","external_knowledge":"Regulome_Explorer_Kruskal-Wallis_test_for_numerical_and_categorical_data.md"}
{"instance_id":"sf_bq156","db":"PANCANCER_ATLAS_1","question":"Calcule le t-score (arrondi à 2 décimales) pour comparer la différence entre les niveaux moyens d'expression du gène DRG2 entre deux groupes (TP53 muté vs non muté) dans l'étude sur le gliome de bas grade (LGG), où les niveaux d'expression sont calculés comme la moyenne de log10(normalized_count + 1) pour chaque participant, en ne tenant compte que des échantillons avec des mutations TP53 dont le statut 'FILTER' est 'PASS' dans les données de mutation, et en ignorant tout groupe comportant moins de 10 échantillons ou présentant une variance nulle; reportez-vous à `t_score.md` pour la méthode de calcul du t-score.","external_knowledge":"t_score.md"}
{"instance_id":"sf_bq157","db":"PANCANCER_ATLAS_1","question":"Veuillez calculer le score t afin de déterminer la différence statistique dans l’expression du gène DRG2 entre les patients LGG avec et sans mutation TP53 : pour chaque patient, calculez la moyenne de log10(normalized_count + 1) de l’expression de DRG2 sur l’ensemble de leurs échantillons, en utilisant uniquement les échantillons présents dans la table `MC3_MAF_V5_one_per_tumor_sample` pour l’étude LGG ; identifiez les patients présentant des mutations de TP53 à partir de cette table où `Hugo_Symbol` est 'TP53' et `FILTER` est 'PASS' ; puis effectuez un test t comparant la moyenne de l’expression DRG2 log-transformée entre les patients avec et sans mutation TP53.","external_knowledge":"Regulome_Explorer_T_test_for_numerical_and_binary_data.md"}
{"instance_id":"sf_bq158","db":"PANCANCER_ATLAS_1","question":"Quels sont les cinq principaux types histologiques du cancer du sein (BRCA) dans le PanCancer Atlas qui présentent le pourcentage le plus élevé de mutations du gène CDH1 ?","external_knowledge":null}
{"instance_id":"sf_bq159","db":"PANCANCER_ATLAS_1","question":"Calculez la valeur du chi carré pour évaluer l'association entre les types histologiques et la présence de mutations du gène CDH1 chez les patients BRCA en utilisant les données du PanCancer Atlas. Concentrez-vous sur les patients dont les types histologiques sont connus et ne considérez que les entrées de mutation fiables. Excluez tout type histologique ou statut de mutation dont les totaux marginaux sont inférieurs ou égaux à 10. Appairez les données cliniques et les données de mutation en utilisant ParticipantBarcode","external_knowledge":null}
{"instance_id":"bq161","db":"pancancer_atlas_2","question":"Calculez la différence nette entre le nombre de patients atteints d’adénocarcinome pancréatique (PAAD) dans l’ensemble de données du TCGA qui présentent des mutations dans les gènes KRAS et TP53, et ceux sans mutations dans l’un ou l’autre des gènes. Utilisez les données cliniques et de suivi des patients, ainsi que les détails des mutations génomiques issus de la base de données de génomique du cancer du TCGA, en vous concentrant spécifiquement sur les études PAAD où les mutations ont passé les filtres de qualité.","external_knowledge":null}
{"instance_id":"bq151","db":"pancancer_atlas_2","question":"En utilisant l'ensemble de données TCGA, calculez la statistique du chi carré pour évaluer l'association entre les mutations des gènes KRAS et TP53 chez les patients diagnostiqués d'un adénocarcinome pancréatique (PAAD). Intégrez les données de suivi clinique et des annotations de mutations de haute qualité afin de déterminer avec précision la fréquence des patients présentant des mutations co-occurrentes KRAS et TP53 par rapport à ceux chez lesquels chaque mutation se produit indépendamment. Assurez-vous que les dossiers des patients soient méticuleusement appariés sur la base d'identifiants uniques afin de maintenir l'intégrité des données. Cette analyse vise à identifier et quantifier les corrélations potentielles entre les altérations génétiques KRAS et TP53 au sein de la population de patients PAAD.","external_knowledge":null}
{"instance_id":"bq162","db":"HTAN_1","question":"Sur la base de la 5e révision (r5) des données HTAN, dressez la liste des types d'essais d'imagerie disponibles au centre HTAN WUSTL qui possèdent des données Level2 et toute donnée de niveau supérieur associée (Level3, Level4) dérivée de celles-ci via les relations 'entityId' dans la table 'id_provenance_r5' ; exclure tout enregistrement dont le 'Component' est NULL ou contient 'Auxiliary' ou 'OtherAssay' ; pour chaque type d'essais d'imagerie, fournissez les niveaux de données disponibles (Level2, Level3, Level4), et n'incluez pas les données Level1 ni les types d'essais en Microscopie électronique.","external_knowledge":null}
{"instance_id":"sf_bq163","db":"HTAN_2","question":"Quels 20 gènes dans le jeu de données HTAN scRNAseq MSK-SCLC échantillons combinés montrent la plus grande différence dans l'expression moyenne de X_value entre les cellules épithéliales féminines et masculines, spécifiquement dans le cluster 41 chez des patients humains âgés de 74 ans au stade ? Veuillez calculer la différence en soustrayant l'expression moyenne X_value masculine de l'expression moyenne X_value féminine pour chaque gène.","external_knowledge":null}
{"instance_id":"sf_bq164","db":"HTAN_2","question":"Consolider les métadonnées des ensembles de données de transcriptomique spatiale et de scRNAseq—y compris les niveaux 1 à 4 et les fichiers auxiliaires—pour l'ID d'exécution 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test'. Inclure Filename, HTAN Parent Biospecimen ID, Component, File Format, Entity ID et Run ID.","external_knowledge":null}
{"instance_id":"sf_bq166","db":"TCGA_MITELMAN","question":"En utilisant des données de nombre de copies au niveau des segments, à partir du jeu de données copy_number_segment_allelic_hg38_gdc_r23 restreint aux échantillons 'TCGA-KIRC', fusionnez ces segments avec les définitions des bandes cytogénétiques dans 'CytoBands_hg38' pour identifier le nombre de copies maximal de chaque échantillon par cytobande. Classez ces nombres de copies maximaux en amplifications (>3), gains (=3), délétions homozygotes (=0), délétions hétérozygotes (=1), ou normal (=2), puis calculez la fréquence de chaque sous-type sur le total des cas distincts, et enfin présentez ces fréquences en pourcentages triées par chromosome et cytobande.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"bq165","db":"mitelman","question":"Pouvez-vous utiliser les coordonnées génomiques de CytoConverter pour calculer la fréquence des gains et pertes chromosomiques sur une cohorte d'échantillons de cancer du sein (morphologie='3111') et d'adénocarcinome (topologie='0401') ? Concrètement, veuillez inclure le nombre et la fréquence (2 décimales en pourcentage) des amplifications (gains de plus de 1 copie), gains (1 copie supplémentaire), pertes (1 copie) et délétions homozygotes (perte de 2 copies) pour chaque bande chromosomique. Et trier le résultat par l'ordre ordinal de chaque chromosome et par la position de départ et de fin en paires de bases de chaque bande, par ordre croissant.","external_knowledge":null}
{"instance_id":"bq169","db":"mitelman","question":"Récupérer les références de cas distinctes, les numéros de cas, les numéros d'enquête et les informations sur les clones lorsque un seul clone présente simultanément les trois altérations génétiques suivantes : (1) une perte sur le chromosome 13 entre les positions 48,303,751 et 48,481,890, (2) une perte sur le chromosome 17 entre les positions 7,668,421 et 7,687,490, et (3) un gain sur le chromosome 11 entre les positions 108,223,067 et 108,369,102. Pour chaque clone correspondant, afficher les détails chromosomiques pour chacune de ces trois régions (y compris le numéro de chromosome représenté par ChrOrd, le point de départ et le point de fin) et la description courte correspondante du caryotype dans la table KaryClone. Utilisez CytoConverted et KaryClone.","external_knowledge":null}
{"instance_id":"bq111","db":"mitelman","question":"Pourriez-vous calculer, par chromosome, la corrélation de Pearson entre la fréquence des anomalies du nombre de copies (y compris les amplifications, les gains, les pertes et les délétions) issues de la base de données Mitelman pour les cas avec morph = 3111 et topo = 0401, et celles calculées à partir des données TCGA, en retournant les coefficients de corrélation et les valeurs-p correspondantes pour chaque type d’anomalie, en veillant à ce que seuls les résultats comportant au moins cinq enregistrements correspondants soient affichés.","external_knowledge":"Correlations_between_Mitelman_and_TCGA_datasets.md"}
{"instance_id":"sf_bq451","db":"_1000_GENOMES","question":"Extraire les données de génotype pour les polymorphismes nucléotidiques simples (SNPs) sur le chromosome X, en excluant les positions où la valeur de `start` se situe entre 59999 et 2699519 ou entre 154931042 et 155260559. Pour chaque échantillon, identifier les appels de génotype lorsque le tableau de génotype comporte au moins un allèle. Classer chaque appel de génotype dans l'une des catégories suivantes : allèles homozygotes de référence (les deux allèles sont 0), allèles homozygotes alternatifs (les deux allèles sont identiques et supérieurs à 0), ou allèles hétérozygotes (les allèles sont différents, ou l'un des allèles est nul, et au moins un allèle est supérieur à 0). Calculer le nombre total de sites appelables (la somme des trois catégories de génotype), le nombre d'appels de génotype homozygotes de référence, homozygotes alternatifs et hétérozygotes, le nombre total de variantes nucléotidiques simples (SNVs) comme la somme des génotypes homozygotes alternatifs et hétérozygotes, le pourcentage d'appels hétérozygotes parmi tous les SNVs, et le pourcentage d'appels homozygotes alternatifs parmi tous les SNVs. Afficher l'identifiant de l'échantillon avec ces comptes et pourcentages calculés, et ordonner les résultats par le pourcentage d'appels hétérozygotes parmi les SNVs en ordre décroissant, puis par l'identifiant de l'échantillon.","external_knowledge":"1000_genomes_alleles_type.md"}
{"instance_id":"sf_bq452","db":"_1000_GENOMES","question":"Identifier des variantes sur le chromosome 12 et, pour chaque variante, calculer le score du chi carré en utilisant les comptages d’allèles chez les cas et les témoins, où les cas sont des individus de la 'EAS' super population et les témoins sont des individus de toutes les autres super populations. Appliquer la correction de Yates pour la continuité dans le calcul du chi carré, en veillant à ce que les comptages attendus pour chaque allèle dans les deux groupes soient au moins 5. Renvoyer la position de début, la position de fin et le score du chi carré des variantes les plus significatives où le score du chi carré est d’au moins 29.71679.","external_knowledge":null}
{"instance_id":"sf_bq453","db":"_1000_GENOMES","question":"Sur le chromosome 17 entre les positions 41196311 et 41277499, quels sont les noms de référence, les positions de début et de fin, les bases de référence, les bases alternatives distinctes, les types de variantes, et les scores du chi carré (calculés à partir de l'équilibre de Hardy-Weinberg) ainsi que le nombre total de génotypes, leurs comptages observés et attendus pour les génotypes homozygotes de référence, hétérozygotes et homozygotes alternatifs, de même que les fréquences d'allèles (y compris celles de 1KG), pour chaque variante ?","external_knowledge":null}
{"instance_id":"sf_bq454","db":"_1000_GENOMES","question":"Pour l'ensemble de données 1000 Genomes, analyzez les variantes autosomales communes (celles ayant une fréquence d'allèle d'au moins 0,05) à travers les différentes super-populations. Pour chaque super-population, déterminez combien de variantes sont partagées par un nombre spécifique d'échantillons au sein de cette super-population. Incluez dans vos résultats la taille totale de la population de chaque super-population, si la variante est commune (fréquence d'allèle ≥ 0,05), le nombre d'échantillons possédant chaque variante, et le comptage total des variantes partagées par ce nombre d'échantillons. N'incluez que les variantes autosomales en excluant explicitement les chromosomes sexuels (X, Y) et l'ADN mitochondrial (MT) de l'analyse. Prenez en compte uniquement les échantillons qui présentent au moins un allèle alternatif (non-référence) pour la variante.","external_knowledge":null}
{"instance_id":"sf_bq415","db":"HUMAN_GENOME_VARIANTS","question":"Listez les 10 échantillons dans les données du génome qui présentent le plus grand nombre de positions où il n'y a exactement qu'un seul allèle alternatif et dont le génotype de l'échantillon est homozygote pour l'allèle de référence (les deux allèles sont 0). Triez les résultats par ordre décroissant du nombre de ces positions.","external_knowledge":"Homozygous_Reference_Genotype.md"}
{"instance_id":"bq279","db":"austin","question":"Pouvez-vous fournir le nombre de stations de vélos en libre-service actives et fermées distinctes pour chaque année 2013 et 2014 ?","external_knowledge":null}
{"instance_id":"bq281","db":"austin","question":"Quel est le nombre maximum de trajets à vélo électrique d'une durée supérieure à 10 minutes effectués par les abonnés titulaires de 'Student Membership' en une seule journée, en excluant les trajets commençant ou se terminant à 'Mobile Station' ou 'Repair Shop' ?","external_knowledge":null}
{"instance_id":"bq282","db":"austin","question":"Pouvez-vous me donner la valeur numérique du district actif du conseil municipal d'Austin qui compte le plus grand nombre de trajets à vélo qui commencent et se terminent dans le même district, mais pas à la même station ?","external_knowledge":null}
{"instance_id":"bq006","db":"austin","question":"Quelle est la date ayant le deuxième score Z le plus élevé pour les comptages quotidiens des incidents de 'PUBLIC INTOXICATION' à Austin pour l'année 2016 ? Indiquez la date au format '2016-xx-xx'.","external_knowledge":null}
{"instance_id":"sf_bq283","db":"AUSTIN","question":"Parmi toutes les stations qui sont actuellement actives, identifiez celles qui se classent parmi les 15 premiers (y compris les ex aequo) en fonction du nombre total de trajets qui démarrent à chaque station. Pour chacune de ces stations, renvoyez l’ID de la station, le nombre total de trajets démarrés, le pourcentage de ces trajets par rapport au total des trajets démarrés à partir des stations actives, et la durée moyenne des trajets en minutes. Ordonnez les résultats selon le rang de la station.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq284","db":"bbc","question":"Pouvez-vous fournir une répartition du nombre total d'articles dans différentes catégories et le pourcentage de ces articles qui mentionnent \"éducation\" dans chaque catégorie selon BBC News?","external_knowledge":null}
{"instance_id":"bq413","db":"dimensions_ai_covid19","question":"Récupérer les titres de venue des publications qui ont un `date_inserted` à partir de l'année 2021 et qui sont associées à une grille dont la ville d'adresse est 'Qianjiang'. Pour chaque publication, privilégier le titre de venue en sélectionnant d'abord le titre du journal s'il existe; sinon, le titre des actes; s'il n'est pas non plus disponible, alors le titre du livre; et enfin, si aucun de ceux-ci n'est disponible, le titre de la série de livres.","external_knowledge":null}
{"instance_id":"bq425","db":"ebi_chembl","question":"En utilisant les données de ChEMBL Release 23, récupérez toutes les molécules distinctes associées à l'entreprise 'SanofiAventis', en listant le nom commercial et la date d'approbation la plus récente pour chaque molécule. Veillez à ne conserver que la date d'approbation la plus récente par molécule et à ce que le champ entreprise corresponde exactement à 'SanofiAventis' sans se fier aux autres champs.","external_knowledge":null}
{"instance_id":"bq430","db":"ebi_chembl","question":"Trouver des paires de molécules différentes testées dans le même essai et le même type standard, où les deux présentent entre 10 et 15 atomes lourds, moins de 5 activités dans cet essai, moins de 2 activités en double, des valeurs standard non nulles, et des valeurs pChEMBL supérieures à 10. Pour chaque paire, rapporter le nombre maximal d'atomes lourds, la date de publication la plus récente (calculée en fonction du rang du document dans la même revue et la même année, et mappée sur un mois et jour synthétiques), l'ID du document le plus élevé, classer le changement des valeurs standard comme 'increase', 'decrease', ou 'no-change' en fonction de leurs valeurs et de leurs relations, et générer des UUID à partir de leurs identifiants d'activité et des SMILES canoniques.","external_knowledge":"chembl.md"}
{"instance_id":"bq023","db":"fec","question":"En utilisant l'Enquête sur la population américaine quinquennale de 2018 (ACS) pour les revenus médians au niveau des secteurs de recensement et le jeu de données des contributions individuelles de la Commission électorale fédérale de 2020 (FEC) filtré pour les donateurs dans l'État de New York, apparié aux géographies des secteurs de recensement via une table de correspondance code postal → secteur de recensement, calculez et listez le montant moyen des dons politiques et le revenu médian pour chaque secteur de recensement situé dans le comté de Kings (Brooklyn), New York.","external_knowledge":null}
{"instance_id":"bq094","db":"fec","question":"Veuillez fournir la liste de tous les comités de 2016 qui ont soutenu au moins un candidat et qui ont reçu un montant total de contributions individuelles compris entre $0 et $200 (incluant des contributions supérieures à $0 et inférieures à $200). Pour chaque comité éligible, indiquez son nom, le nombre de candidats uniques qu'il a soutenus, les noms des candidats par ordre alphabétique (séparés par des virgules) et le total de ces petits dons reçus par le comité.","external_knowledge":null}
{"instance_id":"bq287","db":"fda","question":"Parmi tous les codes ZIP de l'Utah, quel est le taux d'emploi de l'American Community Survey de 2017 pour la population âgée de 16 ans ou plus dans le code ZIP qui compte le moins de succursales bancaires assurées par la FDIC ?","external_knowledge":null}
{"instance_id":"bq432","db":"fda","question":"Veuillez fournir les données des événements alimentaires where both \"date_created\" and \"date_started\" sont between January 1 and January 31, 2015, appliquez les étapes de nettoyage de données suivantes : diviser les champs reactions et outcomes en tableaux par des virgules, gérer les motifs numériques spéciaux dans le champ products_brand_name (where a digit is followed by comma and another digit) en préservant ces motifs numériques tout en remplaçant les autres \", \" par \" -- \", remplacer \", \" par \" -- \" dans les champs products_industry_code, products_role et products_industry_name, et calculer industry_code_length et brand_name_length comme les longueurs des tableaux après la séparation.","external_knowledge":"Food_Event_Cleansing_Logic.md"}
{"instance_id":"bq285","db":"fda","question":"Pourriez-vous me fournir le code postal de l'emplacement qui compte le plus grand nombre d'institutions bancaires en Floride ?","external_knowledge":null}
{"instance_id":"bq288","db":"fda","question":"Quel est le nombre total de toutes les institutions bancaires dans l'État qui a la plus grande somme d'actifs provenant des banques établies entre le 1er janvier 1900 et le 31 décembre 2000, dont les noms des institutions commencent par 'Bank' ?","external_knowledge":null}
{"instance_id":"sf_bq412","db":"GOOGLE_ADS","question":"Veuillez récupérer les URL des pages, l'heure de première impression, la dernière impression, la raison de suppression, la catégorie de violation et les bornes inférieure et supérieure des heures affichées pour les cinq publicités les plus récemment retirées dans la région de Croatie, code de région 'HR', où la date de disponibilité des heures affichées est nulle, la borne inférieure des heures affichées dépasse 10 000, la borne supérieure des heures affichées est inférieure à 25 000, et les publicités ont utilisé au moins l'une des approches de sélection d'audience parmi les démographiques, l'emplacement géographique, les signaux contextuels, les listes de clients ou les centres d'intérêt, en ordonnant les publicités résultantes par leur dernière heure d'affichage en ordre décroissant.","external_knowledge":null}
{"instance_id":"sf_bq423","db":"GOOGLE_ADS","question":"Entre le 1er janvier 2023 et le 1er janvier 2024, quelle publicité de type image sur le sujet Santé, publiée par un annonceur vérifié situé à Chypre, a été affichée en Croatie, possède times_shown_availability_date égal à NULL (ce qui signifie que les données d'affichage sont disponibles), utilisait des informations démographiques, le ciblage géo-localisé, des signaux contextuels, des listes de clients et des centres d'intérêt, et toutes ces méthodes de sélection étaient utilisées, et en outre sa première date d'affichage était strictement postérieure au 1er janvier 2023 et sa dernière date d'affichage était strictement antérieure au 1er janvier 2024 ? Parmi ces publicités, fournissez l'URL de la page de celle qui présente la borne supérieure du nombre d'affichages la plus élevée.","external_knowledge":null}
{"instance_id":"sf_bq070","db":"IDC","question":"Pourriez-vous fournir un ensemble de données propre et structuré à partir de la table dicom_all qui n’inclut que les images SM marquées comme VOLUME provenant des collections TCGA-LUAD et TCGA-LUSC, en excluant toute lame présentant le type de compression “other,” lorsque l’étape de préparation de l’échantillon porte explicitement sur “Embedding medium” fixé à “Tissue freezing medium,” et en veillant à ce que le type de tissu soit uniquement “normal” ou “tumor” et que le sous-type du cancer soit rapporté en conséquence ?","external_knowledge":"dicom_dataset_selection.md"}
{"instance_id":"sf_bq320","db":"IDC","question":"Dans la table dicom_pivot, combien de valeurs uniques de StudyInstanceUID correspondent exactement à la SegmentedPropertyTypeCodeSequence de \"15825003\" (insensible à la casse) et possèdent également une collection_id dont la valeur est soit \"Community\" ou \"nsclc_radiomics\" ?","external_knowledge":null}
{"instance_id":"sf_bq321","db":"IDC","question":"Combien y a-t-il de StudyInstanceUIDs uniques provenant des séries DWI, T2 Weighted Axial, Apparent Diffusion Coefficient et T2 Weighted Axial Segmentations dans la collection 'qin_prostate_repeatability' ?","external_knowledge":null}
{"instance_id":"sf_bq323","db":"IDC","question":"Dans la collection 'prostatex', pour les séquences IRM où la Modalité est 'MR', attribuez l'étiquette 't2w_prostateX' aux séquences dont la SeriesDescription contient 't2_tse_tra' et 'adc_prostateX' à celles dont la SeriesDescription contient 'ADC'. Pour toutes les séquences étiquetées comme 't2w_prostateX' ou 'adc_prostateX', calculez la moyenne du Temps de Répétition, la moyenne du Temps d'Écho et la moyenne de l'épaisseur de coupe, puis calculez la somme de ces moyennes afin d'obtenir la moyenne globale combinée.","external_knowledge":null}
{"instance_id":"sf_bq417","db":"IDC","question":"Veuillez fournir les détails d'identification, les informations sur l'étude et la série, le lieu de stockage et la taille totale en MB des images médicales appartenant à des patients masculins âgés exactement de 18 ans, basés sur la portion numérique du champ PatientAge, où le BodyPartExamined est défini sur 'MEDIASTINUM' et où la date de l'étude est strictement après September 1, 2014.","external_knowledge":"IDC_data_model.md"}
{"instance_id":"sf_bq455","db":"IDC","question":"Identifiez les cinq plus grandes séries CT par taille (en MiB), en incluant leur SeriesInstanceUID, le numéro de série, l'identifiant du patient et la taille de la série. Ces séries doivent provenir de la modalité CT et ne pas faire partie de la collection `nlst`. Excluez toute série dont le ImageType est classifié comme 'LOCALIZER' ou dont le TransferSyntaxUID est soit '1.2.840.10008.1.2.4.70' ou '1.2.840.10008.1.2.4.51' (c.-à-d. JPEG compressé). Les séries sélectionnées doivent avoir des intervalles de coupe cohérents, des niveaux d'exposition, une orientation d'image (avec une seule valeur unique de ImageOrientationPatient), un espacement des pixels, des positions d'image (à la fois sur l'axe z et les positions xy), et des dimensions de l'image (lignes et colonnes) cohérentes. Assurez-vous que le nombre d'images corresponde au nombre de positions uniques sur l'axe z, ce qui indique l'absence de tranches en double. De plus, la composante en z du produit vectoriel croisé des cosinus directeurs des axes x et y issus de ImageOrientationPatient doit avoir une valeur absolue comprise entre 0.99 et 1.01, assurant l'alignement avec le plan d'imagerie attendu. Enfin, triez les résultats par taille de série en ordre décroissant et limitez la sortie aux cinq premières séries satisfaisant ces conditions.","external_knowledge":null}
{"instance_id":"sf_bq456","db":"IDC","question":"Veuillez récupérer à partir de la table dicom_all chaque PatientID, StudyInstanceUID, StudyDate, et le CodeMeaning du FindingSite pour les patients dont le StudyDate se situe dans l'année 2001, ainsi que les valeurs maximales de chacune des mesures suivantes identifiées par leur CodeMeaning (Elongation, Flatness, Least Axis in 3D Length, Major Axis in 3D Length, Maximum 3D Diameter of a Mesh, Minor Axis in 3D Length, Sphericity, Surface Area of Mesh, Surface to Volume Ratio, Volume from Voxel Summation, et Volume of Mesh), en veillant à ce que la table quantitative_measurements soit jointe sur segmentationInstanceUID correspondant au SOPInstanceUID dans dicom_all, et grouping by PatientID, StudyInstanceUID, StudyDate, and FindingSite CodeMeaning.","external_knowledge":null}
{"instance_id":"sf_bq324","db":"IDC","question":"Combien d'images au total parmi toutes les images de microscopie sur lames entières de la collection TCGA-BRCA qui utilisent la modalité SM et incluent une étape de coloration à base d'éosine dans leur SpecimenPreparationSequence ?","external_knowledge":null}
{"instance_id":"bq418","db":"targetome_reactome","question":"Déterminez quelles sont les trois voies Reactome de niveau le plus bas (avec une preuve TAS) qui présentent les plus grandes statistiques du χ², en ne considérant que les cibles chez l'Homo sapiens associées au sorafenib sous les conditions où la valeur médiane de l’essai est ≤ 100 et les valeurs d’essai basses et élevées sont ≤ 100 ou nulles. Pour chacune de ces trois voies, combien de ces cibles et de ces non-cibles se trouvent à l’intérieur de la voie et à l’extérieur ?","external_knowledge":null}
{"instance_id":"bq330","db":"fda","question":"Quel code postal du Colorado présente la plus forte concentration d'emplacements de banques par groupe de blocs, basé sur le chevauchement entre les codes postaux et les groupes de blocs ?","external_knowledge":"overlap_ratio.md"}
{"instance_id":"bq398","db":"world_bank","question":"Quels sont les trois principaux indicateurs de la dette pour la Russie, basés sur les valeurs de dette les plus élevées ?","external_knowledge":null}
{"instance_id":"bq399","db":"world_bank","question":"Quel pays à revenu élevé a enregistré, respectivement pour chaque région, le taux moyen de natalité brut le plus élevé, et quels sont leurs taux moyens correspondants, pendant les années 1980 ?","external_knowledge":null}
{"instance_id":"bq457","db":"libraries_io","question":"Obtenez les détails des dépôts qui utilisent des bibliothèques de bascule de fonctionnalité spécifiques. Pour chaque dépôt, incluez le nom complet avec le propriétaire, le type de plateforme d'hébergement, la taille en octets, le langage de programmation principal, le nom de la source de fork (le cas échéant), l'horodatage de la dernière mise à jour, le nom de l'artefact et de la bibliothèque de la bascule de fonctionnalité utilisée, et les langages de programmation de la bibliothèque. Incluez les dépôts qui dépendent des bibliothèques de bascule de fonctionnalité spécifiées, définies par leurs noms d'artefact, noms de bibliothèque, plateformes et langages.","external_knowledge":"feature_toggle_libraries.md"}
{"instance_id":"bq227","db":"london","question":"Pourriez-vous fournir les parts annuelles en pourcentage, arrondies à deux décimales, des 5 catégories de délits mineurs les plus fréquentes à partir de 2008 dans les crimes totaux de Londres, chaque année étant affichée sur une ligne ?","external_knowledge":null}
{"instance_id":"bq232","db":"london","question":"Pourriez-vous fournir le nombre total d'incidents de 'Other Theft' dans la catégorie 'Theft and Handling' pour chaque année dans l'arrondissement de Westminster ?","external_knowledge":null}
{"instance_id":"bq228","db":"london","question":"Veuillez fournir une liste des trois principales catégories de criminalité dans l'arrondissement de Barking and Dagenham, ainsi que le nombre d'incidents dans chaque catégorie.","external_knowledge":null}
{"instance_id":"bq229","db":"open_images","question":"En utilisant l'ensemble de données bigquery-public-data.open_images, pouvez-vous fournir le nombre d'URLs d'images distinctes classées comme 'cat' (où l'image a l'étiquette '/m/01yrx' avec confidence=1) et le nombre d'URLs d'images distinctes classées comme 'other' (ce qui signifie qu'elles n'ont pas du tout d'étiquette 'cat' '/m/01yrx') ?","external_knowledge":null}
{"instance_id":"bq230","db":"usda_nass_agriculture","question":"En utilisant l'ensemble de données sur les cultures, trouvez les totaux de production pour 2022, mesurés en boisseaux, pour le maïs issu de la catégorie 'FIELD CROPS' et les champignons du groupe 'HORTICULTURE' pour chaque État américain. N'incluez que les lignes de données où 'statisticcat_desc' est 'PRODUCTION', 'agg_level_desc' est 'STATE', 'value' n'est pas NULL, et assurez-vous que pour le maïs le 'unit_desc' est 'BU'. Combinez les deux résultats afin que les totaux de maïs et de champignons pour 2022 pour chaque État soient présentés.","external_knowledge":null}
{"instance_id":"bq326","db":"world_bank","question":"Sur la base du jeu de données mondial sur la population de la Banque mondiale et du jeu de données Santé, Nutrition et Population de la Banque mondiale, combien de pays ont connu une augmentation de plus de 1 % en 2018 par rapport à l'année précédente, à la fois dans leur population totale et dans les dépenses de santé courantes par habitant (PPA) ?","external_knowledge":null}
{"instance_id":"bq424","db":"world_bank","question":"Énumérez les 10 premiers pays en fonction du montant total de la dette extérieure à long terme, par ordre décroissant, en excluant ceux qui n'ont pas de région spécifiée.","external_knowledge":null}
{"instance_id":"bq327","db":"world_bank","question":"Combien d'indicateurs de dette pour la Russie ont une valeur de 0, en excluant les valeurs NULL ?","external_knowledge":null}
{"instance_id":"bq328","db":"world_bank","question":"Quelle région a la valeur médiane du PIB (en US$ constants de 2015) la plus élevée ?","external_knowledge":null}
{"instance_id":"sf_bq331","db":"META_KAGGLE","question":"Trouver les trois premiers utilisateurs qui ont rédigé le premier message dans les sujets du forum, classés par ordre décroissant de leurs scores de messages, où un score de message est défini comme le nombre d'utilisateurs distincts qui ont voté pour ce message. Pour chacun de ces utilisateurs, fournissez leur nom d'utilisateur et la différence absolue entre leur score de message et le score moyen des premiers messages dans les sujets du forum.","external_knowledge":null}
{"instance_id":"sf_bq380","db":"META_KAGGLE","question":"En utilisant les données des tables Forum Message Votes et Users, trouvez les trois premiers utilisateurs qui ont reçu le plus grand nombre de votes positifs distincts sur le forum Kaggle. Pour chacun de ces utilisateurs, indiquez leur nom d'utilisateur, le nombre total de votes positifs distincts qu'ils ont reçus (basé sur le champ ToUserId), et le nombre total de votes positifs distincts qu'ils ont donnés (basé sur le champ FromUserId), triés par le nombre de votes reçus en ordre décroissant et limités à seulement les trois premiers résultats.","external_knowledge":null}
{"instance_id":"sf_bq370","db":"WIDE_WORLD_IMPORTERS","question":"Combien de clients ont des commandes et des factures qui correspondent au niveau de chaque ligne d'article et, lorsqu'ils sont agrégés, aboutissent à ce que chaque client ait un nombre égal de commandes et de factures, ainsi qu'une valeur totale identique pour les commandes et les factures ?","external_knowledge":null}
{"instance_id":"sf_bq371","db":"WIDE_WORLD_IMPORTERS","question":"Au cours de l'année 2013, en considérant que la valeur totale de chaque facture est le produit du prix unitaire et de la quantité et en regroupant par trimestre (Q1, Q2, Q3, Q4) dans lequel la date de la facture se situe, quelle est la différence entre la moyenne des valeurs des factures lorsqu'elle est la plus élevée et lorsqu'elle est la plus faible au cours de ces trimestres ?","external_knowledge":null}
{"instance_id":"sf_bq372","db":"WIDE_WORLD_IMPORTERS","question":"Parmi toutes les commandes qui n'apparaissent pas dans la table invoice, pour chaque catégorie de clientèle calculez la valeur maximale des commandes perdues, puis déterminez laquelle des valeurs maximales des commandes perdues par catégorie est la plus proche de la moyenne globale de ces valeurs maximales des commandes perdues pour l'ensemble des catégories ?","external_knowledge":null}
{"instance_id":"sf_bq373","db":"WIDE_WORLD_IMPORTERS","question":"En utilisant la date de facturation pour déterminer chaque mois de l'année 2014, et en additionnant les montants totaux des lignes de facture pour chaque client au cours de ces mois, quelle est la médiane de la moyenne mensuelle des dépenses pour l'ensemble des clients ?","external_knowledge":null}
{"instance_id":"bq393","db":"hacker_news","question":"Je veux identifier les utilisateurs qui ont eu une activité suivie d'une inactivité. Plus précisément, trouvez l'ID utilisateur et son numéro de mois correspondant (à partir du mois de leur première activité) pour l'utilisateur ayant le plus haut numéro de mois qui est devenu inactif (aucune activité enregistrée) après son dernier mois d'activité enregistré. Pour cette analyse, ne considérez les données que jusqu'au September 10, 2024, et assurez-vous que le numéro de mois représente le nombre de mois écoulés depuis la première activité de l'utilisateur. L'utilisateur devrait avoir au moins un mois où il était censé être actif (dans sa période d'activité) mais n'a en réalité aucun enregistrement.","external_knowledge":null}
{"instance_id":"bq403","db":"irs_990","question":"Quelles sont les trois années entre 2012 et 2017 qui présentent la plus petite différence absolue entre le revenu médian et les dépenses fonctionnelles médianes pour les organisations déposant les formulaires IRS 990 ? Veuillez afficher les trois années et les différences respectives.","external_knowledge":null}
{"instance_id":"bq397","db":"ecommerce","question":"Après avoir supprimé tous les doublons dans le jeu de données rev_transactions, identifiez chaque regroupement par canal qui contient des transactions provenant de plus d'un pays. Pour chacun de ces regroupements par canal, trouvez le pays ayant le plus grand nombre total de transactions et indiquez à la fois le nom du pays et le total des transactions pour ce regroupement par canal.","external_knowledge":null}
{"instance_id":"bq402","db":"ecommerce","question":"Calculez le taux de conversion des visiteurs uniques en acheteurs en utilisant les données exclusivement de la table `web_analytics` dans l'ensemble de données `data-to-insights.ecommerce`. Un visiteur est défini comme un `fullVisitorId` unique présent dans la table, tandis qu'un acheteur est un visiteur qui a au moins une transaction enregistrée (`totals.transactions` n'est pas NULL). Le taux de conversion est calculé en divisant le nombre d'acheteurs uniques par le nombre total de visiteurs uniques. De plus, calculez le nombre moyen de transactions par acheteur, en ne prenant en compte que les visiteurs ayant effectué au moins une transaction.","external_knowledge":null}
{"instance_id":"sf_bq160","db":"META_KAGGLE","question":"Veuillez fournir la date de création, le titre, le titre du forum parent, le nombre de réponses, le nombre de réponses par des utilisateurs distincts, le nombre total de votes positifs et le nombre total de vues pour les cinq premiers sujets de forum les plus anciens qui appartiennent à n'importe quel sous-forum du forum parent intitulé \"Général\". Le nombre de réponses doit être calculé comme le nombre total de messages associés à chaque sujet, et le nombre de réponses par des utilisateurs distincts doit être le nombre d'utilisateurs uniques qui ont posté des messages dans le sujet. Les votes positifs doivent être calculés comme le nombre total de votes positifs sur tous les messages dans chaque sujet. Si des valeurs manquent ou sont None, veuillez les traiter comme zéro","external_knowledge":null}
{"instance_id":"sf_bq167","db":"META_KAGGLE","question":"Identifiez la paire d'utilisateurs Kaggle impliqués dans ForumMessageVotes de telle sorte que l'un des utilisateurs ait attribué à l'autre le plus grand nombre distinct de votes positifs, puis affichez également combien de votes positifs ce destinataire a rendus. Présentez les noms d'utilisateur des deux utilisateurs, le nombre total de votes positifs distincts reçus l'un de l'autre, et les votes qu'ils ont rendus, en triant par le nombre le plus élevé de votes reçus puis par le nombre le plus élevé de votes donnés, et n'affichez que le meilleur résultat.","external_knowledge":null}
{"instance_id":"sf_bq171","db":"META_KAGGLE","question":"À qui appartiennent les votes positifs des messages du forum qui sont les plus proches de la moyenne en 2019 ? En cas d'égalité, dites-moi celui dont le nom d'utilisateur est le premier par ordre alphabétique.","external_knowledge":null}
{"instance_id":"sf_bq118","db":"DEATH","question":"Parmi les individus identifiés comme blancs, de combien le nombre moyen de décès issus des codes ICD-10 dont les descriptions contiennent le mot “discharge” est-il plus élevé que le nombre moyen de décès issus des codes ICD-10 dont les descriptions contiennent le mot “vehicle”, lorsqu’on regroupe par tranches d'âge (en excluant spécifiquement “Urethral discharge,” “Discharge of firework,” et “Legal intervention involving firearm discharge”) ?","external_knowledge":null}
{"instance_id":"sf_bq072","db":"DEATH","question":"Veuillez fournir, pour chaque âge de 12 à 18 ans (inclus), le nombre total de décès et le nombre de décès parmi les individus identifiés comme Black (basé sur les descriptions de race contenant le mot ‘black’), spécifiquement pour les décès associés aux codes ICD-10 dont les descriptions incluent le mot ‘vehicle’ et pour les décès associés aux codes ICD-10 dont les descriptions incluent le mot ‘firearm’. Utilisez la table EntityAxisConditions pour déterminer quels codes ICD-10 étaient impliqués dans chaque décès, plutôt que de joindre les informations sur les codes ICD-10 directement sur les enregistrements de décès.","external_knowledge":null}
{"instance_id":"ga001","db":"ga4","question":"Je veux connaître les préférences des clients qui ont acheté le Google Navy Speckled Tee en December 2020. Quel autre produit a été acheté avec la quantité totale la plus élevée aux côtés de cet article ?","external_knowledge":null}
{"instance_id":"ga002","db":"ga4","question":"Dites-moi quels sont les autres produits les plus achetés et leurs quantités par les clients qui ont acheté Google Red Speckled Tee chaque mois pendant les trois mois à partir de novembre 2020.","external_knowledge":null}
{"instance_id":"ga003","db":"firebase","question":"J'essaie d'évaluer quels types de plateaux de jeu ont été les plus efficaces le 15 septembre 2018. Peux-tu déterminer les scores moyens pour chaque type de plateau de jeu à partir des complétions du mode Quick Play ce jour-là ?","external_knowledge":null}
{"instance_id":"ga004","db":"ga4","question":"Pouvez-vous déterminer la différence moyenne du nombre de pages vues entre les utilisateurs qui ont acheté quelque chose et ceux qui ne l'ont pas fait en December 2020 ? Étiquetez simplement toute personne impliquée dans des événements d'achat comme acheteur.","external_knowledge":null}
{"instance_id":"ga008","db":"ga4","question":"Pourriez-vous fournir le nombre total de pages vues pour chaque jour de November 2020 ainsi que la moyenne de pages vues par utilisateur sur ces jours, réservée aux utilisateurs qui ont effectué au moins un achat en November 2020 ?","external_knowledge":null}
{"instance_id":"ga017","db":"ga4","question":"Combien d'utilisateurs distincts ont consulté la page la plus visitée au cours de janvier 2021 ?","external_knowledge":null}
{"instance_id":"ga007","db":"ga4","question":"Veuillez déterminer quel pourcentage des pages vues le 2 janvier 2021 étaient des pages de type PDP.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga013","db":"ga4","question":"Je veux connaître toutes les pages visitées par l'utilisateur 1402138.5184246691 le 2 janvier 2021. Veuillez afficher les noms de ces pages et ajuster les noms pour PDP ou PLP lorsque cela est nécessaire.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga018","db":"ga4","question":"Le 2 janvier 2021, je souhaite déterminer le pourcentage du nombre de fois où les utilisateurs passent d'une vue de page de liste de produits (PLP) à une vue de page de détail de produit (PDP) au sein de la même session, en utilisant uniquement les événements page_view. Pourriez-vous calculer combien de vues PLP se sont finalement transformées en une vue PDP dans la même session à cette date, puis fournir le pourcentage résultant des transitions PLP-vers-PDP ?","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga032","db":"ga4","question":"Pouvez-vous générer le flux de navigation pour l'utilisateur avec pseudo_id '1362228.4966015575' le 28 janvier 2021, en ne montrant que les événements page_view ? Veuillez relier les titres des pages avec '>>' entre chaque étape, convertir les pages de détail produit en 'PDP' et les pages de liste produit en 'PLP' en fonction de la structure des URL, et fusionner les pages adjacentes identiques afin qu'elles n'apparaissent qu'une seule fois dans la séquence. Je dois comprendre comment cet utilisateur spécifique a navigué sur notre site web ce jour-là.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga031","db":"ga4","question":"Je veux connaître le taux de conversion des sessions utilisateur le 2 janvier 2021, en utilisant uniquement les événements 'page_view'. Le taux de conversion doit être calculé comme le pourcentage des visites utilisateur qui atteignent à la fois les pages Accueil et Confirmation de commande au cours d'une seule session, par rapport à celles qui sont arrivées sur la page d'accueil.","external_knowledge":null}
{"instance_id":"ga006","db":"ga4","question":"Pour la plage de dates November 1–30, 2020, pouvez-vous récupérer chaque user_pseudo_id et son revenu moyen d'achat en USD par session pour les utilisateurs ayant eu plus d'une session d'achat, en ne considérant que les événements avec event_name='purchase' et un ecommerce.purchase_revenue_in_usd non-null, regroupant les sessions par le ga_session_id provenant de event_params","external_knowledge":null}
{"instance_id":"ga009","db":"ga4","question":"Pourriez-vous me dire le nombre moyen de sessions engagées par utilisateur pour le mois de décembre 2020, en ne comptant que les sessions où le paramètre d'événement 'session_engaged' est égal à '1' et en utilisant 'user_pseudo_id' combiné avec le 'ga_session_id' pour identifier les sessions distinctes ?","external_knowledge":null}
{"instance_id":"ga010","db":"ga4","question":"Pouvez-vous me donner un aperçu du trafic de notre site web pour décembre 2020 ? Je suis particulièrement intéressé par le canal ayant le quatrième plus grand nombre de sessions.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga014","db":"ga4","question":"Pouvez-vous fournir le nombre total de sessions pour chaque canal de trafic en décembre 2020, en utilisant les informations de 'event_params' ?","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga011","db":"ga4","question":"Quelle est la page qui affiche le deuxième plus grand nombre de vues totales de pages, après avoir nettoyé son URL (en supprimant les barres obliques en trop) et avoir extrait le chemin de page correct, sur le site 'shop.googlemerchandisestore.com' pendant décembre 2020 ?","external_knowledge":null}
{"instance_id":"ga012","db":"ga4","question":"Le 30 novembre 2020, identifiez la catégorie d'article ayant le taux d'imposition le plus élevé en divisant la valeur de la taxe en usd par le revenu d'achat en usd pour les événements d'achat, puis récupérez les identifiants de transaction, les quantités totales d'articles et à la fois le revenu d'achat en usd et le revenu d'achat pour ces événements d'achat dans cette catégorie au taux d'imposition le plus élevé.","external_knowledge":null}
{"instance_id":"ga019","db":"firebase","question":"Pourriez-vous déterminer quel pourcentage des utilisateurs soit ne l'ont pas désinstallée dans les sept jours qui ont suivi l'installation, soit ne l'ont jamais désinstallée après l'installation, au cours des mois d'août et septembre 2018 ?","external_knowledge":null}
{"instance_id":"ga030","db":"firebase","question":"Pouvez-vous regrouper les utilisateurs par semaine de leur première session, en commençant à partir du July 2, 2018 ? Pour chaque groupe, calculez le taux de rétention à la quatrième semaine (c.-à-d. le pourcentage des utilisateurs du groupe d'origine qui sont revenus lors de la quatrième semaine après leur première session). Veuillez identifier la cohorte ayant le taux de rétention le plus élevé à la quatrième semaine, et nommer le groupe d'après la date du lundi de la semaine de la première session de la cohorte. Renvoyez le résultat au format \"YYYY-MM-DD\".","external_knowledge":"retention_rate.md"}
{"instance_id":"ga005","db":"firebase","question":"Réaliser une analyse de cohorte hebdomadaire de la rétention des utilisateurs, à partir du July 9, 2018 et se terminant le October 2, 2018. Regrouper les utilisateurs par la semaine de leur premier événement `session_start` (les semaines commençant le lundi), et identifier les nouveaux utilisateurs comme ceux dont event_date correspond à la date de leur user_first_touch_timestamp. Calculer le taux de rétention de la semaine 2 pour chaque cohorte hebdomadaire, défini comme le pourcentage d'utilisateurs qui ont eu un événement `session_start` exactement 2 semaines après leur première semaine. N'incluez que les cohortes du July 9, 2018 au September 17, 2018 (la dernière cohorte pouvant être analysée pour une rétention de 2 semaines compte tenu des données disponibles). Présentez les résultats avec chaque cohorte hebdomadaire et son taux de rétention de la semaine 2 correspondant, triés par date de cohorte.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga028","db":"firebase","question":"Veuillez effectuer une analyse de rétention sur 7 jours pour les utilisateurs dont la première session a démarré l’application au cours de la semaine commençant le 2 juillet 2018. Pour chaque semaine de Week 0 (la semaine de leur première session) à Week 4, fournissez le nombre total de nouveaux utilisateurs dans Week 0 et le nombre d’utilisateurs retenus pour chaque semaine suivante. En veillant à ne compter les événements que jusqu’au 2 octobre 2018 et à regrouper les dates par des semaines commençant le lundi.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga020","db":"firebase","question":"Quel type d'événement quickplay avait le taux de rétention utilisateur le plus bas durant la deuxième semaine après leur engagement initial, pour les utilisateurs qui se sont engagés pour la première fois entre le 1er et le 15 août 2018, mesuré par la présence des événements session_start ?","external_knowledge":"retention_rate.md"}
{"instance_id":"ga021","db":"firebase","question":"Quel est le taux de rétention des utilisateurs deux semaines après leur premier événement quickplay, calculé séparément pour chaque type d'événement quickplay, dans la période allant du July 2, 2018, au July 16, 2018 ? Veuillez vous concentrer sur les utilisateurs qui ont commencé une session (session_start) pendant cette période.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga022","db":"firebase","question":"Pourriez-vous m'aider à obtenir le taux de rétention hebdomadaire des clients en septembre 2018, pour les nouveaux clients qui ont utilisé notre application pour la première fois (first_open event) au cours de la première semaine à partir du 1er septembre 2018 (dans le fuseau horaire de Shanghai) ? Les taux de rétention doivent couvrir les périodes des semaines 1, 2 et 3 après l'utilisation initiale et les afficher sous forme de colonnes.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga025","db":"firebase","question":"Pour tous les utilisateurs qui ont d'abord ouvert l'application en September 2018 et qui se sont ensuite désinstallés dans sept jours, je veux savoir quel pourcentage d'entre eux a connu un plantage de l'application (app_exception). Le calcul doit être effectué en convertissant les horodatages en dates d'abord, puis en calculant le nombre de jours jusqu'à la désinstallation à partir des dates. Seuls les utilisateurs qui se sont désinstallés dans sept jours et qui ont connu un plantage doivent être pris en compte dans le pourcentage final.","external_knowledge":null}
{"instance_id":"local002","db":"E_commerce","question":"Pouvez-vous calculer la moyenne mobile symétrique sur 5 jours des ventes prévues de jouets pour la période du 5 au 8 décembre 2018, en utilisant les données de ventes quotidiennes du 1er janvier 2017 au 29 août 2018, avec un modèle de régression linéaire simple ? Enfin, fournissez la somme de ces quatre moyennes mobiles sur 5 jours ?","external_knowledge":null}
{"instance_id":"local003","db":"E_commerce","question":"Selon le document de définition RFM, calculez la moyenne des ventes par commande pour chaque client au sein des segments RFM distincts, en ne tenant compte que des commandes 'delivered'. Utilisez l'identifiant unique du client. Définissez clairement comment calculer la Récence à partir du dernier horodatage d'achat et précisez les critères de classification des segments RFM. La moyenne des ventes doit être calculée comme les dépenses totales divisées par le nombre total de commandes. Veuillez analyser et rendre compte des différences de la moyenne des ventes entre les segments RFM.","external_knowledge":"RFM.md"}
{"instance_id":"local004","db":"E_commerce","question":"Pourriez-vous me dire le nombre de commandes, le paiement moyen par commande et la durée de vie du client en semaines des 3 clients ayant le paiement moyen par commande le plus élevé, où la durée de vie est calculée en soustrayant la date d'achat la plus ancienne de la date d'achat la plus récente en jours, puis en divisant par sept, et si le résultat est inférieur à sept jours, le régler à 1,0 ?","external_knowledge":null}
{"instance_id":"local007","db":"Baseball","question":"Pourriez-vous m'aider à calculer la durée moyenne de carrière en années pour tous les joueurs de baseball ? Veuillez préciser le résultat sous forme d'un nombre à virgule flottante. Tout d'abord, calculez la différence en années, mois et jours entre les dates de début et de dernier match. Pour chaque joueur, la durée de carrière est calculée comme la somme du nombre absolu d'années, plus le nombre absolu de mois divisé par 12, plus le nombre absolu de jours divisé par 365. Arrondissez chaque partie à deux décimales avant de les additionner. Enfin, faites la moyenne des durées de carrière et arrondissez le résultat à un nombre à virgule flottante.","external_knowledge":null}
{"instance_id":"local008","db":"Baseball","question":"J'aimerais connaître les prénoms des joueurs de baseball qui ont atteint la valeur la plus élevée de matchs joués, de points marqués, de coups sûrs et de circuits, avec leurs valeurs de score correspondantes.","external_knowledge":null}
{"instance_id":"local009","db":"Airlines","question":"Quelle est la distance du trajet le plus long où Abakan est soit la ville de départ soit la ville d'arrivée (en kilomètres) ?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local010","db":"Airlines","question":"Répartissez toutes les paires de villes uniques dans les plages de distance 0, 1000, 2000, 3000, 4000, 5000 et 6000+, en fonction de leur distance moyenne sur l'ensemble des itinéraires entre elles. Ensuite, combien de paires y a-t-il dans la plage de distance qui contient le moins de paires de villes uniques ?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local015","db":"California_Traffic_Collision","question":"Veuillez calculer le taux de létalité des collisions impliquant des motocyclistes, séparé par l'utilisation du casque. Plus précisément, calculez deux pourcentages : 1) le pourcentage des décès de motocyclistes dans les collisions où les parties (conducteurs ou passagers) portaient des casques, et 2) le pourcentage des décès de motocyclistes dans les collisions où les parties ne portaient pas de casque. Pour chaque groupe, calculez cela en divisant le nombre total de décès de motocyclistes par le nombre total de collisions impliquant ce groupe. Utilisez la table parties pour déterminer l'utilisation du casque (à partir des champs party_safety_equipment).","external_knowledge":null}
{"instance_id":"local017","db":"California_Traffic_Collision","question":"En quelle année les deux causes les plus fréquentes des accidents de la circulation différaient-elles de celles des autres années ?","external_knowledge":null}
{"instance_id":"local018","db":"California_Traffic_Collision","question":"Pour la catégorie de violation du facteur de collision primaire qui était la cause la plus fréquente des accidents de la route en 2021, de combien de points de pourcentage sa part des incidents routiers annuels en 2021 a-t-elle diminué par rapport à sa part en 2011 ?","external_knowledge":null}
{"instance_id":"local019","db":"WWE","question":"Pour le titre NXT qui a connu le match le plus court (à l'exclusion des titres avec \"changement de titre\"), quels étaient les noms des deux lutteurs impliqués ?","external_knowledge":null}
{"instance_id":"local026","db":"IPL","question":"Veuillez m’aider à identifier les trois meilleurs lanceurs qui, dans les overs où le maximum de runs a été concédé dans chaque match, ont concédé le plus grand nombre de runs dans un seul over sur l'ensemble des matchs. Pour chacun de ces lanceurs, indiquez le match au cours duquel ils ont concédé ces runs maximaux. Ne considérez que les overs qui ont concédé le plus de runs dans leurs matchs respectifs et, parmi ceux-ci, déterminez quels lanceurs ont concédé le plus de runs dans un seul over au total.","external_knowledge":null}
{"instance_id":"local020","db":"IPL","question":"Quel lanceur a la plus faible moyenne au bowling par guichets pris ?","external_knowledge":null}
{"instance_id":"local021","db":"IPL","question":"Pourriez-vous calculer la moyenne du total des runs marqués par tous les batteurs qui ont marqué plus de 50 runs lors d'un seul match ?","external_knowledge":null}
{"instance_id":"local022","db":"IPL","question":"Récupérez les noms des joueurs qui ont marqué au moins 100 runs dans un match alors qu'ils jouaient pour l'équipe qui a perdu ce match.","external_knowledge":null}
{"instance_id":"local023","db":"IPL","question":"Aidez-moi à trouver les noms des 5 meilleurs joueurs ayant la moyenne de runs par match la plus élevée en saison 5, ainsi que leurs moyennes au bâton.","external_knowledge":null}
{"instance_id":"local024","db":"IPL","question":"Pouvez-vous m'aider à trouver les cinq pays dont les joueurs ont la plus haute moyenne de leurs moyennes individuelles de runs par match sur l'ensemble des saisons ? Plus précisément, pour chaque joueur, calculez sa moyenne de runs par match sur tous les matchs auxquels il a participé, puis calculez la moyenne de ces moyennes de joueurs pour chaque pays, et incluez dans le résultat ces moyennes de batteur par pays.","external_knowledge":null}
{"instance_id":"local025","db":"IPL","question":"Pour chaque match, en tenant compte de chaque manche, veuillez additionner les points marqués par les deux batteurs et les points supplémentaires pour chaque over, puis identifier l'over unique ayant le total le plus élevé, récupérer le lanceur pour cet over à partir de la table ball by ball, et calculer la moyenne de ces totaux d'over les plus élevés sur tous les matchs, en veillant à ce que tous les points et les détails des lanceurs soient reflétés avec précision.","external_knowledge":null}
{"instance_id":"local028","db":"Brazilian_E_Commerce","question":"Pourriez-vous générer un rapport qui montre le nombre de commandes livrées pour chaque mois des années 2016, 2017 et 2018 ? Chaque colonne représente une année, et chaque ligne représente un mois.","external_knowledge":null}
{"instance_id":"local031","db":"Brazilian_E_Commerce","question":"Quel est le volume mensuel le plus élevé des commandes livrées dans l'année ayant le plus faible volume annuel de commandes livrées parmi 2016, 2017 et 2018 ?","external_knowledge":null}
{"instance_id":"local029","db":"Brazilian_E_Commerce","question":"Veuillez identifier les trois principaux clients, en se basant sur leur customer_unique_id, qui ont le plus grand nombre de commandes livrées, et donner la valeur moyenne du paiement, la ville et l'État pour chacun de ces clients.","external_knowledge":null}
{"instance_id":"local030","db":"Brazilian_E_Commerce","question":"Parmi toutes les villes ayant des commandes livrées, trouvez les cinq villes dont la somme des paiements est la plus faible, puis calculez la moyenne de leurs paiements totaux et la moyenne de leur nombre total de commandes livrées.","external_knowledge":null}
{"instance_id":"local032","db":"Brazilian_E_Commerce","question":"Pourriez-vous m'aider à trouver les vendeurs qui excellent dans les catégories suivantes, en ne tenant compte que des commandes livrées : le vendeur ayant le plus grand nombre d'identifiants clients distincts, le vendeur avec le plus grand bénéfice (calculé comme le prix moins la valeur du fret), le vendeur ayant le plus grand nombre de commandes distinctes, et le vendeur ayant le plus grand nombre d'évaluations 5 étoiles ? Pour chaque catégorie, veuillez fournir l'ID du vendeur et la valeur correspondante, en étiquetant chaque ligne d'une description de l'accomplissement.","external_knowledge":null}
{"instance_id":"local034","db":"Brazilian_E_Commerce","question":"Pourriez-vous m'aider à calculer la moyenne du nombre total de paiements effectués en utilisant le mode de paiement le plus privilégié pour chaque catégorie de produit, ce mode étant celui qui affiche le plus grand nombre de paiements dans sa catégorie ?","external_knowledge":null}
{"instance_id":"local037","db":"Brazilian_E_Commerce","question":"Identifiez les trois principales catégories de produits dont le type de paiement le plus utilisé a le plus grand nombre de paiements parmi toutes les catégories, et indiquez le nombre de paiements effectués dans chaque catégorie en utilisant ce type de paiement.","external_knowledge":null}
{"instance_id":"local035","db":"Brazilian_E_Commerce","question":"Dans la table “olist_geolocation”, veuillez identifier quelles deux villes consécutives, lorsque triées par geolocation_state, geolocation_city, geolocation_zip_code_prefix, geolocation_lat et geolocation_lng, présentent la plus grande distance entre elles en fonction de la différence de distance calculée entre chaque ville et son prédécesseur immédiat dans cet ordre.","external_knowledge":"spherical_law.md"}
{"instance_id":"local038","db":"Pagila","question":"Pourriez-vous m'aider à déterminer quel acteur a joué le rôle principal le plus fréquemment dans des films pour enfants en anglais qui étaient classés soit G soit PG, ayant une durée de 120 minutes ou moins, et sortis entre 2000 et 2010 ? Veuillez fournir le nom complet de l'acteur.","external_knowledge":null}
{"instance_id":"local039","db":"Pagila","question":"Veuillez m'aider à trouver la catégorie de film ayant le plus grand total d'heures de location dans les villes dont le nom commence par \"A\" ou contient un tiret.","external_knowledge":null}
{"instance_id":"local040","db":"modern_data","question":"Dans l'ensemble de données combiné qui unit les données sur les arbres et les données de revenus par code postal, en comblant les valeurs de code postal manquantes lorsque nécessaire, quels sont les trois arrondissements restreints aux enregistrements dont le revenu médian et le revenu moyen sont tous deux supérieurs à zéro et dont le nom d'arrondissement est valide, qui contiennent le plus grand nombre d'arbres, et quel est le revenu moyen pour chacun de ces trois arrondissements ?","external_knowledge":null}
{"instance_id":"local041","db":"modern_data","question":"Quel pourcentage des arbres du Bronx ont un état de santé bon ?","external_knowledge":null}
{"instance_id":"local049","db":"modern_data","question":"Pouvez-vous m'aider à calculer le nombre moyen de nouvelles entreprises licornes par an dans le secteur principal de 2019 à 2021 ?","external_knowledge":null}
{"instance_id":"local054","db":"chinook","question":"Pourriez-vous me dire les prénoms des clients qui ont dépensé moins de $1 sur des albums de l'artiste le plus vendu, ainsi que les montants qu'ils ont dépensés ?","external_knowledge":null}
{"instance_id":"local055","db":"chinook","question":"Identifiez l'artiste ayant les ventes totales d'albums les plus élevées (l'égalité étant résolue par ordre alphabétique) et l'artiste ayant les ventes totales d'albums les plus faibles (l'égalité étant résolue par ordre alphabétique), puis calculez le montant que chaque client a dépensé spécifiquement pour les albums de ces deux artistes. Ensuite, calculez la dépense moyenne des clients qui ont acheté chez l'artiste ayant les ventes les plus élevées et la dépense moyenne des clients qui ont acheté chez l'artiste ayant les ventes les plus faibles, et enfin renvoyez la différence absolue entre ces deux moyennes.","external_knowledge":null}
{"instance_id":"local198","db":"chinook","question":"À partir des données de ventes, quelle est la valeur médiane du total des ventes réalisées dans les pays où le nombre de clients est supérieur à 4 ?","external_knowledge":null}
{"instance_id":"local056","db":"sqlite-sakila","question":"Quel client a la variation moyenne mensuelle la plus élevée des montants de paiement ? Veuillez fournir le nom complet du client.","external_knowledge":null}
{"instance_id":"local058","db":"education_business","question":"Pouvez-vous fournir une liste des segments de produits matériels ainsi que leurs nombres de produits uniques pour 2020 dans le résultat, classée par le pourcentage d'augmentation le plus élevé des produits uniques des ventes entre 2020 et 2021 ?","external_knowledge":null}
{"instance_id":"local059","db":"education_business","question":"Pour l'année calendaire 2021, quelle est la moyenne globale de la quantité vendue des trois produits matériels les plus vendus (par quantité totale vendue) dans chaque division ?","external_knowledge":null}
{"instance_id":"local060","db":"complex_oracle","question":"Aux États-Unis, pour Q4 2019 et Q4 2020, commencez par ne sélectionner que les villes dont les ventes totales (sans promotions) ont augmenté d'au moins 20% entre Q4 2019 et Q4 2020. Parmi ces villes, classez les produits selon leurs ventes globales (toujours sans promotions) dans ces trimestres et retenez les 20% les plus élevés. Puis calculez la part de chaque produit parmi les ventes totales en Q4 2019 et Q4 2020 et calculez la différence de part entre Q4 2019 et Q4 2020, en retournant les résultats par ordre décroissant de cette variation de part.","external_knowledge":null}
{"instance_id":"local063","db":"complex_oracle","question":"Parmi tous les produits vendus aux États-Unis avec promo_id=999, en ne considérant que les villes dont les ventes ont augmenté d'au moins 20 % entre Q4 2019 (calendar_quarter_id=1772) et Q4 2020 (calendar_quarter_id=1776), quel produit, qui se classe parmi les 20 % des ventes totales les plus élevées, présente la plus petite variation en points de pourcentage de sa part des ventes totales entre ces deux trimestres?","external_knowledge":null}
{"instance_id":"local061","db":"complex_oracle","question":"Quel est le montant moyen prévu des ventes mensuelles en USD pour la France en 2021, en considérant uniquement les ventes de produits avec promotions où promo_total_id = 1 et les canaux où channel_total_id = 1, en prenant les ventes mensuelles de chaque produit en 2019 et 2020, en calculant le taux de croissance de 2019 à 2020 pour ce même produit et ce même mois, en appliquant ce taux de croissance pour projeter les ventes mensuelles de 2021, en convertissant tous les montants projetés pour 2021 en USD avec les taux de change de 2021, et en faisant la moyenne et en les répertoriant par mois ?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local050","db":"complex_oracle","question":"Quelle est la médiane des ventes mensuelles moyennes projetées en USD pour la France en 2021, calculée en utilisant les données de ventes mensuelles de 2019 et 2020 (filtrées par promo_total_id=1 et channel_total_id=1), en appliquant le taux de croissance de 2019 à 2020 pour projeter 2021, en convertissant en USD selon la table des devises, et ensuite en déterminant les moyennes mensuelles avant de trouver leur médiane ?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local062","db":"complex_oracle","question":"Veuillez regrouper tous les clients italiens en dix tranches pour décembre 2021 en faisant la somme de leurs profits sur tous les produits achetés (où le bénéfice est calculé comme quantity_sold multiplié par la différence entre unit_price et unit_cost), puis diviser l'étendue globale des bénéfices mensuels totaux en dix intervalles égaux. Pour chaque tranche, indiquez le nombre de clients et identifiez le bénéfice total minimum et maximum au sein de cette tranche.","external_knowledge":null}
{"instance_id":"local067","db":"complex_oracle","question":"Pouvez-vous fournir les profits les plus élevés et les plus bas pour les clients italiens, segmentés en dix tranches également réparties basées sur leurs profits de vente de décembre 2021 ?","external_knowledge":null}
{"instance_id":"local070","db":"city_legislation","question":"Veuillez examiner nos enregistrements de la base de données pour les villes chinoises (country_code_2 = 'cn') au cours de juillet 2021 et identifier les plus courtes et les plus longues séquences de dates consécutives. Pour chaque date de ces séries, renvoyez exactement un enregistrement par date ainsi que le nom de la ville correspondant. Dans votre sortie, veuillez vous assurer que la première lettre de chaque nom de ville est en majuscule et que le reste soit en minuscules. Affichez les dates et les noms de ville pour les séries de dates consécutives les plus courtes et les plus longues, triées par date.","external_knowledge":null}
{"instance_id":"local071","db":"city_legislation","question":"Pourriez-vous examiner nos enregistrements en juin 2022 et identifier quels pays ont la plus longue série de dates de villes insérées consécutivement ? Veuillez lister les codes pays à deux lettres de ces pays.","external_knowledge":null}
{"instance_id":"local072","db":"city_legislation","question":"Identifier le pays pour lequel les données ont été insérées sur neuf jours différents en janvier 2022. Ensuite, trouver la période consécutive la plus longue avec des insertions de données pour ce pays au cours de janvier 2022, et calculer la proportion des entrées qui proviennent de sa capitale au sein de cette période d'insertion consécutive la plus longue.","external_knowledge":null}
{"instance_id":"local068","db":"city_legislation","question":"Calculez le nombre de nouvelles villes insérées en avril, mai et juin pour chaque année de 2021 à 2023. Pour chaque mois, calculez le total cumulé des villes ajoutées pour ce mois précis au fil des années jusqu’à l’année donnée (c’est‑à‑dire la somme des comptes de ce mois au cours des années). De plus, calculez les pourcentages de croissance d’une année sur l’autre pour à la fois le total mensuel et le total cumulé pour chaque mois, en comparant chaque année à l’année précédente. Présentez les résultats uniquement pour 2022 et 2023, en listant l’année, le mois, le nombre total de villes ajoutées dans ce mois, le total cumulé pour ce mois et les pourcentages de croissance d’année sur l’année pour à la fois le total mensuel et le total cumulé. Utilisez les données de 2021 uniquement comme référence de base pour le calcul des taux de croissance, et excluez-les de la sortie finale.","external_knowledge":null}
{"instance_id":"local073","db":"modern_data","question":"Pour chaque commande de pizza, fournissez une ligne de résultat unique avec l'ID de ligne, l'ID de commande, l'ID client, le nom de la pizza et l'ensemble final d'ingrédients. Les ingrédients finaux sont déterminés en partant des garnitures standard de la recette de la pizza, en supprimant les garnitures exclues et en ajoutant des garnitures supplémentaires. Présentez les ingrédients dans une chaîne commençant par le nom de la pizza suivi de ': ', les ingrédients étant listés par ordre alphabétique. Les ingrédients apparaissant plusieurs fois (par exemple issus des garnitures standard et des garnitures supplémentaires) doivent être préfixés par '2x' et énumérés en premier, suivis des ingrédients à occurrence unique, les deux ensembles classés par ordre alphabétique. Regroupez par l'ID de ligne, l'ID de commande, le nom de la pizza et l'heure de commande afin de garantir que chaque commande n'apparaisse qu'une fois. Triez les résultats par l'ID de ligne dans l'ordre croissant. Attribuez pizza_id 1 aux pizzas 'Meatlovers' et pizza_id 2 à toutes les autres.","external_knowledge":null}
{"instance_id":"local066","db":"modern_data","question":"Sur la base de nos informations sur les commandes de pizzas des clients, résumez la quantité totale de chaque ingrédient utilisé dans les pizzas que nous avons livrées. Affichez le nom et la quantité pour chaque ingrédient.","external_knowledge":null}
{"instance_id":"local065","db":"modern_data","question":"Calculez le revenu total provenant des pizzas Meat Lovers au prix de $12 et des pizzas végétariennes à $10. Incluez les garnitures supplémentaires facturées à $1 chacune. Assurez-vous que les commandes annulées soient filtrées. Combien d'argent Pizza Runner a-t-il gagné au total ?","external_knowledge":null}
{"instance_id":"local074","db":"bank_sales_trading","question":"Veuillez générer un résumé des soldes de clôture à la fin de chaque mois pour les transactions de chaque client, affichez les variations mensuelles et les soldes cumulés mensuels des comptes bancaires. Assurez-vous que, même si un client n'a aucune activité sur son compte au cours d'un mois donné, le solde de ce mois soit néanmoins inclus dans la sortie.","external_knowledge":null}
{"instance_id":"local064","db":"bank_sales_trading","question":"Pour chaque client et chaque mois de 2020, calculez d'abord le solde de fin de mois en ajoutant tous les montants des dépôts et en soustrayant tous les montants des retraits qui ont eu lieu au cours de ce mois. Déterminez ensuite quel mois de 2020 présente le plus grand nombre de clients ayant un solde de fin de mois positif et quel mois a le plus faible nombre. Pour chacun de ces deux mois, calculez la moyenne du solde de fin de mois sur l'ensemble des clients et indiquez la différence entre ces deux moyennes.","external_knowledge":null}
{"instance_id":"local297","db":"bank_sales_trading","question":"Pour chaque client, regroupez tous les dépôts et retraits par le premier jour de chaque mois afin d'obtenir un montant net mensuel, puis calculez le solde de clôture de chaque mois en cumulant ces nets mensuels. Ensuite, déterminez le taux de croissance du mois le plus récent en comparant son solde de clôture à celui du mois précédent, en considérant les dépôts comme positifs et les retraits comme négatifs, et si le solde du mois précédent est nul, le taux de croissance doit être le solde du mois en cours multiplié par 100. Enfin, calculez le pourcentage de clients dont le mois le plus récent affiche un taux de croissance supérieur à 5%.","external_knowledge":null}
{"instance_id":"local298","db":"bank_sales_trading","question":"Pour chaque mois, calculez le solde total de tous les utilisateurs pour le mois précédent (mesuré au 1er jour de chaque mois), en remplaçant tout solde négatif par zéro. Assurez-vous que les données du premier mois ne soient utilisées que comme référence pour le calcul du solde total précédent, et excluez-les de la sortie finale. Triez les résultats par ordre croissant de mois.","external_knowledge":null}
{"instance_id":"local299","db":"bank_sales_trading","question":"Pour une base de données bancaire avec les transactions des clients, calculez le solde quotidien de chaque client (où les dépôts ajoutent au solde et les autres types de transactions le soustraient). Pour chaque client et chaque jour, calculez la moyenne mobile sur 30 jours du solde (seulement après avoir 30 jours de données, et en traitant les moyennes négatives comme zéro). Puis regroupez ces moyennes quotidiennes par mois et trouvez, pour chaque mois, le maximum de la moyenne mobile sur 30 jours du solde de chaque client. Faites la somme de ces valeurs maximales pour tous les clients pour chaque mois. Considérez le premier mois de l'historique des transactions de chaque client comme période de référence et excluez-le des résultats finaux, en présentant les totaux mensuels de ces sommes des moyennes mobiles sur 30 jours maximales.","external_knowledge":null}
{"instance_id":"local300","db":"bank_sales_trading","question":"Pour chaque client, calculez leurs soldes quotidiens pour chaque jour entre leurs dates de transaction les plus anciennes et les plus récentes, y compris les jours sans transactions en reportant le solde du jour précédent. Traitez tout solde quotidien négatif comme zéro. Ensuite, pour chaque mois, déterminez le solde quotidien le plus élevé que chaque client a eu pendant ce mois. Enfin, pour chaque mois, faites la somme de ces soldes quotidiens maximaux entre tous les clients afin d'obtenir un total mensuel.","external_knowledge":null}
{"instance_id":"local075","db":"bank_sales_trading","question":"Pouvez-vous fournir une répartition du nombre de fois où chaque produit a été vu, du nombre de fois où ils ont été ajoutés au panier et du nombre de fois où ils ont été laissés dans le panier sans être achetés ? Donnez également le nombre d'achats réels pour chaque produit. Assurez-vous que les produits ayant un identifiant de page dans (1, 2, 12, 13) soient filtrés.","external_knowledge":null}
{"instance_id":"local077","db":"bank_sales_trading","question":"Veuillez analyser nos données d'intérêts de septembre 2018 à août 2019. Pour chaque mois, calculez la composition moyenne pour chaque intérêt en divisant la composition par la valeur de l'indice. Identifiez l'intérêt dont la valeur moyenne de la composition est la plus élevée chaque mois et rapportez sa composition moyenne en tant que composition maximale de l'indice pour ce mois. Calculez la moyenne mobile sur trois mois de ces compositions maximales de l'indice mensuelles. Assurez-vous que la sortie inclut la date, le nom de l'intérêt, la composition maximale de l'indice pour ce mois, la moyenne mobile, et les noms et compositions maximales de l'indice des intérêts les plus importants d'un mois écoulé et de deux mois écoulés.","external_knowledge":null}
{"instance_id":"local078","db":"bank_sales_trading","question":"Identifiez les 10 premières et les 10 dernières catégories d'intérêt en fonction de leurs valeurs de composition les plus élevées sur l'ensemble des mois. Pour chaque catégorie, affichez time(MM-YYYY), le nom de l'intérêt et la valeur de la composition","external_knowledge":null}
{"instance_id":"local081","db":"northwind","question":"En considérant uniquement les clients qui ont passé des commandes en 1998, calculez le montant total dépensé par chaque client en faisant la somme du prix unitaire multiplié par la quantité de tous les produits dans leurs commandes, en excluant toute remise. Attribuez à chaque client une catégorie de dépenses en fonction des seuils des groupes de clients, et déterminez combien de clients se trouvent dans chaque catégorie de dépenses et quel pourcentage du nombre total de clients ayant passé des commandes en 1998 chaque catégorie représente.","external_knowledge":null}
{"instance_id":"local085","db":"northwind","question":"Parmi les employés ayant plus de 50 commandes totales, lesquels trois ont le pourcentage le plus élevé de commandes en retard, lorsque la date d'expédition est postérieure ou égale à sa date requise ? Veuillez lister l'ID de chaque employé, le nombre de commandes en retard et le pourcentage de commandes en retard correspondant.","external_knowledge":null}
{"instance_id":"local096","db":"Db-IMDB","question":"Pour chaque année, calculez le pourcentage de films qui avaient exclusivement des actrices (ce qui signifie qu'il n'y avait pas d'acteurs masculins et pas d'acteurs dont le genre était inconnu/non précisé). Considérez les acteurs dont le genre est marqué 'Male' ou 'None' comme non féminins. Pour les résultats, affichez l'année, le nombre total de films de cette année, et le pourcentage de films avec exclusivement des actrices. Extrayez l'année à partir du champ Movie.year en prenant les 4 derniers caractères et en les convertissant en nombre.","external_knowledge":null}
{"instance_id":"local097","db":"Db-IMDB","question":"Pourriez-vous analyser nos données et identifier quelle période de dix ans, débutant à partir de n'importe quelle année de sortie d'un film présente dans les données, a le plus grand nombre de films, en considérant les périodes consécutives de dix ans commençant à chaque année unique ? Il suffit d'afficher l'année de début et le nombre total pour cette période spécifique.","external_knowledge":null}
{"instance_id":"local098","db":"Db-IMDB","question":"Depuis la première année où chaque acteur est apparu dans un film jusqu'à la dernière, combien d'acteurs dans la base de données n'ont jamais eu d'écart de plus de trois années consécutives sans au moins une nouvelle apparition dans un film, ce qui signifie qu'il n'existe pas de période de quatre ans au cours de leur carrière active sans au moins un crédit de film ?","external_knowledge":null}
{"instance_id":"local099","db":"Db-IMDB","question":"J'ai besoin que vous examiniez les collaborations entre acteurs et que vous me disiez combien d'acteurs ont tourné plus de films avec Yash Chopra qu'avec n'importe quel autre réalisateur. Cela nous aidera à mieux comprendre son influence sur l'industrie.","external_knowledge":null}
{"instance_id":"local100","db":"Db-IMDB","question":"Découvrez combien d'acteurs ont un 'Shahrukh number' de 2 ? Cela signifie qu'ils ont joué dans un film avec quelqu'un qui a joué avec Shahrukh Khan, mais pas directement avec lui.","external_knowledge":null}
{"instance_id":"local114","db":"education_business","question":"Fournir un rapport détaillé sur les ventes Web pour chaque région, incluant le nombre de commandes, le montant total des ventes et le nom et le montant des ventes de tous les représentants qui ont atteint le montant total des ventes le plus élevé dans cette région (inclure tous les représentants en cas d'égalité).","external_knowledge":null}
{"instance_id":"local128","db":"BowlingLeague","question":"Énumérez les bowlers (y compris leur ID, prénom et nom de famille), le numéro de match, le numéro de partie, le score de handicap, la date du tournoi et le lieu pour les seuls bowlers qui ont remporté des parties avec un score de handicap de 190 ou moins dans les trois lieux : Thunderbird Lanes, Totem Lanes et Bolero Lanes. N'incluez que les enregistrements de parties spécifiques où ils ont gagné avec un score de handicap de 190 ou moins dans ces trois lieux.","external_knowledge":null}
{"instance_id":"local130","db":"school_scheduling","question":"Pourriez-vous fournir une liste des noms de famille de tous les étudiants qui ont terminé des cours d'anglais (la réussite étant définie comme ayant un ClassStatus de 2), ainsi que leurs rangs quintiles basés sur leurs notes individuelles dans ces cours ? Le quintile doit être déterminé en calculant combien d'étudiants ont des notes supérieures ou égales à la note de chaque étudiant, puis en divisant ce classement par le nombre total d'étudiants qui ont terminé des cours d'anglais. Les quintiles doivent être étiquetés comme \"Premier\" (20 % des mieux classés), \"Deuxième\" (21-40 % des mieux classés), \"Troisième\" (41-60 % des mieux classés), \"Quatrième\" (61-80 % des mieux classés) et \"Cinquième\" (20 % les moins bien classés). Veuillez trier les résultats du quintile le plus performant au moins performant (Premier à Cinquième).","external_knowledge":null}
{"instance_id":"local131","db":"EntertainmentAgency","question":"Pourriez-vous lister chaque style musical avec le nombre de fois où il apparaît comme première, deuxième ou troisième préférence dans une seule ligne par style?","external_knowledge":null}
{"instance_id":"local133","db":"EntertainmentAgency","question":"Étant donné une base de données des styles musicaux et des préférences des utilisateurs, where Musical_Preferences contains user rankings of musical styles (PreferenceSeq=1 for first choice, PreferenceSeq=2 for second choice, PreferenceSeq=3 for third choice) : Calculez un score pondéré pour chaque style musical en attribuant 3 points pour chaque fois où il a été classé premier choix, 2 points pour chaque deuxième choix, et 1 point pour chaque classement en troisième choix. Calculez le score total pondéré pour chaque style musical qui a été classé par au moins un utilisateur. Ensuite, calculez la différence absolue entre le score total pondéré de chaque style et la moyenne du score total pondéré sur tous ces styles.","external_knowledge":null}
{"instance_id":"local132","db":"EntertainmentAgency","question":"Affichez toutes les paires d'artistes et de clients qui possèdent chacun au plus trois points forts ou préférences de style, où les première et deuxième préférences de style des clients correspondent aux première et deuxième forces de style des artistes (ou dans l'ordre inverse). N'affichez que le nom de scène de l'artiste et le nom de famille du client.","external_knowledge":null}
{"instance_id":"local141","db":"AdventureWorks","question":"Comment les ventes annuelles totales de chaque représentant commercial se comparent-elles à leur quota annuel de ventes ? Fournissez la différence entre leurs ventes totales et le quota pour chaque année, organisée par représentant commercial et par année.","external_knowledge":null}
{"instance_id":"local152","db":"imdb_movies","question":"Pouvez-vous fournir les 9 principaux réalisateurs par nombre de films, en incluant leur ID, nom, nombre de films, durée moyenne entre les films (arrondie à l'entier le plus proche), note moyenne (arrondie à 2 décimales), total des votes, note minimale et note maximale, et durée totale des films ? Triez les résultats d'abord par le nombre de films en ordre décroissant puis par la durée totale des films en ordre décroissant.","external_knowledge":null}
{"instance_id":"local230","db":"imdb_movies","question":"Déterminez les trois genres ayant le plus grand nombre de films notés au-dessus de 8, puis identifiez les quatre réalisateurs qui ont dirigé le plus de films notés au-dessus de 8 dans ces genres. Énumérez ces réalisateurs et leurs nombres de films respectifs.","external_knowledge":null}
{"instance_id":"local156","db":"bank_sales_trading","question":"Analysez le prix moyen annuel d'achat par Bitcoin par région, calculé comme le montant total dépensé en dollars, divisé par la quantité totale achetée chaque année, en excluant les données de la première année pour chaque région. Ensuite, pour chaque année, classez les régions en fonction de ces prix d'achat moyens et calculez la variation en pourcentage annuelle du coût pour chaque région par rapport à l'année précédente.","external_knowledge":null}
{"instance_id":"local157","db":"bank_sales_trading","question":"En utilisant la table \"bitcoin_prices\", veuillez calculer le changement en pourcentage journalier du volume d'échange pour chaque ticker du 1er août au 10 août 2021, en veillant à ce que tout volume se terminant par \"K\" ou \"M\" soit correctement converti en milliers ou en millions, tout volume \"-\" est traité comme zéro, seuls les volumes non nuls sont utilisés pour déterminer le volume du jour précédent, et les résultats sont ordonnés par ticker et par date.","external_knowledge":null}
{"instance_id":"local163","db":"education_business","question":"Quels membres du corps professoral universitaire dont les salaires sont les plus proches du salaire moyen pour leurs grades respectifs ? Veuillez fournir les grades, les prénoms, les noms de famille et les salaries.university","external_knowledge":null}
{"instance_id":"local168","db":"city_legislation","question":"Parmi les offres d'emploi qui comportent spécifiquement le poste d'analyste de données, qui exigent un salaire annuel moyen non nul et qui sont à distance, quel est le salaire moyen global en ne tenant compte que des trois compétences les plus demandées pour ces postes ?","external_knowledge":null}
{"instance_id":"local169","db":"city_legislation","question":"Quel est le taux de rétention annuel des législateurs qui ont commencé leur premier mandat entre le 1er janvier 1917 et le 31 décembre 1999, mesuré comme la proportion de cette cohorte encore en fonction à la date du 31 décembre pour chacune des 20 premières années qui suivent le début de leur premier mandat ? Les résultats devraient afficher les 20 périodes dans l'ordre, quel que soit le fait que des législateurs aient été retenus au cours d'une année donnée.","external_knowledge":null}
{"instance_id":"local171","db":"city_legislation","question":"Pour les législateurs masculins de Louisiane, combien de législateurs distincts étaient en fonction le 31 décembre de chaque année, sur une période allant de plus de 30 ans après leur premier mandat jusqu'à moins de 50 ans, en regroupant les résultats selon le nombre exact d'années écoulées depuis leur premier mandat ?","external_knowledge":null}
{"instance_id":"local167","db":"city_legislation","question":"En se basant sur l’État que chaque législatrice a représenté pour la première fois, quel État compte le plus grand nombre de législatrices dont les mandats ont inclus le 31 décembre à un moment donné, et quel est ce nombre ? Veuillez fournir l’abréviation de l’État.","external_knowledge":null}
{"instance_id":"local170","db":"city_legislation","question":"Identifiez les abréviations d'État où, pour les législateurs masculins et féminins, le taux de rétention reste supérieur à zéro à des intervalles spécifiques de 0, 2, 4, 6, 8 et 10 ans après la date de début de leur premier mandat. Un législateur est considéré en poste s'il est en fonction au 31 décembre de l'année correspondante. Incluez uniquement les États où les deux cohortes de genre maintiennent des taux de rétention non nuls à chacun de ces six points temporels au cours de la première décennie de mandat.","external_knowledge":null}
{"instance_id":"local193","db":"sqlite-sakila","question":"Pourriez-vous déterminer le pourcentage moyen du total des ventes sur la durée de vie (LTV) qui se produit au cours des premiers 7 et 30 jours après l'achat initial d'un client ? Incluez également le total moyen des ventes sur la durée de vie (LTV). Veuillez exclure les clients dont le LTV total est nul. Les périodes de 7 et 30 jours doivent être basées sur le nombre exact d'heures-minutes-secondes, et non sur des jours calendaires.","external_knowledge":null}
{"instance_id":"local194","db":"sqlite-sakila","question":"Veuillez fournir une liste des trois films les plus rentables pour chaque acteur, ainsi que le revenu moyen par acteur dans ces films, calculé en répartissant équitablement le revenu total des films entre les acteurs pour chaque film.","external_knowledge":null}
{"instance_id":"local195","db":"sqlite-sakila","question":"Veuillez déterminer dans quelle mesure l’attrait de nos cinq principaux acteurs est répandu. Quel pourcentage de nos clients ont loué des films mettant en vedette ces acteurs ?","external_knowledge":null}
{"instance_id":"local196","db":"sqlite-sakila","question":"Pour chaque catégorie de notation du premier film loué par les clients — où le premier film est identifié sur la base de la date de paiement la plus ancienne par client — veuillez fournir le montant total moyen dépensé par client et le nombre moyen de locations ultérieures (calculé comme le nombre total de locations moins un) pour les clients dont le premier film loué appartient à cette catégorie de notation.","external_knowledge":null}
{"instance_id":"local197","db":"sqlite-sakila","question":"Parmi nos 10 meilleurs clients qui paient, pouvez-vous identifier le plus grand écart des montants de paiement d'un mois à l'autre, déterminer pour quel client et pendant quel mois cet écart mois sur mois maximal est apparu, et fournir la différence arrondie à deux décimales.","external_knowledge":null}
{"instance_id":"local199","db":"sqlite-sakila","question":"Pouvez-vous identifier l'année et le mois avec le plus grand nombre de commandes de location créées par le personnel du magasin pour chaque magasin ? Veuillez indiquer l'ID du magasin, l'année, le mois et le nombre total de locations pour ces dates.","external_knowledge":null}
{"instance_id":"local201","db":"modern_data","question":"Identifiez les 10 premiers mots, triés par ordre alphabétique, qui ont entre 4 et 5 caractères, commencent par 'r', et qui possèdent au moins un anagramme de la même longueur, en tenant compte de la casse. Fournissez le nombre de tels anagrammes pour chaque mot.","external_knowledge":null}
{"instance_id":"local202","db":"city_legislation","question":"Pour les données sur les extraterrestres, combien des 10 États les plus peuplés par la population d'extraterrestres ont un pourcentage d'extraterrestres amicaux plus élevé que celui des extraterrestres hostiles, avec un âge moyen des extraterrestres supérieur à 200 ?","external_knowledge":null}
{"instance_id":"local209","db":"delivery_center","question":"Dans l'ensemble de données des commandes jointes aux informations des magasins, quel magasin a le plus grand nombre total de commandes, et parmi les commandes de ce magasin, quel est le ratio des commandes qui apparaissent dans la table des livraisons avec le statut 'livré' par rapport au total des commandes pour ce magasin ?","external_knowledge":null}
{"instance_id":"local210","db":"delivery_center","question":"Pouvez-vous identifier les hubs qui ont enregistré une hausse de plus de 20 % des commandes terminées entre février et mars ?","external_knowledge":null}
{"instance_id":"local212","db":"delivery_center","question":"Pouvez-vous trouver les 5 chauffeurs-livreurs ayant le plus grand nombre moyen de livraisons quotidiennes ?","external_knowledge":null}
{"instance_id":"local218","db":"EU_soccer","question":"Pouvez-vous calculer la médiane des buts marqués lors de la meilleure saison de chaque équipe ?","external_knowledge":null}
{"instance_id":"local219","db":"EU_soccer","question":"Dans chaque ligue, en tenant compte de toutes les saisons, quelle est l'unique équipe qui a le moins de victoires de matchs au total, basée sur la comparaison des buts à domicile et à l'extérieur, y compris les équipes avec zéro victoire, en veillant à ce que si plusieurs équipes sont à égalité pour le plus petit nombre de victoires, une seule équipe soit renvoyée pour chaque ligue ?","external_knowledge":null}
{"instance_id":"local221","db":"EU_soccer","question":"Dites-moi les 10 équipes ayant le plus de victoires dans la ligue.","external_knowledge":null}
{"instance_id":"local220","db":"EU_soccer","question":"Quel joueur a participé au plus grand nombre de matchs remportés et quel joueur a participé au plus grand nombre de matchs perdus, en ne tenant compte que des matchs auxquels ils ont réellement joué (entrées nulles exclues) et où leur équipe a gagné ou perdu (excluant les matchs nuls) ?","external_knowledge":null}
{"instance_id":"local228","db":"IPL","question":"Pour chaque saison IPL, identifiez les trois meilleurs batteurs ayant le total de courses le plus élevé et les trois meilleurs lanceurs ayant le plus de guichets pris, en excluant les dismissals 'run out', 'hit wicket' et 'retired hurt'. En cas d’égalité des courses ou des guichets, départagez-les en utilisant le plus petit identifiant de joueur. Ensuite, affichez ces six joueurs dans des positions correspondantes — batteur 1 avec lanceur 1, batteur 2 avec lanceur 2 et batteur 3 avec lanceur 3 — dans l’ordre croissant de l’ID de saison, ainsi que le total de courses ou de guichets de chaque joueur.","external_knowledge":null}
{"instance_id":"local229","db":"IPL","question":"Trouvez les identifiants des joueurs qui ont marqué le plus grand nombre de runs réalisés lors d’un partenariat pour chaque match. La sortie doit inclure les identifiants de deux joueurs, chacun avec ses scores individuels et le score total du partenariat. Pour chaque paire, le joueur ayant le score individuel le plus élevé doit être répertorié comme joueur 1, et le joueur ayant le score le plus bas comme joueur 2. Dans les cas où les deux joueurs ont le même score, le joueur dont l’ID est le plus élevé doit être le joueur 1, et le joueur dont l’ID est le plus bas doit être le joueur 2. Il peut y avoir plusieurs lignes pour un seul match.","external_knowledge":null}
{"instance_id":"local244","db":"music","question":"Calculez la durée de chaque piste, classez-les en court, moyen ou long, affichez la durée minimale et maximale pour chaque catégorie (en minutes) et le chiffre d'affaires total pour chaque catégorie, regroupez par catégorie.","external_knowledge":"music_length_type.md"}
{"instance_id":"local253","db":"education_business","question":"En utilisant un ensemble de données sur les salaires où les valeurs de salaire doivent être nettoyées en supprimant les caractères non numériques et en les convertissant en un type numérique, écrivez une requête SQL détaillée qui identifie les 5 meilleures entreprises par salaire moyen dans chacun de Mumbai, Pune, New Delhi et Hyderabad, puis compare le salaire moyen de chaque entreprise dans ces villes au salaire moyen national global. Le résultat final doit afficher quatre colonnes : Localisation, Nom de l'entreprise, Salaire moyen dans l'État et Salaire moyen dans le pays, en ne listant que les 5 meilleures entreprises dans chacun des emplacements spécifiés.","external_knowledge":null}
{"instance_id":"local258","db":"IPL","question":"Calculez le nombre total de guichets obtenus par chaque lanceur (à l'exclusion des run-outs et autres éliminations non attribuées au lanceur), leur taux d'économie (total des runs concédés divisé par le nombre total d'overs lancés, en ne tenant compte que des runs marqués par le batteur et en ignorant les extras comme les wides et les no-balls), leur rythme moyen de balles lancées par guichet pris, et leur meilleure performance de bowling en un seul match (le match ayant le plus de guichets réalisés par le lanceur, formaté comme \"wickets-runs\" où les runs correspondent aux runs concédés hors extras).","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local259","db":"IPL","question":"Pour chaque joueur, répertoriez leur identifiant, leur nom, leur rôle le plus fréquent sur tous les matchs, leur main de frappe, leur style de lancer, le total des runs marqués, le nombre total de matchs joués, le nombre total de fois où ils ont été éliminés, la moyenne de batteur (runs totaux divisés par le nombre total d'éliminations), le score le plus élevé dans un seul match, le nombre de matchs où ils ont marqué au moins 30 runs, au moins 50 runs et au moins 100 runs, le nombre total de balles affrontées au cours de leur carrière, le taux de strike (runs totaux divisés par le nombre total de balles affrontées, multiplié par 100), le nombre total de wickets pris, le taux d'économie (moyenne des runs concédés par over), et leur meilleure performance au bowling dans un seul match (le plus de wickets pris dans un match, formaté comme \"wickets taken-runs given\", où la meilleure performance est celle avec le plus de wickets, et en cas d'égalité, le moins de runs concédés). Ignorez les données de runs supplémentaires.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local262","db":"stacking","question":"Quels problèmes dépassent le nombre total de fois où ils apparaissent dans la table des solutions en comptant toutes les occurrences, à travers les étapes 1, 2 et 3, lorsque le score de test maximal d'un modèle autre que \"Stack\" est inférieur au score de test du modèle \"Stack\" pour la même étape et version ?","external_knowledge":null}
{"instance_id":"local263","db":"stacking","question":"Identifiez le L1_model associé à chaque modèle (spécifié par nom et version) qui apparaît le plus fréquemment pour chaque statut ('fort' ou 'faible'), avec le nombre de fois où il apparaît. Un modèle a un statut 'fort' si, pour l'une de ses étapes, le score de test maximal parmi les modèles non-'Stack' est inférieur au score de test du modèle 'Stack'. Il a un statut 'faible' si le score de test maximal parmi les modèles non-'Stack' est égal au score de test du modèle 'Stack'. Comptez combien de fois chaque L1_model est associé à un statut 'fort' ou 'faible' sur l'ensemble des modèles, et déterminez quel L1_model a l'occurrence la plus élevée pour chaque statut.","external_knowledge":null}
{"instance_id":"local264","db":"stacking","question":"Quelle catégorie de modèle (L1_model) apparaît le plus fréquemment à travers toutes les étapes et versions lorsque l'on compare les modèles traditionnels au modèle Stack, et quel est le nombre total de ses occurrences ?","external_knowledge":null}
{"instance_id":"local269","db":"oracle_sql","question":"Quelle est la quantité totale moyenne sur l'ensemble des combinaisons d'emballage finales, en ne prenant en compte que les articles au niveau feuille contenus dans chaque combinaison après avoir déployé entièrement les relations d'emballage imbriquées ?","external_knowledge":null}
{"instance_id":"local270","db":"oracle_sql","question":"Quels conteneurs d'emballage de premier niveau, c’est‑à‑dire ceux qui ne sont contenus dans aucun autre emballage, ont un article pour lequel la quantité totale accumulée à travers tous les niveaux imbriqués de la hiérarchie dépasse 500, et quels sont les noms à la fois de ces conteneurs et des articles correspondants ?","external_knowledge":null}
{"instance_id":"local272","db":"oracle_sql","question":"Pour la commande 423, identifiez les identifiants de produit, les allées et les emplacements à partir desquels prélever les quantités exactes nécessaires pour chaque ligne de commande, en veillant à ce que la quantité totale prélevée pour chaque produit corresponde aux quantités cumulées commandées sans dépasser l'inventaire disponible dans l'entrepôt 1. Calculez les quantités à prélever à partir de chaque emplacement en privilégiant les stocks dont les dates d'achat sont plus anciennes et les quantités plus petites, et assurez-vous que le prélèvement respecte la séquence et les quantités cumulées des lignes de commande pour les produits ayant plusieurs entrées.","external_knowledge":null}
{"instance_id":"local273","db":"oracle_sql","question":"Calculez le pourcentage moyen de prélèvement pour chaque nom de produit, en utilisant une approche FIFO (premier entré, premier sorti) qui sélectionne à partir des emplacements d'inventaire en se basant sur la date d'achat la plus ancienne et la plus petite quantité disponible, en veillant à ce que la quantité prélevée reflète uniquement l'intervalle de recouvrement entre la quantité requise de chaque commande et la quantité disponible de l'inventaire, puis regrouper et trier les résultats par nom du produit?","external_knowledge":null}
{"instance_id":"local274","db":"oracle_sql","question":"Quels produits ont été prélevés pour la commande 421, et quel est le nombre moyen d'unités prélevées pour chaque produit, en utilisant la méthode FIFO (First-In, First-Out) ?","external_knowledge":null}
{"instance_id":"local275","db":"oracle_sql","question":"À partir des données de ventes mensuelles débutant en janvier 2016 et en utilisant une moyenne mobile centrée pour ajuster la saisonnalité, quels produits avaient un ratio de ventes ajusté pour la saisonnalité qui est resté constamment au-dessus de 2 pour chaque mois de l'année 2017 ?","external_knowledge":"calculation_method.md"}
{"instance_id":"local277","db":"oracle_sql","question":"Quelle est la moyenne des ventes annuelles prévues pour les produits 4160 et 7790 en 2018, en utilisant des données de ventes mensuelles à partir de janvier 2016 pour les 36 premiers mois, en appliquant des ajustements de saisonnalité des étapes temporelles 7 à 30, et en employant une méthode de régression pondérée pour estimer les ventes ?","external_knowledge":"calculation_method.md"}
{"instance_id":"local279","db":"oracle_sql","question":"En utilisant un modèle récursif d'ajustement mensuel des stocks à partir des niveaux d'inventaire de décembre 2018, où nous réapprovisionnons un produit si son stock de fin d'inventaire tombe en dessous du niveau minimum requis, déterminer pour chaque produit le mois de 2019 où la différence absolue entre son stock de fin d'inventaire et le niveau minimum requis est la plus petite, et retourner le product_id, ce mois et la différence absolue.","external_knowledge":null}
{"instance_id":"local283","db":"EU_soccer","question":"Analysez le jeu de données des matchs de football pour déterminer l'équipe championne de chaque saison, à travers tous les pays et ligues, en attribuant 3 points pour chaque victoire, 1 point pour chaque nul et 0 point pour chaque défaite. Pour chaque saison, indiquez le nom de l'équipe championne, la ligue, le pays et le total des points accumulés.","external_knowledge":null}
{"instance_id":"local284","db":"bank_sales_trading","question":"Pour les données de légumes en gros, pouvez-vous générer un résumé des taux de perte de nos articles ? Incluez le taux de perte moyen et décomposez également le nombre d’articles qui se situent en dessous, au-dessus et dans l’intervalle d’une déviation standard autour de cette moyenne.","external_knowledge":null}
{"instance_id":"local285","db":"bank_sales_trading","question":"Pour les données de vente en gros de légumes, pouvez-vous analyser notre performance financière sur les années 2020 à 2023 ? J'ai besoin d'informations sur le prix moyen de vente en gros, le prix de vente en gros maximum, le prix de vente en gros minimum, la différence de prix en gros, le prix total de vente en gros, le prix total de vente, le taux de perte moyen, la perte totale et le bénéfice pour chaque catégorie au cours de chaque année. Arrondissez toutes les valeurs calculées à deux décimales.","external_knowledge":null}
{"instance_id":"local286","db":"electronic_sales","question":"Préparez un rapport de performance complet sur nos vendeurs, en mettant l'accent sur les ventes totales, le prix moyen des articles, les scores moyens des avis et les temps d'emballage. Veillez à ce que le rapport n'inclue que les vendeurs ayant vendu plus de 100 produits et mettez en évidence les noms des catégories de produits en anglais ayant le plus grand volume de ventes.","external_knowledge":null}
{"instance_id":"local301","db":"bank_sales_trading","question":"Pour les données hebdomadaires de ventes, j'ai besoin d'une analyse de nos performances autour de la mi-juin pour les années 2018, 2019 et 2020. Plus précisément, calculez le pourcentage de variation des ventes entre les quatre semaines précédant June 15 et les quatre semaines suivant June 15 pour chaque année.","external_knowledge":null}
{"instance_id":"local302","db":"bank_sales_trading","question":"Analysez la variation moyenne en pourcentage des ventes entre les 12 semaines avant et après June 15, 2020, pour chaque type d'attribut : région, plateforme, tranche d'âge, démographie et type de client. Pour chaque type d'attribut, calculez la variation moyenne en pourcentage des ventes pour toutes ses valeurs d'attribut. Identifiez le type d'attribut ayant l'impact négatif le plus élevé sur les ventes et fournissez sa variation moyenne en pourcentage des ventes.","external_knowledge":null}
{"instance_id":"local329","db":"log","question":"Combien de sessions uniques ont visité la page /regist/input puis la page /regist/confirm, dans cet ordre?","external_knowledge":null}
{"instance_id":"local330","db":"log","question":"En utilisant la table de journalisation des activités, calculez le nombre total de sessions utilisateur uniques où chaque page web apparaît soit comme page d'atterrissage (la première page visitée dans une session basée sur l'horodatage) soit comme page de sortie (la dernière page visitée dans une session basée sur l'horodatage), ou les deux. Comptez chaque session une seule fois par page, même si la page sert à la fois de page d'atterrissage et de page de sortie pour cette session.","external_knowledge":null}
{"instance_id":"local331","db":"log","question":"Quelles sont les trois visites distinctes de la troisième page qui sont les plus fréquemment observées immédiatement après deux visites consécutives de la page '/detail', et combien de fois chaque visite de la troisième page se produit-elle ?","external_knowledge":null}
{"instance_id":"local358","db":"log","question":"Combien y a-t-il d'utilisateurs dans chaque catégorie d'âge (20s, 30s, 40s, 50s et autres) ?","external_knowledge":null}
{"instance_id":"local360","db":"log","question":"Pour chaque session utilisateur dans la table des journaux d'activité, identifiez le nombre d'événements qui se sont produits avant le premier clic '/detail' ou la conversion '/complete', en comptant uniquement les événements qui ont un type de recherche non vide. Trouvez les sessions présentant le nombre minimum de tels événements pré-clic/pré-conversion. Si plusieurs sessions partagent ce nombre minimum, incluez-les toutes dans les résultats. Renvoyez chaque session admissible accompagnée du chemin correspondant et du type de recherche.","external_knowledge":null}
{"instance_id":"local344","db":"f1","question":"En considérant toutes les courses pour lesquelles les données d'arrêt au stand sont disponibles, et en se concentrant sur les cas où un pilote n'était pas derrière une autre voiture sur le tour précédent mais est derrière sur le tour actuel (en tenant compte des abandons, des entrées d'arrêts au stand, des sorties d'arrêts au stand et des départs de course), combien de fois chaque type de dépassement s'est produit en Formule 1 ?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local336","db":"f1","question":"Dans les cinq premiers tours de la course, combien de dépassements ont eu lieu dans chaque catégorie — abandons, arrêts au stand, dépassements liés au départ et dépassements classiques sur la piste ?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local335","db":"f1","question":"Depuis 2001, dans les saisons de Formule 1, en ne retenant que les pilotes ayant marqué des points au cours d'une saison, quels cinq constructeurs ont connu le plus grand nombre de saisons où leurs pilotes ont inscrit le plus faible total de points parmi tous les pilotes ayant marqué des points au cours de cette saison ?","external_knowledge":null}
{"instance_id":"local309","db":"f1","question":"Pour chaque année, quel pilote et quel constructeur ont obtenu le plus de points ? Je veux le nom complet de chaque pilote.","external_knowledge":null}
{"instance_id":"local310","db":"f1","question":"En utilisant uniquement les données de la table ‘results’, trouvez les trois années pour lesquelles la somme des points totaux les plus élevés obtenus par n’importe quel pilote et des points totaux les plus élevés obtenus par n’importe quel constructeur au cours de cette année (les deux calculés en additionnant les points issus de la table ‘results’) est la plus petite, et listez ces trois années par ordre croissant de ce total.","external_knowledge":null}
{"instance_id":"local311","db":"f1","question":"Quels constructeurs ont enregistré les trois meilleurs points combinés issus de leur meilleur pilote et de leur équipe, et dans quelles années les ont-ils réalisés ?","external_knowledge":null}
{"instance_id":"local354","db":"f1","question":"Parmi les pilotes de Formule 1 ayant couru dans les années 1950, quels pilotes ont terminé une saison au cours de cette décennie avec le même constructeur lors de la première et de la dernière course auxquelles ils ont participé, tout en prenant part à au moins deux manches distinctes au cours de cette même saison ?","external_knowledge":null}
{"instance_id":"local355","db":"f1","question":"Calculez la moyenne globale du premier tour manqué et de la dernière manche manquée des courses par les pilotes de Formule 1 sur l'ensemble des années. Incluez uniquement les pilotes qui ont manqué moins de trois courses au cours d'une année donnée et qui ont changé d'équipe entre leurs apparitions immédiatement avant et après leur pause (c.-à-d. l'ID du constructeur pour la course juste avant leur première course manquée doit être différent de l'ID du constructeur pour la course juste après leur dernière course manquée cette année-là). Ne regroupez pas les résultats par année; retournez simplement les moyennes globales sur l'ensemble du jeu de données.","external_knowledge":null}
{"instance_id":"local356","db":"f1","question":"Fournissez les noms complets des pilotes qui ont été dépassés sur la piste plus de fois qu'ils n'ont dépassé d'autres sur la piste pendant les tours de course, en excluant les changements de position dus aux arrêts au stand (à l'entrée et à la sortie des stands), les abandons, ou les changements de position qui se sont produits lors du premier tour d'une course (considérés comme des mouvements de départ).","external_knowledge":null}
{"instance_id":"sf001","db":"GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI","question":"En supposant qu'aujourd'hui soit April 1, 2024, j'aimerais connaître les quantités quotidiennes de neige tombée supérieures à 6 inches pour chaque code postal des États-Unis pendant la semaine qui se termine après les deux premières semaines complètes de l'année précédente. Affichez le code postal, la date et la quantité de neige tombée.","external_knowledge":null}
{"instance_id":"sf003","db":"GLOBAL_GOVERNMENT","question":"Pour chaque année comprise entre 2015 et 2020, quelle zone de tabulation des codes postaux du recensement (ZCTA) avait le deuxième taux de croissance annuelle de la population? Inclure uniquement les zones avec une estimation de population d'au moins 25 000 personnes pour cette année-là (basée sur les estimations de l'American Community Survey sur 5 ans). Pour chaque année, fournir le code postal, l'abréviation de l'État et le pourcentage du taux de croissance annuel.","external_knowledge":null}
{"instance_id":"sf002","db":"FINANCE__ECONOMICS","question":"Au 31 décembre 2022, dressez la liste des 10 principales banques actives ayant des actifs dépassant 10 milliards de dollars, classées selon le pourcentage le plus élevé d'actifs non assurés, ce pourcentage étant calculé comme 1 moins la valeur de la variable '% Insured (Estimated)' à partir des estimations trimestrielles. Fournissez les noms de ces banques et leurs pourcentages respectifs d'actifs non assurés.","external_knowledge":null}
{"instance_id":"sf044","db":"FINANCE__ECONOMICS","question":"Quel a été le pourcentage de variation des cours de clôture après séance pour les sept Magnifiques de la tech du 1er janvier au 30 juin 2024 ?","external_knowledge":null}
{"instance_id":"sf006","db":"FINANCE__ECONOMICS","question":"Pour chaque État des États-Unis, déterminer comment le nombre d'entités de succursales financières actives a évolué du 1er mars 2020 au 31 décembre 2021. Une entité est considérée comme active à une date donnée si sa date de début est antérieure ou égale à cette date et sa date de fin est soit nulle, soit postérieure ou égale à cette date. Pour chaque État, calculez le nombre d'entités actives au 1er mars 2020, le nombre d'entités actives au 31 décembre 2021, et le pourcentage de variation de ces chiffres","external_knowledge":null}
{"instance_id":"sf008","db":"US_REAL_ESTATE","question":"Déterminez la variation en pourcentage du flux de revenus bruts et l'indice des prix des maisons à l'achat, ajusté saisonnièrement, pour la zone métropolitaine Phoenix-Mesa-Scottsdale, AZ, du 1er janvier 2023 au 31 décembre 2023. Le flux de revenus bruts fait référence au revenu brut ajusté total provenant de toutes les entités financières situées dans la zone métropolitaine spécifiée.","external_knowledge":null}
{"instance_id":"sf010","db":"US_REAL_ESTATE","question":"Quels sont les ratios cumulatifs des prêts hypothécaires proches du défaut en Californie pour chaque date enregistrée en 2023, y compris ceux qui présentent un retard de paiement de 90 à 180 jours, ceux en moratoire, ou ceux faisant l’objet de procédures de forclusion, de faillite ou de remise par acte en lieu et place de l'exécution ?","external_knowledge":null}
{"instance_id":"sf037","db":"US_REAL_ESTATE","question":"Comment pouvons-nous trouver la distance en ligne droite la plus courte, en miles, entre chaque magasin 'The Home Depot' et son emplacement le plus proche 'Lowe's Home Improvement' ? En utilisant la base de données US_REAL_ESTATE.CYBERSYN, joindre la table point_of_interest_index avec les tables point_of_interest_addresses_relationships et us_addresses pour obtenir les coordonnées géographiques. Pour chaque emplacement de 'The Home Depot' (identifié par son poi_id), calculez sa distance à tous les magasins 'Lowe's Home Improvement' en utilisant les fonctions ST_DISTANCE et ST_MAKEPOINT, convertissez la distance des mètres en miles (en divisant par 1609), et ne renvoyez que l'enregistrement ayant la distance minimale pour chaque magasin 'The Home Depot' en utilisant QUALIFY avec ROW_NUMBER().","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf012","db":"WEATHER__ENVIRONMENT","question":"En utilisant les données du FEMA National Flood Insurance Program Claim Index, pour chaque année allant de 2010 à 2019, quels étaient les montants totaux des dommages aux bâtiments et les montants totaux des dommages au contenu rapportés dans le cadre du National Flood Insurance Program pour la communauté NFIP nommée 'City Of New York', regroupés par année de sinistre ?","external_knowledge":null}
{"instance_id":"sf018","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Examiner l'engagement des utilisateurs envers les notifications push dans une fenêtre d'une heure spécifiée le 1er juin 2023.","temporal":"Yes","external_knowledge":"PushNotificationAnalysis.md"}
{"instance_id":"sf035","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Combien d'utilisateurs uniques ont démarré des sessions chaque jour au sein de chaque groupe d'applications entre June 1, 2023 et June 7, 2023 ? Affichez également l'ID du groupe d'applications et la date de début de la session.","external_knowledge":null}
{"instance_id":"sf029","db":"AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET","question":"Générez un rapport quotidien détaillé des ventes pour chaque produit sous la vue distributeur 'Manufacturing', couvrant les 30 jours allant jusqu'au February 6, 2022, en joignant les données de ventes, de trafic, d'inventaire et de net PPM sur date, ASIN, program, period et distributor_view. Le rapport doit inclure le nombre total d'unités commandées, le revenu total des commandes, le prix de vente moyen, les vues d'aperçu, le taux de conversion, les unités expédiées, le revenu expédié, le PPM net moyen, l'OOS moyen des produits procurables, le nombre total d'unités en stock et leur valeur, les unités net reçues et leur valeur, les quantités de commandes d'achat ouvertes, les unités commandées par les clients non livrées, le taux de confirmation moyen du vendeur, le taux de remplissage à la réception, le taux d'écoulement et le délai du fournisseur.","external_knowledge":null}
{"instance_id":"sf040","db":"US_ADDRESSES__POI","question":"Trouvez les 10 adresses les plus au nord dans la plus grande zone de codes postaux de Floride. Quels sont leurs numéros d'adresse, noms de rue et types ?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf009","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Une entreprise immobilière a besoin d'une comparaison détaillée côte à côte des bâtiments à Amsterdam et à Rotterdam. Ils exigent un rapport montrant chaque classe et sous-classe de bâtiment, avec la superficie totale (en mètres carrés) et le nombre total de bâtiments pour chaque catégorie de classification dans les deux villes. Les données doivent être organisées par classe de bâtiment et sous-classe dans l'ordre croissant, les statistiques d'Amsterdam et de Rotterdam étant présentées dans des colonnes parallèles afin de faciliter une comparaison directe. Pouvez-vous générer ce rapport complet de comparaison des classifications de bâtiments ?","external_knowledge":null}
{"instance_id":"sf013","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Comparez les longueurs totales des routes à Amsterdam et à Rotterdam en créant une analyse côte à côte des deux villes. Pour chaque combinaison de classe de route et de sous-classe, calculez la longueur totale des routes (en mètres) spécifiquement pour les segments QUADKEY '12020210' et '12020211'. Présentez les résultats avec des colonnes pour la classe, la sous-classe, les longueurs de routes d'Amsterdam et les longueurs de routes de Rotterdam.","external_knowledge":null}
{"instance_id":"sf041","db":"YES_ENERGY__SAMPLE_DATA","question":"Produire un rapport pour ERCOT le 1er octobre 2022, qui combine des données horaires sur les prix day-ahead et en temps réel à partir de l'ID de nœud 10000697078, les prévisions de charge (datatypeid 19060) et les charges réelles, ainsi que les prévisions et les valeurs réelles de production éolienne (datatypeid de prévision 9285, datatypeid réel 16) et solaire (datatypeid de prévision 662, datatypeid réel 650) à partir de l'ID d'objet 10000712973. Ce rapport devrait inclure les alignements des fuseaux horaires, les classifications des pics et les calculs de charge nette, fournissant des informations sur la dynamique opérationnelle quotidienne et l'efficacité.","temporal":"Yes","external_knowledge":"ERCOT_Daily_Market_Dynamics_Report.md"}
{"instance_id":"sf011","db":"CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE","question":"Déterminez la répartition de la population au sein de chaque groupe de blocs par rapport à son secteur de recensement dans l'État de New York en utilisant les données ACS 2021. Incluez l’ID du groupe de blocs, la valeur du recensement, l’ID du tract (comté/État), la population totale du tract et le ratio de population de chaque groupe de blocs.","external_knowledge":null}
{"instance_id":"sf014","db":"CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE","question":"Quel est le code postal de l'État de New York ayant le plus grand nombre de navetteurs effectuant un trajet de plus d'une heure, selon les données ACS 2021 ? Incluez le code postal, le total des navetteurs, la référence de l'État pour cette durée et la population de l'État.","external_knowledge":null}
