{"instance_id":"bq011","db":"ga4","question":"Có bao nhiêu người dùng giả khác nhau có thời gian tương tác tích cực trong khoảng thời gian 7 ngày kết thúc vào January 7, 2021 at 23:59:59, nhưng lại không có thời gian tương tác tích cực trong khoảng thời gian 2 ngày kết thúc vào cùng ngày (January 7, 2021 at 23:59:59)?","external_knowledge":"ga4_obfuscated_sample_ecommerce.events.md"}
{"instance_id":"bq010","db":"ga360","question":"Tìm sản phẩm bán chạy nhất giữa các khách hàng đã mua 'Youtube Men’s Vintage Henley' vào tháng 7 năm 2017, và loại trừ chính nó.","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq009","db":"ga360","question":"Nguồn lưu lượng truy cập nào có tổng doanh thu giao dịch cao nhất trong năm 2017, và sự khác biệt bằng triệu (làm tròn tới hai chữ số thập phân) giữa tổng doanh thu giao dịch hàng tháng cao nhất và thấp nhất cho nguồn lưu lượng đó là bao nhiêu?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq001","db":"ga360","question":"Đối với mỗi khách truy cập đã thực hiện ít nhất một giao dịch vào tháng 2 năm 2017, có bao nhiêu ngày trôi qua giữa ngày ghé thăm đầu tiên của họ trong tháng 2 và ngày giao dịch đầu tiên của họ trong tháng 2, và họ đã thực hiện giao dịch đầu tiên đó trên loại thiết bị nào?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq002","db":"ga360","question":"Trong nửa đầu năm 2017, tập trung vào doanh thu sản phẩm hits, nguồn lưu lượng truy cập nào đã tạo ra tổng doanh thu từ sản phẩm cao nhất, và mức doanh thu tối đa theo ngày, theo tuần và theo tháng cho nguồn lưu lượng truy cập tốt nhất đó trong khoảng thời gian này là bao nhiêu (in millions)?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq003","db":"ga360","question":"Giữa ngày 1 tháng 4 và ngày 31 tháng 7 năm 2017, sử dụng dữ liệu doanh thu sản phẩm hits cùng với tổng số transactions để phân loại các phiên thành mua hàng (transactions ≥ 1 và productRevenue not null) hoặc không mua hàng (transactions null và productRevenue null), so sánh lượt xem trang trung bình trên mỗi khách viếng thăm cho từng nhóm theo tháng","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq004","db":"ga360","question":"Vào tháng 7 năm 2017, giữa tất cả những khách hàng mua bất kỳ sản phẩm liên quan đến YouTube, sản phẩm riêng biệt nào—loại trừ những sản phẩm có chứa ‘YouTube’ trong tên sản phẩm—đã có tổng số lượng mua cao nhất?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq008","db":"ga360","question":"Trong January 2017, giữa những người truy cập có tên chiến dịch chứa 'Data Share' và đã truy cập bất kỳ trang nào bắt đầu bằng '/home', trang nào họ thường ghé thăm tiếp theo nhất, và thời gian tối đa (tính bằng giây) họ dành trên trang '/home' trước khi chuyển sang trang khác là bao nhiêu?","external_knowledge":"google_analytics_sample.ga_sessions.md"}
{"instance_id":"bq269","db":"ga360","question":"Giữa ngày 1 tháng 6 năm 2017 và ngày 31 tháng 7 năm 2017, chỉ xem xét các phiên có lượt xem trang không rỗng. Phân loại mỗi phiên là ‘purchase’ nếu nó có ít nhất một giao dịch, hoặc ‘non_purchase’ ngược lại. Đối với mỗi tháng, tổng hợp lượt xem trang của mỗi khách truy cập theo từng phân loại, sau đó tính trung bình lượt xem trang trên mỗi khách truy cập cho cả nhóm ‘purchase’ và ‘non_purchase’ trong mỗi tháng, và trình bày kết quả cạnh nhau.","external_knowledge":null}
{"instance_id":"bq268","db":"ga360","question":"Xác định số ngày dài nhất giữa lần ghé thăm đầu tiên và sự kiện được ghi lại cuối cùng (hoặc là lần ghé thăm cuối cùng hoặc giao dịch đầu tiên) cho một người dùng, trong đó sự kiện được ghi lại cuối cùng liên quan đến một thiết bị di động. Sự kiện được ghi lại cuối cùng có thể là lần ghé thăm cuối cùng hoặc giao dịch đầu tiên, và bạn nên tập trung vào những người dùng mà sự kiện được ghi lại cuối cùng xảy ra trên thiết bị di động.","external_knowledge":null}
{"instance_id":"bq270","db":"ga360","question":"Các tỷ lệ chuyển đổi hàng tháng cho việc thêm vào giỏ hàng và mua hàng, được tính bằng phần trăm lượt xem trang chi tiết sản phẩm, từ tháng 1 đến tháng 3 năm 2017 là bao nhiêu?","external_knowledge":"ga360_hits.eCommerceAction.action_type.md"}
{"instance_id":"bq275","db":"ga360","question":"Những ID khách truy cập nào thuộc về người dùng mà giao dịch đầu tiên diễn ra trên một thiết bị được gắn nhãn là 'mobile' vào ngày muộn hơn ngày ghé thăm lần đầu tiên của họ?","external_knowledge":null}
{"instance_id":"bq374","db":"ga360","question":"Tính tỷ lệ phần trăm của người dùng mới, trong khoảng từ August 1, 2016, đến April 30, 2017, những người ở lại trang web lâu hơn 5 phút trong lần ghé thăm đầu tiên và đã thực hiện một giao dịch mua ở lượt ghé thăm sau đó bất cứ lúc nào, so với tổng số người dùng mới trong cùng khoảng thời gian.","external_knowledge":null}
{"instance_id":"sf_bq029","db":"PATENTS","question":"Tính số nhà phát minh trung bình trên mỗi bằng sáng chế và tổng số ấn phẩm bằng sáng chế ở Canada (CA) cho từng khoảng thời gian 5 năm từ 1960 đến 2020, dựa trên ngày công bố. Chỉ bao gồm các bằng sáng chế có ít nhất một nhà phát minh được liệt kê, và nhóm kết quả theo các khoảng 5 năm (1960-1964, 1965-1969, v.v.).","external_knowledge":null}
{"instance_id":"sf_bq026","db":"PATENTS","question":"Đối với bên nhận cấp bằng tích cực nhất trong danh mục bằng sáng chế 'A61', tôi muốn biết năm mã quyền tài phán cấp bằng sáng chế mà họ đã nộp nhiều bằng sáng chế nhất trong năm bận rộn nhất của họ, được phân cách bằng dấu phẩy.","external_knowledge":null}
{"instance_id":"sf_bq091","db":"PATENTS","question":"Vào năm nào bên nắm giữ nhiều đơn đăng ký nhất trong phân loại bằng sáng chế 'A61' đã nộp nhiều đơn nhất?","external_knowledge":null}
{"instance_id":"sf_bq099","db":"PATENTS","question":"Đối với lớp bằng sáng chế A01B3, tôi muốn phân tích thông tin của top 3 người được cấp quyền dựa trên tổng số đơn đăng ký. Vui lòng cung cấp năm thông tin sau: tên của người được cấp quyền này, tổng số đơn đăng ký, năm có số đơn đăng ký nhiều nhất, số đơn đăng ký trong năm đó, và mã quốc gia có số đơn đăng ký nhiều nhất trong năm đó.","external_knowledge":null}
{"instance_id":"sf_bq033","db":"PATENTS","question":"Có bao nhiêu ấn phẩm của Hoa Kỳ liên quan đến IoT (nơi phần tóm tắt bao gồm cụm từ 'internet of things') được nộp mỗi tháng từ năm 2008 đến năm 2022, bao gồm các tháng không có hồ sơ?","external_knowledge":null}
{"instance_id":"sf_bq209","db":"PATENTS","question":"Bạn có thể tính số lượng bằng sáng chế tiện ích được cấp vào năm 2010 và có đúng một forward citation trong một khoảng 10 năm sau ngày nộp đơn/đăng ký của chúng không? Đối với phân tích này, forward citations nên được đếm là các số đơn đăng ký trích dẫn riêng biệt đã trích dẫn bằng sáng chế này trong vòng 10 năm sau ngày nộp đơn của chính bằng sáng chế.","external_knowledge":null}
{"instance_id":"sf_bq027","db":"PATENTS","question":"Đối với các bằng sáng chế được cấp từ năm 2010 đến năm 2018, cung cấp số công bố của từng bằng sáng chế và số lượng trích dẫn trước mà mỗi bằng sáng chế nhận được trong thể loại SEA.","external_knowledge":null}
{"instance_id":"sf_bq210","db":"PATENTS","question":"Có bao nhiêu bằng sáng chế US B2 được cấp từ năm 2008 đến năm 2018 có các yêu cầu bảo hộ không chứa từ 'claim'?","external_knowledge":null}
{"instance_id":"sf_bq211","db":"PATENTS","question":"Trong số các bằng sáng chế được cấp từ năm 2010 đến năm 2023 tại CN, có bao nhiêu trong số chúng thuộc các gia đình có tổng số hơn một đơn đăng ký khác nhau?","external_knowledge":null}
{"instance_id":"sf_bq213","db":"PATENTS","question":"Mã IPC 4 chữ số phổ biến nhất trong số các bằng sáng chế tiện ích B2 của Hoa Kỳ được cấp từ tháng 6 đến tháng 8 năm 2022 là gì?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq212","db":"PATENTS","question":"Đối với các bằng sáng chế tiện ích của Hoa Kỳ thuộc phân loại B2 được cấp trong khoảng từ tháng 6 đến tháng 9 năm 2022, hãy xác định mã IPC4 (bốn chữ số) phổ biến nhất cho mỗi bằng sáng chế. Sau đó, liệt kê các số công bố và mã IPC4 của các bằng sáng chế mà mã này xuất hiện 10 lần trở lên.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq214","db":"PATENTS_GOOGLE","question":"Đối với các bằng sáng chế tiện ích của Hoa Kỳ thuộc phân loại B2 được cấp từ năm 2010 đến 2014, hãy tìm bằng sáng chế có số lượng forward citations nhiều nhất trong vòng một tháng kể từ ngày nộp đơn của nó, và xác định bằng sáng chế tương tự nhất từ cùng năm nộp đơn, bất kể loại của nó.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq216","db":"PATENTS_GOOGLE","question":"Xác định năm nộp đơn của năm bằng sáng chế hàng đầu được nộp cùng năm với `US-9741766-B2` và có mức độ tương đồng công nghệ cao nhất với nó. Vui lòng cung cấp các số công bố.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq247","db":"PATENTS_GOOGLE","question":"Từ tập dữ liệu publications, trước hết hãy xác định sáu gia đình có nhiều bài báo nhất mà family_id khác '-1'. Sau đó, bằng cách sử dụng bảng abs_and_emb (kết nối theo publication_number), cung cấp ID của từng gia đình trong số đó kèm với mọi bản tóm tắt không rỗng liên quan đến các bài báo của họ.","external_knowledge":null}
{"instance_id":"sf_bq127","db":"PATENTS_GOOGLE","question":"Đối với mỗi nhóm ấn phẩm mà ấn phẩm sớm nhất được công bố lần đầu vào tháng 1 năm 2015, vui lòng cung cấp ngày công bố sớm nhất, các số công bố khác nhau, mã quốc gia của chúng, các mã CPC và IPC khác nhau, các nhóm (tức là các id) trích dẫn và được trích dẫn bởi nhóm ấn phẩm này. Vui lòng trình bày tất cả danh sách dưới dạng các giá trị phân cách bằng dấu phẩy, được sắp xếp theo thứ tự chữ cái.","external_knowledge":null}
{"instance_id":"sf_bq215","db":"PATENTS","question":"Bằng sáng chế Mỹ nào có mã loại B2 và ngày cấp bằng nằm giữa năm 2015 và 2018 có điểm nguyên bản cao nhất được tính bằng 1 - (tổng bình phương số lần xuất hiện của các mã IPC 4 chữ số khác nhau trong các tham chiếu ngược của nó chia cho bình phương tổng số lần xuất hiện của các mã IPC 4 chữ số này)?","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq222","db":"PATENTS","question":"Tìm các lĩnh vực công nghệ CPC ở Đức có mức trung bình động hàm mũ cao nhất (hệ số làm mịn 0.1) về số lượng hồ sơ bằng sáng chế mỗi năm, cụ thể cho các bằng sáng chế được cấp vào December 2016. Đối với mỗi nhóm CPC ở cấp 4, hãy hiển thị tiêu đề đầy đủ, nhóm CPC, và năm có giá trị trung bình động hàm mũ cao nhất về số lượng hồ sơ bằng sáng chế.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq221","db":"PATENTS","question":"Xác định các lĩnh vực công nghệ CPC có trung bình động cấp số nhân của số lượng hồ sơ sáng chế cao nhất theo từng năm (với hệ số làm mịn là 0.2), xem xét chỉ mã CPC đầu tiên cho mỗi bằng sáng chế có ngày nộp hợp lệ và số đơn không rỗng, và báo cáo tiêu đề CPC đầy đủ cùng với năm tốt nhất liên quan đến mức trung bình động cấp số nhân cao nhất cho mỗi nhóm CPC ở cấp 5.","external_knowledge":"sliding_windows_calculation_cpc.md"}
{"instance_id":"sf_bq223","db":"PATENTS","question":"Những người được cấp quyền, loại trừ DENSO CORP ra, đã trích dẫn các bằng sáng chế được cấp cho DENSO CORP, và tiêu đề của các phân lớp CPC chính liên quan đến những trích dẫn này là gì? Cung cấp tên của từng người được cấp quyền trích dẫn (trừ DENSO CORP), toàn bộ tiêu đề của phân lớp CPC chính (dựa trên mã CPC đầu tiên), và số lượng trích dẫn được nhóm theo người được cấp quyền trích dẫn và tiêu đề của phân lớp CPC. Đảm bảo chỉ xét các bằng sáng chế có ngày nộp hợp lệ, và tập trung vào mã CPC đầu tiên cho mỗi bằng sáng chế được trích dẫn. Kết quả nên loại trừ DENSO CORP khỏi danh sách người được cấp quyền trích dẫn.","external_knowledge":"patents_info.md"}
{"instance_id":"sf_bq420","db":"PATENTS_USPTO","question":"Bạn có thể xác định 5 bằng sáng chế hàng đầu bị từ chối ban đầu theo Mục 101 mà không có bất kỳ yêu cầu được cấp nào, dựa trên độ dài của các yêu cầu được cấp không? Các bằng sáng chế này nên được cấp tại Hoa Kỳ trong khoảng từ 2010 đến 2023. Ngoài ra, hãy đảm bảo chọn ngày hành động của văn phòng đầu tiên cho mỗi đơn. Vui lòng bao gồm số công bố đầu tiên của chúng, cùng với ngày công bố đầu tiên, độ dài của các yêu cầu đã nộp và ngày cấp.","external_knowledge":null}
{"instance_id":"sf_bq207","db":"PATENTS_USPTO","question":"Bạn có thể cung cấp số công bố sớm nhất, số đơn tương ứng, số yêu cầu bảo hộ và tổng số từ cho 100 yêu cầu bảo hộ độc lập của bằng sáng chế hàng đầu, dựa trên tổng số từ cao nhất, lấy từ thống kê yêu cầu bảo hộ trong uspto_oce_claims (lọc theo ind_flg='1'), ghép với số công bố của chúng từ uspto_oce_claims match, và sau đó được nối thêm với patents publications để đảm bảo chỉ công bố sớm nhất cho mỗi đơn được bao gồm, được sắp xếp theo tổng số từ giảm dần, và giới hạn ở 100 kết quả?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq128","db":"PATENTSVIEW","question":"Trích xuất thông tin sau cho các bằng sáng chế Hoa Kỳ được nộp đơn từ January 1, 2014 đến February 1, 2014. Tiêu đề và bản tóm tắt của bằng sáng chế. Ngày công bố của bằng sáng chế. Số lượng trích dẫn ngược cho mỗi bằng sáng (tức là số bằng sáng chế được bằng sáng hiện tại trích dẫn trước ngày nộp đơn). Số lượng trích dẫn thuận cho mỗi bằng sáng trong vòng 5 năm đầu tiên kể từ ngày công bố (tức là số bằng sáng chế đã trích dẫn bằng sáng hiện tại trong vòng 5 năm sau ngày công bố). Đối với mỗi bằng sáng, đảm bảo số trích dẫn thuận được tính chỉ cho các trích dẫn nằm trong vòng 5 năm sau ngày công bố, và số trích dẫn ngược được tính cho các trích dẫn trước ngày nộp đơn.","external_knowledge":"forward_backward_citation.md"}
{"instance_id":"sf_bq246","db":"PATENTSVIEW","question":"Truy vấn các bằng sáng chế Hoa Kỳ với số lượng trích dẫn tiến trong vòng 3 năm đầu tiên sau ngày nộp đơn cấp bằng sáng chế (tức là các bằng sáng chế trích dẫn bằng sáng chế hiện tại trong vòng 3 năm). Chỉ bao gồm các bằng sáng chế có cả trích dẫn lùi trong vòng 1 năm trước ngày nộp đơn và trích dẫn tiến trong vòng 1 năm sau ngày nộp đơn. Truy vấn nên tập trung vào các danh mục CPC cụ thể, sắp xếp kết quả theo số lượng trích dẫn lùi theo thứ tự giảm dần, và trả về bằng sáng chế có nhiều trích dẫn lùi nhất, giới hạn ở một kết quả duy nhất.","external_knowledge":null}
{"instance_id":"sf_bq052","db":"PATENTSVIEW","question":"Lấy thông tin sau đây cho các bằng sáng chế Hoa Kỳ: mã bằng sáng chế, tiêu đề và ngày nộp đơn. Số lượng tham chiếu ngược trong vòng 1 tháng trước ngày nộp đơn (tức là các bằng sáng chế đã trích dẫn bằng sáng chế hiện tại trước ngày nộp đơn). Số lượng tham chiếu tiến trong vòng 1 tháng sau ngày nộp đơn (tức là các bằng sáng chế đã trích dẫn bằng sáng chế hiện tại sau ngày nộp đơn). Phần tóm tắt của bằng sáng chế. Chỉ bao gồm các bằng sáng chế thuộc các danh mục CPC cụ thể, như tiểu mục 'C05' hoặc nhóm 'A01G'. Câu truy vấn nên lọc bằng sáng chế để chỉ bao gồm những bằng có ít nhất một trích dẫn ngược hoặc một trích dẫn tiến trong khoảng thời gian 1 tháng được chỉ định. Sắp xếp kết quả theo ngày nộp đơn và trả về toàn bộ hồ sơ phù hợp.","external_knowledge":null}
{"instance_id":"sf_bq036","db":"GITHUB_REPOS","question":"Trung bình có bao nhiêu lượt commit trên GitHub được thực hiện mỗi tháng trong năm 2016 cho các kho lưu trữ chứa mã Python?","external_knowledge":null}
{"instance_id":"sf_bq100","db":"GITHUB_REPOS","question":"Làm thế nào chúng ta có thể nhận diện 10 gói được sử dụng nhiều nhất trong nội dung của kho lưu trữ trên GitHub bằng cách tìm các lệnh import được đóng trong dấu ngoặc đơn, phân tách các import nhiều dòng bằng ký tự xuống dòng, trích xuất tên gói xuất hiện trong dấu nháy kép, đếm tần suất xuất hiện của các gói này, bỏ qua bất kỳ kết quả null nào, và cuối cùng sắp xếp chúng theo thứ tự giảm dần của tần suất xuất hiện? Câu trả lời cuối cùng nên loại bỏ dấu nháy kép.","external_knowledge":null}
{"instance_id":"sf_bq101","db":"GITHUB_REPOS","question":"Từ nội dung GitHub Repos, làm thế nào để xác định 10 tên package được import nhiều nhất trong các tệp nguồn Java bằng cách chia nội dung của từng tệp thành các dòng, lọc các câu lệnh import hợp lệ, chỉ trích xuất phần package bằng một regex thích hợp, nhóm theo các tên package được trích xuất, đếm số lần xuất hiện của chúng, và cuối cùng trả về 10 package xuất hiện nhiều nhất theo thứ tự giảm dần của tần suất?","external_knowledge":null}
{"instance_id":"sf_bq182","db":"GITHUB_REPOS_DATE","question":"Những ngôn ngữ lập trình chính nào, được xác định bằng tổng số byte cao nhất ở mỗi kho lưu trữ, có ít nhất 5 PullRequestEvents vào ngày January 18, 2023 trên phạm vi toàn bộ các kho lưu trữ của chúng?","external_knowledge":null}
{"instance_id":"sf_bq217","db":"GITHUB_REPOS_DATE","question":"Vào ngày 18 tháng 1 năm 2023, có bao nhiêu sự kiện tạo pull request đã xảy ra trong các kho lưu trữ trên GitHub có JavaScript là một trong các ngôn ngữ lập trình của chúng? Sử dụng dữ liệu từ bảng githubarchive cho các sự kiện và bảng languages cho thông tin ngôn ngữ của kho lưu trữ.","external_knowledge":null}
{"instance_id":"sf_bq191","db":"GITHUB_REPOS_DATE","question":"Từ dữ liệu GitHub WatchEvent năm 2017, hãy tìm hai kho lưu trữ đứng đầu có hơn 300 người theo dõi phân biệt, và đảm bảo kết quả được ghép nối với bảng 'sample_files' để trả về tên của mỗi kho lưu trữ cùng với số lượng người theo dõi phân biệt của nó, và giới hạn kết quả ở hai kho lưu trữ có số người theo dõi cao nhất.","external_knowledge":null}
{"instance_id":"sf_bq224","db":"GITHUB_REPOS_DATE","question":"Kho lưu trữ nào có giấy phép được phê duyệt trong `licenses.md` có tổng số lượt fork, vấn đề, và lượt theo dõi cao nhất vào tháng 4 năm 2022?","external_knowledge":null}
{"instance_id":"sf_bq192","db":"GITHUB_REPOS_DATE","question":"Tìm kho lưu trữ Python hoạt động nhất trên GitHub dựa trên số người theo dõi, số vấn đề và số lần fork. Truy vấn nên chọn các kho lưu trữ có các giấy phép nguồn mở cụ thể (`artistic-2.0`, `isc`, `mit`, `apache-2.0`), đếm số người theo dõi phân biệt, các sự kiện liên quan đến issues, và số lần fork cho mỗi kho lưu trữ vào tháng 4 năm 2022, và chỉ bao gồm những kho lưu trữ có các tệp `.py` trên nhánh `master`. Ghép dữ liệu giấy phép với số lượt theo dõi, các sự kiện liên quan đến issues, và số lần fork, sau đó sắp xếp theo một tiêu chí kết hợp của số lần fork, số vấn đề và số người theo dõi, trả về tên và số lượng của kho lưu trữ hoạt động nhất.","external_knowledge":null}
{"instance_id":"sf_bq225","db":"GITHUB_REPOS","question":"Từ các tệp kho GitHub trong 'github_repos.sample_files' được ghép với 'github_repos.sample_contents', mười ngôn ngữ lập trình nào xuất hiện nhiều nhất (dựa trên các phần mở rộng tệp được nhận diện) trong các tệp có nội dung không rỗng, được sắp xếp theo số lượng tệp của chúng theo thứ tự giảm dần?","external_knowledge":"lang_and_ext.md"}
{"instance_id":"sf_bq180","db":"GITHUB_REPOS","question":"Lấy 5 tên module được sử dụng nhiều nhất từ các script Python (`.py`) và R (`.r`), đếm số lần xuất hiện của các module trong các câu lệnh `import` và `from` cho Python, và các lệnh gọi `library()` cho R. Truy vấn nên chỉ xem xét các tập tin Python và R, nhóm theo tên module, và trả về 5 module hàng đầu được sắp xếp theo tần suất.","external_knowledge":null}
{"instance_id":"sf_bq233","db":"GITHUB_REPOS","question":"Bạn có thể phân tích dữ liệu ghép từ các repo github và nội dung github_repos, chỉ tập trung vào các tệp kết thúc bằng '.py' hoặc '.r', sau đó trích xuất các module Python từ các dòng 'import' hoặc 'from ... import' và các thư viện R từ các dòng 'library(...)', đếm số lần xuất hiện của chúng, và cuối cùng liệt kê kết quả được sắp xếp theo ngôn ngữ và theo số lần xuất hiện theo thứ tự giảm dần không?","external_knowledge":null}
{"instance_id":"sf_bq248","db":"GITHUB_REPOS","question":"Trong mọi kho lưu trữ không sử dụng bất kỳ ngôn ngữ lập trình nào có tên (không phân biệt chữ hoa chữ thường) chứa chuỗi con \"python\", tỷ lệ phần trăm của các tệp có đường dẫn chứa \"readme.md\" và nội dung của chúng chứa cụm từ \"Copyright (c)\" là bao nhiêu?","external_knowledge":null}
{"instance_id":"sf_bq193","db":"GITHUB_REPOS","question":"Truy xuất tất cả các dòng không rỗng, không có chú thích từ các tệp `README.md` trong các kho lưu trữ trên GitHub, loại trừ các dòng là chú thích (bắt đầu bằng `#` cho Markdown hoặc `//` cho chú thích mã). Đối với mỗi dòng, tính xem mỗi dòng duy nhất xuất hiện bao nhiêu lần trên toàn bộ các kho lưu trữ và trả về danh sách các ngôn ngữ lập trình được sử dụng trong mỗi kho lưu trữ chứa dòng đó, phân tách bằng dấu phẩy, được sắp xếp theo thứ tự bảng chữ cái, với kết quả được sắp xếp theo tần suất xuất hiện giảm dần.","external_knowledge":null}
{"instance_id":"sf_bq295","db":"GITHUB_REPOS_DATE","question":"Sử dụng dữ liệu GitHub Archive năm 2017 về các sự kiện theo dõi, ba kho lưu trữ nào có ít nhất một file Python (với phần mở rộng .py) có kích thước nhỏ hơn 15,000 bytes và chứa chuỗi con \"def \" trong nội dung của chúng có tổng số sự kiện theo dõi cao nhất cho năm đó?","external_knowledge":null}
{"instance_id":"sf_bq249","db":"GITHUB_REPOS","question":"Vui lòng cung cấp một báo cáo về số lần xuất hiện của các loại dòng cụ thể trên các tập tin từ kho lưu trữ GitHub. Phân loại một dòng là 'trailing' nếu nó kết thúc bằng một ký tự trống, như 'Space' nếu nó bắt đầu bằng một khoảng trắng, và như 'Other' nếu nó không đáp ứng điều kiện nào. Báo cáo nên bao gồm tổng số lần xuất hiện cho từng danh mục, xét trên toàn bộ các dòng từ mọi tập tin.","external_knowledge":null}
{"instance_id":"sf_bq375","db":"GITHUB_REPOS","question":"Xác định loại tệp nào trong số Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java), và JavaScript (.js) trong kho mã nguồn GitHub có nhiều tệp nhất với độ sâu thư mục lớn hơn 10, và cung cấp số lượng tệp.","external_knowledge":null}
{"instance_id":"sf_bq255","db":"GITHUB_REPOS","question":"Có bao nhiêu thông điệp commit tồn tại trong các kho lưu trữ sử dụng ngôn ngữ lập trình 'Shell' và giấy phép 'apache-2.0', với độ dài của thông điệp commit lớn hơn 5 ký tự nhưng nhỏ hơn 10,000 ký tự, và các thông điệp không bắt đầu bằng từ 'merge', 'update' hoặc 'test'?","external_knowledge":null}
{"instance_id":"sf_bq194","db":"GITHUB_REPOS","question":"Trong tổng số tất cả các tập tin Python (*.py), R (*.r, *.R, *.Rmd, *.rmd), và notebook IPython (*.ipynb) trong bộ dữ liệu mẫu GitHub, thư viện hoặc mô-đun nào được xác định là phổ biến thứ hai dựa trên các câu lệnh import đã được trích xuất?","external_knowledge":null}
{"instance_id":"sf_bq377","db":"GITHUB_REPOS","question":"Trích xuất và đếm tần suất của tất cả các tên package được liệt kê trong phần 'require' của nội dung được định dạng JSON","external_knowledge":null}
{"instance_id":"sf_bq359","db":"GITHUB_REPOS","question":"Liệt kê tên các kho lưu trữ và số lượng commit cho hai kho lưu trữ GitHub có JavaScript là ngôn ngữ chính và có số commit cao nhất.","external_knowledge":null}
{"instance_id":"sf_bq252","db":"GITHUB_REPOS","question":"Bạn có thể tìm giúp tên của kho lưu trữ chứa tệp Swift không nhị phân được sao chép nhiều nhất trong tập dữ liệu, sao cho mỗi tệp được nhận diện một cách duy nhất bằng ID của nó không?","external_knowledge":null}
{"instance_id":"sf_bq251","db":"PYPI","question":"Tôi muốn biết các URL dự án GitHub cho 3 gói PyPI được tải xuống nhiều nhất dựa trên số lượt tải. Đầu tiên, trích xuất siêu dữ liệu gói PyPI bao gồm tên, phiên bản và URL dự án. Lọc các URL này chỉ giữ những URL liên kết tới các kho lưu trữ GitHub. Sử dụng một biểu thức chính quy để làm sạch các URL GitHub bằng cách loại bỏ những phần không cần thiết như 'issues', 'pull', 'blob', và 'tree' trong đường dẫn, chỉ giữ lại URL kho lưu trữ chính. Đối với các gói có nhiều phiên bản, chỉ sử dụng phiên bản mới nhất dựa trên thời gian tải lên. Ghép dữ liệu này với các chỉ số tải xuống để xác định các gói được tải xuống nhiều nhất. Chỉ trả về các URL kho lưu trữ GitHub đã làm sạch (không có dấu ngoặc kép) cho 3 gói hàng đầu theo tổng số lượt tải xuống, đảm bảo chỉ có các gói có URL GitHub hợp lệ được đưa vào kết quả.","external_knowledge":null}
{"instance_id":"bq019","db":"cms_data","question":"Trong dữ liệu chi phí nội trú CMS Medicare năm 2014, định nghĩa DRG nào có tổng số lần xuất viện cao nhất, và trong số ba thành phố có số lần xuất viện nhiều nhất cho định nghĩa DRG đó, tổng thanh toán trung bình có trọng số cho từng thành phố là bao nhiêu (trọng số theo tổng số lần xuất viện)?","external_knowledge":null}
{"instance_id":"bq234","db":"cms_data","question":"Thuốc được kê đơn nhiều nhất ở mỗi tiểu bang vào năm 2014?","external_knowledge":null}
{"instance_id":"bq235","db":"cms_data","question":"Bạn có thể cho biết nhà cung cấp dịch vụ chăm sóc sức khỏe nào chịu chi phí trung bình tổng hợp cao nhất cho cả dịch vụ ngoại trú và nội trú vào năm 2014 không?","external_knowledge":null}
{"instance_id":"bq172","db":"cms_data","question":"Đối với thuốc có tổng số đơn thuốc kê đơn cao nhất tại bang New York trong năm 2014, bạn có thể liệt kê năm bang có tổng số lượt yêu cầu thanh toán cho thuốc này cao nhất không? Vui lòng cũng nêu rõ tổng số lượt yêu cầu thanh toán của họ và tổng chi phí thuốc.","external_knowledge":null}
{"instance_id":"bq177","db":"cms_data","question":"Đối với nhà cung cấp có tổng chi phí Medicare nội trú từ năm 2011 đến năm 2015 cao nhất (được tính bằng tổng của (average_medicare_payments × total_discharges)), vui lòng liệt kê chi phí nội trú trung bình hàng năm của nhà cung cấp đó và chi phí ngoại trú trung bình hàng năm của nhà cung cấp đó cho từng năm lịch trong khoảng thời gian này, trong đó chi phí nội trú được tính bằng trung bình của (average_medicare_payments × total_discharges) và chi phí ngoại trú được tính bằng trung bình của (average_total_payments × outpatient_services).","external_knowledge":null}
{"instance_id":"bq354","db":"cms_data","question":"Bạn có thể cung cấp tỷ lệ phần trăm của người tham gia cho mụn trứng cá tiêu chuẩn, viêm da cơ địa, bệnh vảy nến và bệnh bạch tạng theo định nghĩa của International Classification of Diseases 10-CM (ICD-10-CM), bao gồm cả các phân loại con của chúng? Vui lòng bao gồm tất cả các khái niệm liên quan được ánh xạ tới các mã ICD-10-CM chuẩn (L70 cho mụn trứng cá, L20 cho viêm da cơ địa, L40 cho bệnh vảy nến, và L80 cho bệnh bạch tạng) bằng cách sử dụng các mối quan hệ khái niệm, bao gồm các khái niệm con. Tỷ lệ phần trăm nên được tính dựa trên tổng số người tham gia, chỉ xem xét các khái niệm chuẩn và các khái niệm liên quan của chúng và các khái niệm con của chúng.","external_knowledge":null}
{"instance_id":"bq355","db":"cms_data","question":"Vui lòng cho tôi biết tỷ lệ phần trăm của những người tham gia không sử dụng quinapril và các thuốc liên quan(Quinapril RxCUI: 35208).","external_knowledge":null}
{"instance_id":"bq032","db":"noaa_data","question":"Bạn có thể cho biết vĩ độ của tọa độ cuối cùng của cơn bão đã di chuyển quãng đường dài thứ hai ở Đại Tây Dương phía Bắc trong năm 2020 không?","external_knowledge":"functions_st_distance.md"}
{"instance_id":"bq119","db":"noaa_data","question":"Vui lòng hiển thị thông tin về cơn bão có tổng quãng đường di chuyển dài thứ ba ở Đại Tây Dương phía Bắc trong năm 2020, bao gồm tọa độ di chuyển của nó, tổng quãng đường di chuyển tích lũy tại mỗi điểm (tính bằng kilômét), và vận tốc gió duy trì tối đa tại các thời điểm đó.","external_knowledge":"functions_st_distance.md"}
{"instance_id":"sf_bq117","db":"NOAA_DATA","question":"Có bao nhiêu sự kiện bão nghiêm trọng đã xảy ra trong tháng bị ảnh hưởng nhiều nhất trong 15 năm qua theo dữ liệu của NOAA, chỉ tính đến 100 sự kiện bão có thiệt hại về tài sản lớn nhất.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq419","db":"noaa_data","question":"5 bang nào có số lượng sự kiện bão nhiều nhất từ năm 1980 đến năm 1995, chỉ xét các bang nằm trong top 1000 có số lượng sự kiện cao nhất theo từng năm? Vui lòng sử dụng chữ viết tắt của bang.","external_knowledge":null}
{"instance_id":"sf_bq071","db":"NOAA_DATA_PLUS","question":"Bạn có thể cung cấp số lượng bão và danh sách tên bão (sắp xếp theo bảng chữ cái và cách nhau bằng dấu phẩy) cho mỗi thành phố và mã bưu chính liên quan của nó, nơi các cơn bão nằm trong phạm vi của các mã bưu chính? Vui lòng loại trừ bất kỳ cơn bão chưa được đặt tên nào, và sắp xếp kết quả theo số lượng bão giảm dần. Đầu ra nên bao gồm các cột sau: thành phố, mã bưu chính, tiểu bang, số lượng bão, và danh sách các cơn bão.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq236","db":"NOAA_DATA_PLUS","question":"Những mã ZIP hàng đầu nào ở các khu vực tại Hoa Kỳ đã trải qua nhiều sự kiện mưa đá nhất trong 10 năm qua? Đừng sử dụng dữ liệu từ hail reports table.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq356","db":"noaa_data","question":"Trong số tất cả các trạm khí tượng GSOD của NOAA đã ghi nhận dữ liệu nhiệt độ hàng ngày hợp lệ (nhiệt độ trung bình không thiếu, max, min) vào năm 2019 và có chu kỳ ghi nhận bắt đầu vào hoặc trước January 1, 2000, và tiếp tục cho đến ít nhất June 30, 2019, có bao nhiêu trạm trong số này đạt được 90% hoặc nhiều hơn của số ngày ghi nhận nhiệt độ hợp lệ tối đa có thể trong năm 2019?","external_knowledge":null}
{"instance_id":"bq042","db":"noaa_data","question":"Bạn có thể giúp tôi truy vấn nhiệt độ trung bình, vận tốc gió trung bình và lượng mưa cho Sân bay LaGuardia ở NYC vào ngày 12 tháng 6 cho mỗi năm từ 2011 đến 2020, cụ thể sử dụng mã trạm 725030 không?","external_knowledge":null}
{"instance_id":"bq394","db":"noaa_data","question":"3 tháng đứng đầu từ năm 2010 đến năm 2014 có tổng các hiệu tuyệt đối giữa nhiệt độ không khí trung bình, nhiệt độ bóng ướt, nhiệt độ điểm sương và nhiệt độ mặt nước biển nhỏ nhất, kèm theo năm và tháng tương ứng và tổng các hiệu? Vui lòng trình bày năm và tháng ở định dạng số.","external_knowledge":null}
{"instance_id":"bq357","db":"noaa_data","question":"Các tọa độ vĩ độ và kinh độ và các ngày từ năm 2005 đến năm 2015 có 5 tốc độ gió trung bình hàng ngày cao nhất là gì, loại trừ các bản ghi có giá trị tốc độ gió bị thiếu? Sử dụng dữ liệu từ các bảng có tiền tố \"icoads_core\".","external_knowledge":null}
{"instance_id":"bq181","db":"noaa_data","question":"Tỷ lệ phần trăm của các trạm thời tiết ghi nhận dữ liệu nhiệt độ hợp lệ (không có giá trị thiếu hoặc giá trị không hợp lệ) cho ít nhất 90% số ngày trong năm 2022, trong đó nhiệt độ, giá trị tối đa và tối thiểu không NULL và không bằng 9999.9, và trạm có mã nhận dạng hợp lệ (mã USAF không bằng '999999'), từ tất cả các trạm có sẵn trong cơ sở dữ liệu NOAA GSOD?","external_knowledge":null}
{"instance_id":"bq045","db":"noaa_data","question":"Các trạm thời tiết ở tiểu bang Washington ghi nhận hơn 150 ngày mưa trong năm 2023 nhưng có số ngày mưa ít hơn so với năm 2022? Định nghĩa một “ngày mưa” là một ngày có lượng mưa lớn hơn 0 mm và không bằng 99.99. Chỉ bao gồm các trạm có dữ liệu lượng mưa hợp lệ.","external_knowledge":null}
{"instance_id":"sf_bq358","db":"NEW_YORK_CITIBIKE_1","question":"Bạn có thể cho biết chuyến đi bằng xe đạp nào ở Thành phố New York vào ngày 15 tháng 7 năm 2015 bắt đầu và kết thúc ở các khu vực mã ZIP có nhiệt độ trung bình cao nhất trong ngày đó, được ghi nhận bởi trạm thời tiết ở Central Park (WBAN '94728') không? Nếu có nhiều hơn một chuyến đi thỏa mãn các tiêu chí này, tôi muốn biết về chuyến bắt đầu từ mã ZIP nhỏ nhất và kết thúc ở mã ZIP lớn nhất. Vui lòng trả về mã ZIP khởi đầu và mã ZIP kết thúc của chuyến đi này.","temporal":"Yes","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq290","db":"noaa_data","question":"Bạn có thể tính sự khác biệt giữa nhiệt độ tối đa, nhiệt độ tối thiểu và nhiệt độ trung bình giữa các trạm khí tượng ở Mỹ và Vương quốc Anh cho từng ngày trong tháng 10 năm 2023, sử dụng trường ngày, và loại bỏ các bản ghi có giá trị nhiệt độ thiếu hoặc không hợp lệ?","external_knowledge":null}
{"instance_id":"bq031","db":"noaa_data","question":"Cung cấp dữ liệu thời tiết hàng ngày cho Rochester từ ngày 01 tháng 01 năm 2019 đến ngày 31 tháng 03 năm 2019, bao gồm nhiệt độ (độ C), lượng mưa (cm), và vận tốc gió (m/s). Đối với mỗi biến, tính trung bình động 8 ngày (bao gồm ngày hiện tại và 7 ngày trước). Cũng tính hiệu giữa trung bình động ở mỗi ngày với các trung bình động của 1 đến 8 ngày trước (tức lag1 đến lag8). Kết quả nên bao gồm: các giá trị hàng ngày cho nhiệt độ, lượng mưa và vận tốc gió. Trung bình động 8 ngày cho mỗi biến. Các khác biệt giữa trung bình động của mỗi ngày và các trung bình động của 1 đến 8 ngày trước (ví dụ sự chênh lệch giữa trung bình động ngày hôm nay và trung bình động của 1 ngày trước, 2 ngày trước, v.v.). Làm tròn tất cả các giá trị về một chữ số thập phân. Dữ liệu được sắp xếp theo ngày, bắt đầu từ ngày 9 tháng 1 năm 2019.","external_knowledge":null}
{"instance_id":"bq392","db":"noaa_gsod","question":"3 ngày có nhiệt độ trung bình cao nhất trong tháng 10 năm 2009 cho trạm số 723758, theo định dạng YYYY-MM-DD?","external_knowledge":null}
{"instance_id":"sf_bq050","db":"NEW_YORK_CITIBIKE_1","question":"Tôi muốn phân tích các chuyến đi xe đạp ở Thành phố New York cho năm 2014 bằng cách liên kết dữ liệu chuyến đi với thông tin thời tiết để hiểu cách điều kiện thời tiết (nhiệt độ, vận tốc gió và lượng mưa) ảnh hưởng đến các chuyến đi giữa các khu phố. Đối với mỗi tổ hợp của các khu phố bắt đầu và kết thúc, tôi cần các mục sau: 1. Tổng số chuyến đi giữa các khu phố. 2. Thời gian trung bình của chuyến đi bằng phút (làm tròn đến 1 chữ số thập phân). 3. Nhiệt độ trung bình tại thời điểm bắt đầu chuyến đi (làm tròn đến 1 chữ số thập phân). 4. Vận tốc gió trung bình tại thời điểm bắt đầu (tính bằng mét trên giây, làm tròn đến 1 chữ số thập phân). 5. Lượng mưa trung bình tại thời điểm bắt đầu (tính bằng centimet, làm tròn đến 1 chữ số thập phân). 6. Tháng có nhiều chuyến đi nhất (ví dụ `4` cho tháng 4). Dữ liệu nên được nhóm theo khu bắt đầu và khu kết thúc, với:`zip_codes` trong `geo_us_boundaries` được dùng để ánh xạ vị trí chuyến đi dựa trên vĩ độ và kinh độ. `zip_codes` trong `cyclistic` được dùng để lấy tên quận và khu phố. Sử dụng dữ liệu thời tiết từ trạm Central Park cho ngày của chuyến đi, bao phủ tất cả các chuyến đi trong 2014.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq426","db":"NEW_YORK_CITIBIKE_1","question":"Loại người dùng nào ghi nhận nhiệt độ trung bình cao nhất cho các chuyến đi bắt đầu và kết thúc tại mã bưu điện 10019 ở Thành phố New York trong năm 2018? Bao gồm lượng mưa trung bình, vận tốc gió và nhiệt độ cho loại người dùng đó dựa trên dữ liệu thời tiết từ trạm thời tiết tại Công viên Trung tâm ở Thành phố New York.","external_knowledge":"functions_st_within.md"}
{"instance_id":"sf_bq291","db":"NOAA_GLOBAL_FORECAST_SYSTEM","question":"Bạn có thể cung cấp một bản tổng hợp thời tiết hàng ngày cho July 2019 trong bán kính 5 km quanh vĩ độ 26.75 và kinh độ 51.5 không? Tôi cần nhiệt độ tối đa, tối thiểu và trung bình; tổng lượng mưa; độ che phủ mây trung bình từ 10 giờ sáng đến 5 giờ chiều; tổng lượng tuyết rơi (khi nhiệt độ trung bình dưới 32°F); và tổng lượng mưa (khi nhiệt độ trung bình từ 32°F trở lên) cho mỗi ngày dự báo. Dữ liệu nên tương ứng với các dự báo được tạo ra trong July 2019 cho ngày tiếp theo.","external_knowledge":"functions_st_within.md"}
{"instance_id":"bq208","db":"new_york_noaa","question":"Bạn có thể cung cấp các trạm khí tượng nằm trong bán kính 20-mile quanh Chappaqua, New York (Vĩ độ: 41.197, Kinh độ: -73.764), và cho tôi biết số lượng quan sát nhiệt độ hợp lệ mà họ đã ghi nhận từ năm 2011 đến 2020, loại bỏ mọi dữ liệu nhiệt độ không hợp lệ hoặc thiếu.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq047","db":"new_york_noaa","question":"Bạn có thể phân tích mối quan hệ giữa từng loại phàn nàn và nhiệt độ hàng ngày ở Thành phố New York, đặc biệt sử dụng dữ liệu nhiệt độ từ sân bay LaGuardia (STN=725030) và JFK (STN=744860) cho 10 năm bắt đầu từ năm 2008, và sau đó xác định, đối với mỗi loại phàn nàn có tổng số lần xuất hiện lớn hơn 5000 và cho thấy mức tương quan mạnh (giá trị tuyệt đối > 0.5) với nhiệt độ, tổng số phàn nàn, tổng số ngày có ghi nhận nhiệt độ hợp lệ, và các hệ số tương quan Pearson (làm tròn đến bốn chữ số thập phân) giữa nhiệt độ và cả số phàn nàn hàng ngày cũng như tỷ lệ phần trăm phàn nàn hàng ngày trên tổng số phàn nàn, loại trừ bất kỳ ngày nào có dữ liệu nhiệt độ thiếu hoặc không hợp lệ (như 9999.9)?","external_knowledge":null}
{"instance_id":"bq048","db":"new_york_noaa","question":"Loại phàn nàn nào có tổng số yêu cầu lớn hơn 3000 từ năm 2011 đến 2020 cho thấy mối tương quan Pearson dương mạnh nhất và mối tương quan Pearson âm mạnh nhất với vận tốc gió trung bình hàng ngày được đo tại trạm 744860 (JFK Airport), dựa trên tỷ lệ phàn nàn hàng ngày (tỷ lệ phàn nàn theo từng loại so với tổng phàn nàn hàng ngày)? Vui lòng cung cấp các loại phàn nàn và hệ số tương quan của chúng, làm tròn đến bốn chữ số thập phân.","external_knowledge":null}
{"instance_id":"bq293","db":"new_york_geo","question":"Tôi muốn phân tích dữ liệu chuyến taxi vàng ở Thành phố New York, cụ thể cho ngày 1 tháng 1 năm 2015, bằng cách sử dụng bộ dữ liệu bigquery-public-data.new_york.tlc_yellow_trips_2015. Tôi cần ghép dữ liệu này với bảng geo_us_boundaries.zip_codes để ánh xạ mỗi chuyến đi tới mã ZIP của NYC tương ứng dựa trên tọa độ đón. Phân tích nên tạo một bảng phân tích đầy đủ theo từng giờ cho tất cả các mã ZIP bằng cách ghép chéo các mã ZIP distinct với các giờ distinct, bao gồm cả những giờ có số chuyến bằng 0. Đối với mỗi kết hợp mã ZIP và giờ, tính tổng số chuyến và các chỉ số theo thời gian sau: số chuyến từ 1 giờ trước, 1 ngày trước (24 giờ), 7 ngày trước (168 giờ) và 14 ngày trước (336 giờ). Thêm vào đó, tính trung bình động 14 ngày và 21 ngày và độ lệch chuẩn của số chuyến theo thời gian, loại trừ giờ hiện tại. Chỉ bao gồm các chuyến có tọa độ vĩ độ và kinh độ hợp lệ. Kết quả cuối cùng nên được sắp xếp theo số chuyến cao nhất, chỉ hiển thị 5 nhóm có số chuyến lớn nhất.","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq017","db":"GEO_OPENSTREETMAP","question":"Các loại đường cao tốc dài nhất nằm trong ranh giới multipolygon của Đan Mạch (được định nghĩa bởi mã Wikidata 'Q35'), được sắp xếp theo tổng chiều dài và được phân tích thông qua planet features là những loại nào?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq131","db":"GEO_OPENSTREETMAP","question":"Số lượng trạm dừng của mạng lưới xe buýt có số trạm nhiều nhất nằm trong ranh giới multipolygon của Đan Mạch (được định nghĩa bởi Wikidata ID 'Q35'), được phân tích thông qua các tính năng Planet.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq349","db":"GEO_OPENSTREETMAP","question":"ID OpenStreetMap từ bảng planet features nào tương ứng với một ranh giới hành chính, được biểu diễn dưới dạng multipolygons, mà tổng số POIs được gắn nhãn 'amenity'-tagged, như được suy ra từ bảng planet nodes, gần nhất với trung vị của tổng số POIs trong số tất cả các ranh giới như vậy?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq007","db":"CENSUS_BUREAU_ACS_2","question":"Xác định mười tiểu bang Hoa Kỳ có dân số dễ bị tổn thương cao nhất, được tính dựa trên tổng có trọng số của các ngành nghề từ dữ liệu ACS 5-Year năm 2017, và xác định sự thay đổi thu nhập trung vị trung bình của các tiểu bang đó từ năm 2015 đến 2018 dựa trên dữ liệu theo mã ZIP.","external_knowledge":"total_vulnerable_weights.md"}
{"instance_id":"sf_bq429","db":"CENSUS_BUREAU_ACS_2","question":"Năm bang đứng đầu có sự chênh lệch trung bình lớn nhất về thu nhập trung vị giữa năm 2015 và 2018 ở cấp độ mã ZIP là những bang nào, và số lượng nhân viên dễ bị tổn thương trung bình tương ứng trên các ngành bán buôn, tài nguyên thiên nhiên và xây dựng, nghệ thuật và giải trí, thông tin, và bán lẻ vào năm 2017 là bao nhiêu, theo ACS Five-Year Estimates và dữ liệu ranh giới mã ZIP?","external_knowledge":"avg_vulnerable_weights.md"}
{"instance_id":"sf_bq073","db":"CENSUS_BUREAU_ACS_2","question":"Sử dụng dữ liệu về sự khác biệt thu nhập trung vị ở cấp ZIP giữa năm 2015 và 2018, cùng với số liệu việc làm ACS năm 2017, liệt kê từng bang theo thứ tự giảm dần của tổng số lao động dễ bị tổn thương, trong đó “dễ bị tổn thương” được định nghĩa là 38% số nhân viên bán buôn và 41% số nhân viên sản xuất vào năm 2017. Kết quả của bạn nên bao gồm tên bang, số lượng lao động dễ bị tổn thương trong ngành bán buôn, số lượng lao động dễ bị tổn thương trong ngành sản xuất, và tổng cộng của những lao động dễ bị tổn thương này.","external_knowledge":null}
{"instance_id":"sf_bq410","db":"CENSUS_BUREAU_ACS_2","question":"Tìm 3 trạng thái có dân số ngoài lực lượng lao động được điều chỉnh nhỏ nhất bằng cách sử dụng dữ liệu ACS theo tract năm 2017. Tính dân số ngoài lực lượng được điều chỉnh theo công thức (unemployed_pop + not_in_labor_force - group_quarters), và gán các giá trị âm bằng 0. Đối với mỗi trạng thái này, hãy hiển thị chữ viết tắt của trạng thái, tổng sự thay đổi thu nhập trung vị giữa 2015 và 2018 trên tất cả các tract, tổng dân số ngoài lực lượng được điều chỉnh, và tỷ lệ điều chỉnh theo dân số trung bình (tính bằng tỷ lệ của adjusted non-labor force với tổng dân số ở mức tract). Kết nối dữ liệu tract với các trạng thái bằng tiền tố mã FIPS, loại bỏ mọi tract có sự khác biệt về thu nhập là NULL, và sắp xếp kết quả theo dân số ngoài lực lượng được điều chỉnh theo thứ tự tăng dần.","external_knowledge":null}
{"instance_id":"sf_bq348","db":"GEO_OPENSTREETMAP","question":"Trong hình chữ nhật được xác định bởi geogpoints (31.1798246, 18.4519921), (54.3798246, 18.4519921), (54.3798246, 33.6519921) và (31.1798246, 33.6519921), ba tên người dùng đứng đầu về số lượng nút lịch sử ban đầu được gắn nhãn với các tiện nghi ‘bệnh viện’, ‘phòng khám’, hoặc ‘bác sĩ’, hiện không còn xuất hiện trong dữ liệu planet_nodes hiện tại?","external_knowledge":"functions_st_intersects_polygon_line.md"}
{"instance_id":"sf_bq253","db":"GEO_OPENSTREETMAP","question":"Tìm tên của mối quan hệ OpenStreetMap bao gồm nhiều tính năng nhất trong cùng khu vực địa lý với multipolygon được gắn thẻ với Wikidata mục 'Q1095'. Mối quan hệ này phải có một tên được chỉ định và không có thẻ 'wikidata', và ít nhất một trong những tính năng được bao gồm của nó phải có thẻ 'wikidata'. Phân tích nên được tiến hành bằng bảng planet_features. Trả về tên của mối quan hệ này.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq254","db":"GEO_OPENSTREETMAP","question":"Trong số tất cả các multipolygons nằm trong cùng một khu vực địa lý với multipolygon liên kết với Wikidata item Q191, nhưng chính chúng lại thiếu thẻ 'wikidata', hai cái nào xếp hạng cao nhất theo số điểm nằm trong ranh giới của chúng, và tên của chúng là gì?","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"sf_bq056","db":"GEO_OPENSTREETMAP_BOUNDARIES","question":"Có bao nhiêu cặp đường khác nhau được phân loại là motorway, trunk, primary, secondary, hoặc residential ở California chồng lên nhau mà không chia sẻ nút và không có thẻ bridge, trong đó các tuyến đường này được gắn thẻ 'highway', được phân tích thông qua planet ways","external_knowledge":"functions_st_intersects.md"}
{"instance_id":"sf_bq289","db":"GEO_OPENSTREETMAP_CENSUS_PLACES","question":"Bạn có thể tìm khoảng cách ngắn nhất giữa bất kỳ hai tiện nghi nào (hoặc thư viện, nơi thờ tự, hoặc trung tâm cộng đồng) nằm tại Philadelphia, được phân tích thông qua bảng Pennsylvania và các điểm đặc trưng của hành tinh?","external_knowledge":"functions_st_contains.md"}
{"instance_id":"sf_bq250","db":"GEO_OPENSTREETMAP_WORLDPOP","question":"Dựa trên dữ liệu lưới dân số 1km mới nhất ở Singapore trước tháng 1 năm 2023, sử dụng ST_CONVEXHULL để gom các centroid của tất cả các ô lưới dân số thành một vùng bao phủ và ST_INTERSECTS để xác định các bệnh viện từ planet layer của OpenStreetMap (layer_code in (2110, 2120)) nằm trong vùng này, sau đó tính khoảng cách từ mỗi ô lưới đến bệnh viện gần nhất của nó, tổng dân số của ô lưới xa nhất khỏi bất kỳ bệnh viện nào là bao nhiêu?","external_knowledge":"OpenStreetMap_data_in_layered_GIS_format.md"}
{"instance_id":"sf_bq083","db":"CRYPTO","question":"Bạn có thể tính sự biến động hàng ngày của giá trị thị trường của token USDC (địa chỉ `0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48`) cho năm 2023, dựa trên các giao dịch Ethereum? Sự biến động nên được tính từ các hoạt động minting (mẫu input `0x40c10f19%`) và burning (mẫu input `0x42966c68%`). Với mỗi giao dịch, minting nên có giá trị dương và burning âm. Trích xuất số tiền liên quan từ trường 'input' ở dạng hexadecimal, chuyển đổi nó sang đơn vị triệu, biểu diễn ở định dạng USD. Gom kết quả theo ngày và sắp xếp theo thứ tự giảm dần.","external_knowledge":"Total_Market_Value_Change.md"}
{"instance_id":"sf_bq184","db":"CRYPTO","question":"Chỉ dựa trên dữ liệu trace, bạn có thể tính tích lũy theo ngày của số hợp đồng thông minh được tạo bởi các địa chỉ bên ngoài (trace_address là NULL) so với những hợp đồng được tạo bởi các hợp đồng khác (trace_address là NOT NULL) cho mỗi ngày từ 2017-01-01 đến 2021-12-31, đảm bảo mọi ngày trong phạm vi này đều được đưa vào ngay cả khi không có hợp đồng mới nào được tạo ra vào một số ngày, và hiển thị tổng tích lũy tăng dần cho cả hai danh mục.","external_knowledge":null}
{"instance_id":"sf_bq195","db":"CRYPTO","question":"Top 10 địa chỉ Ethereum có số dư lớn nhất, xét cả giao dịch giá trị và phí gas, trước ngày 1 tháng 9 năm 2021? Chỉ giữ lại các giao dịch thành công mà không có loại gọi hoặc loại gọi là 'call'.","external_knowledge":null}
{"instance_id":"sf_bq256","db":"CRYPTO","question":"Xác định số dư Ether cuối cùng của địa chỉ Ethereum đã khởi xướng nhiều giao dịch thành công nhất trước ngày 1 tháng 9 năm 2021 (UTC), loại trừ các cuộc gọi kiểu delegatecall, callcode, hoặc staticcall và bao gồm tất cả các giao dịch đến và đi liên quan, phần thưởng của thợ đào, và các phí gas bị khấu trừ, với số dư cuối cùng được trình bày bằng Ether sau khi chuyển đổi từ Wei.","external_knowledge":null}
{"instance_id":"sf_bq080","db":"CRYPTO","question":"Chỉ sử dụng bảng traces Ethereum, bạn có thể cung cấp một tổng tích lũy theo ngày cho số lượng hợp đồng thông minh được tạo bởi người dùng bên ngoài (where trace_address is null) so với hợp đồng được tạo bởi các hợp đồng khác (where trace_address is not null) giữa August 30, 2018, và September 30, 2018? Đảm bảo kết quả bao gồm mọi ngày trong phạm vi này, ngay cả khi không có hợp đồng mới được tạo, và tổng tích lũy phải tăng tuyệt đối theo từng ngày.","external_knowledge":null}
{"instance_id":"sf_bq342","db":"CRYPTO","question":"Sự khác biệt giữa sự thay đổi trung bình theo giờ của giá trị giao dịch cho token Ethereum 0x68e54af74b22acaccffa04ccaad13be16ed14eac, cụ thể xem xét chỉ các giao dịch mà địa chỉ 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d là người gửi hoặc địa chỉ 0xfbd6c6b112214d949dcdfb1217153bc0a742862f là người nhận, giữa January 1, 2019, và December 31, 2020, khi so sánh 2019 với 2020?","external_knowledge":null}
{"instance_id":"sf_bq341","db":"CRYPTO","question":"Địa chỉ Ethereum nào có top 3 số dư dương nhỏ nhất từ các giao dịch liên quan đến token tại địa chỉ \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\"?","external_knowledge":null}
{"instance_id":"sf_bq444","db":"CRYPTO","question":"Bạn có thể lấy thời gian khối, số khối và hash giao dịch cho năm sự kiện mint và burn đầu tiên từ nhật ký Ethereum cho địa chỉ '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8' được không? Vui lòng bao gồm các sự kiện mint được xác định bằng chủ đề '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' và các sự kiện burn bằng '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c', và sắp xếp chúng theo thời gian khối từ cũ nhất đến mới nhất.","external_knowledge":"ethereum_logs_and_events_overview.md"}
{"instance_id":"sf_bq340","db":"CRYPTO","question":"Sáu địa chỉ Ethereum nào, loại trừ '0x0000000000000000000000000000000000000000', có sự chênh lệch tuyệt đối lớn nhất giữa số dư trước đây và số dư hiện tại của chúng đối với các token có tại các địa chỉ '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' và '0x1e15c05cbad367f044cbfbafda3d9a1510db5513'?","external_knowledge":null}
{"instance_id":"sf_bq005","db":"CRYPTO","question":"Tính thời gian trung bình hàng ngày giữa các khối Bitcoin (đơn vị: giây) cho năm 2023 bằng cách ghép các khối liên tiếp bằng các phép tự ghép được đánh số theo hàng (bao gồm cả các khoảng thời gian giữa các ngày), loại trừ khối genesis, và liệt kê 10 ngày đầu tiên kèm theo các trung bình chưa được hiệu chỉnh của chúng.","external_knowledge":null}
{"instance_id":"sf_bq334","db":"CRYPTO","question":"Tính sự chênh lệch hàng năm giữa giá trị đầu ra trung bình của Bitcoin giữa hai phương pháp: gộp bản ghi nhập/xuất: ghép hai bảng inputs và outputs, lọc để chỉ các bản ghi đầu ra, và tính trung bình theo từng năm. Bảng transactions: sử dụng trực tiếp trường output_value từ bảng transactions để tính trung bình theo từng năm. Hiển thị sự khác biệt (trung bình đầu ra gộp trừ đi trung bình transactions) chỉ đối với các năm có dữ liệu ở cả hai phương pháp.","external_knowledge":null}
{"instance_id":"sf_bq335","db":"CRYPTO","question":"Trong số tất cả các địa chỉ Bitcoin có ít nhất một giao dịch vào tháng 10 năm 2017 (kết hợp cả đầu vào và đầu ra), địa chỉ nào đã thực hiện giao dịch cuối cùng vào ngày muộn nhất của tháng đó, và, đối với bất kỳ địa chỉ nào có cùng ngày muộn nhất đó, địa chỉ nào có tổng giá trị giao dịch cao nhất?","external_knowledge":null}
{"instance_id":"sf_bq057","db":"CRYPTO","question":"Tháng nào trong năm 2021 (ví dụ 3 cho tháng 3) đã chứng kiến tỷ lệ phần trăm cao nhất của khối lượng giao dịch Bitcoin diễn ra trong các giao dịch CoinJoin (được định nghĩa là các giao dịch có >2 đầu ra, giá trị đầu ra ≤ giá trị đầu vào, và có nhiều đầu ra có giá trị bằng nhau)? Đồng thời hãy cung cấp tỷ lệ phần trăm của tất cả các giao dịch Bitcoin là CoinJoin, tỷ lệ phần trăm của các UTXO tham gia vào các giao dịch CoinJoin (trung bình của tỷ lệ đầu vào và đầu ra), và tỷ lệ phần trăm của tổng khối lượng Bitcoin diễn ra trong các giao dịch CoinJoin cho tháng đó. Làm tròn tất cả các tỷ lệ phần trăm về 1 chữ số thập phân.","external_knowledge":null}
{"instance_id":"sf_bq068","db":"CRYPTO","question":"Áp dụng nguyên tắc sổ cái kép bằng cách coi các đầu vào giao dịch là ghi nợ (giá trị âm) và các đầu ra là ghi có (giá trị dương) cho mọi giao dịch Bitcoin Cash từ ngày 2014-03-01 đến ngày 2014-04-01, làm thế nào để chúng ta tính được số dư cuối cùng tối đa và tối thiểu được phân nhóm theo loại địa chỉ từ các giao dịch này?","external_knowledge":null}
{"instance_id":"sf_bq092","db":"CRYPTO","question":"Vào tháng 4 năm 2023, những số dư cao nhất và thấp nhất trên toàn bộ các địa chỉ Dash khi tính toán số dư ròng cho mỗi địa chỉ bằng phương pháp ghi sổ kép (nơi đầu vào được coi như ghi nợ/giá trị âm và đầu ra như ghi có/giá trị dương). Xét tất cả các giao dịch được lọc bởi block_timestamp_month='2023-04-01', và khi một địa chỉ xuất hiện dưới dạng mảng trong dữ liệu, ghép các phần tử của mảng thành một chuỗi phân cách bởi dấu phẩy. Đối với mỗi địa chỉ và tổ hợp loại, cộng tất cả các giá trị để xác định số dư.","external_knowledge":null}
{"instance_id":"sf_bq093","db":"CRYPTO","question":"Những biến động ròng lớn nhất và nhỏ nhất về số dư của các địa chỉ Ethereum Classic vào ngày 14 tháng 10 năm 2016 là bao nhiêu? Hãy tính chúng bằng cách cộng tất cả các giao dịch nơi các địa chỉ nhận được tiền (debits), gửi tiền (credits), và trả hoặc nhận phí gas. Chỉ bao gồm các giao dịch có trạng thái thành công và loại trừ các cuộc gọi nội bộ theo các loại. Đối với phí gas, hãy xem xét cả phí do người gửi giao dịch trả và phí được thợ đào nhận, được tính bằng tích của phí gas với giá gas cho cả thợ đào và người gửi.","external_knowledge":null}
{"instance_id":"sf_bq292","db":"CRYPTO","question":"Phân tích các giao dịch Bitcoin kể từ tháng 7 năm 2023 để xác định tỷ lệ phần trăm hàng tháng của: (1) Các giao dịch được phân loại là CoinJoins (được định nghĩa bởi >2 đầu ra, giá trị đầu ra ≤ giá trị đầu vào, và nhiều đầu ra có cùng giá trị), (2) UTXO tham gia CoinJoins (được tính bằng trung bình của tỷ lệ input/output CoinJoin so với tổng số UTXO trên mạng), (3) Khối lượng giao dịch (dựa trên giá trị đầu vào) được gán cho CoinJoins. Cung cấp kết quả trong một bảng với các chỉ số theo tháng cho các giao dịch, UTXO và khối lượng.","external_knowledge":null}
{"instance_id":"sf_bq135","db":"CRYPTO","question":"Trong dữ liệu chuỗi khối Zilliqa, ngày nào trước năm 2022 có tổng giá trị giao dịch lớn nhất?","external_knowledge":null}
{"instance_id":"sf_bq136","db":"CRYPTO","question":"Tìm tất cả các đường đi giao dịch có đúng hai bước trên chuỗi khối Zilliqa giữa địa chỉ nguồn 'zil1jrpjd8pjuv50cfkfr7eu6yrm3rn5u8rulqhqpz' và địa chỉ đích 'zil19nmxkh020jnequql9kvqkf3pkwm0j0spqtd26e', xem xét cả giao dịch thông thường và chuyển đổi hợp đồng. Đường đi hai bước có nghĩa là phải có một địa chỉ trung gian giữa nguồn và đích. Loại bỏ các đường đi mà bất kỳ địa chỉ trung gian nào có trên 50 giao dịch đi ra để lọc bỏ các sàn giao dịch và các ví hoạt động nhiều. Đảm bảo các giao dịch trong mỗi đường đi tuân theo thứ tự thời gian (thời điểm giao dịch sớm nhất ở đầu). Hiển thị kết quả theo định dạng: '<source> --(tx ABCDE..)--> <intermediate> --(tx FGHIJ..)--> <destination>' trong đó ID giao dịch được rút ngắn về 5 ký tự đầu. Chỉ bao gồm các giao dịch đã được xác nhận trên chuỗi ở cả hai bước của đường đi.","external_knowledge":null}
{"instance_id":"sf_bq065","db":"CRYPTO","question":"Từ bảng oracle requests, hãy lấy 10 yêu cầu oracle gần đây nhất có script ID 3. Đối với mỗi yêu cầu, trích xuất tất cả các cặp symbol-rate bằng cách ghép nối mỗi symbol trong mảng \"symbols\" với tỷ lệ tương ứng ở cùng vị trí trong mảng \"rates\" từ kết quả được giải mã. Điều chỉnh mỗi tỷ lệ bằng cách chia nó cho giá trị multiplier của yêu cầu. Trả về thời gian khối (block timestamp), ID yêu cầu oracle, ký hiệu (symbol), và tỷ lệ đã điều chỉnh cho mỗi cặp symbol-rate. Sắp xếp kết quả theo thứ tự thời gian sao cho các bản ghi mới nhất ở phía trước.","external_knowledge":null}
{"instance_id":"sf_bq037","db":"HUMAN_GENOME_VARIANTS","question":"Về các biến thể di truyền ở người đã được tinh chỉnh và thu thập trong giai đoạn 3 vào 2015-02-20, tôi muốn biết vị trí bắt đầu nhỏ nhất và lớn nhất cũng như tỷ lệ của hai cơ sở này lần lượt cho 'AT' và 'TA'.","external_knowledge":null}
{"instance_id":"sf_bq012","db":"ETHEREUM_BLOCKCHAIN","question":"Tính số dư trung bình (theo đơn vị quadrillions, 10^15) của 10 địa chỉ Ethereum hàng đầu theo số dư ròng, bao gồm các giao dịch nhận và chuyển từ traces (chỉ các giao dịch thành công và loại trừ các loại call như delegatecall, callcode và staticcall), phần thưởng cho thợ mỏ (tổng phí gas trên mỗi khối), và các khoản khấu trừ phí gas từ người gửi. Loại bỏ các địa chỉ null và làm tròn kết quả đến hai chữ số thập phân.","external_knowledge":null}
{"instance_id":"sf_bq187","db":"ETHEREUM_BLOCKCHAIN","question":"Tính tổng cung lưu thông của các token 'BNB' (ở đơn vị chia cho 10^18) bằng cách cộng số dư của tất cả các địa chỉ có số dư khác 0, trong đó số dư của mỗi địa chỉ bằng tổng BNB nhận được trừ BNB đã gửi. Loại bỏ các giao dịch liên quan đến địa chỉ 0 (0x000...) cho cả người gửi và người nhận.","external_knowledge":null}
{"instance_id":"sf_bq450","db":"ETHEREUM_BLOCKCHAIN","question":"Tạo một báo cáo toàn diện về tất cả các địa chỉ Ethereum hoạt động trước January 1, 2017, tính toán số dư ròng của chúng (đã điều chỉnh cho phí giao dịch và loại bỏ các giao dịch delegatecall/callcode/staticcall), theo mẫu hoạt động theo giờ, các ngày hoạt động, các chỉ số giao dịch đến/đi (số lượng, đối tác duy nhất, số ETH chuyển trung bình), tương tác với token ERC20 (số lần vào/ra, số token duy nhất, đối tác), phần thưởng khai thác, tần suất tạo hợp đồng, số giao dịch thất bại, và kích thước bytecode của hợp đồng, với mọi giá trị ETH được chuyển đổi sang đơn vị chuẩn (chia cho 10^18) và loại bỏ các địa chỉ không có lịch sử giao dịch.","external_knowledge":"ethereum_data_transformation.md"}
{"instance_id":"bq034","db":"ghcn_d","question":"Tôi muốn biết các ID và tên của các trạm khí tượng nằm trong phạm vi 50 km theo đường thẳng từ tâm của Chicago (41.8319°N, 87.6847°W).","external_knowledge":null}
{"instance_id":"bq383","db":"ghcn_d","question":"Bạn có thể cung cấp lượng mưa được ghi nhận cao nhất, nhiệt độ tối thiểu và nhiệt độ tối đa từ 15 ngày cuối cùng của mỗi năm từ 2013 đến 2016 tại trạm khí tượng USW00094846 được không? Đảm bảo mỗi giá trị đại diện cho đo lường đỉnh cao cho khoảng thời gian đó, với lượng mưa bằng milimet và nhiệt độ bằng độ C, chỉ sử dụng dữ liệu đã được xác thực (giá trị không rỗng và không có cờ chất lượng).","external_knowledge":null}
{"instance_id":"bq051","db":"new_york_ghcn","question":"Tính số chuyến Citibike trung bình mỗi ngày ở Thành phố New York trong năm 2016, phân loại các ngày là mưa nếu tổng lượng mưa vượt quá 5 milimet (được tính bằng cách chia giá trị lượng mưa thô cho 10), và ngược lại là ngày không mưa. Sử dụng dữ liệu từ trạm GHCN gần nhất nằm trong phạm vi 50 km tính từ (40.7128, -74.0060) có các phép đo hợp lệ, chưa bị gắn cờ, sau đó so sánh số chuyến Citibike trung bình trên các ngày mưa và ngày không mưa.","external_knowledge":null}
{"instance_id":"bq038","db":"new_york","question":"Xác định 10 trạm Citibike hàng đầu có tỷ lệ phần trăm cao nhất của các chuyến đi theo nhóm, được định nghĩa là các chuyến đi bắt đầu và kết thúc tại cùng một trạm mà nhiều người dùng xuất phát/đến trong cùng một cửa sổ thời gian 2 phút. Tính tỷ lệ phần trăm bằng số chuyến đi thuộc về nhóm chia cho tổng số chuyến kết thúc tại trạm đó.","external_knowledge":null}
{"instance_id":"bq053","db":"new_york","question":"Tính sự thay đổi về số lượng cây sống của từng màu lá mùa thu ở Thành phố New York từ năm 1995 đến năm 2015 bằng cách tính, đối với mỗi loài cây, hiệu giữa số lượng cây không được đánh dấu là chết vào năm 1995 và số lượng cây còn sống vào năm 2015, ghép loài theo dạng viết hoa của tên khoa học của chúng từ bảng tree_species. Sau đó, gom nhóm các loài theo màu lá mùa thu của chúng và cộng các hiệu số này lại để xác định tổng sự thay đổi về số lượng cây cho mỗi màu lá mùa thu.","external_knowledge":null}
{"instance_id":"bq054","db":"new_york","question":"Vui lòng cung cấp 10 loài cây hàng đầu ở New York, sử dụng tên Latin viết hoa khi tên Latin không rỗng và bao gồm cả tên phổ biến của chúng, hiển thị tổng số cây, số cây sống và chết cho mỗi năm, và mức tăng tương ứng trong các con số này từ năm 1995 đến năm 2015, sau đó sắp xếp theo sự chênh lệch tổng số cây giữa hai năm này.","external_knowledge":null}
{"instance_id":"bq021","db":"new_york","question":"Đối với 20 tuyến Citi Bike hàng đầu trong năm 2016, tuyến nào nhanh hơn taxi màu vàng và trong số đó, tuyến nào có thời gian đạp xe trung bình dài nhất? Vui lòng cung cấp tên trạm bắt đầu của tuyến này. Các tọa độ được làm tròn đến ba chữ số thập phân.","external_knowledge":null}
{"instance_id":"bq202","db":"new_york_plus","question":"Đối với trạm có số lượt khởi hành Citibike nhiều nhất tại đó trong năm 2018, ngày trong tuần ở dạng số và giờ trong ngày nào có số lượt chuyến đi nhiều nhất dựa trên thời gian bắt đầu của những chuyến đi đó?","external_knowledge":null}
{"instance_id":"bq185","db":"new_york_plus","question":"Thời lượng chuyến đi trung bình bằng phút cho tất cả các chuyến đi taxi Yellow hợp lệ diễn ra từ ngày 1 tháng 2 năm 2016 đến ngày 7 tháng 2 năm 2016 (bao gồm), với thời lượng chuyến đi dương, có nhiều hơn ba hành khách, và khoảng cách chuyến đi tối thiểu là mười dặm, khi cả hai địa điểm đón và trả đều nằm ở Brooklyn là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq040","db":"new_york_plus","question":"Đối với các chuyến taxi màu vàng NYC từ ngày 1 tháng 1 năm 2016 đến ngày 7 tháng 1 năm 2016, loại trừ bất kỳ chuyến đi nào được đón ở ‘EWR’ hoặc ‘Staten Island,’ xác định tỷ lệ các chuyến đi rơi vào mỗi danh mục tiền boa theo mỗi quận đón. Chỉ bao gồm các chuyến đi mà dropoff time sau pickup time, số hành khách lớn hơn 0, và trip_distance, tip_amount, tolls_amount, mta_tax, fare_amount, và total_amount đều không âm. Phân loại phần trăm tiền boa như sau: 0% (không có tiền boa), đến 5%, từ 5% đến 10%, từ 10% đến 15%, từ 15% đến 20%, từ 20% đến 25%, và trên 25%.","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq098","db":"new_york_plus","question":"Đối với các chuyến taxi màu vàng NYC mà cả điểm đón và điểm trả đều diễn ra từ ngày 1 tháng 1 năm 2016 đến ngày 7 tháng 1 năm 2016, bao gồm, hãy tính phần trăm các chuyến đi không có tiền boa trong mỗi quận đón, đảm bảo rằng chỉ những chuyến đi có điểm trả sau điểm đón mới được đưa vào, số hành khách lớn hơn 0, và khoảng cách chuyến đi, tip_amount, tolls_amount, MTA tax, fare_amount, và total_amount đều không âm; định nghĩa các chuyến đi không có tiền boa là những chuyến mà tỷ lệ tiền boa bằng 0, với tỷ lệ tiền boa được tính bằng (tip_amount × 100) chia cho total_amount (và được xem là bằng 0 khi total_amount bằng 0).","external_knowledge":"taxi_tip_rate.md"}
{"instance_id":"bq039","db":"new_york_plus","question":"Tìm mười chuyến taxi hàng đầu ở Thành phố New York trong khoảng từ ngày 1 tháng 7 năm 2016 đến ngày 7 tháng 7 năm 2016 (đảm bảo cả thời gian đón và thời gian trả đều nằm trong các ngày này) nơi số hành khách vượt quá năm, quãng đường chuyến đi tối thiểu là mười miles, và không có bất kỳ khoản phí liên quan đến tiền cước âm (bao gồm tiền tip, phí toll, mta tax, fare và tổng chi phí). Loại bỏ mọi chuyến đi mà thời gian trả không thực sự sau thời gian đón, sau đó sắp xếp kết quả theo tổng số tiền cước theo thứ tự giảm dần. Cuối cùng, hiển thị khu vực đón, khu vực trả, thời lượng chuyến đi tính bằng giây, vận tốc lái xe tính bằng miles per hour, và tỷ lệ tiền tip dưới dạng phần trăm của tổng số tiền cước.","external_knowledge":null}
{"instance_id":"bq203","db":"new_york_plus","question":"Đối với mỗi quận của Thành phố New York, có tổng cộng bao nhiêu ga tàu điện ngầm, có bao nhiêu ga có ít nhất một lối vào được đánh dấu đồng thời là một lối vào thực sự và tuân thủ ADA, và tỷ lệ phần trăm của tổng số ga ở mỗi quận là bao nhiêu, liệt kê các quận từ tỷ lệ cao nhất đến thấp nhất?","external_knowledge":null}
{"instance_id":"bq035","db":"san_francisco","question":"Tổng quãng đường mà mỗi chiếc xe đạp đã đi trong chương trình San Francisco Bikeshare là bao nhiêu, được đo bằng meters? Hãy sử dụng dữ liệu từ các chuyến đi Bikeshare và các trạm để tính toán điều này.","external_knowledge":null}
{"instance_id":"bq186","db":"san_francisco","question":"Vui lòng tìm, đối với mỗi tổ hợp năm-tháng (theo định dạng YYYYMM) được suy ra từ ngày bắt đầu của các chuyến đi thuê xe đạp ở San Francisco, thời lượng chuyến đi đầu tiên tính bằng phút, thời lượng chuyến đi cuối cùng tính bằng phút, thời lượng chuyến đi lớn nhất tính bằng phút, và thời lượng chuyến đi nhỏ nhất tính bằng phút, trong đó ‘đầu tiên’ và ‘cuối cùng’ được xác định theo trình tự thời gian của ngày bắt đầu chuyến đi, sau đó nhóm kết quả của bạn theo năm-tháng này và sắp xếp chúng theo cùng khóa năm-tháng.","external_knowledge":null}
{"instance_id":"bq081","db":"san_francisco_plus","question":"Tìm dữ liệu chuyến đi mới nhất cho mỗi khu vực từ năm 2014 đến năm 2017. Tôi muốn biết tên của mỗi khu vực, mã chuyến đi của chuyến đi này, thời lượng chuyến đi, thời điểm bắt đầu, trạm xuất phát, và giới tính của người đi xe.","external_knowledge":null}
{"instance_id":"sf_bq294","db":"SAN_FRANCISCO_PLUS","question":"Bạn có thể cung cấp chi tiết của 5 chuyến đi chia sẻ xe đạp dài nhất bắt đầu từ ngày July 1, 2017, đến ngày December 31, 2017, bao gồm mã chuyến đi, thời lượng tính bằng giây, ngày bắt đầu, tên trạm bắt đầu, lộ trình (được suy ra từ tên trạm bắt đầu đến tên trạm kết thúc), số xe đạp, loại thuê bao, năm sinh của thành viên, tuổi hiện tại của thành viên (tính theo năm hiện tại), một phân loại độ tuổi dựa trên việc thành viên có dưới 40 tuổi, từ 40 đến 60 tuổi, hoặc trên 60 tuổi, giới tính của thành viên, và tên vùng của trạm bắt đầu? Vui lòng loại bỏ bất kỳ chuyến đi nào mà tên trạm bắt đầu, năm sinh của thành viên, hoặc giới tính của thành viên không được xác định.","temporal":"Yes","external_knowledge":"trip_info.md"}
{"instance_id":"bq339","db":"san_francisco_plus","question":"Tháng nào trong năm 2017 có sự chênh lệch tuyệt đối lớn nhất giữa tổng số phút sử dụng xe đạp tích lũy cho khách hàng và người đăng ký?\tTháng nào (dưới dạng số) trong năm 2017 có sự chênh lệch tuyệt đối lớn nhất giữa tổng số phút sử dụng xe đạp tích lũy (đơn vị nghìn phút) cho khách hàng và người đăng ký, dựa trên ngày kết thúc các chuyến đi trong dữ liệu bikeshare ở San Francisco.","external_knowledge":null}
{"instance_id":"bq400","db":"san_francisco_plus","question":"Đối với các chuyến đi mà 'Clay St & Drumm St' xuất hiện trước 'Sacramento St & Davis St' trong thứ tự dừng chân (một chiều), thời gian khởi hành sớm nhất từ 'Clay St & Drumm St' và thời gian đến muộn nhất tại 'Sacramento St & Davis St' ở định dạng HH:MM:SS là gì? Vui lòng cung cấp headsign của chuyến (trip headsign) cho mỗi tuyến.","external_knowledge":null}
{"instance_id":"bq059","db":"san_francisco_plus","question":"Tốc độ trung bình cao nhất (làm tròn đến 1 chữ số thập phân, đơn vị m/s) cho các chuyến đi xe đạp ở Berkeley với quãng đường chuyến đi lớn hơn 1000 meters?","external_knowledge":null}
{"instance_id":"bq376","db":"san_francisco_plus","question":"Đối với mỗi khu phố ở San Francisco có ít nhất một trạm xe đạp chia sẻ và ít nhất một vụ phạm tội xảy ra, hãy cung cấp tên khu phố cùng với tổng số trạm xe đạp chia sẻ và tổng số vụ phạm tội trong khu vực đó.","external_knowledge":null}
{"instance_id":"sf_bq014","db":"THELOOK_ECOMMERCE","question":"Bạn có thể giúp tôi tính doanh thu cho danh mục sản phẩm có số lượng khách hàng mua hàng nhiều nhất trong đơn hàng đầu tiên của họ mà không bị hủy và không bị trả lại được không?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq188","db":"THELOOK_ECOMMERCE","question":"Trong tất cả các danh mục sản phẩm trong tập dữ liệu, hãy xác định danh mục có tổng lượng mua hàng lớn nhất (dựa trên bảng order_items), và đối với danh mục cụ thể đó, thời gian trung bình tính bằng phút mà người dùng dành cho mỗi lượt xem trang sản phẩm là bao nhiêu? Thời gian trung bình được tính bằng hiệu giữa dấu thời gian khi người dùng xem trang sản phẩm và dấu thời gian của sự kiện tiếp theo trong cùng một phiên.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq258","db":"THELOOK_ECOMMERCE","question":"Tạo báo cáo hàng tháng cho mỗi danh mục sản phẩm, sao cho mỗi hàng tương ứng với các đơn hàng có trạng thái 'Hoàn tất' và được giao trước năm 2022, nhóm theo tháng và năm giao hàng. Đối với mỗi danh mục, tính tổng doanh thu (tổng của sale_price), tổng số đơn hàng đã hoàn thành, và tính tăng trưởng theo tháng cho cả doanh thu và số đơn hàng bằng cách so sánh tổng từng tháng với tháng trước. Sau đó, đối với cùng các đơn hàng đó, tổng hợp và trình bày tổng chi phí (từ chi phí sản phẩm), lợi nhuận (doanh thu trừ tổng chi phí), và cuối cùng tỷ lệ lợi nhuận trên chi phí cho mỗi tháng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq259","db":"THELOOK_ECOMMERCE","question":"Sử dụng dữ liệu đến cuối năm 2022 và được sắp xếp theo tháng mua lần đầu của mỗi người dùng, bạn có thể cung cấp tỷ lệ phần trăm của người dùng đã thực hiện mua hàng ở tháng đầu tiên, tháng thứ hai, tháng thứ ba và tháng thứ tư kể từ lần mua đầu tiên của họ, trong đó \"tháng đầu tiên\" ám chỉ tháng họ thực hiện lần mua đầu tiên?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq189","db":"THELOOK_ECOMMERCE","question":"Chỉ dựa trên các đơn hàng đã hoàn tất, hãy tính tỷ lệ tăng trưởng phần trăm trung bình theo tháng đối với số lượng đơn hàng duy nhất (đếm các mã đơn hàng khác nhau) cho mỗi danh mục sản phẩm bằng cách so sánh số lượng của mỗi tháng với tháng trước đó trong cùng danh mục. Xác định danh mục sản phẩm có mức trung bình cao nhất của các tỷ lệ tăng trưởng đơn hàng theo tháng này. Sau đó, đối với danh mục sản phẩm cụ thể đó, hãy tính tỷ lệ tăng trưởng doanh thu trung bình theo tháng bằng cách tính sự thay đổi phần trăm của tổng doanh thu (tổng giá bán) giữa các tháng liên tiếp và lấy trung bình các giá trị này trên toàn bộ thời kỳ.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq260","db":"THELOOK_ECOMMERCE","question":"Từ January 1, 2019, đến April 30, 2022, có bao nhiêu người dùng ở độ tuổi trẻ nhất và có bao nhiêu người dùng ở độ tuổi lớn nhất cho mỗi giới tính trên nền tảng thương mại điện tử, đếm riêng số người trẻ nhất và số người lớn nhất cho mỗi giới tính?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq261","db":"THELOOK_ECOMMERCE","question":"Đối với mỗi tháng trước tháng 1 năm 2024, xác định sản phẩm có lợi nhuận tổng cao nhất (được tính bằng tổng của sale_price trừ chi phí của sản phẩm) trên tất cả các mặt hàng trong đơn hàng, sau đó báo cáo tổng chi phí và tổng lợi nhuận cho sản phẩm hàng đầu đó theo từng tháng, bao gồm tất cả các mặt hàng bất kể trạng thái của chúng, và trình bày kết quả theo thứ tự thời gian theo từng tháng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq262","db":"THELOOK_ECOMMERCE","question":"Báo cáo phân tích hàng tháng về doanh số bán hàng thương mại điện tử từ tháng 6 năm 2019 đến tháng 12 năm 2019, bao gồm, đối với từng danh mục sản phẩm và từng tháng, tổng số đơn hàng, tổng doanh thu và tổng lợi nhuận, cùng với tỷ lệ tăng trưởng theo tháng của chúng dựa trên dữ liệu từ tháng 6 năm 2019 làm cơ sở cho việc tính tăng trưởng bắt đầu từ tháng 7 năm 2019. Đảm bảo tất cả các đơn hàng được bao gồm bất kể trạng thái của chúng, và trình bày kết quả sắp xếp theo thứ tự tăng dần theo tháng (định dạng \"2019-07\") và sau đó theo danh mục sản phẩm. Loại bỏ tháng 6 năm 2019 khỏi kết quả cuối cùng nhưng dùng nó cho các tính toán tăng trưởng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq190","db":"THELOOK_ECOMMERCE","question":"Xác định số người dùng là trẻ nhất và già nhất cho mỗi giới tính (nam và nữ) riêng biệt, trong số những người đăng ký từ ngày 1 tháng 1 năm 2019 đến ngày 30 tháng 4 năm 2022. Với mỗi giới tính, xác định độ tuổi tối thiểu và tối đa trong phạm vi này, và đếm xem có bao nhiêu người dùng thuộc vào hai nhóm tuổi tương ứng với nhóm trẻ nhất và nhóm già nhất.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq263","db":"THELOOK_ECOMMERCE","question":"Vui lòng tạo một báo cáo theo tháng cho năm 2023 tập trung vào danh mục 'Sleep & Lounge', hiển thị cho mỗi tháng tổng doanh số, tổng chi phí, số đơn hàng hoàn thành, lợi nhuận ròng, và tỷ lệ lợi nhuận trên chi phí, đảm bảo rằng đơn hàng được gắn nhãn là 'Complete,' ngày tạo nằm trong khoảng từ January 1, 2023 đến December 31, 2023, và dữ liệu chi phí được liên kết chính xác với sản phẩm tương ứng thông qua các mặt hàng đơn hàng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq264","db":"THELOOK_ECOMMERCE","question":"Xác định sự khác biệt về số lượng người dùng đăng ký lớn tuổi nhất và trẻ nhất giữa January 1, 2019, và April 30, 2022, từ dữ liệu nền tảng thương mại điện tử của chúng tôi.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq197","db":"THELOOK_ECOMMERCE","question":"Đối với mỗi tháng trước tháng 7 năm 2024, xác định sản phẩm bán chạy nhất (được xác định bằng tổng lượng bán ra cao nhất, với tổng doanh thu làm tiêu chí phân biệt khi hai sản phẩm có cùng lượng bán) giữa tất cả các đơn hàng có trạng thái 'Complete' và các sản phẩm có nhãn hiệu không NULL. Trả về một báo cáo cho thấy tháng, tên sản phẩm, nhãn hiệu, danh mục, tổng doanh số, tổng doanh thu làm tròn và trạng thái đơn hàng cho các sản phẩm dẫn đầu theo tháng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq265","db":"THELOOK_ECOMMERCE","question":"Bạn có thể liệt kê địa chỉ email của 10 người dùng hàng đầu đã đăng ký vào năm 2019 và đã mua hàng vào năm 2019, xếp hạng họ theo giá trị trung bình đơn hàng cao nhất của họ, trong đó giá trị trung bình đơn hàng được tính bằng cách nhân số lượng mặt hàng trong mỗi đơn hàng với giá bán, cộng tổng số tiền này trên tất cả các đơn hàng của mỗi người dùng và sau đó chia cho tổng số đơn hàng?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq266","db":"THELOOK_ECOMMERCE","question":"Vui lòng cung cấp tên của các sản phẩm có doanh số ở từng tháng của năm 2020 và có lợi nhuận thấp nhất, được tính bằng hiệu giữa giá bán lẻ và giá vốn từ dữ liệu sản phẩm. Loại bỏ bất kỳ tháng nào mà dữ liệu này không có sẵn. Vui lòng liệt kê các sản phẩm theo thứ tự thời gian dựa trên tháng.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq333","db":"THELOOK_ECOMMERCE","question":"Ba trình duyệt nào có thời lượng phiên trung bình ngắn nhất — được tính bằng hiệu số giây giữa thời điểm sớm nhất và thời điểm muộn nhất cho mỗi phiên của người dùng — trong khi chỉ bao gồm các trình duyệt có tổng số phiên nhiều hơn 10, và thời lượng phiên trung bình tương ứng của chúng là bao nhiêu?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq361","db":"THELOOK_ECOMMERCE","question":"Đối với nhóm người dùng có ngày mua hàng đầu tiên là January 2020, tỷ lệ phần trăm người dùng quay lại trong các tháng tiếp theo của năm 2020 là bao nhiêu?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq271","db":"THELOOK_ECOMMERCE","question":"Vui lòng tạo một báo cáo cho mỗi tháng trong năm 2021, cung cấp số lượng đơn hàng, số lượng người mua duy nhất, và lợi nhuận (được tính bằng tổng giá bán lẻ của sản phẩm trừ tổng chi phí sản phẩm), trong đó các đơn hàng được đặt trong năm 2021 bởi người dùng đã đăng ký trong năm 2021 cho các mặt hàng tồn kho được tạo ra trong năm 2021, và nhóm kết quả theo quốc gia của người dùng, ngành hàng của sản phẩm, và danh mục sản phẩm.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq272","db":"THELOOK_ECOMMERCE","question":"Vui lòng cung cấp tên của ba sản phẩm có lợi nhuận cao nhất cho mỗi tháng từ tháng 1 năm 2019 đến tháng 8 năm 2022, loại trừ bất kỳ sản phẩm nào liên quan đến các đơn hàng bị hủy hoặc trả lại. Đối với mỗi sản phẩm ở mỗi tháng, lợi nhuận nên được tính bằng tổng giá bán của tất cả các mặt hàng trong các đơn hàng trừ tổng chi phí của những mặt hàng đã bán trong tháng đó.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq273","db":"THELOOK_ECOMMERCE","question":"Bạn có thể liệt kê 5 tháng từ August 2022 đến November 2023 có lợi nhuận từ các đơn hàng hoàn tất do Facebook mang lại và thể hiện mức tăng theo tháng lớn nhất không? Tính lợi nhuận bằng doanh thu trừ chi phí, group by tháng giao hàng, và chỉ bao gồm các đơn hàng được tạo trong khoảng từ August 2022 đến November 2023. So sánh lợi nhuận của từng tháng với tháng trước để tìm ra mức tăng lớn nhất.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq020","db":"GENOMICS_CANNABIS","question":"Tên của chuỗi tham chiếu có mật độ biến thể cao nhất trong tập dữ liệu bộ gen cannabis được cho trước là gì?","external_knowledge":null}
{"instance_id":"sf_bq107","db":"GENOMICS_CANNABIS","question":"Độ mật độ biến thể của tham chiếu cần sa với độ dài tham chiếu dài nhất là gì? Lưu ý rằng một biến thể được coi là có mặt nếu có ít nhất một lần gọi biến thể với kiểu gen lớn hơn 0.","external_knowledge":null}
{"instance_id":"bq025","db":"census_bureau_international","question":"Cung cấp danh sách 10 nước hàng đầu cho năm 2020, được sắp xếp theo tỷ lệ phần trăm cao nhất của dân số dưới 20 tuổi. Đối với mỗi nước, hãy nêu tổng dân số dưới 20 tuổi, tổng dân số giữa năm, và tỷ lệ dân số dưới 20 tuổi.","external_knowledge":null}
{"instance_id":"bq115","db":"census_bureau_international","question":"Quốc gia nào có tỷ lệ phần trăm dân số dưới 25 tuổi cao nhất vào năm 2017?","external_knowledge":null}
{"instance_id":"bq030","db":"covid19_open_data","question":"Tính đến May 10, 2020, trong số tất cả các quốc gia có hơn 50,000 ca mắc COVID-19 được xác nhận, ba quốc gia nào có tỷ lệ hồi phục cao nhất dựa trên tổng số ca hồi phục so với tổng số ca được xác nhận, và tỷ lệ hồi phục tương ứng của chúng được biểu diễn ở dạng phần trăm là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq018","db":"covid19_open_data","question":"Ngày nào trong tháng 3 và tháng 4 có tốc độ tăng số ca xác nhận COVID-19 cao nhất ở Hoa Kỳ? Định dạng là MM-DD.","external_knowledge":null}
{"instance_id":"bq086","db":"covid19_open_world_bank","question":"Bạn cần tính tỷ lệ phần trăm dân số của mỗi nước đã được xác nhận mắc COVID-19 cho đến ngày 30 tháng 6 năm 2020. Dữ liệu dân số cho năm 2018 có thể được tìm thấy trong bộ dữ liệu của Ngân hàng Thế giới, và dữ liệu ca mắc COVID-19 được xác nhận tích lũy có sẵn trong bộ dữ liệu COVID-19 Open Data. Tính tỷ lệ phần trăm dân số của mỗi nước đã được xác nhận mắc COVID-19 tích lũy.","external_knowledge":null}
{"instance_id":"bq085","db":"covid19_jhu_world_bank","question":"Bạn có thể cung cấp cho Hoa Kỳ, Pháp, Trung Quốc, Ý, Tây Ban Nha, Đức và Iran tổng số ca được xác nhận COVID-19 tính đến ngày 20 tháng 4 năm 2020, cùng với số ca trên 100.000 người dựa trên tổng dân số năm 2020 của họ được tính bằng cách cộng tất cả các mục dân số liên quan từ dữ liệu World Bank?","external_knowledge":null}
{"instance_id":"bq130","db":"covid19_nyt","question":"Phân tích số ca mắc mới hàng ngày của COVID-19 từ tháng 3 đến tháng 5 năm 2020, xác định năm bang của Hoa Kỳ có mức tăng hàng ngày cao nhất. Xin biên soạn một bảng xếp hạng dựa trên tần suất xuất hiện của mỗi bang trong các bảng xếp hạng top năm hàng ngày này. Sau đó, xem xét bang xếp thứ tư trong bảng tổng hợp và xác định năm huyện hàng đầu của nó dựa trên tần suất xuất hiện trong các bảng xếp hạng top năm về số ca mắc mới hàng ngày.","external_knowledge":null}
{"instance_id":"bq087","db":"covid19_symptom_search","question":"Vui lòng tính sự thay đổi phần trăm tổng thể của mức trung bình tần suất tìm kiếm hàng tuần cho triệu chứng 'Anosmia' trên năm quận của Thành phố New York—Bronx County, Queens County, Kings County, New York County, và Richmond County—bằng cách so sánh dữ liệu hợp nhất từ ngày 1 tháng 1 năm 2019 đến ngày 31 tháng 12 năm 2019 với dữ liệu hợp nhất từ ngày 1 tháng 1 năm 2020 đến ngày 31 tháng 12 năm 2020.","external_knowledge":null}
{"instance_id":"bq088","db":"covid19_symptom_search","question":"Vui lòng tính mức trung bình của các triệu chứng lo âu và trầm cảm từ dữ liệu theo quốc gia hàng tuần cho Hoa Kỳ trong các giai đoạn từ January 1, 2019, đến January 1, 2020, và từ January 1, 2020, đến January 1, 2021. Sau đó, tính phần trăm tăng lên của mức trung bình các triệu chứng này từ giai đoạn 2019 sang giai đoạn 2020.","external_knowledge":null}
{"instance_id":"bq089","db":"covid19_usa","question":"Dựa trên ước tính dân số mới nhất từ Khảo sát Cộng đồng Mỹ 5 năm 2018, số lượng điểm tiêm chủng trên mỗi 1000 người cho các hạt ở California là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq407","db":"covid19_usa","question":"Tìm ba hạt có dân số trên 50,000, dựa trên dữ liệu điều tra dân số 5 năm cho năm 2020, có tỷ lệ tử vong do COVID-19 trên ca mắc cao nhất vào ngày 27 tháng 8 năm 2020. Đối với các hạt này, cung cấp tên, tiểu bang, tuổi trung bình, tổng dân số, số ca mắc COVID-19 được xác nhận trên mỗi 100,000 người, số ca tử vong trên mỗi 100,000 người, và tỷ lệ tử vong do COVID-19 ở dạng phần trăm.","external_knowledge":null}
{"instance_id":"bq137","db":"census_bureau_usa","question":"Vui lòng tìm tất cả các khu vực mã ZIP nằm trong vòng 10 kilômét từ tọa độ (-122.3321, 47.6062) bằng cách ghép dữ liệu dân số điều tra dân số năm 2010 (chỉ tổng hợp dân số nam và nữ mà không giới hạn độ tuổi) với thông tin khu vực mã ZIP, và trả về từng khu vực với đa giác của khu vực đó, diện tích đất và diện tích mặt nước tính bằng mét vuông, vĩ độ và kinh độ, mã bang, tên bang, thành phố, quận/hạt và tổng dân số.","external_knowledge":"functions_st_dwithin.md"}
{"instance_id":"bq060","db":"census_bureau_international","question":"Ba nước có di cư ròng cao nhất vào năm 2017, ở nhóm các nước có diện tích lớn hơn 500 kilômét vuông? Và tỷ lệ di cư của chúng là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq338","db":"census_bureau_acs_1","question":"Bạn có thể tìm các khu vực census tract ở khu vực có mã ZIP 36047 nằm trong top 20 về mức tăng dân số theo phần trăm lớn nhất từ năm 2011 đến năm 2018, cũng nằm trong top 20 về mức tăng tuyệt đối lớn nhất của thu nhập trung vị trong cùng khoảng thời gian, và có trên 1,000 cư dân ở mỗi năm trong khoảng thời gian đó không?","external_knowledge":null}
{"instance_id":"bq061","db":"census_bureau_acs_1","question":"Khu vực census tract nào đã chứng kiến mức tăng lớn nhất về thu nhập trung bình giữa năm 2015 và 2018 ở California? Hãy cho tôi biết mã của khu vực đó.","external_knowledge":null}
{"instance_id":"bq064","db":"census_bureau_acs_1","question":"Sử dụng dữ liệu Census Tract năm 2017 từ các tập dữ liệu công khai BigQuery của Mỹ, bạn cần phân bổ tương ứng dân số và thu nhập của từng Census Tract cho các mã ZIP dựa trên diện tích giao nhau giữa ranh giới địa lý của chúng. Sau đó, lọc kết quả để chỉ bao gồm các mã ZIP nằm trong bán kính 5-mile quanh một điểm cụ thể ở Bang Washington, với tọa độ tại vĩ độ 47.685833°N và kinh độ -122.191667°W. Cuối cùng, tính tổng dân số và thu nhập cá nhân trung bình cho mỗi mã ZIP (làm tròn đến một chữ số thập phân) và sắp xếp kết quả theo thu nhập cá nhân trung bình giảm dần.","external_knowledge":"functions_st_intersects_area.md"}
{"instance_id":"bq461","db":"ncaa_basketball","question":"Vui lòng cung cấp một bản tóm tắt theo trình tự thời gian cho tất cả các pha ghi điểm từ trận đấu mùa giải 2014 mà Wildcats là đội chủ nhà và Fighting Irish là đội khách. Bao gồm với mỗi pha ghi điểm đồng hồ trận đấu, điểm số tích lũy của cả hai đội (Wildcats và Fighting Irish), đội ghi điểm, và mô tả của sự kiện.","external_knowledge":null}
{"instance_id":"bq198","db":"ncaa_basketball","question":"Liệt kê 5 trường đại học hàng đầu có nhiều mùa giải nhất mà họ đạt được số trận thắng tối đa trong các mùa giải bóng rổ NCAA tương ứng của họ từ 1900 đến 2000, cho thấy tổng số mùa giải đạt hiệu suất đỉnh cao như vậy của từng đội, đồng thời loại bỏ các mục thiếu tên đội.","external_knowledge":null}
{"instance_id":"bq462","db":"ncaa_basketball","question":"Vui lòng tạo một bảng từ bộ dữ liệu bóng rổ NCAA và liệt kê năm kỷ lục hàng đầu trong mỗi bốn danh mục sau: (1) Địa điểm hàng đầu - những địa điểm có sức chứa lớn nhất theo sức chứa chỗ ngồi, với Ngày được hiển thị là 'N/A'; (2) Biên độ thắng Championship lớn nhất - các trận National Championship kể từ mùa giải 2016 (season > 2015) với biên điểm lớn nhất; (3) Trận đấu có điểm số cao nhất - các trận kể từ mùa giải 2011 (season > 2010) với tổng điểm do hai đội ghi được nhiều nhất; và (4) Tổng số cú ném 3 điểm - các trận kể từ mùa giải 2011 (season > 2010) với tổng số cú ném 3 điểm được thực hiện bởi cả hai đội nhiều nhất. Bảng cuối cùng nên được tổ chức với các cột: Danh mục, Ngày, Cặp đấu hoặc Địa điểm, và Chỉ số Chính, với mỗi danh mục 5 kỷ lục được trình bày theo thứ tự giảm dần của Chỉ số Chính.","external_knowledge":null}
{"instance_id":"bq427","db":"ncaa_basketball","question":"Bạn có thể xác định, đối với mỗi loại cú ném, tọa độ x và y trung bình (điều chỉnh để đảm bảo tính nhất quán liên quan đến rổ trái hoặc rổ phải), số lượt ném trung bình, và số cú ném thành công trung bình, xem xét chỉ những cú ném được thực hiện trước ngày 15 tháng 3 năm 2018, loại trừ những cú ném có loại cú ném hoặc tọa độ NULL, đảm bảo các cú ném ở phía sân đúng theo rổ của đội.","external_knowledge":"basketball.md"}
{"instance_id":"bq428","db":"ncaa_basketball","question":"Đối với năm thị trường đội bóng hàng đầu có số lượng cầu thủ khác nhau ghi được ít nhất 15 điểm cao nhất trong hiệp thứ hai của các trận đấu từ năm 2010 đến năm 2018, hãy cung cấp chi tiết về từng trận mà họ đã tham gia trong các trận đấu lịch sử giải vô địch bóng rổ NCAA ở cùng thời kỳ, như được nêu trong tài liệu mô hình dữ liệu.","external_knowledge":"ncaa_data_model.md"}
{"instance_id":"bq144","db":"ncaa_insights","question":"Tạo một tập dữ liệu bằng cách kết hợp kết quả các trận đấu của giải vô địch bóng rổ nam NCAA từ mùa giải 2014 trở đi, bao gồm cả các trận đấu lịch sử của giải đấu và kết quả giải đấu năm 2018, với các chỉ số hiệu suất pace và hiệu quả tương ứng cho mỗi đội và đối thủ của họ từ dữ liệu feature_engineering. Tập dữ liệu nên bao gồm mùa giải, nhãn kết quả trận đấu (thắng hoặc thua), hạt giống của đội và đối thủ, tên trường, xếp hạng pace và hiệu quả, các giá trị thống kê, và sự khác biệt giữa các chỉ số của đội và đối thủ để cho phép phân tích toàn diện động lực của đội và đối thủ.","external_knowledge":"NCAA_Basketball_Tournament_SQL_Query_Variable_Guide.md"}
{"instance_id":"bq113","db":"bls","question":"Quận nào ở Utah đã trải qua mức tăng phần trăm lớn nhất về việc làm xây dựng từ năm 2000 đến năm 2018, được tính bằng cách trung bình mức lao động trong tháng thứ ba của mỗi quý ở những năm đó? Mức tăng phần trăm tương ứng là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq112","db":"bls","question":"Giữa năm 1998 và 2017, đối với Quận Allegheny ở khu vực Pittsburgh, liệu mức lương trung bình hàng năm cho tất cả các ngành có bắt kịp lạm phát của tất cả các mặt hàng tiêu dùng hay không, và trong khoảng thời gian đó, tỷ lệ tăng trưởng phần trăm tương ứng (đến hai chữ số thập phân) của tiền lương và CPI là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq055","db":"google_dei","question":"Bạn có thể cung cấp ba nhóm chủng tộc có sự khác biệt phần trăm lớn nhất giữa dữ liệu tuyển dụng tổng thể năm 2021 của Google từ dữ liệu tuyển dụng không giao thoa và các tỷ lệ trung bình trong dữ liệu BLS năm 2021 cho các ngành công nghệ được định nghĩa cụ thể là 'Internet publishing and broadcasting and web search portals,' 'Software publishers,' 'Data processing, hosting, and related services,' hoặc nhóm ngành 'Computer systems design and related services,' cùng với sự chênh lệch tương ứng của chúng không?","external_knowledge":null}
{"instance_id":"bq075","db":"google_dei","question":"Bạn có thể cung cấp một báo cáo tổng hợp cho năm 2021 so sánh phân bố theo chủng tộc (Asian, Black, Hispanic/Latinx, White) và giới tính (U.S. Women, U.S. Men) trên phạm vi tuyển dụng lực lượng lao động của Google, đại diện lực lượng lao động của Google, và dữ liệu của BLS dành cho các ngành công nghệ được định nghĩa là Internet publishing and broadcasting and web search portals hoặc Computer systems design and related services không?","external_knowledge":null}
{"instance_id":"bq406","db":"google_dei","question":"Vui lòng tính tỷ lệ tăng trưởng cho người châu Á, người da đen, người Latinx, người Mỹ bản địa, người da trắng, phụ nữ Mỹ, nam giới Mỹ, phụ nữ toàn cầu và nam giới toàn cầu từ năm 2014 đến năm 2024 liên quan đến lực lượng lao động tổng thể.","external_knowledge":null}
{"instance_id":"sf_bq084","db":"GOOG_BLOCKCHAIN","question":"Đối với mỗi tháng trong năm 2023, có tổng số giao dịch đã xảy ra là bao nhiêu (tính cả tất cả các bản ghi giao dịch mà không loại bỏ các hash giao dịch trùng lặp), và có bao nhiêu giao dịch mỗi giây được xử lý mỗi tháng, trong đó giá trị giao dịch trên mỗi giây được tính bằng cách chia tổng số giao dịch hàng tháng cho đúng số giây trong tháng đó, bao gồm logic năm nhuận đúng đắn nếu áp dụng dựa trên năm được trích xuất từ dấu thời gian giao dịch? Hiển thị tổng số giao dịch theo tháng, số giao dịch mỗi giây đã tính, năm và tháng, và trình bày các hàng theo thứ tự giảm dần của tổng số giao dịch theo tháng.","external_knowledge":null}
{"instance_id":"sf_bq058","db":"GOOG_BLOCKCHAIN","question":"Truy xuất tất cả các tiền gửi đã được hoàn tất vào Optimism tại khối 29815485 bằng Optimism Standard Bridge, bao gồm transaction hash, một liên kết Etherscan (địa chỉ URL đầy đủ), địa chỉ token L1 và L2, địa chỉ người gửi và người nhận (loại bỏ các số 0 ở đầu) và số tiền gửi (chuyển đổi từ hex sang thập phân). Đảm bảo dữ liệu được định dạng và phân tích đúng theo các tiêu chuẩn địa chỉ và token của Optimism, và loại bỏ tiền tố '0x' ngoại trừ transaction hash. Lưu ý rằng, hàm băm keccak-256 của chữ ký sự kiện Ethereum cho DepositFinalized là \"0x3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".","external_knowledge":"optimism_standard_bridge_contract.md"}
{"instance_id":"sf_bq416","db":"GOOG_BLOCKCHAIN","question":"Bạn có thể lấy ba giao dịch USDT lớn nhất trên chuỗi TRON bằng cách liệt kê số khối, địa chỉ nguồn, địa chỉ đích (ở định dạng TronLink), và lượng chuyển, sử dụng địa chỉ hợp đồng USDT '0xa614f803b6fd780986a42c78ec9c7f77e6ded13c' và chữ ký sự kiện chuyển '0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef', chia giá trị chuyển thô cho 1,000,000 để chuyển đổi thành lượng USDT cuối cùng, và sau đó sắp xếp kết quả theo thứ tự từ lớn nhất đến nhỏ nhất của lượng chuyển.","external_knowledge":"blockchain_data_transformations.md"}
{"instance_id":"sf_bq226","db":"GOOG_BLOCKCHAIN","question":"Địa chỉ người gửi, được đại diện dưới dạng URL đầy đủ trên https://cronoscan.com, đã được sử dụng nhiều nhất trên blockchain Cronos trong các giao dịch tới các trường 'to_address' có giá trị khác null, trong các khối có kích thước lớn hơn 4096 byte, kể từ ngày 1 tháng 1 năm 2023?","external_knowledge":null}
{"instance_id":"sf_bq016","db":"DEPS_DEV_V1","question":"Chỉ xem xét các phiên bản phát hành cao nhất của các gói NPM, phụ thuộc nào (gói và phiên bản của nó) xuất hiện nhiều nhất trong các phụ thuộc của các gói này?","external_knowledge":null}
{"instance_id":"sf_bq062","db":"DEPS_DEV_V1","question":"Giấy phép được sử dụng nhiều nhất bởi các gói trong mỗi hệ thống là gì?","external_knowledge":null}
{"instance_id":"sf_bq063","db":"DEPS_DEV_V1","question":"Tìm URL GitHub (với nhãn liên kết 'SOURCE_REPO') của phiên bản phát hành mới nhất của gói NPM có số lượng phụ thuộc nhiều nhất trong phiên bản phát hành mới nhất của nó, loại bỏ các gói có tên chứa ký tự '@' và chỉ xem xét các URL mà nhãn liên kết là 'SOURCE_REPO' và URL chứa 'github.com'.","external_knowledge":null}
{"instance_id":"sf_bq028","db":"DEPS_DEV_V1","question":"Chỉ xem xét các phiên bản phát hành mới nhất của các gói NPM, những gói nào là 8 gói phổ biến nhất dựa trên số sao Github, cũng như các phiên bản của chúng?","external_knowledge":null}
{"instance_id":"bq022","db":"chicago","question":"Tính thời lượng chuyến đi tối thiểu và tối đa bằng phút (làm tròn đến số nguyên gần nhất), tổng số chuyến đi, và phí trung bình cho mỗi trong sáu nhóm phân vị bằng nhau dựa trên thời lượng chuyến đi, chỉ xét các chuyến có thời lượng từ 0 đến 60 phút.","external_knowledge":null}
{"instance_id":"bq362","db":"chicago","question":"Ba công ty nào có mức tăng lớn nhất về số chuyến đi giữa hai tháng liên tiếp trong năm 2018?","external_knowledge":null}
{"instance_id":"bq363","db":"chicago","question":"Tính toán tổng số chuyến đi và phí vé trung bình (định dạng làm tròn hai chữ số thập phân) cho mười nhóm phân vị có kích thước bằng nhau. Tạo mười nhóm phân vị bằng cách phân chia chiều dài thời gian chuyến đi (từ 1-50 phút) thành các tập bằng nhau. Mỗi nhóm nên đại diện cho một số lượng giá trị phút phân biệt tương tự nhau. Hiển thị khoảng thời gian của từng nhóm được định dạng dưới dạng \"XXm to XXm\" (các chữ số được đệm bằng hai chữ số), tổng số chuyến đi cho mỗi nhóm và phí vé trung bình. Các khoảng thời gian nên đại diện cho giá trị tối thiểu và tối đa của thời lượng trong mỗi phân vị. Sắp xếp kết quả theo thứ tự thời gian của khoảng thời gian. Dùng NTILE(10) để tạo các nhóm phân vị từ các thời gian chuyến đi được sắp xếp.","external_knowledge":null}
{"instance_id":"bq076","db":"chicago","question":"Số vụ trộm xe cơ giới cao nhất xảy ra trong bất kỳ tháng nào của năm 2016 là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq077","db":"chicago","question":"Với mỗi năm từ 2010 đến 2016, số vụ trộm xe máy nhiều nhất trong một tháng là bao nhiêu?","external_knowledge":null}
{"instance_id":"sf_bq350","db":"OPEN_TARGETS_PLATFORM_1","question":"Đối với dữ liệu phân tử chi tiết, hãy hiển thị mã thuốc, loại thuốc và trạng thái thu hồi cho các thuốc được phê duyệt có cảnh báo hộp đen và loại thuốc đã biết thuộc danh sách 'Keytruda', 'Vioxx', 'Premarin', và 'Humira'.","external_knowledge":null}
{"instance_id":"sf_bq379","db":"OPEN_TARGETS_PLATFORM_1","question":"Ký hiệu mục tiêu được phê duyệt nào có điểm liên kết tổng thể gần nhất với điểm trung bình cho bệnh vảy nến?","external_knowledge":null}
{"instance_id":"sf_bq078","db":"OPEN_TARGETS_PLATFORM_2","question":"Lấy ký hiệu được phê duyệt của các gen mục tiêu có điểm tổng thể cao nhất liên quan đến bệnh 'EFO_0000676' từ nguồn dữ liệu 'IMPC'.","external_knowledge":null}
{"instance_id":"sf_bq095","db":"OPEN_TARGETS_PLATFORM_1","question":"Hãy tạo danh sách các loại thuốc từ bảng chứa các chi tiết phân tử đã hoàn tất các thử nghiệm lâm sàng cho ung thư nội tiết tuyến tụy, mã bệnh EFO_0007416. Vui lòng bao gồm tên mỗi loại thuốc, ký hiệu mục tiêu đã được phê duyệt, và liên kết đến các thử nghiệm lâm sàng liên quan.","external_knowledge":null}
{"instance_id":"bq109","db":"open_targets_genetics_1","question":"Tìm giá trị trung bình, phương sai, hiệu tối đa-tối thiểu và nguồn QTL (nghiên cứu phía bên phải) của log2(h4/h3) lớn nhất cho dữ liệu mà id của gene bên phải là \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, trait được báo cáo bao gồm \"lesterol levels\", đặc tính sinh học bên phải là \"IPSC\", và biến thể là '1_55029009_C_T'.","external_knowledge":null}
{"instance_id":"sf_bq325","db":"OPEN_TARGETS_GENETICS_2","question":"Vui lòng xác định 10 gen có liên kết mạnh nhất trên toàn bộ các nghiên cứu bằng cách trước tiên chọn, với mỗi gen trong mỗi nghiên cứu, biến thể có giá trị p nhỏ nhất, và sau đó xếp hạng tất cả các cặp gen–biến thể như vậy để trả về 10 gen có giá trị p nhỏ nhất trên toàn bộ.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq090","db":"CYMBAL_INVESTMENTS","question":"Giá trị nội tại trung bình cao hơn bao nhiêu cho các giao dịch sử dụng chiến lược feeling-lucky so với các giao dịch sử dụng chiến lược momentum trong các giao dịch mua?","external_knowledge":null}
{"instance_id":"bq442","db":"CYMBAL_INVESTMENTS","question":"Vui lòng thu thập thông tin của 6 báo cáo giao dịch có giá đóng cửa cao nhất. Hãy tham khảo tài liệu để có đầy đủ thông tin mà tôi muốn.","external_knowledge":"Trade_Capture_Report_Data_List.md"}
{"instance_id":"bq079","db":"usfs_fia","question":"Xem xét chỉ nhóm đánh giá mới nhất cho mỗi bang cho loại đánh giá 'EXPCURR', xác định bang nào có tổng diện tích đất rừng khai thác gỗ lớn nhất và bang nào có tổng diện tích đất rừng lớn nhất. Đối với đất rừng khai thác gỗ, bao gồm các plot có mã trạng thái điều kiện bằng 1, mã trạng thái dự trữ bằng 0, và mã lớp năng suất khu vực nằm trong khoảng từ 1 đến 6. Đối với đất rừng, bao gồm các plot có mã trạng thái điều kiện bằng 1. Tính tổng diện tích (acres) bằng cách cộng các hệ số mở rộng điều chỉnh cho macroplots và subplots, dựa trên cơ sở tỷ lệ tương ứng của chúng ('MACR' cho macroplots và 'SUBP' cho subplots) và các hệ số điều chỉnh khi lớn hơn 0. Đối với mỗi danh mục (đất rừng khai thác gỗ và đất rừng), cung cấp mã bang, nhóm đánh giá, tên bang và tổng diện tích cho bang có tổng diện tích lớn nhất, xem xét chỉ nhóm đánh giá mới nhất cho mỗi bang.","external_knowledge":null}
{"instance_id":"bq024","db":"usfs_fia","question":"Trong năm 2012, những nhóm đánh giá top 10 có diện tích subplot lớn nhất khi chỉ xét điều kiện có diện tích subplot lớn nhất trong mỗi nhóm? Vui lòng bao gồm nhóm đánh giá, loại đánh giá, mã trạng thái điều kiện, mô tả đánh giá, mã bang, macroplot acres, và subplot acres.","external_knowledge":null}
{"instance_id":"bq220","db":"usfs_fia","question":"Dựa trên bảng condition, plot_tree, và population trong bigquery-public-data.usfs_fia, đối với evaluation_type được đặt là 'EXPCURR' và condition_status_code bằng 1, các tiểu bang nào có kích thước subplot trung bình lớn nhất và kích thước macroplot trung bình lớn nhất, tương ứng, cho từng năm 2015, 2016 và 2017? Vui lòng bao gồm loại biểu đồ (subplot hay macroplot), năm cụ thể, tiểu bang, và kích thước trung bình tương ứng trong kết quả của bạn.","external_knowledge":"subplot_macroplot_size.md"}
{"instance_id":"bq096","db":"gbif","question":"Xác định năm nào có ngày sớm nhất sau tháng Giêng mà có hơn 10 quan sát của Sterna paradisaea được ghi nhận ở phía bắc vĩ độ 40°. Đối với mỗi năm, tìm ngày đầu tiên sau tháng Giêng có trên 10 quan sát loài này ở khu vực đó, và xác định năm có ngày sớm nhất trong số các ngày đầu tiên như vậy giữa tất cả các năm.","external_knowledge":null}
{"instance_id":"sf_bq276","db":"NOAA_PORTS","question":"Bạn có thể cung cấp danh sách đầy đủ tất cả các cảng ở vùng số 6585 nằm trong biên giới của các bang Hoa Kỳ và đã bị ảnh hưởng bởi các cơn bão được đặt tên ở khu vực Bắc Đại Tây Dương với vận tốc gió tối thiểu 35 knots và phân loại Saffir-Simpson tối thiểu ở cấp độ bão nhiệt đới, bao gồm đối với mỗi cảng tên của nó, tên bang, các năm riêng biệt mà bão đã xảy ra, tổng số cơn bão riêng biệt, các tên cơn bão riêng biệt, mức trung bình của cấp bão, vận tốc gió trung bình, và các hình học tương ứng cho cảng và khu vực bão nhiệt đới?","temporal":"Yes","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq277","db":"noaa_ports","question":"Cảng đơn lẻ nào được liệt kê dưới số vùng '6585', nằm trong biên giới của một tiểu bang Hoa Kỳ và xuất hiện nhiều nhất trong các khu vực của các cơn bão nhiệt đới được đặt tên có vận tốc gió tối thiểu 35 knots ở Bắc Đại Tây Dương, loại trừ những cơn bão được gán nhãn 'NOT_NAMED'?","external_knowledge":"persistent_udfs_routines.md"}
{"instance_id":"bq278","db":"sunroof_solar","question":"Vui lòng cung cấp một bản so sánh chi tiết về tiềm năng mặt trời cho từng bang, phân biệt giữa mức mã bưu điện và khu vực điều tra dân số. Đối với mỗi bang, hãy nêu tổng số tòa nhà có sẵn để lắp đặt hệ thống pin mặt trời, tỷ lệ phần trăm trung bình diện tích trên Google Maps được Project Sunroof phủ, tỷ lệ phần trăm trung bình của phần phủ đó phù hợp cho mặt trời, tổng số tấm pin tiềm năng, tổng công suất tính bằng kilowatt, tiềm năng phát điện, lượng CO2 được bù đắp, số lượng tòa nhà hiện có lắp đặt pin mặt trời, và khoảng cách tiềm năng lắp đặt được tính bằng cách điều chỉnh tổng số tòa nhà đủ điều kiện theo các tỷ lệ phủ và phù hợp và trừ đi số tòa nhà đang lắp đặt hiện tại.","external_knowledge":null}
{"instance_id":"bq102","db":"gnomAD","question":"Xác định các vị trí bắt đầu liên quan đến biến thể missense ở gen BRCA1 trên nhiễm sắc thể 17, nơi base tham chiếu là 'C' và base thay thế là 'T'. Sử dụng dữ liệu từ phiên bản gnomAD v2.1.1.","external_knowledge":null}
{"instance_id":"bq445","db":"gnomAD","question":"Sử dụng dữ liệu bộ gen gnomAD v2.1.1 cho nhiễm sắc thể 17, xác định vị trí bắt đầu nhỏ nhất và vị trí kết thúc lớn nhất của bất kỳ biến thể nào mà các chú thích VEP lồng nhau chứa ký hiệu 'BRCA1'. Sau đó, đối với tất cả các biến thể mà vị trí của chúng nằm trong vùng gen đó, trích xuất giá trị 'Protein_position' chỉ khi 'Consequence' bao gồm 'missense_variant', sắp xếp chúng theo thứ tự tăng dần theo 'Protein_position', và cuối cùng xuất ra kết quả đầu tiên như vậy.","external_knowledge":null}
{"instance_id":"bq103","db":"gnomAD","question":"Tạo thống kê tóm tắt các biến thể di truyền trong vùng nằm giữa vị trí 55039447 và 55064852 trên nhiễm sắc thể 1. Điều này bao gồm số biến thể, tổng số alen được quan sát, tổng số alen và các ký hiệu gen khác nhau (sử dụng Variant Effect Predictor, VEP, để chú thích gen). Thêm vào đó, tính mật độ đột biến bằng cách chia độ dài của vùng cho số biến thể. Sử dụng dữ liệu từ phiên bản gnomAD v3.","external_knowledge":null}
{"instance_id":"sf_bq104","db":"GOOGLE_TRENDS","question":"Dựa trên ngày làm mới gần đây nhất, hãy xác định từ khóa tìm kiếm đang tăng được xếp hạng cao nhất cho tuần cách đúng một năm so với tuần mới nhất có sẵn trong dữ liệu.","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf_bq411","db":"GOOGLE_TRENDS","question":"Vui lòng truy xuất ba từ khóa tìm kiếm hàng đầu của Google Trends (xếp hạng 1, 2 và 3) từ top_terms cho mỗi ngày trong tuần từ thứ Hai đến thứ Sáu giữa ngày 1 tháng 9 năm 2024 và ngày 14 tháng 9 năm 2024, được nhóm theo cột refresh_date và sắp xếp theo thứ tự giảm dần của refresh_date.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq105","db":"nhtsa_traffic_fatalities_plus","question":"Theo dữ liệu tai nạn và xao nhãng lái xe năm 2015 và 2016, và loại trừ các trường hợp mà trạng thái xao nhãng của người lái xe được ghi nhận là 'Not Distracted,' 'Unknown if Distracted,' hoặc 'Not Reported,' có bao nhiêu vụ tai nạn giao thông trên mỗi 100.000 người bị gây ra bởi sự xao nhãng khi lái xe ở từng bang của Hoa Kỳ cho hai năm đó, dựa trên dân số theo cuộc điều tra dân số năm 2010, và năm bang có tỷ lệ cao nhất mỗi năm là những bang nào?","external_knowledge":null}
{"instance_id":"bq108","db":"nhtsa_traffic_fatalities","question":"Trong tập dữ liệu năm 2015 cho các vụ tai nạn xảy ra từ tháng 1 đến tháng 8 và có hơn một người tham gia khác biệt, bao nhiêu phần trăm trong số các vụ tai nạn này có nhiều hơn một cá nhân bị thương nghiêm trọng (mức độ thương tích = 4)?","external_knowledge":null}
{"instance_id":"bq067","db":"nhtsa_traffic_fatalities","question":"Tôi muốn tạo một tập dữ liệu có nhãn từ dữ liệu tử vong do tai nạn giao thông của Cục Quản lý An toàn Giao thông Đường bộ Quốc gia (NHTSA) nhằm dự đoán xem một tai nạn giao thông có liên quan đến nhiều hơn một cá nhân riêng biệt có dẫn đến nhiều hơn một ca tử vong hay không, trong đó nhãn là 1 nếu một tai nạn có nhiều hơn một người với mã mức độ chấn thương là 4 (chấn thương tử vong) và 0 nếu ngược lại. Đối với mỗi tai nạn, hãy bao gồm các predictor số: state_number, the vehicle body_type, the number_of_drunk_drivers, the day_of_week, the hour_of_crash, và một chỉ báo nhị phân cho xem tai nạn có xảy ra ở khu vực làm việc hay không (1 nếu nó không “None,” ngược lại 0). Thêm vào đó, hãy xây dựng một đặc trưng cho sự chênh lệch tuyệt đối trung bình giữa travel_speed và speed_limit cho mỗi tai nạn, chỉ xem xét các vận tốc di chuyển lên tới 151 mph (loại trừ các mã 997, 998, 999) và giới hạn tốc độ lên tới 80 mph (loại trừ các mã 98, 99), và phân loại sự khác biệt tốc độ trung bình này thành các cấp từ 0 đến 4 theo các bậc 20 mph với giới hạn dưới bao gồm và giới hạn trên loại trừ. Cuối cùng, chỉ bao gồm các tai nạn có liên quan đến nhiều hơn một cá nhân riêng biệt.","external_knowledge":"nhtsa_traffic_fatalities.md"}
{"instance_id":"bq396","db":"nhtsa_traffic_fatalities","question":"Những bang nào nằm trong top 3 có sự chênh lệch lớn nhất về số vụ tai nạn giao thông giữa thời tiết mưa và thời tiết quang đãng trong các ngày cuối tuần năm 2016? Vui lòng cung cấp các mức chênh lệch tương ứng cho từng bang.","external_knowledge":null}
{"instance_id":"bq441","db":"nhtsa_traffic_fatalities","question":"Xin vui lòng giúp tôi tổng hợp các chi tiết quan trọng về tai nạn giao thông trong năm 2015, như được liệt kê trong tài liệu thông tin.","external_knowledge":"Traffic_Fatalities_Info_List_2015.md"}
{"instance_id":"bq097","db":"sdoh","question":"Tăng lên bao nhiêu về mức thu nhập trung bình trên mỗi công việc giữa các năm 2012 và 2017 cho mỗi khu vực địa lý ở Massachusetts (được chỉ định bằng \"MA\" ở cuối GeoName)?","external_knowledge":null}
{"instance_id":"bq120","db":"sdoh","question":"Xác định 10 khu vực hàng đầu (huyện) có tổng số hộ tham gia SNAP lớn nhất, sử dụng dữ liệu cấp huyện ACS 5 năm 2017 và dữ liệu ghi nhận tham gia SNAP từ ngày 01 tháng 01 năm 2017, loại trừ những khu vực có tổng tham gia SNAP bằng 0. Đối với mỗi khu vực này, tính tỷ lệ giữa số hộ có thu nhập dưới $20,000 và tổng số hộ tham gia SNAP.","external_knowledge":null}
{"instance_id":"bq110","db":"sdoh","question":"Sự thay đổi về số lượng cựu chiến binh vô gia cư giữa năm 2012 và 2018 cho mỗi vùng CoC ở New York có dữ liệu ở cả hai năm là gì?","external_knowledge":null}
{"instance_id":"bq395","db":"sdoh","question":"Tính tỷ lệ thay đổi phần trăm của tổng số người vô gia cư không có nơi trú ẩn từ năm 2015 đến năm 2018 cho mỗi tiểu bang bằng cách cộng dồn số liệu trên toàn bộ Continuums of Care (CoCs) trong mỗi tiểu bang. Sau đó, xác định trung bình phần trăm trên toàn quốc của các thay đổi phần trăm theo từng tiểu bang này. Xác định năm tiểu bang có mức thay đổi phần trăm gần nhất với mức trung bình quốc gia của các thay đổi phần trăm này. Vui lòng cung cấp chữ viết tắt của các tiểu bang.","external_knowledge":null}
{"instance_id":"bq352","db":"sdoh","question":"Vui lòng liệt kê số tuần mang thai trung bình trong năm 2018 cho các hạt ở Wisconsin nơi mà hơn 5% lực lượng lao động có thời gian đi làm từ 45-59 phút vào năm 2017.","external_knowledge":null}
{"instance_id":"bq074","db":"sdoh","question":"Đếm số huyện đã trải qua sự gia tăng thất nghiệp từ năm 2015 đến năm 2018, sử dụng dữ liệu ACS 5 năm, và có sự giảm số lượt người đăng ký đủ điều kiện kép giữa December 1, 2015 và December 1, 2018.","external_knowledge":null}
{"instance_id":"bq066","db":"sdoh","question":"Bạn có thể đánh giá mối quan hệ giữa tỷ lệ nghèo đói từ dữ liệu điều tra dân số của năm trước và tỷ lệ sinh không mắc bệnh lý sản khoa cho các năm 2016 đến 2018 không? Chỉ sử dụng dữ liệu cho các ca sinh mà không được báo cáo mắc bệnh lý sản khoa và đối với mỗi năm, sử dụng dữ liệu điều tra dân số 5 năm của năm trước để tính hệ số tương quan Pearson.","external_knowledge":null}
{"instance_id":"bq114","db":"openaq","question":"Ba thành phố nào có sự chênh lệch lớn nhất giữa các phép đo PM2.5 của EPA năm 1990 của họ (sử dụng units_of_measure = 'Micrograms/cubic meter (LC)' và parameter_name = 'Acceptable PM2.5 AQI & Speciation Mass') và các phép đo PM2.5 OpenAQ năm 2020 của họ (với pollutant = 'pm25' dựa trên năm được trích xuất từ dấu thời gian), với cả hai bộ dữ liệu được ghép nối theo vĩ độ và kinh độ làm tròn hai chữ số thập phân, và sự chênh lệch được sắp xếp từ lớn nhất đến nhỏ nhất?","external_knowledge":null}
{"instance_id":"bq116","db":"sec_quarterly_financials","question":"Bang nào của Hoa Kỳ báo cáo tổng doanh thu hàng năm cao nhất tính bằng tỷ đô la trong năm tài khóa 2016, xét đến các công ty đã cung cấp bốn quý dữ liệu và báo cáo các thẻ đo lường trong ('Revenues','SalesRevenueNet','SalesRevenueGoodsNet'), loại trừ bất kỳ mục nào mà trường trạng thái (stprba) là null hoặc trống?","external_knowledge":null}
{"instance_id":"sf_bq015","db":"STACKOVERFLOW_PLUS","question":"Xác định và xếp hạng 10 thẻ hàng đầu từ các câu hỏi trên Stack Overflow được tham chiếu trong bình luận của Hacker News kể từ năm 2014 bằng cách đếm số lần mỗi câu hỏi được đề cập, sau đó tách chuỗi thẻ của các câu hỏi bằng ký tự '|' làm phân tách, nhóm theo thẻ","external_knowledge":null}
{"instance_id":"bq041","db":"stackoverflow","question":"Tính toán các thống kê theo tháng cho các người dùng StackOverflow mới được tạo trong năm 2021. Đối với mỗi tháng, hãy báo cáo tổng số người dùng mới, tỷ lệ phần trăm của những người dùng mới này đã đặt ít nhất một câu hỏi trong vòng 30 ngày kể từ khi đăng ký, và trong số những người đó, tỷ lệ phần trăm đã trả lời ít nhất một câu hỏi sau câu hỏi đầu tiên của họ và trong vòng 30 ngày kể từ câu hỏi đầu tiên.","external_knowledge":null}
{"instance_id":"sf_bq121","db":"STACKOVERFLOW","question":"Uy tín trung bình và số huy hiệu của người dùng Stack Overflow biến đổi như thế nào dựa trên số năm làm thành viên đầy đủ mà họ đã có, chỉ xét những người gia nhập vào hoặc trước October 1, 2021?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq123","db":"stackoverflow","question":"Bạn cần xác định ngày trong tuần nào có phần trăm cao thứ ba của các câu hỏi trên Stack Overflow nhận được một câu trả lời trong vòng một giờ. Để làm điều này, hãy sử dụng ngày tạo câu hỏi từ bảng posts_questions và ngày tạo câu trả lời sớm nhất từ bảng posts_answers. Sau khi bạn tính được phần trăm các câu hỏi được trả lời trong vòng một giờ cho từng ngày, hãy xác định ngày có phần trăm cao thứ ba và báo cáo phần trăm đó.","external_knowledge":null}
{"instance_id":"bq280","db":"stackoverflow","question":"Vui lòng cung cấp tên hiển thị của người dùng đã trả lời nhiều câu hỏi nhất trên Stack Overflow, chỉ xét những người dùng có điểm uy tín lớn hơn 10.","external_knowledge":null}
{"instance_id":"bq300","db":"stackoverflow","question":"Số lượng câu trả lời cao nhất nhận được cho một câu hỏi cụ thể về Python 2 trên Stack Overflow là bao nhiêu, loại trừ bất kỳ cuộc thảo luận nào liên quan đến Python 3?","external_knowledge":null}
{"instance_id":"bq301","db":"stackoverflow","question":"Lấy chi tiết các câu trả lời được chấp nhận cho các câu hỏi trên Stack Overflow được đăng vào January 2016 có các thẻ bao gồm \"javascript\" và ít nhất một trong \"xss\", \"cross-site\", \"exploit\", hoặc \"cybersecurity\"; các câu trả lời này cũng phải được đăng vào January 2016. Đối với mỗi câu trả lời được chấp nhận, hãy bao gồm ID của câu trả lời, danh tiếng của người trả lời, điểm số, và số lượt bình luận, cùng với các thẻ của câu hỏi liên quan, điểm của câu hỏi, số lượt trả lời của câu hỏi, danh tiếng của người hỏi, số lượt xem, và số lượt bình luận.","external_knowledge":null}
{"instance_id":"bq302","db":"stackoverflow","question":"Tỷ lệ hàng tháng của các câu hỏi trên Stack Overflow được gắn thẻ 'python' trong năm 2022 là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq303","db":"stackoverflow","question":"From July 1, 2019 through December 31, 2019, đối với tất cả người dùng có ID nằm trong khoảng từ 16712208 đến 18712208 trên Stack Overflow, hãy truy xuất ID người dùng và các thẻ của câu hỏi liên quan cho mỗi đóng góp của họ, bao gồm bình luận trên cả câu hỏi và câu trả lời, bất kỳ câu trả lời nào họ đã đăng, và bất kỳ câu hỏi nào họ đã tự viết, đảm bảo gắn đúng bình luận hoặc câu trả lời với các thẻ của câu hỏi cha mà nó thuộc.","external_knowledge":null}
{"instance_id":"bq304","db":"stackoverflow","question":"Lấy 50 câu hỏi được xem nhiều nhất cho từng thẻ liên quan đến Android sau đây trên StackOverflow: 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps', và 'android-asynctask'. Mỗi câu hỏi phải chứa từ 'how' ở tiêu đề hoặc nội dung và không được chứa bất kỳ thuật ngữ khắc phục sự cố nào trong tiêu đề hoặc nội dung: 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve', hoặc 'trouble'. Chỉ bao gồm các thẻ có ít nhất 50 câu hỏi đáp ứng các tiêu chí này, và đối với mỗi thẻ như vậy, chọn 50 câu hỏi hàng đầu được xếp hạng theo lượt xem.","external_knowledge":null}
{"instance_id":"bq310","db":"stackoverflow","question":"Tiêu đề của câu hỏi \"how\" được xem nhiều nhất liên quan đến phát triển Android trên StackOverflow, theo các nhãn được chỉ định như 'android-layout', 'android-activity', 'android-intent', và các nhãn khác","external_knowledge":null}
{"instance_id":"bq305","db":"stackoverflow","question":"Những người dùng nào có tổng lượt xem cao nhất đối với các câu hỏi mà họ liên kết, trong đó một người dùng được coi là liên kết nếu họ sở hữu câu hỏi, hoặc câu trả lời của họ là câu trả lời được chấp thuận, hoặc điểm của câu trả lời của họ lớn hơn 5, hoặc điểm của câu trả lời của họ vượt quá 20% tổng điểm các câu trả lời cho câu hỏi đó (và lớn hơn 0), hoặc câu trả lời của họ nằm trong top ba câu trả lời có điểm cao nhất cho câu hỏi đó?","external_knowledge":null}
{"instance_id":"bq306","db":"stackoverflow","question":"Xác định 10 thẻ hàng đầu cho người dùng 1908967, dựa chỉ vào các câu trả lời được đăng trước June 7, 2018, trong đó mỗi thẻ có điểm bằng 10 lần số lượt upvote (vote_type_id=2) và 15 lần số lượt đã chấp nhận (vote_type_id=1). Lấy thẻ từ các câu hỏi liên quan đến những câu trả lời đó, và chỉ xét các lượt upvote và các lượt chấp nhận cho những câu trả lời đó. Trả về các thẻ có tổng điểm cao nhất theo thứ tự giảm dần, giới hạn 10 thẻ.","external_knowledge":null}
{"instance_id":"sf_bq307","db":"STACKOVERFLOW","question":"Tìm 10 huy hiệu vàng hàng đầu mà người dùng thường nhận được như huy hiệu vàng đầu tiên của họ trên Stack Overflow. Đối với từng huy hiệu trong số này, hãy hiển thị tên huy hiệu, số người dùng đã nhận huy hiệu đó như huy hiệu vàng đầu tiên của họ, và số ngày trung bình từ ngày tạo tài khoản của người dùng đến ngày họ nhận được huy hiệu, được tính bằng ngày mà không có bất kỳ điều chỉnh nào đối với định dạng ngày.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq308","db":"stackoverflow","question":"Hiển thị số lượng câu hỏi được đăng trên Stack Overflow vào mỗi ngày trong tuần của năm 2021, và cho biết có bao nhiêu câu hỏi và tỷ lệ phần trăm trong số đó được trả lời trong vòng một giờ.","external_knowledge":null}
{"instance_id":"bq309","db":"stackoverflow","question":"Truy vấn 10 câu hỏi dài nhất trên Stack Overflow, được đo bằng độ dài của nội dung câu hỏi, với điều kiện mỗi câu hỏi hoặc có câu trả lời được chấp thuận hoặc không có câu trả lời được chấp thuận nhưng có ít nhất một câu trả lời có tỉ lệ điểm trên lượt xem vượt quá 0.01. Đối với từng câu hỏi trong số này, bao gồm uy tín của người dùng đã đặt câu hỏi, tổng phiếu ròng của người dùng đó (tính bằng tổng up_votes trừ đi_down_votes), và tổng số huy hiệu mà người dùng ấy đã kiếm được.","external_knowledge":null}
{"instance_id":"bq124","db":"fhir_synthea","question":"Trong tổng số tất cả bệnh nhân, có bao nhiêu cá nhân vẫn còn sống (tức là không có deceased.dateTime được ghi nhận), có chẩn đoán là đái tháo đường hoặc tăng huyết áp, và được kê đơn ít nhất bảy loại thuốc đang dùng khác nhau?","external_knowledge":null}
{"instance_id":"bq391","db":"fhir_synthea","question":"Trong số các bệnh nhân đang sống có họ bắt đầu bằng chữ cái \"A\" và mỗi người có đúng một tình trạng duy nhất, tám tình trạng nào có số lượng thuốc đang dùng khác nhau nhiều nhất được kê cho bất kỳ bệnh nhân đơn lẻ nào, và mã tương ứng của chúng là gì?","external_knowledge":null}
{"instance_id":"bq126","db":"the_met","question":"Các tiêu đề, tên nghệ sĩ, phương tiện và URL hình ảnh gốc của các đối tượng có chữ 'Photograph' trong tên của chúng từ bộ phận 'Photographs', được tạo ra không bởi một nghệ sĩ vô danh, với ngày kết thúc đối tượng là năm 1839 hoặc sớm hơn?","external_knowledge":null}
{"instance_id":"bq366","db":"the_met","question":"Ba nhãn được liên kết nhiều nhất với các tác phẩm từ mỗi thời kỳ lịch sử trong bộ sưu tập của The Met, chỉ xét các nhãn liên kết với 500 tác phẩm trở lên? Hãy cung cấp cho tôi thời kỳ, nhãn và số lượng liên quan.","external_knowledge":null}
{"instance_id":"bq414","db":"the_met","question":"Lấy id đối tượng, tiêu đề, và ngày metadata được định dạng (dưới dạng chuỗi ở định dạng 'YYYY-MM-DD') cho các đối tượng trong phòng ban \"The Libraries\" where cropConfidence > 0.5, tiêu đề của đối tượng chứa từ \"book\".","external_knowledge":null}
{"instance_id":"bq200","db":"mlb","question":"Sử dụng dữ liệu từ cả mùa giải thông thường và vòng playoffs, xác định người ném bóng đạt tốc độ ném cao nhất không bằng 0 cho từng đội bằng cách xác nhận xem mã ID của người ném bóng có xuất hiện trong danh sách người chơi của đội chủ nhà hoặc đội khách cho trận đấu đó hay không, sau đó lấy tên đầy đủ của người ném bóng đó cùng với tốc độ ném hợp lệ tối đa mà họ đạt được khi thi đấu cho đội cụ thể đó.","external_knowledge":null}
{"instance_id":"sf_bq458","db":"WORD_VECTORS_US","question":"Phân tách nội dung văn bản của mỗi bài viết thành các từ, loại bỏ các từ dừng, và lấy các vector từ tương ứng cho các từ này từ vector GloVe. Đối với mỗi từ, gán trọng vector từ của nó bằng cách chia từng thành phần cho lũy thừa 0.4 của tần suất từ tương ứng trong tập tần suất từ. Sau đó, đối với mỗi bài viết, tổng hợp các vector từ được gán trọng này bằng cách cộng các thành phần của chúng để hình thành một vector bài viết. Chuẩn hóa mỗi vector bài viết để có độ dài bằng 1 bằng cách chia cho độ lớn của nó. Cuối cùng, lấy ID, ngày, tiêu đề và vector bài viết đã chuẩn hóa cho mỗi bài viết.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq459","db":"WORD_VECTORS_US","question":"Vui lòng tìm 10 bài viết liên quan hàng đầu bằng cách chỉ xử lý trường 'body' của mỗi bài viết, trong đó mỗi 'body' được phân tách thành các token mà không loại bỏ stopwords, mỗi token còn lại được chuyển thành một vector từ dựa trên GloVe và được gán trọng bằng cách chia mỗi phần tử cho lũy thừa 0.4 của tần suất từ, sau đó các vector có trọng số này được cộng lại và chuẩn hóa để tạo thành một vector đơn vị cho mỗi bài viết. Thực hiện cùng một cách gán trọng và chuẩn hóa trên cụm từ truy vấn 'Epigenetics and cerebral organoids: promising directions in autism spectrum disorders' và tính độ tương đồng cosine giữa vector truy vấn và từng vector của bài viết. Cuối cùng, trả về id, ngày tháng, tiêu đề và điểm số độ tương đồng cosine cho 10 bài viết có mức độ tương đồng cao nhất.","external_knowledge":"tokenize_func.md"}
{"instance_id":"sf_bq460","db":"WORD_VECTORS_US","question":"Vui lòng xử lý các bài viết từ bộ dữ liệu 'nature' bằng cách đầu tiên phân tách phần thân văn bản thành các từ và loại bỏ các từ dừng. Đối với mỗi từ còn lại, truy xuất vector từ của nó từ bảng glove_vectors và tần suất của nó từ bảng word_frequencies, sau đó chia mỗi vector từ cho lũy thừa 0.4 của tần suất từ để gán trọng số cho nó. Cộng các vector có trọng số lại với nhau để thu được một vector tổng hợp cho mỗi bài viết, chuẩn hóa vector tổng hợp này về độ dài đơn vị, và sau đó tính toán các điểm tương đồng cosine giữa các vector được chuẩn hóa này. Cuối cùng, trả về các ID, ngày tháng, tiêu đề và các điểm tương đồng cosine của top 10 bài viết có mức độ tương đồng cao nhất với bài viết có ID '8a78ef2d-d5f7-4d2d-9b47-5adb25cbd373'.","external_knowledge":"tokenize_func.md"}
{"instance_id":"bq204","db":"eclipse_megamovie","question":"Tìm người dùng có tổng lượt nhấp chuột cao nhất trên tất cả các bản ghi từ tất cả các bộ sưu tập ảnh có sẵn.","external_knowledge":null}
{"instance_id":"bq389","db":"epa_historical_air_quality","question":"Vui lòng tính mức trung bình hàng tháng của PM10, PM2.5 FRM, PM2.5 non-FRM, các chất hữu cơ bay hơi, SO2 (được nhân với hệ số 10), và chì (được nhân với hệ số 100) ở California cho năm 2020.","external_knowledge":null}
{"instance_id":"sf_bq345","db":"IDC","question":"Kích thước của các tập tin DICOM có các modality SEG hoặc RTSTRUCT và SOP Class UID \"1.2.840.10008.5.1.4.1.1.66.4\" lớn đến mức nào, khi được nhóm theo collection, study, và series IDs, nếu chúng không có tham chiếu đến các series, hình ảnh hoặc nguồn khác? Bạn có thể cung cấp thêm một URL viewer được định dạng như \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" theo study ID, và liệt kê các kích thước này ở kilobytes, sắp xếp từ lớn nhất đến nhỏ nhất?","external_knowledge":null}
{"instance_id":"sf_bq346","db":"IDC","question":"Trong dữ liệu DICOM công khai mà Modality là 'SEG' và SOPClassUID là '1.2.840.10008.5.1.4.1.1.66.4', và mỗi phân đoạn tham chiếu tới SOPInstanceUID gốc của nó, năm loại phân đoạn nào (theo 'SegmentedPropertyCategory.CodeMeaning') xuất hiện nhiều nhất?","external_knowledge":null}
{"instance_id":"sf_bq347","db":"IDC","question":"Trong hợp nhất của các chuỗi MR được chỉ định với SeriesInstanceUID 1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147 và tất cả các trường hợp phân đoạn liên quan, loại hình ảnh nào có tổng số SOP instances lớn nhất, và có bao nhiêu?","external_knowledge":null}
{"instance_id":"sf_bq390","db":"IDC","question":"Trong bộ sưu tập \"qin_prostate_repeatability\", vui lòng cung cấp các StudyInstanceUID khác nhau cho các nghiên cứu có hình ảnh MRI T2-weighted cắt ngang và cũng chứa các phân đoạn cấu trúc giải phẫu được gắn nhãn là \"vùng ngoại biên\".","external_knowledge":null}
{"instance_id":"sf_bq421","db":"IDC","question":"Bạn có thể liệt kê mọi cặp duy nhất giữa chất nền nhúng và ý nghĩa mã của chất nhuộm, cùng với số lần xuất hiện cho mỗi cặp, dựa trên các mã chất nền nhúng và chất nhuộm riêng biệt từ chế độ 'SM' trong tập dữ liệu DICOM của các chuỗi chuẩn bị mẫu chưa được lồng ghép, đảm bảo rằng các mã này thuộc hệ mã SCT?","external_knowledge":null}
{"instance_id":"sf_bq422","db":"IDC","question":"Sử dụng các hình ảnh CT trong thư viện 'nlst', tính toán và so sánh hai chỉ số riêng biệt: 1) kích thước chuỗi trung bình tính bằng MiB cho 3 bệnh nhân có độ chênh lệch giữa các khoảng cách lát tối đa (được định nghĩa là hiệu giữa khoảng cách lát tối đa và tối thiểu trên tất cả các chuỗi của họ), và 2) kích thước chuỗi trung bình tính bằng MiB cho 3 bệnh nhân có sự chênh lệch phơi sáng tối đa (được định nghĩa là hiệu giữa giá trị phơi sáng tối đa và tối thiểu trên tất cả các chuỗi của họ). Đối với mỗi bệnh nhân, tính kích thước chuỗi bằng cách cộng kích thước của tất cả hình ảnh trong chuỗi đó và quy đổi sang MiB. Trả kết quả thành hai nhóm riêng biệt được gắn nhãn \"Top 3 theo Khoảng cách lát cắt\" và \"Top 3 theo Độ phơi sáng tối đa\" với kích thước chuỗi trung bình tương ứng.","external_knowledge":null}
{"instance_id":"sf_bq069","db":"IDC","question":"Bạn có thể giúp tôi tạo một báo cáo về các chuỗi hình ảnh CT từ bảng dicom_all sao cho tất cả chuỗi từ NLST bị loại trừ, bất kỳ chuỗi localizers hoặc chuỗi nén JPEG (transfer syntaxes 1.2.840.10008.1.2.4.70 hoặc 1.2.840.10008.1.2.4.51) đều bị bỏ qua, và chỉ những chuỗi vượt qua một số kiểm tra hình học — tức là có một hướng duy nhất, khoảng cách pixel giống nhau, số lượng SOP instance và số lượng vị trí khớp, hàng pixel và cột đồng nhất, và tích vô hướng của các vector định hướng hình ảnh gần bằng 1 — được bao gồm, đồng thời tính toán sự khác biệt khoảng cách lát cắt, sự khác biệt phơi sáng, và kích thước chuỗi ước lượng theo MB cho mỗi chuỗi đủ điều kiện.","external_knowledge":"nonNlstCohort.md"}
{"instance_id":"sf_bq219","db":"IOWA_LIQUOR_SALES","question":"Trong bộ dữ liệu Iowa Liquor Sales, bắt đầu từ ngày 1 tháng 1 năm 2022 cho đến tháng cuối cùng được hoàn tất đầy đủ, hai danh mục rượu nào, mỗi danh mục đóng góp trung bình ít nhất 1% tổng khối lượng bán hàng hàng tháng trong ít nhất 24 tháng dữ liệu có sẵn, có hệ số tương quan Pearson thấp nhất khi so sánh tỷ lệ phần trăm doanh số rượu theo từng tháng của chúng với tổng doanh số rượu trong các tháng đó, và tên của chúng là gì?","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq199","db":"iowa_liquor_sales","question":"Xác định 10 loại rượu hàng đầu ở Iowa trong năm 2021 bằng cách tính, đối với mỗi loại, mức trung bình của giá bán lẻ trên mỗi lít trên tất cả các giao dịch bán hàng thuộc loại đó trong năm 2021. Đối với các loại hàng đầu này, hãy cung cấp giá bán lẻ trên mỗi lít trung bình được tính theo cùng cách cho các năm 2019, 2020 và 2021.","external_knowledge":null}
{"instance_id":"bq218","db":"iowa_liquor_sales","question":"Top 5 mặt hàng có mức tăng trưởng theo năm cao nhất trong tổng doanh thu bán hàng cho năm 2023 là gì?","external_knowledge":null}
{"instance_id":"bq049","db":"iowa_liquor_sales_plus","question":"Vui lòng hiển thị doanh số Bourbon Whiskey bình quân theo đầu người theo tháng trong năm 2022 ở Dubuque County cho mã ZIP xếp thứ ba về tổng doanh số Bourbon Whiskey, chỉ sử dụng dân số từ 21 tuổi trở lên.","external_knowledge":null}
{"instance_id":"bq360","db":"nppes","question":"Trong số các nhà cung cấp dịch vụ chăm sóc sức khỏe có địa điểm thực hành ở Mountain View, CA, và có chuyên môn được chỉ định trong lĩnh vực phân loại của nhà cung cấp chăm sóc sức khỏe, xác định 10 chuyên môn phổ biến nhất dựa trên số lượng NPIs khác nhau. Sau đó xác định chuyên môn trong số 10 chuyên môn hàng đầu đó có số lượng NPIs khác nhau gần nhất với mức trung bình của số lượng NPIs giữa 10 chuyên môn đó.","external_knowledge":null}
{"instance_id":"bq286","db":"usa_names","question":"Bạn có thể cho tôi biết tên của bé gái phổ biến nhất ở tiểu bang Wyoming trong năm 2021, được xác định dựa trên tỷ lệ phần trăm số bé gái có tên đó so với tổng số bé gái có cùng tên đó ở tất cả các bang.","external_knowledge":null}
{"instance_id":"sf_bq044","db":"TCGA","question":"Đối với bệnh nhân ung thư bàng quang có đột biến ở gene CDKN2A (cyclin-dependent kinase inhibitor 2A), dựa trên dữ liệu lâm sàng từ Genomic Data Commons Release 39, họ có những loại đột biến nào, giới tính của họ là gì, tình trạng sống sót, và số ngày đến khi tử vong - và đối với bốn downstream genes (MDM2 (MDM2 proto-oncogene), TP53 (tumor protein p53), CDKN1A (cyclin-dependent kinase inhibitor 1A), và CCNE1 (Cyclin E1)), mức biểu hiện gen cho mỗi bệnh nhân là gì?","external_knowledge":"TCGA_Study_Abbreviations.md"}
{"instance_id":"sf_bq043","db":"TCGA","question":"Các mức biểu hiện RNA của các gen MDM2, TP53, CDKN1A và CCNE1 là bao nhiêu, cùng với thông tin lâm sàng liên quan, ở bệnh nhân ung thư bàng quang có đột biến CDKN2A trong dự án 'TCGA-BLCA'? Sử dụng dữ liệu lâm sàng từ Genomic Data Commons Release 39, dữ liệu về đột biến soma được lấy từ tham chiếu bộ gen người hg19 vào Feb 2017.","external_knowledge":null}
{"instance_id":"bq143","db":"CPTAC_PDC","question":"Sử dụng dữ liệu CPTAC proteomics và RNAseq cho ung thư thận tế bào sáng để chọn các mẫu 'Primary Tumor' và 'Solid Tissue Normal'. JOIN các tập dữ liệu dựa trên IDs người nộp mẫu và ký hiệu gen. Tính tương quan giữa sự phong phú protein (log2 ratio) và mức biểu hiện gen (log-transformed+1 FPKM) cho mỗi gene và loại mẫu. Lọc bỏ các tương quan có trị tuyệt đối lớn hơn 0.5, và tính tương quan trung bình cho mỗi loại mẫu.","external_knowledge":null}
{"instance_id":"sf_bq147","db":"TCGA","question":"Bạn có thể xác định các ca ung thư vú TCGA từ giải trình tự RNA hg38 r35` nơi gene protein_coding và dự án TCGA-BRCA tồn tại, và có các mẫu giải trình tự RNA của nhiều loại mô—bao gồm \"Solid Tissue Normal\"—trong cùng một ca?","external_knowledge":null}
{"instance_id":"sf_bq148","db":"TCGA","question":"Bạn có thể xác định năm gen mã hóa protein có phương sai biểu hiện cao nhất (được đo bằng fpkm_uq_unstranded) đặc biệt trong các mẫu 'Solid Tissue Normal' không? Hạn chế phân tích cho các trường hợp thuộc dự án TCGA-BRCA có ít nhất một mẫu 'Solid Tissue Normal'.","external_knowledge":null}
{"instance_id":"sf_bq175","db":"TCGA_MITELMAN","question":"Xác định các cytoband trên NST số 1 trong tập dữ liệu phân đoạn alen TCGA-KIRC, nơi tần suất của các lần khuếch đại (amplifications), tăng số bản sao (gains), và mất một bản sao dị hợp tử (heterozygous deletions) lần lượt nằm trong top 11. Tính toán các thứ hạng này dựa trên số bản sao tối đa được quan sát qua các nghiên cứu bộ gen về ung thư thận, phản ánh mức độ nghiêm trọng của các biến đổi di truyền.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"sf_bq176","db":"TCGA_MITELMAN","question":"Xác định các mã vạch ca bệnh từ nghiên cứu TCGA-LAML có số lượng sao chép trung bình có trọng số cao nhất tại cytoband 15q11 trên nhiễm sắc thể 15, bằng cách sử dụng dữ liệu phân đoạn và sự chồng lên của cytoband từ cơ sở dữ liệu genôm của TCGA và Mitelman.","external_knowledge":null}
{"instance_id":"sf_bq170","db":"TCGA_MITELMAN","question":"Đối với các trường hợp ung thư vú (TCGA-BRCA) từ Release 23 của kho lưu trữ GDC đang hoạt động, xác định và phân loại biến đổi số lượng sao chép (CNVs) trên tất cả các vùng cytoband ở mọi nhiễm sắc thể. Đối với mỗi vùng cytoband và mỗi trường hợp, xác định sự giao nhau giữa vùng cytoband và các đoạn số sao chép của trường hợp đó, và tính số sao chép trung bình có trọng số theo độ chồng lấp cho vùng cytoband đó trong trường hợp, làm tròn đến số nguyên gần nhất. Phân loại số sao chép đã được làm tròn thành các loại CNV như sau: mất đoạn đồng hợp tử (0), mất đoạn dị hợp tử (1), trạng thái lưỡng bội bình thường (2), tăng (3), và khuyếch đại (amplifications) (lớn hơn 3). Đối với mỗi vùng cytoband, cung cấp tên của nó và vị trí bắt đầu và kết thúc, và tính tần suất của từng loại CNV trên toàn bộ các trường hợp như một phần trăm của tổng số trường hợp, làm tròn hai chữ số thập phân.","external_knowledge":"copy_number_variations.md"}
{"instance_id":"sf_bq150","db":"TCGA_HG19_DATA_V0","question":"Đánh giá xem các biến thể di truyền khác có ảnh hưởng đến mức biểu hiện của TP53 đã được biến đổi log10 trong các mẫu TCGA-BRCA khi sử dụng dữ liệu giải trình tự và dữ liệu đột biến. Cung cấp tổng số mẫu, số loại đột biến, giá trị bình phương trung bình giữa các nhóm, giá trị bình phương trung bình trong các nhóm, và giá trị F.","external_knowledge":"TCGA_F_Score.md"}
{"instance_id":"sf_bq152","db":"TCGA_HG38_DATA_V0","question":"Đối với các trường hợp ung thư vú (TCGA-BRCA) từ Release 23 của kho lưu trữ GDC đang hoạt động, xác định và phân loại biến đổi số sao chép (CNVs) trên tất cả các cytoband trên mọi nhiễm sắc thể. Với mỗi cytoband và mỗi trường hợp, xác định sự chồng lấn giữa vùng cytoband và các đoạn số sao chép của trường hợp, và tính số sao chép trung bình có trọng số của sự chồng lấn cho cytoband đó ở trường hợp, làm tròn đến số nguyên gần nhất. Phân loại số sao chép đã được làm tròn thành các loại CNV như sau: mất đồng hợp tử (0), mất dị hợp tử (1), trạng thái lưỡng bội bình thường (2), tăng (3), và khuếch đại (lớn hơn 3). Đối với mỗi cytoband, cung cấp tên và vị trí bắt đầu/kết thúc, và tính tần suất của từng loại CNV trên toàn bộ các trường hợp như một phần trăm của tổng số trường hợp, làm tròn hai chữ số thập phân.","external_knowledge":null}
{"instance_id":"sf_bq155","db":"TCGA_HG38_DATA_V0","question":"Trong cohort TCGA-BRCA của những bệnh nhân có tuổi bằng hoặc nhỏ hơn 80 tại thời điểm chẩn đoán và có giai đoạn mô học là Stage I, Stage II, hoặc Stage IIA, hãy tính giá trị t được suy ra từ hệ số tương quan Pearson giữa mức biểu hiện RNA-Seq trung bình được chuyển đổi log10 (sử dụng HTSeq__Counts + 1) của gen SNORA31 và mức biểu hiện microRNA-Seq trung bình của tất cả các microRNA độc nhất, chỉ xem xét các cặp có hơn 25 mẫu và sao cho giá trị tuyệt đối của hệ số tương quan Pearson nằm trong khoảng từ 0.3 đến 1.0.","external_knowledge":null}
{"instance_id":"sf_bq141","db":"TCGA_HG38_DATA_V0","question":"Sử dụng bộ dữ liệu TCGA-KIRP, chọn bệnh nhân từ bảng 'TCGA_bioclin_v0.Clinical' có clinical_stage không rỗng và disease_code bằng 'KIRP'. Lấy dữ liệu biểu hiện gen của họ từ bảng 'TCGA_hg38_data_v0.RNAseq_Gene_Expression' cho các gene 'MT-CO3,' 'MT-CO1,' và 'MT-CO2,' và ngẫu nhiên chia bệnh nhân thành một tập huấn luyện (90%) và một tập kiểm tra (10%) dựa trên case_barcode thông qua phương pháp FARM_FINGERPRINT. Đối với mỗi clinical_stage trong tập huấn luyện, tính giá trị trung bình HTSeq__FPKM_UQ biểu hiện của ba gene. Đối với mỗi bệnh nhân trong tập kiểm tra, tính khoảng cách Euclidean giữa các giá trị biểu hiện của bệnh nhân và các giá trị trung bình theo clinical_stage, và gán bệnh nhân đó cho clinical_stage có giá trị trung bình gần nhất. Cuối cùng, xuất case_barcode và clinical_stage được dự đoán.","external_knowledge":null}
{"instance_id":"bq046","db":"TCGA_bioclin_v0","question":"Tìm mã vạch ca bệnh và URL tệp GDC tương ứng cho các bệnh nhân nữ ở độ tuổi 30 hoặc nhỏ hơn được chẩn đoán mắc ung thư vú (BRCA) trong cơ sở dữ liệu TCGA. Truy vấn nên xác định trước các bệnh nhân từ bảng Annotations nơi entity_type là \"Patient\" và hoặc category là \"History of unacceptable prior treatment related to a prior/other malignancy\" hoặc classification là \"Redaction\". Cũng xác định các bệnh nhân từ bảng Clinical với disease_code \"BRCA\", age_at_diagnosis nhỏ hơn hoặc bằng 30, và gender \"FEMALE\". Thực hiện FULL JOIN giữa hai tập này, nhưng chỉ giữ các bệnh nhân mà cả categoryName và classificationName đều NULL trong kết quả cuối cùng. Sử dụng siêu dữ liệu GDC từ release archive 14 (cụ thể các bảng rel14_caseData, rel14_fileData_current, và rel14_GDCfileID_to_GCSurl_NEW) để lấy các URL tệp tương ứng.","external_knowledge":null}
{"instance_id":"sf_bq153","db":"PANCANCER_ATLAS_1","question":"Tính toán, đối với mỗi loại mô học được chỉ định trong trường 'icd_o_3_histology' (loại trừ những loại được bao quanh bằng dấu ngoặc vuông), trung bình của mức biểu hiện log10(normalized_count + 1) trung bình trên mỗi bệnh nhân của gen IGF2 ở các bệnh nhân LGG có dữ liệu biểu hiện IGF2 hợp lệ. Ghép nối dữ liệu biểu hiện gen và dữ liệu lâm sàng bằng trường ParticipantBarcode.","external_knowledge":null}
{"instance_id":"sf_bq154","db":"PANCANCER_ATLAS_1","question":"Tính điểm H Kruskal-Wallis giữa các nhóm bệnh nhân LGG về biểu hiện của gen IGF2, trong đó biểu hiện IGF2 của mỗi bệnh nhân được xác định bằng cách áp dụng log10(normalized_count + 1) và sau đó lấy trung bình trên các mẫu. Ghép nhóm bệnh nhân theo các mã mô học ICD-O-3, loại bỏ bất kỳ mã nào được đóng kín hoàn toàn bằng dấu ngoặc vuông, chỉ bao gồm các nhóm có nhiều hơn một bệnh nhân, và đảm bảo rằng normalized_count không được để trống. Cuối cùng, trả về tổng số nhóm, tổng số mẫu, và điểm H Kruskal-Wallis ở thứ tự giảm dần.","external_knowledge":"Regulome_Explorer_Kruskal-Wallis_test_for_numerical_and_categorical_data.md"}
{"instance_id":"sf_bq156","db":"PANCANCER_ATLAS_1","question":"Tính t-score (làm tròn đến 2 chữ số thập phân) để so sánh sự khác biệt về mức biểu hiện trung bình của gen DRG2 giữa hai nhóm (đột biến TP53 so với không đột biến) trong nghiên cứu Gliôm cấp độ thấp (LGG), nơi mức biểu hiện được tính bằng trung bình của log10(normalized_count + 1) cho mỗi người tham gia, chỉ xem xét các mẫu có đột biến TP53 có trạng thái 'FILTER' là 'PASS' trong dữ liệu đột biến, và bỏ qua bất kỳ nhóm nào có ít hơn 10 mẫu hoặc có phương sai bằng 0; tham khảo `t_score.md` để biết phương pháp tính t-score.","external_knowledge":"t_score.md"}
{"instance_id":"sf_bq157","db":"PANCANCER_ATLAS_1","question":"Vui lòng tính điểm T để xác định sự khác biệt thống kê trong biểu hiện của gen DRG2 giữa các bệnh nhân LGG có và không có đột biến TP53: với mỗi bệnh nhân, tính trung bình của log10(normalized_count + 1) biểu hiện DRG2 trên tất cả các mẫu của họ, chỉ sử dụng các mẫu có mặt trong bảng `MC3_MAF_V5_one_per_tumor_sample` cho nghiên cứu LGG; xác định các bệnh nhân có đột biến TP53 từ bảng này nơi `Hugo_Symbol` là 'TP53' và `FILTER` là 'PASS'; sau đó thực hiện một kiểm định t (T-test) so sánh trung bình biểu hiện DRG2 đã được biến đổi log giữa các bệnh nhân có và không có đột biến TP53.","external_knowledge":"Regulome_Explorer_T_test_for_numerical_and_binary_data.md"}
{"instance_id":"sf_bq158","db":"PANCANCER_ATLAS_1","question":"Trong PanCancer Atlas, năm loại mô học của ung thư vú (BRCA) có tỷ lệ đột biến trên gen CDH1 cao nhất không?","external_knowledge":null}
{"instance_id":"sf_bq159","db":"PANCANCER_ATLAS_1","question":"Tính giá trị chi-bình phương để đánh giá mối quan hệ giữa các loại mô học và sự xuất hiện của đột biến gen CDH1 ở bệnh nhân BRCA, sử dụng dữ liệu từ PanCancer Atlas. Tập trung vào những bệnh nhân có loại mô học được biết và chỉ xem xét các bản ghi đột biến đáng tin cậy. Loại trừ bất kỳ loại mô học hoặc trạng thái đột biến nào có tổng biên nhỏ hơn hoặc bằng 10. Ghép dữ liệu lâm sàng và đột biến bằng ParticipantBarcode.","external_knowledge":null}
{"instance_id":"bq161","db":"pancancer_atlas_2","question":"Hãy tính hiệu số giữa số bệnh nhân ung thư tuyến tụy dạng adenocarcinoma (PAAD) trong dữ liệu của TCGA được xác nhận có đột biến ở cả KRAS và TP53, và số bệnh nhân không có đột biến ở cả hai gen. Sử dụng dữ liệu lâm sàng và theo dõi của bệnh nhân cùng với chi tiết đột biến gen từ cơ sở dữ liệu genomics ung thư của TCGA, tập trung đặc biệt vào các nghiên cứu PAAD nơi các đột biến đã vượt qua các bộ lọc chất lượng.","external_knowledge":null}
{"instance_id":"bq151","db":"pancancer_atlas_2","question":"Sử dụng dữ liệu TCGA, tính thống kê chi-bình phương để đánh giá mối liên hệ giữa đột biến KRAS và TP53 ở những bệnh nhân được chẩn đoán PAAD. Kết hợp dữ liệu theo dõi lâm sàng và chú thích đột biến chất lượng cao để xác định chính xác tần suất bệnh nhân có đột biến KRAS và TP53 đồng thời xuất hiện so với những người có mỗi đột biến xuất hiện độc lập. Đảm bảo hồ sơ bệnh nhân được ghép khớp tỉ mỉ dựa trên các định danh duy nhất để duy trì tính toàn vẹn của dữ liệu. Phân tích này nhằm xác định và định lượng các mối tương quan tiềm năng giữa các biến đổi di truyền KRAS và TP53 trong quần thể PAAD.","external_knowledge":null}
{"instance_id":"bq162","db":"HTAN_1","question":"Dựa trên phiên bản thứ 5 (r5) của dữ liệu HTAN, liệt kê các loại xét nghiệm hình ảnh có sẵn tại trung tâm HTAN WUSTL có dữ liệu Level2 và bất kỳ dữ liệu cấp cao hơn nào (Level3, Level4) được sinh ra từ chúng thông qua mối quan hệ 'entityId' trong bảng 'id_provenance_r5'; loại trừ bất kỳ hồ sơ nào mà 'Component' bằng NULL hoặc chứa 'Auxiliary' hoặc 'OtherAssay'; đối với mỗi loại xét nghiệm hình ảnh, cung cấp các mức dữ liệu có sẵn (Level2, Level3, Level4), và không bao gồm dữ liệu Level1 hoặc các loại xét nghiệm Hiển vi điện tử.","external_knowledge":null}
{"instance_id":"sf_bq163","db":"HTAN_2","question":"20 gen nào trong tập dữ liệu HTAN scRNAseq MSK-SCLC các mẫu ghép cho thấy sự khác biệt lớn nhất về biểu hiện trung bình của X_value giữa tế bào biểu mô của nữ và nam, đặc biệt ở cụm 41 của các bệnh nhân 74 tuổi? Vui lòng tính sự khác biệt bằng cách trừ giá trị trung bình X_value của nam từ giá trị trung bình X_value của nữ cho mỗi gen.","external_knowledge":null}
{"instance_id":"sf_bq164","db":"HTAN_2","question":"Hợp nhất siêu dữ liệu từ các tập dữ liệu spatial transcriptomics và scRNAseq—bao gồm các cấp độ 1 đến 4 và các tệp phụ trợ—cho ID lần chạy 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test'. Bao gồm Filename, HTAN Parent Biospecimen ID, Component, File Format, Entity ID, và Run ID.","external_knowledge":null}
{"instance_id":"sf_bq166","db":"TCGA_MITELMAN","question":"Sử dụng dữ liệu số sao chép ở mức đoạn từ bộ dữ liệu copy_number_segment_allelic_hg38_gdc_r23 được giới hạn cho các mẫu 'TCGA-KIRC', kết hợp các đoạn này với định nghĩa băng cytogenetic trong 'CytoBands_hg38' để xác định số sao chép tối đa của mỗi cytoband cho từng mẫu. Phân loại các số sao chép tối đa này thành các nhóm: tăng số sao chép (amplifications) (>3), tăng (gains) (=3), mất đoạn đồng hợp tử (homozygous deletions) (=0), mất đoạn dị hợp tử (heterozygous deletions) (=1), hoặc bình thường (=2), sau đó tính tần suất của mỗi loại phụ trên tổng số các trường hợp khác nhau, và cuối cùng trình bày các tần suất này ở dạng phần trăm được sắp xếp theo NST và cytoband.","external_knowledge":"Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"}
{"instance_id":"bq165","db":"mitelman","question":"Bạn có thể sử dụng các tọa độ giải trình tự của CytoConverter để tính tần suất tăng và mất nhiễm sắc thể trên một nhóm mẫu ung thư vú (morphology='3111') và ung thư tuyến (topology='0401') không? Cụ thể, vui lòng báo cáo số lượng và tần suất (làm tròn 2 chữ số phần trăm) của amplifications (tăng lên nhiều hơn 1 bản sao), gains (tăng thêm 1 bản sao), losses (mất 1 bản sao) và homozygous deletions (mất 2 bản sao) cho mỗi băng nhiễm sắc thể. Và sắp xếp kết quả theo thứ tự tăng dần của mỗi nhiễm sắc thể và vị trí bắt đầu-kết thúc của mỗi băng theo thứ tự tăng dần.","external_knowledge":null}
{"instance_id":"bq169","db":"mitelman","question":"Trích xuất các tham chiếu ca duy nhất, số ca, số điều tra và thông tin clone khi một clone đơn lẻ đồng thời thể hiện cả ba biến đổi di truyền sau đây: (1) mất trên nhiễm sắc thể 13 giữa vị trí 48,303,751 và 48,481,890, (2) mất trên nhiễm sắc thể 17 giữa vị trí 7,668,421 và 7,687,490, và (3) tăng trên nhiễm sắc thể 11 giữa vị trí 108,223,067 và 108,369,102. Đối với mỗi clone phù hợp, hiển thị chi tiết nhiễm sắc thể cho từng vùng trong ba vùng này (bao gồm số nhiễm sắc thể được biểu thị bởi ChrOrd, vị trí bắt đầu và vị trí kết thúc) và mô tả ngắn về karyotype từ bảng KaryClone. Sử dụng CytoConverted và KaryClone.","external_knowledge":null}
{"instance_id":"bq111","db":"mitelman","question":"Bạn có thể tính, theo từng nhiễm sắc thể, mối tương quan Pearson giữa tần suất bất thường số sao chép (bao gồm amplifications, gains, losses và deletions) từ cơ sở dữ liệu Mitelman cho các trường hợp có morph = 3111 và topo = 0401, và những giá trị được tính từ dữ liệu TCGA, trả về hệ số tương quan và giá trị p tương ứng cho từng loại bất thường, đảm bảo chỉ hiển thị các kết quả có ít nhất năm bản ghi phù hợp.","external_knowledge":"Correlations_between_Mitelman_and_TCGA_datasets.md"}
{"instance_id":"sf_bq451","db":"_1000_GENOMES","question":"Trích xuất dữ liệu kiểu gen cho các SNPs (biến thể nucleotide đơn) trên nhiễm sắc thể X, loại bỏ các vị trí mà giá trị `start` nằm giữa 59999 và 2699519 hoặc giữa 154931042 và 155260559. Với mỗi mẫu, xác định các lần gọi kiểu gen mà mảng kiểu gen có ít nhất một alen. Phân loại mỗi lần gọi kiểu gen thành một trong các loại sau: alen tham chiếu đồng hợp (cả hai alen bằng 0), alen thay thế đồng hợp (cả hai alen giống nhau và lớn hơn 0), hoặc alen dị hợp (các alen khác nhau, hoặc bất kỳ alen nào là null, và ít nhất một alen lớn hơn 0). Tính tổng số vị trí có thể gọi được (tổng của cả ba loại gọi kiểu gen), số lượng gọi kiểu gen tham chiếu đồng hợp, gọi kiểu gen đồng hợp thay thế và dị hợp, tổng số biến thể nucleotide đơn (SNV) là tổng của gọi kiểu gen đồng hợp thay thế và dị hợp, phần trăm gọi dị hợp trong tất cả các SNV, và phần trăm gọi đồng hợp thay thế trong tất cả các SNV. Xuất ID mẫu cùng với các số liệu và phần trăm này, và sắp xếp kết quả theo phần trăm gọi dị hợp trong SNVs giảm dần, sau đó theo ID mẫu.","external_knowledge":"1000_genomes_alleles_type.md"}
{"instance_id":"sf_bq452","db":"_1000_GENOMES","question":"Xác định các biến thể trên nhiễm sắc thể số 12 và, đối với mỗi biến thể, tính toán giá trị chi-bình phương bằng cách sử dụng số đếm alen ở ca-bệnh và đối chứng, trong đó ca-bệnh là các cá nhân từ nhóm siêu dân số 'EAS' và đối chứng là các cá nhân từ tất cả các nhóm siêu dân số khác. Áp dụng correction của Yates cho sự liên tục trong tính toán chi-bình phương, đảm bảo rằng các số đếm kỳ vọng cho mỗi alen ở cả hai nhóm tối thiểu bằng 5. Trả về vị trí bắt đầu, vị trí kết thúc và giá trị chi-bình phương của các biến thể hàng đầu mà giá trị chi-bình phương không nhỏ hơn 29.71679.","external_knowledge":null}
{"instance_id":"sf_bq453","db":"_1000_GENOMES","question":"Trên nhiễm sắc thể 17, giữa các vị trí 41196311 và 41277499, những tên tham chiếu là gì, vị trí bắt đầu và kết thúc, các base tham chiếu, các base thay thế riêng biệt, các loại biến thể, và điểm χ^2 (tính từ cân bằng Hardy-Weinberg) cùng với tổng số kiểu gen, số lượng quan sát được và kỳ vọng cho các kiểu gen đồng hợp tham chiếu, dị hợp, và đồng hợp thay thế, cũng như tần suất alen (bao gồm dữ liệu từ 1KG) cho mỗi biến thể?","external_knowledge":null}
{"instance_id":"sf_bq454","db":"_1000_GENOMES","question":"Đối với bộ dữ liệu 1000 Genomes, phân tích các biến thể trên nhiễm sắc thể thường phổ biến (những biến thể có tần suất alen tối thiểu 0.05) trên các siêu quần thể khác nhau. Đối với mỗi siêu quần thể, đếm có bao nhiêu biến thể được chia sẻ bởi từng số lượng mẫu cụ thể trong siêu quần thể đó. Bao gồm trong kết quả kích thước quần thể tổng cộng của mỗi siêu quần thể, liệu biến thể có phổ biến (tần suất alen ≥ 0.05) hay không, số mẫu mang mỗi biến thể, và tổng số biến thể được chia sẻ bởi số mẫu tương ứng. Chỉ bao gồm các biến thể trên nhiễm sắc thể thường bằng cách loại trừ rõ ràng các nhiễm sắc thể giới tính (X, Y) và DNA ti thể (MT) khỏi phân tích. Xem xét chỉ các mẫu có ít nhất một alen thay thế (không tham chiếu) cho biến thể.","external_knowledge":null}
{"instance_id":"sf_bq415","db":"HUMAN_GENOME_VARIANTS","question":"Liệt kê 10 mẫu trong dữ liệu bộ gen có số vị trí cao nhất tại đó có đúng một allele thay thế và kiểu gen của mẫu đó là đồng hợp tử với allele tham chiếu (cả hai allele đều bằng 0). Sắp xếp kết quả theo thứ tự giảm dần của các đếm này.","external_knowledge":"Homozygous_Reference_Genotype.md"}
{"instance_id":"bq279","db":"austin","question":"Bạn có thể cho biết số lượng các trạm cho thuê xe đạp khác nhau đang hoạt động và đã đóng cửa cho từng năm 2013 và 2014 không?","external_knowledge":null}
{"instance_id":"bq281","db":"austin","question":"Số lượt đi xe đạp điện dài hơn 10 phút lớn nhất được thực hiện bởi người đăng ký có 'Student Membership' trong một ngày, loại trừ các lượt đi bắt đầu hoặc kết thúc tại 'Mobile Station' hoặc 'Repair Shop'?","external_knowledge":null}
{"instance_id":"bq282","db":"austin","question":"Bạn có thể cho tôi biết số của quận hội đồng đang hoạt động ở Austin có số lượt chuyến đi xe đạp bắt đầu và kết thúc trong cùng một quận nhưng không tại cùng một trạm nhiều nhất là bao nhiêu không?","external_knowledge":null}
{"instance_id":"bq006","db":"austin","question":"Ngày nào có Z-score cao thứ hai đối với số ca mỗi ngày của các vụ 'PUBLIC INTOXICATION' ở Austin cho năm 2016? Hãy liệt kê ngày theo định dạng '2016-xx-xx'.","external_knowledge":null}
{"instance_id":"sf_bq283","db":"AUSTIN","question":"Trong số tất cả các trạm đang hoạt động, hãy xác định những trạm xếp hạng trong top 15 (bao gồm cả các vị trí bằng nhau) dựa trên tổng số chuyến bắt đầu từ mỗi trạm. Đối với mỗi trạm trong số đó, trả về ID trạm, tổng số chuyến bắt đầu, tỷ lệ phần trăm của những chuyến đó so với tổng số chuyến bắt đầu từ các trạm đang hoạt động, và thời lượng chuyến đi trung bình tính bằng phút. Sắp xếp kết quả theo thứ hạng của trạm.","temporal":"Yes","external_knowledge":null}
{"instance_id":"bq284","db":"bbc","question":"Bạn có thể cung cấp bảng phân tích tổng số bài viết được chia thành các danh mục khác nhau và tỷ lệ phần trăm của những bài viết đó đề cập đến \"giáo dục\" trong mỗi danh mục từ BBC News được không?","external_knowledge":null}
{"instance_id":"bq413","db":"dimensions_ai_covid19","question":"Lấy tiêu đề nơi công bố của các ấn phẩm có `date_inserted` từ năm 2021 trở đi và liên kết với một lưới có địa chỉ thành phố là 'Qianjiang'. Đối với mỗi ấn phẩm, ưu tiên tiêu đề nơi công bố bằng cách chọn trước tiêu đề tạp chí nếu nó tồn tại; nếu không, tiếp theo là tiêu đề kỷ yếu; nếu cái đó cũng không có, thì tiêu đề sách; và cuối cùng, nếu không có cái nào trong số đó, tiêu đề của chuỗi sách.","external_knowledge":null}
{"instance_id":"bq425","db":"ebi_chembl","question":"Sử dụng dữ liệu từ ChEMBL Release 23, truy xuất tất cả các phân tử khác nhau liên kết với công ty 'SanofiAventis', liệt kê tên thương mại và ngày phê duyệt gần đây nhất cho mỗi phân tử. Đảm bảo chỉ giữ lại ngày phê duyệt mới nhất cho mỗi phân tử và đảm bảo trường công ty khớp chính xác với 'SanofiAventis' mà không dựa vào các trường khác.","external_knowledge":null}
{"instance_id":"bq430","db":"ebi_chembl","question":"Tìm các cặp phân tử khác nhau được thử nghiệm trong cùng một xét nghiệm (assay) và cùng loại chuẩn, mà cả hai đều có 10–15 nguyên tử nặng, ít hơn 5 hoạt động trong xét nghiệm đó, ít hơn 2 hoạt động trùng lặp, giá trị chuẩn không rỗng, và giá trị pChEMBL lớn hơn 10. Đối với mỗi cặp, báo cáo số lượng nguyên tử nặng tối đa, ngày công bố muộn nhất (được tính toán dựa trên thứ hạng của tài liệu trong cùng một tạp chí và năm, và ánh xạ nó tới một tháng và ngày tổng hợp), ID tài liệu cao nhất, phân loại sự thay đổi của giá trị chuẩn là 'tăng', 'giảm', hoặc 'không đổi' dựa trên giá trị và quan hệ của chúng, và tạo UUID từ các ID hoạt động của chúng và SMILES chuẩn.","external_knowledge":"chembl.md"}
{"instance_id":"bq023","db":"fec","question":"Sử dụng Khảo sát Dân số và Nhà ở Mỹ (ACS) 5 năm 2018 để ước lượng thu nhập trung vị ở cấp khu vực điều tra dân số và tập dữ liệu đóng góp cá nhân của Ủy ban Bầu cử Liên bang (FEC) năm 2020 được lọc cho các người đóng góp ở New York, ghép với địa bàn khu vực điều tra dân số thông qua bảng đối chiếu từ mã ZIP tới khu vực điều tra dân số, tính và liệt kê số tiền đóng góp chính trị trung bình và thu nhập trung vị cho mỗi khu vực điều tra dân số nằm ở Kings County (Brooklyn), New York.","external_knowledge":null}
{"instance_id":"bq094","db":"fec","question":"Vui lòng cung cấp danh sách tất cả các ủy ban năm 2016 đã ủng hộ ít nhất một ứng viên và nhận được tổng số đóng góp cá nhân từ $0 đến $200 (bao gồm cả những đóng góp > $0 và < $200) sao cho tổng các đóng góp nhỏ này vượt quá $0. Đối với mỗi ủy ban đủ điều kiện, hãy bao gồm tên của nó, số lượng ứng viên duy nhất mà nó đã ủng hộ, tên của các ứng viên theo thứ tự chữ cái (cách nhau bằng dấu phẩy), và tổng số tiền đóng góp nhỏ mà ủy ban nhận được.","external_knowledge":null}
{"instance_id":"bq287","db":"fda","question":"Trong tất cả các mã ZIP ở Utah, tỷ lệ việc làm theo Khảo sát Cộng đồng Mỹ năm 2017 cho dân số từ 16 tuổi trở lên ở mã ZIP có số lượng địa điểm ngân hàng được FDIC bảo hiểm ít nhất là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq432","db":"fda","question":"Vui lòng cung cấp dữ liệu sự kiện thực phẩm mà cả \"date_created\" và \"date_started\" nằm trong khoảng từ ngày 1 tháng 1 năm 2015 đến ngày 31 tháng 1 năm 2015; áp dụng các bước làm sạch dữ liệu sau: tách các trường reactions và outcomes thành mảng bằng dấu phẩy, xử lý các mẫu số đặc biệt trong trường products_brand_name (nơi một chữ số theo sau bởi dấu phẩy và một chữ số khác) bằng cách bảo toàn những mẫu số đó trong khi thay thế các dấu \", \" bằng \" -- \", thay thế \", \" bằng \" -- \" trong các trường products_industry_code, products_role, và products_industry_name, và tính độ dài industry_code_length và brand_name_length là độ dài của mảng sau khi tách.","external_knowledge":"Food_Event_Cleansing_Logic.md"}
{"instance_id":"bq285","db":"fda","question":"Bạn có thể cung cấp cho tôi mã ZIP của vị trí có số lượng ngân hàng nhiều nhất ở Florida được không?","external_knowledge":null}
{"instance_id":"bq288","db":"fda","question":"Tổng số các tổ chức ngân hàng ở bang có tổng tài sản cao nhất từ các ngân hàng được thành lập trong khoảng từ ngày 1 tháng 1 năm 1900 đến ngày 31 tháng 12 năm 2000, với tên tổ chức bắt đầu bằng 'Bank'?\"","external_knowledge":null}
{"instance_id":"sf_bq412","db":"GOOGLE_ADS","question":"Vui lòng lấy các URL trang, thời gian hiển thị lần đầu, thời gian hiển thị lần cuối, lý do loại bỏ, danh mục vi phạm, và giới hạn dưới và giới hạn trên của thời gian hiển thị cho năm quảng cáo bị gỡ bỏ gần đây nhất ở khu vực Croatia (mã khu vực 'HR'), nơi ngày khả dụng được hiển thị là null, giới hạn dưới được hiển thị vượt quá 10,000, giới hạn trên được hiển thị nhỏ hơn 25,000, và các quảng cáo đã sử dụng ít nhất một phương thức chọn khán giả thuộc các nhóm: nhân khẩu học, địa điểm, tín hiệu ngữ cảnh, danh sách khách hàng, hoặc chủ đề quan tâm; sắp xếp các quảng cáo kết quả theo thời gian hiển thị lần cuối của chúng theo thứ tự giảm dần.","external_knowledge":null}
{"instance_id":"sf_bq423","db":"GOOGLE_ADS","question":"Trong khoảng từ ngày 01/01/2023 đến ngày 01/01/2024, quảng cáo loại hình ảnh trên chủ đề Sức khỏe, được đăng bởi một nhà quảng cáo xác thực có trụ sở tại Síp, đã được hiển thị ở Croatia, có times_shown_availability_date bằng NULL (nghĩa là dữ liệu số lần hiển thị có sẵn), đã sử dụng thông tin nhân khẩu học, nhắm mục tiêu theo vị trí địa lý, tín hiệu ngữ cảnh, danh sách khách hàng và các chủ đề quan tâm mà không có bất kỳ phương pháp chọn lọc nào trong số này bị bỏ qua, và thêm vào đó có ngày hiển thị lần đầu sau ngày 01/01/2023 và ngày hiển thị lần cuối trước ngày 01/01/2024? Trong số các quảng cáo thỏa mãn như vậy, hãy cung cấp URL trang của quảng cáo có giới hạn trên của số lần hiển thị cao nhất.","external_knowledge":null}
{"instance_id":"sf_bq070","db":"IDC","question":"Bạn có thể cung cấp một tập dữ liệu sạch, có cấu trúc từ bảng dicom_all sao cho chỉ gồm các hình ảnh SM được đánh dấu là VOLUME từ các bộ sưu tập TCGA-LUAD và TCGA-LUSC, loại bỏ bất kỳ slide nào có loại nén “other,” trong đó bước chuẩn bị mẫu cụ thể có “Embedding medium” được đặt thành “Tissue freezing medium,” và đảm bảo loại mô chỉ là “normal” hoặc “tumor” và phụ loại ung thư được báo cáo tương ứng?","external_knowledge":"dicom_dataset_selection.md"}
{"instance_id":"sf_bq320","db":"IDC","question":"Trong bảng dicom_pivot, có bao nhiêu giá trị StudyInstanceUID duy nhất khớp chính xác với SegmentedPropertyTypeCodeSequence của \"15825003\" (không phân biệt chữ hoa chữ thường) và cũng có collection_id là một trong các giá trị \"Community\" hoặc \"nsclc_radiomics\"?","external_knowledge":null}
{"instance_id":"sf_bq321","db":"IDC","question":"Có bao nhiêu StudyInstanceUIDs duy nhất từ các loạt DWI, T2 Weighted Axial, loạt Apparent Diffusion Coefficient, và T2 Weighted Axial Segmentations trong bộ sưu tập 'qin_prostate_repeatability'?","external_knowledge":null}
{"instance_id":"sf_bq323","db":"IDC","question":"Trong bộ sưu tập 'prostatex', đối với các chuỗi MRI có Modality là 'MR', gán nhãn 't2w_prostateX' cho các chuỗi có SeriesDescription chứa 't2_tse_tra' và 'adc_prostateX' cho các chuỗi có SeriesDescription chứa 'ADC'. Đối với tất cả các chuỗi được gán nhãn là 't2w_prostateX' hoặc 'adc_prostateX', tính giá trị trung bình của Thời gian lặp lại, Thời gian hồi âm, và Độ dày lát cắt, và sau đó tính tổng các giá trị trung bình này để có được trung bình tổng hợp.","external_knowledge":null}
{"instance_id":"sf_bq417","db":"IDC","question":"Vui lòng cung cấp chi tiết nhận dạng, thông tin nghiên cứu và chuỗi, vị trí lưu trữ, và tổng kích thước tính bằng MB cho các hình ảnh y tế thuộc về bệnh nhân nam có đúng 18 tuổi dựa trên phần số của trường PatientAge, khi BodyPartExamined được đặt thành 'MEDIASTINUM' và ngày nghiên cứu sau ngày 01 tháng 09 năm 2014.","external_knowledge":"IDC_data_model.md"}
{"instance_id":"sf_bq455","db":"IDC","question":"Xác định top năm loạt hình ảnh CT theo kích thước (tính bằng MiB), bao gồm SeriesInstanceUID, SeriesNumber, ID bệnh nhân và kích thước loạt. Các loạt này phải từ modality CT và không thuộc bộ sưu tập 'nlst'. Loại trừ bất kỳ loạt nào có ImageType được phân loại là 'LOCALIZER' hoặc TransferSyntaxUID là '1.2.840.10008.1.2.4.70' hoặc '1.2.840.10008.1.2.4.51' (tức JPEG nén). Các loạt được chọn phải có khoảng cách lát cắt nhất quán, mức phơi sáng, hướng hình ảnh (với chỉ một giá trị duy nhất của ImageOrientationPatient), khoảng cách pixel, vị trí hình ảnh (cả trục z và vị trí xy) và kích thước pixel (số hàng và số cột). Đảm bảo số lượng hình ảnh khớp với số vị trí trục z duy nhất, cho thấy không có lát cắt trùng lặp. Ngoài ra, thành phần trục z của tích chéo các véc tơ hướng x và y từ ImageOrientationPatient phải có giá trị tuyệt đối từ 0.99 đến 1.01, đảm bảo sự phù hợp với mặt phẳng hình ảnh mong đợi. Cuối cùng, sắp xếp kết quả theo kích thước loạt theo thứ tự giảm dần và giới hạn đầu ra ở top năm loạt đáp ứng các điều kiện này.","external_knowledge":null}
{"instance_id":"sf_bq456","db":"IDC","question":"Vui lòng truy xuất từ bảng dicom_all từng PatientID, StudyInstanceUID, StudyDate, và CodeMeaning của FindingSite cho những bệnh nhân có StudyDate nằm trong năm 2001, cùng với giá trị tối đa của mỗi đo lường sau được xác định bởi CodeMeaning (Elongation, Flatness, Least Axis in 3D Length, Major Axis in 3D Length, Maximum 3D Diameter of a Mesh, Minor Axis in 3D Length, Sphericity, Surface Area of Mesh, Surface to Volume Ratio, Volume from Voxel Summation, và Volume of Mesh), đảm bảo bảng quantitative_measurements được ghép nối trên segmentationInstanceUID khớp với SOPInstanceUID trong dicom_all, và nhóm theo PatientID, StudyInstanceUID, StudyDate, và FindingSite CodeMeaning.","external_knowledge":null}
{"instance_id":"sf_bq324","db":"IDC","question":"Có tổng số khung hình có mặt trên toàn bộ các hình ảnh toàn slide từ bộ sưu tập TCGA-BRCA, sử dụng chế độ SM và có một bước nhuộm dựa trên eosin trong SpecimenPreparationSequence của chúng?","external_knowledge":null}
{"instance_id":"bq418","db":"targetome_reactome","question":"Xác định ba đường dẫn cấp thấp nhất của Reactome (với bằng chứng TAS) có giá trị thống kê chi-squared cao nhất, chỉ xem các mục tiêu ở Homo sapiens liên quan đến sorafenib với điều kiện giá trị assay trung vị ≤ 100 và cả giá trị assay thấp và cao đều ≤ 100 hoặc null. Đối với mỗi ba đường dẫn này, có bao nhiêu mục tiêu và bao nhiêu không phải mục tiêu nằm trong đường dẫn và bao nhiêu nằm ngoài đường dẫn?","external_knowledge":null}
{"instance_id":"bq330","db":"fda","question":"Mã bưu chính nào ở Colorado có mật độ cao nhất của các địa điểm ngân hàng trên mỗi nhóm khối, dựa trên sự chồng chéo giữa các mã bưu chính và các nhóm khối?","external_knowledge":"overlap_ratio.md"}
{"instance_id":"bq398","db":"world_bank","question":"Các chỉ số nợ hàng đầu cho Nga dựa trên giá trị nợ cao nhất là gì?","external_knowledge":null}
{"instance_id":"bq399","db":"world_bank","question":"Quốc gia thu nhập cao nào có tỷ lệ sinh thô trung bình cao nhất tương ứng ở mỗi khu vực, và tỷ lệ sinh thô trung bình tương ứng của chúng là bao nhiêu, trong thập niên 1980?","external_knowledge":null}
{"instance_id":"bq457","db":"libraries_io","question":"Lấy chi tiết về các kho lưu trữ sử dụng các thư viện toggle tính năng cụ thể. Đối với mỗi kho lưu trữ, hãy bao gồm tên đầy đủ với chủ sở hữu, loại nền tảng lưu trữ, kích thước tính bằng byte, ngôn ngữ lập trình chính, tên nguồn fork (nếu có), dấu thời gian cập nhật lần cuối, tên artifact và tên thư viện của tính năng toggle được sử dụng, và các ngôn ngữ lập trình của thư viện đó. Bao gồm các kho lưu trữ phụ thuộc vào các thư viện toggle tính năng được chỉ định, được định nghĩa bằng tên artifact, tên thư viện, nền tảng và ngôn ngữ của chúng.","external_knowledge":"feature_toggle_libraries.md"}
{"instance_id":"bq227","db":"london","question":"Bạn có thể cung cấp phần trăm hàng năm, làm tròn đến hai chữ số thập phân, của 5 loại tội phạm nhỏ hàng đầu từ năm 2008 trong tổng số tội phạm ở London, với mỗi năm được hiển thị trên một hàng?","external_knowledge":null}
{"instance_id":"bq232","db":"london","question":"Bạn có thể cung cấp tổng số vụ việc 'Other Theft' trong danh mục 'Theft and Handling' cho từng năm tại quận Westminster được không?","external_knowledge":null}
{"instance_id":"bq228","db":"london","question":"Xin vui lòng cung cấp danh sách ba loại tội phạm lớn nhất ở quận Barking and Dagenham, kèm theo số vụ ở mỗi loại.","external_knowledge":null}
{"instance_id":"bq229","db":"open_images","question":"Sử dụng bộ dữ liệu bigquery-public-data.open_images, bạn có thể cho biết có bao nhiêu URL hình ảnh khác nhau được phân loại là 'cat' (nơi hình có nhãn '/m/01yrx' với confidence=1) và có bao nhiêu URL hình ảnh khác nhau được phân loại là 'other' (nghĩa là chúng không có nhãn '/m/01yrx' cho mèo ở bất kỳ đâu)?","external_knowledge":null}
{"instance_id":"bq230","db":"usda_nass_agriculture","question":"Sử dụng tập dữ liệu crops, tìm tổng sản lượng năm 2022, được đo bằng bushels, cho ngô từ danh mục 'FIELD CROPS' và nấm ăn từ nhóm 'HORTICULTURE' cho mỗi bang ở Hoa Kỳ. Chỉ bao gồm các dòng dữ liệu mà 'statisticcat_desc' là 'PRODUCTION', 'agg_level_desc' là 'STATE', 'value' không null, và đảm bảo rằng đối với ngô 'unit_desc' là 'BU'. Ghép cả hai kết quả lại để tổng ngô và nấm ăn năm 2022 cho mỗi bang được trình bày.","external_knowledge":null}
{"instance_id":"bq326","db":"world_bank","question":"Dựa trên bộ dữ liệu dân số toàn cầu của Ngân hàng Thế giới và bộ dữ liệu dân số sức khỏe dinh dưỡng của Ngân hàng Thế giới, có bao nhiêu quốc gia trải qua mức tăng hơn 1% so với năm trước đến năm 2018 ở cả tổng dân số và chi tiêu y tế hiện tại trên đầu người (PPP)?","external_knowledge":null}
{"instance_id":"bq424","db":"world_bank","question":"Danh sách 10 nước hàng đầu về tổng số nợ nước ngoài dài hạn theo thứ tự giảm dần, loại trừ những nước không có khu vực được chỉ định.","external_knowledge":null}
{"instance_id":"bq327","db":"world_bank","question":"Có bao nhiêu chỉ số nợ cho Nga có giá trị bằng 0, loại trừ các giá trị NULL?","external_knowledge":null}
{"instance_id":"bq328","db":"world_bank","question":"Khu vực nào có GDP trung vị cao nhất (giá trị US$ cố định năm 2015)?","external_knowledge":null}
{"instance_id":"sf_bq331","db":"META_KAGGLE","question":"Tìm ba người dùng đã viết tin nhắn đầu tiên trong các chủ đề diễn đàn, xếp hạng theo thứ tự giảm dần dựa trên điểm tin nhắn của họ, trong đó điểm tin nhắn được định nghĩa là số lượng người dùng khác nhau đã bỏ phiếu cho tin nhắn đó. Đối với mỗi người dùng này, hãy cung cấp tên người dùng của họ và hiệu số tuyệt đối giữa điểm tin nhắn của họ và điểm trung bình của tất cả các tin nhắn đầu tiên trong các chủ đề diễn đàn.","external_knowledge":null}
{"instance_id":"sf_bq380","db":"META_KAGGLE","question":"Sử dụng dữ liệu from các bảng Forum Message Votes và Users, hãy tìm ba người dùng nhận được nhiều lượt ủng hộ phân biệt nhất trên diễn đàn Kaggle. Đối với mỗi người dùng này, liệt kê tên người dùng của họ, tổng số lượt ủng hộ phân biệt họ nhận được (dựa trên trường ToUserId), và tổng số lượt ủng hộ phân biệt họ đã gửi (dựa trên trường FromUserId), xếp theo số lượt nhận được giảm dần và giới hạn ở ba kết quả hàng đầu.","external_knowledge":null}
{"instance_id":"sf_bq370","db":"WIDE_WORLD_IMPORTERS","question":"Có bao nhiêu khách hàng có các đơn hàng và hóa đơn khớp với nhau ở mức chi tiết từng dòng và, khi được tổng hợp, dẫn đến mỗi khách hàng có số lượng đơn hàng và hóa đơn bằng nhau cũng như tổng giá trị cho các đơn hàng và hóa đơn giống nhau?","external_knowledge":null}
{"instance_id":"sf_bq371","db":"WIDE_WORLD_IMPORTERS","question":"Trong năm 2013, xét tổng giá trị của mỗi hóa đơn bằng tích của đơn giá và số lượng, và nhóm theo quý (Q1, Q2, Q3, Q4) mà ngày hóa đơn phát sinh; sự khác biệt giữa giá trị hóa đơn trung bình lớn nhất và nhỏ nhất trên các quý này là bao nhiêu?","external_knowledge":null}
{"instance_id":"sf_bq372","db":"WIDE_WORLD_IMPORTERS","question":"Trong tất cả các đơn hàng không xuất hiện trong bảng invoice, đối với mỗi danh mục khách hàng hãy tính giá trị đơn hàng bị mất lớn nhất, sau đó xác định danh mục khách hàng nào có giá trị đơn hàng bị mất lớn nhất gần với trung bình của các giá trị lớn nhất này trên mọi danh mục?","external_knowledge":null}
{"instance_id":"sf_bq373","db":"WIDE_WORLD_IMPORTERS","question":"Sử dụng ngày lập hóa đơn để xác định từng tháng của năm 2014, và tổng hợp các khoản tiền trên từng dòng hóa đơn cho mỗi khách hàng qua các tháng này, giá trị trung vị của mức chi tiêu trung bình hàng tháng trên tất cả khách hàng là bao nhiêu?","external_knowledge":null}
{"instance_id":"bq393","db":"hacker_news","question":"Tôi muốn xác định các người dùng có hoạt động rồi sau đó không hoạt động. Cụ thể, tìm ID người dùng và số tháng tương ứng của họ (đếm từ tháng hoạt động đầu tiên của họ) cho người dùng có số tháng cao nhất, người đã trở nên không hoạt động (không có ghi nhận hoạt động) sau tháng hoạt động cuối cùng được ghi nhận. Đối với phân tích này, chỉ xem dữ liệu cho đến ngày 10 tháng 9 năm 2024, và đảm bảo số tháng đại diện cho số tháng tính từ tháng hoạt động đầu tiên của người dùng. Người dùng nên có ít nhất một tháng mà họ được kỳ vọng hoạt động (trong phạm vi hoạt động của họ) nhưng thực tế lại không có bản ghi.","external_knowledge":null}
{"instance_id":"bq403","db":"irs_990","question":"Ba năm nào trong khoảng 2012-2017 có sự chênh lệch tuyệt đối nhỏ nhất giữa trung vị doanh thu và trung vị chi phí chức năng đối với các tổ chức nộp IRS 990 forms? Vui lòng cho ra ba năm và các sự chênh lệch tương ứng.","external_knowledge":null}
{"instance_id":"bq397","db":"ecommerce","question":"Sau khi loại bỏ bất kỳ bản ghi trùng lặp nào từ tập dữ liệu rev_transactions, hãy xác định từng nhóm kênh có giao dịch từ nhiều hơn một quốc gia. Đối với mỗi nhóm kênh như vậy, hãy tìm quốc gia có tổng số giao dịch cao nhất và báo cáo cả tên quốc gia lẫn tổng số giao dịch cho nhóm kênh đó.","external_knowledge":null}
{"instance_id":"bq402","db":"ecommerce","question":"Tính tỷ lệ chuyển đổi từ lượt truy cập duy nhất sang người mua bằng cách sử dụng dữ liệu hoàn toàn từ bảng `web_analytics` trong bộ dữ liệu `data-to-insights.ecommerce`. Một lượt truy cập được định nghĩa là một `fullVisitorId` duy nhất có mặt trong bảng, trong khi một người mua hàng là một khách truy cập có ít nhất một giao dịch được ghi nhận (`totals.transactions` không phải là null). Tỷ lệ chuyển đổi được tính bằng cách chia số lượng người mua hàng duy nhất cho tổng số lượt truy cập duy nhất. Ngoài ra, tính trung bình số giao dịch trên mỗi người mua hàng, chỉ xem xét các khách truy cập đã thực hiện ít nhất một giao dịch.","external_knowledge":null}
{"instance_id":"sf_bq160","db":"META_KAGGLE","question":"Vui lòng cung cấp ngày tạo, tiêu đề, tiêu đề diễn đàn cha, số lượt trả lời, số lượt trả lời của những người dùng khác nhau, tổng số lượt upvote, và tổng số lượt xem cho năm chủ đề diễn đàn sớm nhất thuộc bất kỳ diễn đàn con nào dưới diễn đàn cha có tiêu đề \"General\". Số lượt trả lời nên được tính bằng tổng số tin nhắn liên quan đến mỗi chủ đề, và số lượt trả lời từ những người dùng khác nhau nên là số lượng người dùng duy nhất đã đăng tin nhắn trong chủ đề. Tổng số lượt upvote nên được tính bằng tổng số lượt upvote trên tất cả các tin nhắn trong mỗi chủ đề. Nếu bất kỳ giá trị nào thiếu hoặc None, hãy coi chúng như bằng 0.","external_knowledge":null}
{"instance_id":"sf_bq167","db":"META_KAGGLE","question":"Xác định cặp người dùng Kaggle tham gia vào ForumMessageVotes sao cho một người dùng đã gửi cho người kia số lượng upvote khác biệt lớn nhất, sau đó cũng hiển thị số lượt upvote mà người nhận trả lại. Hiển thị tên người dùng của cả hai người dùng, tổng số lượt upvote khác biệt mà một người nhận được từ người kia, và số lượt upvote họ đã trả lại, sắp xếp theo số lượt nhận được cao nhất và sau đó là số lượt gửi đi cao nhất, và chỉ hiển thị kết quả đứng đầu.","external_knowledge":null}
{"instance_id":"sf_bq171","db":"META_KAGGLE","question":"Lượt upvote cho bài đăng trên diễn đàn của ai gần nhất với mức trung bình trong năm 2019? Nếu có đồng hạng, hãy cho tôi biết người dùng có tên đăng nhập đầu tiên theo thứ tự chữ cái.","external_knowledge":null}
{"instance_id":"sf_bq118","db":"DEATH","question":"Trong số những người được xác định là da trắng, số tử vong trung bình từ các mã ICD-10 có mô tả chứa từ “discharge” sẽ cao hơn bao nhiêu so với số tử vong trung bình từ các mã ICD-10 có mô tả chứa từ “vehicle”, khi được tổng hợp theo nhóm tuổi? (lưu ý loại trừ cụ thể “Urethral discharge,” “Discharge of firework,” và “Legal intervention involving firearm discharge”).","external_knowledge":null}
{"instance_id":"sf_bq072","db":"DEATH","question":"Vui lòng cung cấp, đối với mỗi độ tuổi từ 12 đến 18 (kể cả), tổng số ca tử vong và số ca tử vong của những người được xác định là da đen (dựa trên mô tả về chủng tộc chứa từ ‘black’), cụ thể cho các tử vong liên quan đến các mã ICD-10 có mô tả chứa từ ‘vehicle’ và cho các tử vong liên quan đến các mã ICD-10 có mô tả chứa từ ‘firearm’. Sử dụng bảng EntityAxisConditions để xác định các mã ICD-10 liên quan đến mỗi ca tử vong, thay vì liên kết thông tin mã ICD-10 trực tiếp trên hồ sơ tử vong.","external_knowledge":null}
{"instance_id":"ga001","db":"ga4","question":"Tôi muốn biết sở thích của khách hàng đã mua Google Navy Speckled Tee vào December 2020. Sản phẩm nào khác được mua với tổng số lượng cao nhất cùng với mặt hàng này?","external_knowledge":null}
{"instance_id":"ga002","db":"ga4","question":"Hãy cho tôi những sản phẩm khác được mua nhiều nhất và số lượng của chúng, theo từng tháng, bởi những khách hàng đã mua Google Red Speckled Tee mỗi tháng trong ba tháng bắt đầu từ November 2020.","external_knowledge":null}
{"instance_id":"ga003","db":"firebase","question":"Tôi đang cố gắng đánh giá xem loại bảng nào hiệu quả nhất vào ngày 15 tháng 9 năm 2018. Bạn có thể tìm ra điểm trung bình cho mỗi loại bảng từ các lần hoàn thành ở chế độ chơi nhanh vào ngày hôm đó không?","external_knowledge":null}
{"instance_id":"ga004","db":"ga4","question":"Bạn có thể xác định sự chênh lệch trung bình về lượt xem trang giữa những người dùng đã mua hàng và những người dùng không mua hàng vào December 2020 không? Chỉ gán nhãn cho bất kỳ ai tham gia vào các sự kiện mua hàng là người mua.","external_knowledge":null}
{"instance_id":"ga008","db":"ga4","question":"Bạn có thể cung cấp tổng số lượt xem trang cho từng ngày trong tháng 11 năm 2020 cũng như số lượt xem trang trung bình trên mỗi người dùng vào những ngày đó, được giới hạn cho những người dùng đã thực hiện ít nhất một lần mua hàng trong tháng 11 năm 2020 không?","external_knowledge":null}
{"instance_id":"ga017","db":"ga4","question":"Có bao nhiêu người dùng khác nhau đã xem trang được ghé thăm nhiều nhất trong tháng 1 năm 2021?","external_knowledge":null}
{"instance_id":"ga007","db":"ga4","question":"Vui lòng xác định tỷ lệ phần trăm lượt xem trang vào ngày January 2, 2021 thuộc về các trang loại PDP.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga013","db":"ga4","question":"Tôi muốn biết tất cả các trang đã được truy cập bởi người dùng 1402138.5184246691 vào ngày January 2, 2021. Vui lòng hiển thị tên của các trang này và điều chỉnh tên cho PDP hoặc PLP khi cần thiết.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga018","db":"ga4","question":"Vào ngày 2 tháng 1 năm 2021, tôi muốn xác định tỷ lệ phần trăm số lần người dùng chuyển từ PLP view sang PDP view trong cùng một phiên, chỉ sử dụng các sự kiện page_view. Bạn có thể tính xem có bao nhiêu lượt xem PLP cuối cùng dẫn đến PDP trong cùng một phiên vào ngày đó, và sau đó cung cấp tỷ lệ phần trăm chuyển PLP sang PDP tương ứng không?","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga032","db":"ga4","question":"Bạn có thể tạo luồng điều hướng cho người dùng có pseudo_id '1362228.4966015575' vào ngày January 28th 2021, chỉ hiển thị các sự kiện page_view không? Vui lòng nối các tiêu đề trang với '>>' giữa từng bước, chuyển đổi các trang chi tiết sản phẩm thành 'PDP' và các trang danh sách sản phẩm thành 'PLP' dựa trên cấu trúc URL, và gộp các trang giống nhau liền kề để chúng chỉ xuất hiện một lần trong chuỗi. Tôi cần hiểu cách người dùng cụ thể này đã điều hướng qua trang web của chúng ta vào ngày đó.","external_knowledge":"ga4_page_category.md"}
{"instance_id":"ga031","db":"ga4","question":"Tôi muốn biết tỷ lệ chuyển đổi theo phiên người dùng vào January 2nd, 2021, chỉ sử dụng các sự kiện 'page_view'. Tỷ lệ chuyển đổi nên được tính bằng phần trăm số lượt truy cập của người dùng đến được cả hai Trang chủ và Trang Xác nhận thanh toán trong một phiên, so với những lượt đến Trang chủ.","external_knowledge":null}
{"instance_id":"ga006","db":"ga4","question":"Cho khoảng thời gian November 1–30, 2020, bạn có thể truy vấn mỗi user_pseudo_id và doanh thu mua hàng trung bình trên mỗi phiên bằng USD cho những người dùng đã có hơn một phiên mua hàng, xem xét chỉ các sự kiện có event_name='purchase' và ecommerce.purchase_revenue_in_usd khác NULL, nhóm các phiên theo ga_session_id từ event_params","external_knowledge":null}
{"instance_id":"ga009","db":"ga4","question":"Bạn có thể cho biết số trung bình của các phiên được tương tác trên mỗi người dùng trong tháng 12 năm 2020, chỉ tính những phiên mà tham số sự kiện 'session_engaged' bằng '1' và sử dụng sự kết hợp của 'user_pseudo_id' với 'ga_session_id' để nhận diện các phiên riêng biệt?","external_knowledge":null}
{"instance_id":"ga010","db":"ga4","question":"Bạn có thể cho tôi một cái nhìn tổng quan về lưu lượng truy cập trang web của chúng ta trong December 2020 được không? Tôi đặc biệt quan tâm đến kênh có số lượt phiên cao thứ tư.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga014","db":"ga4","question":"Bạn có thể cung cấp tổng số lượt truy cập cho mỗi kênh lưu lượng truy cập trong tháng 12 năm 2020, sử dụng thông tin từ 'event_params'.","external_knowledge":"ga4_dimensions_and_metrics.md"}
{"instance_id":"ga011","db":"ga4","question":"Trang nào có tổng lượt xem trang cao thứ hai, sau khi làm sạch URL của nó (loại bỏ các dấu gạch chéo thừa) và trích xuất đường dẫn trang chính xác, trên trang web 'shop.googlemerchandisestore.com' trong tháng 12 năm 2020?","external_knowledge":null}
{"instance_id":"ga012","db":"ga4","question":"Vào ngày 30 tháng 11 năm 2020, hãy xác định danh mục mặt hàng có tỷ lệ thuế cao nhất bằng cách chia giá trị thuế bằng usd cho doanh thu mua bằng usd cho các sự kiện mua hàng, sau đó lấy các mã giao dịch, tổng số lượng mặt hàng, và cả doanh thu mua bằng usd và doanh thu mua cho các sự kiện mua hàng đó trong danh mục có tỷ lệ thuế cao nhất.","external_knowledge":null}
{"instance_id":"ga019","db":"firebase","question":"Bạn có thể xác định tỷ lệ phần trăm của người dùng không gỡ cài đặt ứng dụng của chúng ta trong vòng bảy ngày hoặc chưa từng gỡ cài đặt nó sau khi cài đặt trong August and September 2018 được không?","external_knowledge":null}
{"instance_id":"ga030","db":"firebase","question":"Bạn có thể nhóm người dùng theo tuần bắt đầu của phiên làm việc đầu tiên của họ, bắt đầu từ July 2, 2018 không? Đối với mỗi nhóm, tính tỷ lệ duy trì ở tuần thứ tư (tức là phần trăm người dùng từ nhóm ban đầu quay lại trong tuần thứ tư sau lần đầu tiên họ tham gia phiên làm việc). Vui lòng xác định cohort có tỷ lệ duy trì cao nhất ở tuần thứ tư, và đặt tên nhóm theo ngày thứ Hai của tuần đầu tiên của cohort. Trả về kết quả ở định dạng \"YYYY-MM-DD\".","external_knowledge":"retention_rate.md"}
{"instance_id":"ga005","db":"firebase","question":"Thực hiện một phân tích nhóm theo tuần cho việc giữ chân người dùng, bắt đầu từ July 9, 2018, và kết thúc vào October 2, 2018. Gom người dùng theo tuần của sự kiện session_start đầu tiên của họ (tuần bắt đầu từ thứ Hai), và xác định người dùng mới là những người có event_date trùng với ngày của user_first_touch_timestamp. Tính tỷ lệ duy trì Tuần 2 cho từng nhóm theo tuần, được định nghĩa là phần trăm người dùng có sự kiện session_start đúng 2 tuần sau tuần đầu tiên của họ. Chỉ bao gồm các nhóm từ July 9, 2018 đến September 17, 2018 (nhóm cuối cùng có thể được phân tích cho việc duy trì 2 tuần dựa trên dữ liệu có sẵn). Trình bày kết quả với mỗi nhóm theo tuần và tỷ lệ duy trì Tuần 2 tương ứng của nó, sắp xếp theo ngày của nhóm.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga028","db":"firebase","question":"Vui lòng thực hiện phân tích giữ chân 7 ngày cho người dùng lần đầu mở ứng dụng trong tuần bắt đầu từ ngày July 2, 2018. Đối với mỗi tuần từ Tuần 0 (tuần là tuần đầu tiên của họ) đến Tuần 4, hãy cung cấp tổng số người dùng mới ở Tuần 0 và số người dùng được giữ chân cho mỗi tuần tiếp theo. Đảm bảo rằng bạn chỉ tính các sự kiện đến ngày October 2, 2018, và ghép nhóm các ngày theo tuần bắt đầu thứ Hai.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga020","db":"firebase","question":"Loại sự kiện quickplay nào có tỷ lệ duy trì người dùng thấp nhất trong tuần thứ hai sau lần tương tác đầu tiên của họ, đối với người dùng bắt đầu tương tác giữa ngày 1 tháng 8 năm 2018 và ngày 15 tháng 8 năm 2018, được đo bằng sự có mặt của các sự kiện session_start?","external_knowledge":"retention_rate.md"}
{"instance_id":"ga021","db":"firebase","question":"Tỷ lệ giữ chân người dùng hai tuần sau sự kiện quickplay đầu tiên của họ, được tính riêng cho từng loại sự kiện quickplay, trong khoảng thời gian từ July 2, 2018, đến July 16, 2018? Hãy tập trung vào những người dùng đã bắt đầu một phiên (session_start) trong khoảng thời gian này.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga022","db":"firebase","question":"Bạn có thể giúp tôi lấy tỷ lệ giữ chân khách hàng hàng tuần trong tháng 9 năm 2018 cho những khách hàng mới lần đầu sử dụng ứng dụng của chúng tôi (first_open sự kiện) trong tuần đầu tiên bắt đầu từ ngày 1 tháng 9 năm 2018 (múi giờ ở Thượng Hải)? Tỷ lệ giữ chân nên bao gồm các tuần 1, 2 và 3 sau lần sử dụng ban đầu và hiển thị chúng theo định dạng cột.","external_knowledge":"retention_rate.md"}
{"instance_id":"ga025","db":"firebase","question":"Đối với tất cả người dùng lần đầu mở ứng dụng vào September 2018 và sau đó gỡ cài đặt trong vòng 7 ngày, tôi muốn biết tỷ lệ phần trăm của họ đã gặp sự cố ứng dụng (app_exception). Việc tính toán nên được thực hiện bằng cách chuyển đổi các timestamp sang ngày, và sau đó tính số ngày gỡ cài đặt dựa trên các ngày. Chỉ những người dùng gỡ cài đặt trong vòng 7 ngày và đã gặp sự cố mới được xem xét trong tỷ lệ phần trăm cuối cùng.","external_knowledge":null}
{"instance_id":"local002","db":"E_commerce","question":"Bạn có thể tính trung bình động đối xứng 5 ngày của doanh số đồ chơi được dự báo cho từ ngày 5 đến ngày 8 tháng 12 năm 2018, bằng dữ liệu doanh số hàng ngày từ ngày 1 tháng 1 năm 2017 đến ngày 29 tháng 8 năm 2018, với một mô hình hồi quy tuyến tính đơn giản? Cuối cùng, hãy cung cấp tổng của bốn giá trị trung bình động 5 ngày đó.","external_knowledge":null}
{"instance_id":"local003","db":"E_commerce","question":"Theo tài liệu định nghĩa RFM, tính trung bình doanh số trên mỗi đơn hàng cho từng khách hàng trong các phân khúc RFM riêng biệt, chỉ xem xét các đơn hàng 'đã giao'. Sử dụng định danh khách hàng duy nhất. Xác định rõ cách tính Recency dựa trên thời điểm mua hàng gần nhất và nêu rõ tiêu chí phân loại các phân đoạn RFM. Doanh số trung bình được tính bằng tổng chi tiêu chia cho tổng số đơn hàng. Vui lòng phân tích và báo cáo sự khác biệt về doanh số trung bình giữa các phân khúc RFM.","external_knowledge":"RFM.md"}
{"instance_id":"local004","db":"E_commerce","question":"Bạn có thể cho tôi biết số đơn hàng, thanh toán trung bình trên mỗi đơn hàng và tuổi thọ của khách hàng tính bằng tuần của 3 khách hàng có mức thanh toán trung bình trên mỗi đơn hàng cao nhất, tuổi thọ được tính bằng cách lấy ngày mua muộn nhất trừ ngày mua sớm nhất, chia cho bảy để ra tuần, và nếu kết quả nhỏ hơn bảy ngày thì gán bằng 1.0?","external_knowledge":null}
{"instance_id":"local007","db":"Baseball","question":"Bạn có thể giúp tôi tính giá trị quãng thời gian sự nghiệp trung bình cho tất cả các cầu thủ bóng chày và cho kết quả ở dạng một số thực (float) không? Đầu tiên, tính sự khác biệt về năm, tháng và ngày giữa ngày ra mắt và ngày thi đấu cuối cùng. Đối với mỗi cầu thủ, quãng thời gian sự nghiệp được tính bằng tổng của số năm tuyệt đối, cộng với số tháng tuyệt đối chia cho 12, cộng với số ngày tuyệt đối chia cho 365. Làm tròn mỗi phần đến hai chữ số thập phân trước khi cộng lại. Cuối cùng, tính trung bình các quãng thời gian sự nghiệp và làm tròn kết quả ở dạng số thực.","external_knowledge":null}
{"instance_id":"local008","db":"Baseball","question":"Tôi muốn biết tên của các cầu thủ bóng chày đã đạt được giá trị cao nhất về số trận đã chơi, số lần chạy, số lần đánh và số home run, kèm theo các giá trị điểm tương ứng của họ.","external_knowledge":null}
{"instance_id":"local009","db":"Airlines","question":"Khoảng cách của tuyến đường dài nhất mà Abakan là thành phố xuất phát hoặc thành phố đích là bao nhiêu (in kilometers)?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local010","db":"Airlines","question":"Phân phối tất cả các cặp thành phố duy nhất vào các khoảng cách 0, 1000, 2000, 3000, 4000, 5000 và 6000+, dựa trên khoảng cách trung bình của tất cả các tuyến đường giữa chúng. Sau đó, có bao nhiêu cặp ở trong khoảng cách có số lượng cặp thành phố duy nhất ít nhất?","external_knowledge":"haversine_formula.md"}
{"instance_id":"local015","db":"California_Traffic_Collision","question":"Vui lòng tính tỷ lệ tử vong cho các va chạm xe máy, được phân loại theo việc đội mũ bảo hiểm. Cụ thể, tính hai tỷ lệ phần trăm: 1) tỷ lệ tử vong của người lái xe máy trong các va chạm mà các bên (người lái xe hoặc hành khách) đội mũ bảo hiểm, và 2) tỷ lệ tử vong của người lái xe máy trong các va chạm mà các bên không đội mũ bảo hiểm. Đối với mỗi nhóm, tính bằng cáchchia tổng số tử vong của người lái xe máy cho tổng số va chạm liên quan đến nhóm đó. Sử dụng bảng parties để xác định việc đội mũ bảo hiểm (từ các trường party_safety_equipment).","external_knowledge":null}
{"instance_id":"local017","db":"California_Traffic_Collision","question":"Vào năm nào hai nguyên nhân phổ biến nhất gây tai nạn giao thông khác với các năm khác?","external_knowledge":null}
{"instance_id":"local018","db":"California_Traffic_Collision","question":"Đối với loại vi phạm yếu tố va chạm chính, là nguyên nhân phổ biến nhất gây tai nạn giao thông vào năm 2021, phần trăm điểm đóng góp của nó cho các vụ tai nạn đường bộ hàng năm năm 2021 đã giảm bao nhiêu so với phần đóng góp của nó vào năm 2011?","external_knowledge":null}
{"instance_id":"local019","db":"WWE","question":"Đối với danh hiệu NXT có trận đấu ngắn nhất (loại trừ các danh hiệu có \"title change\"), tên của hai đô vật tham gia là gì?","external_knowledge":null}
{"instance_id":"local026","db":"IPL","question":"Vui lòng giúp tôi xác định 3 người ném bóng hàng đầu, những người ở các over có số lượt chạy bị chấp nhận cao nhất ở mỗi trận đã để thua số lượt chạy cao nhất trong một over trên toàn bộ các trận đấu. Đối với từng người ném bóng này, hãy cung cấp trận đấu mà họ đã để thua những lượt chạy tối đa đó. Chỉ xem xét các over có số lượt chạy bị chấp nhận cao nhất trong từng trận và từ đó xác định xem những người ném bóng nào đã để thua nhiều lượt chạy nhất trong một over trên toàn bộ các trận đấu.","external_knowledge":null}
{"instance_id":"local020","db":"IPL","question":"Ai là người có trung bình ném bóng thấp nhất trên mỗi wicket được lấy?","external_knowledge":null}
{"instance_id":"local021","db":"IPL","question":"Bạn có thể tính trung bình của tổng số lượt chạy được ghi bởi tất cả các người chơi ghi bàn có ghi được hơn 50 lượt chạy trong bất kỳ một trận đấu nào không?","external_knowledge":null}
{"instance_id":"local022","db":"IPL","question":"Lấy danh sách tên của các người chơi ghi được ít nhất 100 điểm chạy trong một trận đấu khi thi đấu cho đội thua trận đó.","external_knowledge":null}
{"instance_id":"local023","db":"IPL","question":"Xin giúp tôi tìm tên của 5 cầu thủ đứng đầu có số chạy trung bình cao nhất mỗi trận ở mùa giải 5, cùng với các trung bình đánh bóng của họ.","external_knowledge":null}
{"instance_id":"local024","db":"IPL","question":"Bạn có thể giúp tôi tìm 5 quốc gia có các cầu thủ có mức trung bình cao nhất của trung bình số chạy trên mỗi trận đấu của họ trên toàn bộ các mùa giải không? Cụ thể, với mỗi cầu thủ, hãy tính trung bình số chạy trên mỗi trận đấu của họ trên tất cả các trận họ đã chơi, sau đó tính trung bình của các giá trị trung bình này cho từng quốc gia, và đưa các trung bình quốc gia đó vào kết quả.","external_knowledge":null}
{"instance_id":"local025","db":"IPL","question":"Đối với mỗi trận đấu, xét theo từng innings, hãy kết hợp số chạy do cả hai người đánh ghi và số chạy thừa cho mỗi over, sau đó xác định over duy nhất có tổng số chạy cao nhất, lấy người ném bóng cho over đó từ bảng ball by ball, và tính trung bình của các tổng over cao nhất này trên toàn bộ các trận đấu, đảm bảo rằng mọi số chạy và chi tiết của người ném bóng được phản ánh chính xác.","external_knowledge":null}
{"instance_id":"local028","db":"Brazilian_E_Commerce","question":"Bạn có thể tạo một báo cáo cho thấy số lượng đơn hàng đã giao cho mỗi tháng trong các năm 2016, 2017 và 2018 không? Mỗi cột đại diện cho một năm, và mỗi hàng đại diện cho một tháng.","external_knowledge":null}
{"instance_id":"local031","db":"Brazilian_E_Commerce","question":"Trong ba năm 2016, 2017 và 2018, năm có tổng lượng đơn đặt hàng được giao trong năm thấp nhất là năm nào, và trong năm đó, tháng nào có lượng đơn đặt hàng được giao hàng tháng cao nhất là bao nhiêu?","external_knowledge":null}
{"instance_id":"local029","db":"Brazilian_E_Commerce","question":"Vui lòng xác định ba khách hàng hàng đầu, dựa trên customer_unique_id của họ, những người có số lượng đơn hàng được giao nhiều nhất, và cung cấp giá trị thanh toán trung bình, thành phố và tiểu bang cho từng khách hàng trong số này.","external_knowledge":null}
{"instance_id":"local030","db":"Brazilian_E_Commerce","question":"Trong số tất cả các thành phố có đơn hàng đã giao, hãy tìm năm thành phố có tổng thanh toán thấp nhất, sau đó tính trung bình của tổng thanh toán của chúng và trung bình của tổng số đơn hàng đã giao của chúng.","external_knowledge":null}
{"instance_id":"local032","db":"Brazilian_E_Commerce","question":"Bạn có thể giúp tôi tìm các người bán nổi bật trong các danh mục sau, chỉ xét các đơn hàng đã được giao: người bán có số lượng ID khách hàng duy nhất cao nhất, người bán có lợi nhuận cao nhất (tính bằng giá trừ phí vận chuyển), người bán có số lượng đơn hàng duy nhất cao nhất, và người bán có nhiều đánh giá 5 sao nhất? Đối với mỗi danh mục, vui lòng cung cấp ID người bán và giá trị tương ứng, gắn nhãn mỗi hàng bằng mô tả thành tích.","external_knowledge":null}
{"instance_id":"local034","db":"Brazilian_E_Commerce","question":"Bạn có thể giúp tôi tính giá trị trung bình của tổng số thanh toán được thực hiện bằng phương thức thanh toán được ưa chuộng nhất cho mỗi danh mục sản phẩm, sao cho phương thức thanh toán được ưa chuộng nhất trong một danh mục là phương thức có số lần thanh toán cao nhất không?","external_knowledge":null}
{"instance_id":"local037","db":"Brazilian_E_Commerce","question":"Xác định ba danh mục sản phẩm có loại thanh toán được sử dụng nhiều nhất và có số lượng thanh toán cao nhất trên toàn bộ các danh mục, và nêu rõ số lượt thanh toán được thực hiện trong từng danh mục bằng loại thanh toán đó.","external_knowledge":null}
{"instance_id":"local035","db":"Brazilian_E_Commerce","question":"Trong bảng “olist_geolocation”, hãy xác định hai thành phố liên tiếp, khi được sắp xếp theo geolocation_state, geolocation_city, geolocation_zip_code_prefix, geolocation_lat và geolocation_lng, có khoảng cách lớn nhất giữa chúng dựa trên sự khác biệt về khoảng cách được tính giữa mỗi thành phố và thành phố đứng trước nó trong thứ tự đó.","external_knowledge":"spherical_law.md"}
{"instance_id":"local038","db":"Pagila","question":"Bạn có thể giúp tôi xác định diễn viên nào đóng vai chính nhiều nhất trong các phim dành cho trẻ em bằng tiếng Anh thuộc thể loại này, có xếp hạng G hoặc PG, thời lượng không quá 120 phút, và được phát hành từ năm 2000 đến năm 2010 không? Vui lòng cung cấp tên đầy đủ của diễn viên đó.","external_knowledge":null}
{"instance_id":"local039","db":"Pagila","question":"Xin vui lòng giúp tôi tìm thể loại phim có tổng số giờ cho thuê cao nhất ở các thành phố mà tên thành phố bắt đầu bằng chữ \"A\" hoặc chứa dấu gạch ngang.","external_knowledge":null}
{"instance_id":"local040","db":"modern_data","question":"Trong tập dữ liệu kết hợp hai nguồn dữ liệu về cây và dữ liệu thu nhập theo mã ZIP, điền các giá trị ZIP bị thiếu khi cần thiết, ba quận nào, được giới hạn ở các bản ghi có thu nhập trung vị và thu nhập trung bình đều lớn hơn 0 và có tên quận hợp lệ, chứa số cây nhiều nhất, và thu nhập trung bình cho từng quận trong ba quận này là gì?","external_knowledge":null}
{"instance_id":"local041","db":"modern_data","question":"Bao nhiêu phần trăm cây ở Bronx có trạng thái sức khỏe là tốt?","external_knowledge":null}
{"instance_id":"local049","db":"modern_data","question":"Bạn có thể giúp tôi tính trung bình số lượng công ty kỳ lân mới mỗi năm ở ngành hàng đầu từ năm 2019 đến năm 2021 không?","external_knowledge":null}
{"instance_id":"local054","db":"chinook","question":"Bạn có thể cho tôi biết những tên đầu tiên của những khách hàng đã chi dưới $1 cho các album của nghệ sĩ bán chạy nhất, cùng với số tiền họ đã chi?","external_knowledge":null}
{"instance_id":"local055","db":"chinook","question":"Xác định nghệ sĩ có tổng doanh số bán album cao nhất (điểm đồng hạng được phân xử theo thứ tự bảng chữ cái) và nghệ sĩ có tổng doanh số bán album thấp nhất (điểm đồng hạng được phân xử theo thứ tự bảng chữ cái), sau đó tính số tiền mà mỗi khách hàng chi trả cho album của hai nghệ sĩ đó. Tiếp theo, tính chi tiêu trung bình của những khách hàng mua từ nghệ sĩ bán chạy nhất và chi tiêu trung bình của những khách hàng mua từ nghệ sĩ có doanh số bán thấp nhất, và cuối cùng trả về chênh lệch tuyệt đối giữa hai mức trung bình này.","external_knowledge":null}
{"instance_id":"local198","db":"chinook","question":"Dựa vào dữ liệu doanh số, giá trị trung vị của tổng doanh thu ở các nước có số lượng khách hàng lớn hơn 4 là bao nhiêu?","external_knowledge":null}
{"instance_id":"local056","db":"sqlite-sakila","question":"Khách hàng nào có mức thay đổi trung bình hàng tháng cao nhất trong các khoản thanh toán? Vui lòng cung cấp họ và tên đầy đủ của khách hàng.","external_knowledge":null}
{"instance_id":"local058","db":"education_business","question":"Bạn có thể cung cấp danh sách các phân khúc sản phẩm phần cứng cùng với số lượng sản phẩm duy nhất cho năm 2020 trong kết quả đầu ra, được sắp xếp theo mức tăng phần trăm lớn nhất của các sản phẩm bán ra duy nhất từ 2020 đến 2021 không?","external_knowledge":null}
{"instance_id":"local059","db":"education_business","question":"Trong năm dương lịch 2021, trung bình toàn diện về số lượng đã bán của ba sản phẩm phần cứng bán chạy nhất (theo tổng số lượng bán ra) ở mỗi đơn vị?","external_knowledge":null}
{"instance_id":"local060","db":"complex_oracle","question":"Ở Hoa Kỳ, đối với Q4 2019 và Q4 2020, trước tiên hãy chọn chỉ những thành phố mà tổng doanh số (không có khuyến mãi) tăng ít nhất 20% từ Q4 2019 sang Q4 2020. Trong số các thành phố này, xếp hạng các sản phẩm theo tổng doanh số của chúng (vẫn loại trừ khuyến mãi) ở hai quý đó và lấy 20% hàng đầu. Tiếp đó tính tỉ lệ phần trăm doanh số của mỗi sản phẩm hàng đầu so với tổng doanh số ở Q4 2019 và Q4 2020 và tính sự chênh lệch về tỷ lệ từ Q4 2019 đến Q4 2020, trả về kết quả theo thứ tự giảm dần của sự thay đổi tỷ lệ.","external_knowledge":null}
{"instance_id":"local063","db":"complex_oracle","question":"Trong số tất cả các sản phẩm được bán tại Hoa Kỳ với promo_id=999, chỉ xét các thành phố có doanh số tăng ít nhất 20% từ Quý 4 năm 2019 (calendar_quarter_id=1772) đến Quý 4 năm 2020 (calendar_quarter_id=1776), sản phẩm nào, nằm trong top 20% về tổng doanh số, có sự thay đổi theo phần trăm điểm nhỏ nhất trong thị phần của tổng doanh số giữa hai quý này?","external_knowledge":null}
{"instance_id":"local061","db":"complex_oracle","question":"Doanh số hàng tháng trung bình được dự báo bằng USD cho nước Pháp năm 2021, xem xét chỉ các doanh số sản phẩm có khuyến mãi với promo_total_id = 1 và các kênh có channel_total_id = 1, bằng cách lấy doanh số hàng tháng của từng sản phẩm từ năm 2019 và 2020, tính toán tỷ lệ tăng trưởng từ 2019 đến 2020 cho cùng một sản phẩm và tháng đó, áp dụng tỷ lệ tăng trưởng này để ước tính doanh số hàng tháng năm 2021, chuyển đổi toàn bộ các số tiền dự báo năm 2021 sang USD với tỷ giá năm 2021, và cuối cùng tính trung bình và liệt kê chúng theo từng tháng?","external_knowledge":"projection_calculation.md"}
{"instance_id":"local050","db":"complex_oracle","question":"Giá trị trung vị của doanh số dự báo trung bình hàng tháng bằng USD cho Pháp trong năm 2021, được tính bằng cách sử dụng dữ liệu doanh số hàng tháng từ năm 2019 và 2020 (lọc theo promo_total_id=1 và channel_total_id=1), áp dụng tỷ lệ tăng trưởng từ 2019 đến 2020 để dự báo 2021, chuyển đổi sang USD dựa trên bảng tiền tệ, và sau đó tính các giá trị trung bình hàng tháng trước khi tìm giá trị trung vị của chúng.","external_knowledge":"projection_calculation.md"}
{"instance_id":"local062","db":"complex_oracle","question":"Vui lòng gộp tất cả khách hàng Ý thành mười nhóm cho tháng 12 năm 2021 bằng cách tổng hợp lợi nhuận từ toàn bộ các sản phẩm được mua (lợi nhuận được tính bằng tích của quantity_sold nhân với hiệu giữa unit_price và unit_cost), sau đó chia phạm vi tổng lợi nhuận hàng tháng thành mười khoảng bằng nhau. Với mỗi nhóm, hãy cung cấp số lượng khách hàng và xác định lợi nhuận tối thiểu và tối đa trong nhóm đó.","external_knowledge":null}
{"instance_id":"local067","db":"complex_oracle","question":"Bạn có thể cung cấp lợi nhuận cao nhất và thấp nhất cho khách hàng người Ý được phân khúc thành mười cấp độ được chia đều dựa trên lợi nhuận từ doanh số bán hàng của họ trong December 2021 không?","external_knowledge":null}
{"instance_id":"local070","db":"city_legislation","question":"Vui lòng xem xét các bản ghi cơ sở dữ liệu của chúng tôi cho các thành phố Trung Quốc (country_code_2 = 'cn') trong tháng 7 năm 2021 và xác định cả chuỗi ngày liên tiếp ngắn nhất và dài nhất. Đối với từng ngày trong các chuỗi này, hãy trả về đúng một bản ghi cho mỗi ngày cùng với tên thành phố tương ứng. Trong kết quả của bạn, hãy đảm bảo chữ cái đầu của mỗi tên thành phố được viết hoa và phần còn lại viết thường. Hiển thị các ngày và tên thành phố cho cả chuỗi ngày liên tiếp ngắn nhất và dài nhất, được sắp xếp theo ngày.","external_knowledge":null}
{"instance_id":"local071","db":"city_legislation","question":"Bạn có thể xem lại hồ sơ của chúng tôi trong tháng 6 năm 2022 và xác định quốc gia nào có chuỗi ngày ghi nhận thành phố được chèn liên tiếp dài nhất không? Vui lòng liệt kê các mã nước hai chữ cái của những nước đó.","external_knowledge":null}
{"instance_id":"local072","db":"city_legislation","question":"Xác định quốc gia có dữ liệu được chèn trên chín ngày khác nhau trong tháng 01 năm 2022. Sau đó, xác định khoảng thời gian liên tiếp dài nhất có dữ liệu chèn cho quốc gia này trong tháng 01 năm 2022, và tính tỷ lệ các bản ghi đến từ thủ đô của quốc gia này trong khoảng thời gian chèn liên tiếp dài nhất này.","external_knowledge":null}
{"instance_id":"local068","db":"city_legislation","question":"Tính số lượng thành phố mới được thêm vào trong tháng Tư, tháng Năm và tháng Sáu cho mỗi năm từ 2021 đến 2023. Đối với mỗi tháng, tính tổng lũy kế của số thành phố được thêm vào cho tháng đó qua các năm cho đến năm được cho (tức là tổng các số thành phố được thêm vào tháng đó qua các năm). Ngoài ra, tính tỷ lệ tăng trưởng theo năm cho cả tổng theo tháng và tổng lũy kế cho mỗi tháng, so sánh mỗi năm với năm trước. Chỉ trình bày kết quả cho năm 2022 và 2023, liệt kê năm, tháng, tổng số thành phố được thêm trong tháng đó, tổng lũy kế cho tháng đó, và tỷ lệ tăng trưởng theo năm cho cả tổng theo tháng và tổng lũy kế. Sử dụng dữ liệu từ năm 2021 làm cơ sở duy nhất để tính toán tăng trưởng và loại bỏ nó khỏi kết quả cuối cùng.","external_knowledge":null}
{"instance_id":"local073","db":"modern_data","question":"Đối với mỗi đơn đặt pizza, trả về một hàng kết quả duy nhất với ID hàng, ID đơn hàng, ID khách hàng, tên pizza, và tập hợp thành phần cuối cùng. Các thành phần cuối cùng được xác định bằng cách bắt đầu với các toppings chuẩn từ công thức của pizza, loại bỏ bất kỳ toppings bị loại trừ, và thêm bất kỳ toppings bổ sung nào. Trình bày các thành phần trong một chuỗi bắt đầu bằng tên pizza theo sau là ': ', với các thành phần được liệt kê theo thứ tự bảng chữ cái. Các thành phần xuất hiện nhiều lần (ví dụ từ toppings chuẩn và toppings bổ sung) nên được đánh dấu với '2x' và liệt kê ở đầu, tiếp theo là các thành phần xuất hiện một lần, cả hai đều theo thứ tự bảng chữ cái. Gom nhóm theo ID hàng, ID đơn, tên pizza, và thời gian đặt hàng để đảm bảo mỗi đơn hàng chỉ xuất hiện một lần. Sắp xếp kết quả theo ID hàng tăng dần. Gán pizza_id 1 cho các pizza 'Meatlovers' và pizza_id 2 cho tất cả các pizza khác.","external_knowledge":null}
{"instance_id":"local066","db":"modern_data","question":"Dựa trên thông tin đặt hàng pizza của khách hàng của chúng tôi, hãy tóm tắt tổng số lượng của mỗi nguyên liệu được sử dụng cho các chiếc pizza mà chúng tôi đã giao. Hiển thị tên và số lượng của mỗi nguyên liệu.","external_knowledge":null}
{"instance_id":"local065","db":"modern_data","question":"Tính tổng doanh thu từ các chiếc pizza Meat Lovers có giá $12 và các chiếc pizza Vegetarian có giá $10. Bao gồm bất kỳ topping bổ sung nào được tính $1 cho mỗi chiếc pizza. Đảm bảo rằng các đơn hàng bị hủy được lọc ra. Pizza Runner đã kiếm được tổng số tiền là bao nhiêu?","external_knowledge":null}
{"instance_id":"local074","db":"bank_sales_trading","question":"Vui lòng tạo một bản tổng hợp các số dư cuối kỳ của mỗi tháng cho các giao dịch của từng khách hàng, hiển thị sự thay đổi theo tháng và số dư tài khoản ngân hàng tích lũy theo tháng. Đảm bảo rằng ngay cả khi một khách hàng không có hoạt động tài khoản trong một tháng bất kỳ, số dư cho tháng đó vẫn được đưa vào kết quả.","external_knowledge":null}
{"instance_id":"local064","db":"bank_sales_trading","question":"Đối với mỗi khách hàng và mỗi tháng trong năm 2020, trước hết tính số dư cuối tháng bằng cách cộng tất cả các khoản tiền gửi và trừ tất cả các khoản rút tiền xảy ra trong tháng đó. Sau đó xác định tháng nào trong năm 2020 có số lượng khách hàng có số dư cuối tháng dương cao nhất và tháng nào có số lượng thấp nhất. Đối với hai tháng này, tính trung bình số dư cuối tháng trên toàn bộ khách hàng và đưa ra hiệu giữa hai giá trị trung bình này.","external_knowledge":null}
{"instance_id":"local297","db":"bank_sales_trading","question":"Đối với mỗi khách hàng, gom tất cả tiền gửi và rút tiền theo ngày đầu tiên của mỗi tháng để có được số dư ròng hàng tháng, sau đó tính số dư đóng tháng bằng cách cộng dồn các giá trị ròng hàng tháng này. Tiếp theo, xác định tỷ lệ tăng trưởng của tháng gần đây nhất bằng cách so sánh số dư đóng tháng đó với số dư của tháng trước, coi tiền gửi là dương và tiền rút là âm, và nếu số dư của tháng trước bằng 0 thì tỷ lệ tăng trưởng bằng số dư của tháng hiện tại nhân với 100. Cuối cùng, tính tỷ lệ phần trăm số khách hàng mà tháng gần nhất cho thấy tỷ lệ tăng trưởng lớn hơn 5%.","external_knowledge":null}
{"instance_id":"local298","db":"bank_sales_trading","question":"Đối với mỗi tháng, tính tổng số dư từ tất cả người dùng cho tháng trước (được đo vào ngày 1 của mỗi tháng), thay thế mọi số dư âm bằng 0. Đảm bảo dữ liệu từ tháng đầu tiên chỉ được dùng làm cơ sở để tính tổng số dư trước đó, và loại bỏ nó khỏi kết quả cuối cùng. Sắp xếp kết quả theo thứ tự tăng dần theo tháng.","external_knowledge":null}
{"instance_id":"local299","db":"bank_sales_trading","question":"Đối với cơ sở dữ liệu ngân hàng có giao dịch của khách hàng, tính số dư hàng ngày của mỗi khách hàng (các khoản tiền gửi làm tăng số dư và các loại giao dịch khác trừ đi số dư). Đối với mỗi khách hàng và mỗi ngày, tính trung bình lăn 30 ngày của số dư (chỉ sau khi có đủ 30 ngày dữ liệu, và coi các giá trị trung bình âm là bằng không). Sau đó ghép các giá trị trung bình hàng ngày này theo tháng và tìm số dư trung bình 30 ngày cao nhất của mỗi khách hàng trong mỗi tháng. Cộng các giá trị tối đa này lại với nhau trên tất cả khách hàng cho mỗi tháng. Xem tháng đầu tiên trong lịch sử giao dịch của mỗi khách hàng như giai đoạn cơ sở và loại bỏ nó khỏi kết quả cuối cùng, trình bày tổng hàng tháng của các giá trị tối đa 30 ngày trung bình được tổng hợp từ tất cả khách hàng.","external_knowledge":null}
{"instance_id":"local300","db":"bank_sales_trading","question":"Đối với mỗi khách hàng, tính số dư hàng ngày của họ cho từng ngày từ ngày giao dịch sớm nhất đến ngày giao dịch muộn nhất của họ, kể cả các ngày không có giao dịch bằng cách mang số dư ngày trước đó sang ngày kế tiếp. Xử lý mọi số dư hàng ngày âm bằng 0. Sau đó, đối với mỗi tháng, xác định số dư hàng ngày cao nhất mà mỗi khách hàng có trong tháng đó. Cuối cùng, đối với mỗi tháng, tổng các số dư hàng ngày tối đa này trên toàn bộ khách hàng để có tổng hàng tháng.","external_knowledge":null}
{"instance_id":"local075","db":"bank_sales_trading","question":"Bạn có thể cung cấp bảng tổng hợp số lần mỗi sản phẩm được xem, số lần chúng được thêm vào giỏ hàng, và số lần chúng bị để lại trong giỏ hàng mà chưa được mua không? Ngoài ra, cho tôi số lượng mua thực tế cho mỗi sản phẩm. Đảm bảo rằng các sản phẩm có ID trang in (1, 2, 12, 13) được lọc ra.","external_knowledge":null}
{"instance_id":"local077","db":"bank_sales_trading","question":"Xin hãy phân tích dữ liệu về các lĩnh vực quan tâm của chúng ta từ September 2018 to August 2019. Đối với mỗi tháng, tính thành phần trung bình cho mỗi lĩnh vực quan tâm bằng cách chia thành phần cho giá trị chỉ số. Xác định lĩnh vực quan tâm có giá trị thành phần trung bình cao nhất mỗi tháng và báo cáo thành phần trung bình đó là thành phần chỉ số tối đa cho tháng đó. Tính trung bình lăn ba tháng của các thành phần chỉ số tối đa hàng tháng này. Đảm bảo đầu ra bao gồm ngày, tên lĩnh vực quan tâm, thành phần chỉ số tối đa của tháng đó, trung bình lăn, và tên cùng các thành phần chỉ số tối đa của các lĩnh vực quan tâm hàng đầu từ một tháng trước và hai tháng trước.","external_knowledge":null}
{"instance_id":"local078","db":"bank_sales_trading","question":"Xác định 10 danh mục quan tâm hàng đầu và 10 danh mục quan tâm thấp nhất dựa trên giá trị thành phần cao nhất của chúng qua tất cả các tháng. Đối với mỗi danh mục, hiển thị thời gian (MM-YYYY), tên danh mục quan tâm và giá trị thành phần.","external_knowledge":null}
{"instance_id":"local081","db":"northwind","question":"Xem xét chỉ những khách hàng đã đặt hàng trong năm 1998, tính tổng số tiền mà mỗi khách hàng đã chi bằng cách cộng giá đơn vị nhân với số lượng của tất cả các sản phẩm trong các đơn đặt hàng của họ, loại trừ bất kỳ chiết khấu nào. Gán mỗi khách hàng vào một nhóm chi tiêu dựa trên ngưỡng của nhóm khách hàng, và xác định có bao nhiêu khách hàng ở mỗi nhóm chi tiêu và tỷ lệ phần trăm của tổng số khách hàng đã đặt hàng trong năm 1998 mà mỗi nhóm đại diện.","external_knowledge":null}
{"instance_id":"local085","db":"northwind","question":"Trong số những nhân viên có tổng số đơn hàng lớn hơn 50, ba người có tỷ lệ phần trăm đơn hàng trễ cao nhất, trong đó một đơn hàng được coi là trễ nếu ngày giao hàng bằng hoặc sau ngày yêu cầu? Vui lòng liệt kê mã nhân viên của từng nhân viên, số lượng đơn hàng trễ và tỷ lệ phần trăm đơn hàng trễ tương ứng.","external_knowledge":null}
{"instance_id":"local096","db":"Db-IMDB","question":"Đối với mỗi năm, tính tỷ lệ phần trăm của các bộ phim có diễn viên nữ hoàn toàn (nghĩa là không có nam diễn viên và không có diễn viên nào có giới tính được xác định). Xem các diễn viên có giới tính được gắn nhãn là 'Male' hoặc 'None' là không phải nữ. Đối với kết quả, hiển thị năm, tổng số phim trong năm đó, và tỷ lệ phần trăm của các phim có diễn viên hoàn toàn nữ. Lấy năm từ trường Movie.year bằng cách lấy 4 ký tự cuối cùng và chuyển đổi thành số.","external_knowledge":null}
{"instance_id":"local097","db":"Db-IMDB","question":"Bạn có thể phân tích dữ liệu của chúng tôi và xác định xem khoảng thời gian mười năm bắt đầu từ bất kỳ năm phát hành phim nào có mặt trong dữ liệu là khoảng nào có số lượng phim nhiều nhất, khi xem xét các khoảng thời gian mười năm liên tiếp bắt đầu từ mỗi năm duy nhất trong dữ liệu không? Chỉ in ra năm bắt đầu và tổng số lượng cho khoảng thời gian cụ thể đó.","external_knowledge":null}
{"instance_id":"local098","db":"Db-IMDB","question":"Từ năm đầu tiên mỗi diễn viên xuất hiện trong một bộ phim cho tới năm cuối cùng, có bao nhiêu diễn viên trong cơ sở dữ liệu chưa từng có một khoảng nghỉ dài hơn ba năm liên tiếp mà không có ít nhất một lần xuất hiện phim mới, có nghĩa là không có bất kỳ một khoảng thời gian bốn năm nào trong sự nghiệp diễn xuất của họ mà không có ít nhất một credit phim?","external_knowledge":null}
{"instance_id":"local099","db":"Db-IMDB","question":"Tôi cần bạn xem xét các sự hợp tác giữa các diễn viên và cho tôi biết có bao nhiêu diễn viên đã đóng nhiều phim hơn với Yash Chopra so với bất kỳ đạo diễn nào khác. Điều này sẽ giúp chúng ta hiểu rõ hơn về ảnh hưởng của ông ấy đối với ngành công nghiệp.","external_knowledge":null}
{"instance_id":"local100","db":"Db-IMDB","question":"Tìm hiểu có bao nhiêu diễn viên có một 'Shahrukh number' bằng 2? Điều này có nghĩa là họ đã đóng phim với một người từng đóng với Shahrukh Khan, nhưng không trực tiếp với anh ấy.","external_knowledge":null}
{"instance_id":"local114","db":"education_business","question":"Cung cấp một báo cáo doanh số web chi tiết cho từng vùng, bao gồm số đơn hàng, tổng doanh số và tên cùng với số tiền doanh số của tất cả các đại diện bán hàng đạt tổng doanh số cao nhất ở vùng đó (bao gồm tất cả các đại diện khi có sự bằng nhau về tổng doanh số).","external_knowledge":null}
{"instance_id":"local128","db":"BowlingLeague","question":"Liệt kê các người chơi bowling (bao gồm ID của họ, tên và họ), số trận đấu, số ván, điểm handicap, ngày giải đấu, và địa điểm cho chỉ những người chơi bowling đã thắng các ván với điểm handicap bằng 190 hoặc thấp hơn tại cả ba địa điểm: Thunderbird Lanes, Totem Lanes, và Bolero Lanes. Chỉ bao gồm các hồ sơ trận đấu cụ thể mà họ thắng với điểm handicap bằng 190 hoặc thấp hơn tại ba địa điểm này.","external_knowledge":null}
{"instance_id":"local130","db":"school_scheduling","question":"Bạn có thể cung cấp danh sách họ của tất cả các sinh viên đã hoàn thành các khóa học tiếng Anh (ở đây hoàn thành được định nghĩa là có ClassStatus = 2), cùng với xếp hạng quintile của họ dựa trên điểm số cá nhân của họ trong những khóa học đó không? Quintile được xác định bằng cách tính xem có bao nhiêu sinh viên có điểm cao hơn hoặc bằng điểm của từng sinh viên, sau đó chia xếp hạng này cho tổng số sinh viên đã hoàn thành các khóa học tiếng Anh. Các quintile nên được gắn nhãn là \"First\" (top 20%), \"Second\" (top 21-40%), \"Third\" (top 41-60%), \"Fourth\" (top 61-80%), và \"Fifth\" (bottom 20%). Vui lòng sắp xếp kết quả từ quintile có hiệu suất cao nhất đến thấp nhất (First đến Fifth).","external_knowledge":null}
{"instance_id":"local131","db":"EntertainmentAgency","question":"Bạn có thể liệt kê từng thể loại nhạc với số lần nó xuất hiện ở vị trí ưu tiên 1st, 2nd, hoặc 3rd trong một dòng duy nhất cho mỗi thể loại được không?","external_knowledge":null}
{"instance_id":"local133","db":"EntertainmentAgency","question":"Cho một cơ sở dữ liệu các thể loại nhạc và sở thích của người dùng, nơi Musical_Preferences chứa xếp hạng của người dùng đối với các thể loại nhạc (PreferenceSeq=1 cho lựa chọn đầu tiên, PreferenceSeq=2 cho lựa chọn thứ hai, PreferenceSeq=3 cho lựa chọn thứ ba): Tính điểm có trọng số cho mỗi thể loại nhạc bằng cách gán 3 điểm cho mỗi lần được xếp hạng là lựa chọn đầu tiên, 2 điểm cho mỗi lựa chọn thứ hai, và 1 điểm cho mỗi xếp hạng thứ ba. Tính tổng điểm có trọng số cho mỗi thể loại nhạc đã được xếp hạng bởi ít nhất một người dùng. Sau đó, tính hiệu tuyệt đối giữa tổng điểm có trọng số của mỗi thể loại và điểm trung bình có trọng số trên tất cả các thể loại như vậy.","external_knowledge":null}
{"instance_id":"local132","db":"EntertainmentAgency","question":"Hiển thị tất cả các cặp nghệ sĩ và khách hàng mà mỗi người có tối đa ba sở thích hoặc thế mạnh về phong cách, sao cho sở thích phong cách thứ nhất và thứ hai của khách hàng khớp với sở mạnh phong cách thứ nhất và thứ hai của nghệ sĩ (hoặc ngược lại). Chỉ trả lại nghệ danh của nghệ sĩ và họ của khách hàng.","external_knowledge":null}
{"instance_id":"local141","db":"AdventureWorks","question":"Doanh số tổng cộng hàng năm của từng nhân viên kinh doanh được so sánh với chỉ tiêu doanh số hàng năm của họ như thế nào? Cung cấp sự khác biệt giữa tổng doanh số của họ và chỉ tiêu cho từng năm, được sắp xếp theo nhân viên kinh doanh và năm.","external_knowledge":null}
{"instance_id":"local152","db":"imdb_movies","question":"Bạn có thể cung cấp 9 đạo diễn hàng đầu theo số lượng phim, bao gồm ID của họ, tên, số phim, thời lượng giữa các phim trung bình (làm tròn đến số nguyên gần nhất), đánh giá trung bình (làm tròn đến 2 chữ số thập phân), tổng lượt bỏ phiếu, điểm tối thiểu và tối đa, và tổng thời lượng phim? Sắp xếp kết quả trước tiên theo số lượng phim theo thứ tự giảm dần và sau đó theo tổng thời lượng phim theo thứ tự giảm dần.","external_knowledge":null}
{"instance_id":"local230","db":"imdb_movies","question":"Xác định ba thể loại có nhiều phim được đánh giá trên 8 nhất, và sau đó xác định bốn đạo diễn có số phim do họ đạo diễn nhiều nhất trong các thể loại đó. Liệt kê các đạo diễn này và số phim tương ứng của họ.","external_knowledge":null}
{"instance_id":"local156","db":"bank_sales_trading","question":"Phân tích giá mua trung bình hàng năm cho mỗi Bitcoin theo khu vực, được tính bằng tổng số tiền chi tiêu bằng đô la chia cho tổng số lượng mua được mỗi năm, loại trừ dữ liệu của năm đầu tiên cho mỗi khu vực. Sau đó, đối với mỗi năm, xếp hạng các khu vực dựa trên giá mua trung bình này, và tính phần trăm thay đổi hàng năm về chi phí cho mỗi khu vực so với năm trước.","external_knowledge":null}
{"instance_id":"local157","db":"bank_sales_trading","question":"Sử dụng bảng \"bitcoin_prices\", hãy tính phần trăm thay đổi theo ngày của khối lượng giao dịch cho mỗi ticker từ August 1 đến August 10, 2021, đảm bảo rằng bất kỳ khối lượng kết thúc bằng \"K\" hoặc \"M\" được chuyển đổi chính xác sang nghìn hoặc triệu, bất kỳ khối lượng mang ký hiệu \"-\" nào được coi là 0, chỉ các khối lượng khác 0 được dùng để xác định khối lượng ngày trước, và kết quả được sắp xếp theo ticker và ngày.","external_knowledge":null}
{"instance_id":"local163","db":"education_business","question":"Những giảng viên đại học nào có mức lương gần nhất với mức lương trung bình cho các cấp bậc của họ? Vui lòng cung cấp các cấp bậc, tên, họ và salaries.university","external_knowledge":null}
{"instance_id":"local168","db":"city_legislation","question":"Trong số các bài đăng tuyển dụng có vị trí nhà phân tích dữ liệu, yêu cầu mức lương trung bình hàng năm không NULL và làm việc từ xa, lương trung bình tổng thể là gì khi chỉ xét đến ba kỹ năng được yêu cầu nhiều nhất cho các vị trí này?","external_knowledge":null}
{"instance_id":"local169","db":"city_legislation","question":"Tỷ lệ duy trì hàng năm của các nghị sĩ bắt đầu nhiệm kỳ đầu tiên từ ngày 1 tháng 1 năm 1917 đến ngày 31 tháng 12 năm 1999 được đo bằng tỷ lệ của nhóm này còn tại chức vào ngày 31 tháng 12 cho mỗi trong 20 năm đầu kể từ khi bắt đầu kỳ hạn đầu tiên của họ? Kết quả nên hiển thị đầy đủ 20 giai đoạn liên tiếp bất kể có nghị sĩ nào được duy trì trong một năm cụ thể hay không.","external_knowledge":null}
{"instance_id":"local171","db":"city_legislation","question":"Đối với các nghị sĩ nam từ Louisiana, có bao nhiêu nghị sĩ khác nhau đang phục vụ vào ngày 31 tháng 12 của mỗi năm từ hơn 30 năm kể từ lần nhậm chức đầu tiên cho tới dưới 50 năm, được nhóm kết quả theo đúng số năm đã trôi qua kể từ lần nhậm chức đầu tiên?","external_knowledge":null}
{"instance_id":"local167","db":"city_legislation","question":"Dựa trên bang mà mỗi nữ đại biểu lần đầu tiên đại diện, bang nào có số lượng đại biểu nữ cao nhất mà các nhiệm kỳ của họ từng bao gồm December 31st ở bất kỳ thời điểm nào, và con số đó là bao nhiêu? Vui lòng cung cấp viết tắt của bang đó.","external_knowledge":null}
{"instance_id":"local170","db":"city_legislation","question":"Xác định các chữ viết tắt tiểu bang mà, đối với cả nam và nữ nhà lập pháp, tỷ lệ duy trì vẫn dương tại các mốc thời gian 0, 2, 4, 6, 8 và 10 năm sau ngày bắt đầu nhiệm kỳ đầu tiên của họ. Một nhà lập pháp được coi là duy trì nếu họ đang phục vụ vào ngày 31 tháng 12 của năm tương ứng. Chỉ bao gồm các tiểu bang nơi cả hai nhóm giới tính duy trì tỷ lệ duy trì ở mức dương tại tất cả sáu mốc thời gian này trong thập kỷ đầu tiên của nhiệm kỳ.","external_knowledge":null}
{"instance_id":"local193","db":"sqlite-sakila","question":"Bạn có thể tìm ra tỷ lệ phần trăm trung bình của tổng doanh thu trọn đời (LTV) xảy ra trong 7 và 30 ngày đầu tiên sau lần mua đầu tiên của khách hàng được không? Ngoài ra, hãy bao gồm cả tổng doanh thu trọn đời trung bình (LTV). Vui lòng loại trừ những khách hàng có tổng doanh thu trọn đời bằng 0. Các khoảng thời gian 7 và 30 ngày nên dựa trên số giờ-phút-giây chính xác, chứ không phải ngày theo lịch.","external_knowledge":null}
{"instance_id":"local194","db":"sqlite-sakila","question":"Vui lòng cung cấp danh sách ba phim có doanh thu cao nhất cho mỗi diễn viên, cùng với doanh thu trung bình cho mỗi diễn viên trong các phim đó, được tính bằng cách chia đều tổng doanh thu của từng phim cho số diễn viên tham gia trong từng phim.","external_knowledge":null}
{"instance_id":"local195","db":"sqlite-sakila","question":"Hãy tìm hiểu mức độ phổ biến của sức hấp dẫn của 5 diễn viên hàng đầu của chúng ta. Tỷ lệ phần trăm khách hàng của chúng ta đã thuê các bộ phim có sự tham gia của các diễn viên này là bao nhiêu?","external_knowledge":null}
{"instance_id":"local196","db":"sqlite-sakila","question":"Đối với mỗi thể loại xếp hạng của bộ phim đầu tiên được khách hàng thuê—nơi bộ phim đầu tiên được xác định dựa trên ngày thanh toán sớm nhất của từng khách hàng—hãy cung cấp tổng số tiền chi tiêu trung bình trên mỗi khách hàng và số lượt thuê tiếp theo trung bình (được tính là tổng số lượt thuê trừ đi một) cho các khách hàng có bộ phim đầu tiên được thuê thuộc thể loại xếp hạng đó.","external_knowledge":null}
{"instance_id":"local197","db":"sqlite-sakila","question":"Trong số 10 khách hàng trả tiền nhiều nhất của chúng ta, bạn có thể xác định sự chênh lệch lớn nhất về số tiền thanh toán từ một tháng sang tháng liền sau không? Cụ thể, vui lòng xác định khách hàng nào và vào tháng nào sự chênh lệch theo tháng lớn nhất này đã xảy ra, và làm tròn phần chênh lệch về hai chữ số thập phân.","external_knowledge":null}
{"instance_id":"local199","db":"sqlite-sakila","question":"Bạn có thể xác định năm và tháng có số đơn thuê cao nhất được tạo bởi nhân viên của cửa hàng cho từng cửa hàng không? Vui lòng liệt kê ID cửa hàng, năm, tháng và tổng số lượt thuê cho những ngày đó.","external_knowledge":null}
{"instance_id":"local201","db":"modern_data","question":"Xác định 10 từ đầu tiên, được sắp xếp theo thứ tự bảng chữ cái, có độ dài từ 4 đến 5 ký tự, bắt đầu bằng chữ cái 'r', và có ít nhất một anagram cùng độ dài, xét tới chữ hoa chữ thường. Cung cấp số lượng các anagram như vậy cho từng từ.","external_knowledge":null}
{"instance_id":"local202","db":"city_legislation","question":"Đối với dữ liệu người ngoài hành tinh, có bao nhiêu trong số 10 bang đứng đầu theo dân số người ngoài hành tinh có tỷ lệ người ngoài hành tinh thân thiện cao hơn người ngoài hành tinh thù địch, với tuổi trung bình của người ngoài hành tinh vượt quá 200?","external_knowledge":null}
{"instance_id":"local209","db":"delivery_center","question":"Trong bộ dữ liệu các đơn hàng được ghép với thông tin cửa hàng, cửa hàng nào có tổng số đơn hàng cao nhất, và trong các đơn hàng của cửa hàng đó, tỷ lệ các đơn hàng xuất hiện trong bảng deliveries có trạng thái 'DELIVERED' so với tổng số đơn hàng của cửa hàng đó là bao nhiêu?","external_knowledge":null}
{"instance_id":"local210","db":"delivery_center","question":"Bạn có thể xác định các trung tâm chứng kiến mức tăng hơn 20% trong số đơn hàng đã hoàn thành từ tháng Hai đến tháng Ba không?","external_knowledge":null}
{"instance_id":"local212","db":"delivery_center","question":"Bạn có thể tìm 5 tài xế giao hàng có số lần giao hàng trung bình mỗi ngày cao nhất không?","external_knowledge":null}
{"instance_id":"local218","db":"EU_soccer","question":"Bạn có thể tính trung vị của số bàn thắng cao nhất của mỗi đội trong các mùa giải không?","external_knowledge":null}
{"instance_id":"local219","db":"EU_soccer","question":"Ở mỗi giải, xét tất cả các mùa giải, đội nào có số trận thắng tổng cộng ít nhất dựa trên sự so sánh bàn thắng sân nhà và sân khách, kể cả các đội có 0 trận thắng, và đảm bảo rằng nếu có nhiều đội bằng nhau ở số trận thắng tối thiểu, thì chỉ có một đội được chọn cho mỗi giải.","external_knowledge":null}
{"instance_id":"local221","db":"EU_soccer","question":"Hãy cho tôi danh sách 10 đội có số trận thắng nhiều nhất trên toàn giải.","external_knowledge":null}
{"instance_id":"local220","db":"EU_soccer","question":"Ai là cầu thủ tham gia nhiều nhất số trận thắng và ai là cầu thủ tham gia nhiều nhất số trận thua, chỉ xét các trận đấu mà họ thực sự thi đấu (loại bỏ các giá trị null) và ở những trận đội của họ thắng hoặc thua (loại bỏ trận hòa)?","external_knowledge":null}
{"instance_id":"local228","db":"IPL","question":"Đối với mỗi mùa IPL, xác định ba batsman có tổng số runs cao nhất và ba bowler có số wickets cao nhất, loại trừ các lần bị loại ‘run out’, ‘hit wicket’, và ‘retired hurt’. Trong trường hợp hòa ở số runs hoặc số wickets, phân xử bằng ID người chơi nhỏ hơn. Sau đó xuất ra sáu người chơi này ở các vị trí ghép—batsman 1 với bowler 1, batsman 2 với bowler 2, và batsman 3 với bowler 3—theo thứ tự tăng dần của ID mùa giải, kèm theo tổng số runs hoặc wickets của mỗi người chơi.","external_knowledge":null}
{"instance_id":"local229","db":"IPL","question":"Tìm ID của các người chơi ghi được số run hợp tác cao nhất cho mỗi trận đấu. Kết quả nên bao gồm các ID của hai người chơi, mỗi người kèm với điểm số cá nhân của họ và tổng điểm hợp tác. Với mỗi cặp, người chơi có điểm số cá nhân cao hơn nên được liệt kê là người chơi 1, và người chơi có điểm số thấp hơn là người chơi 2. Trong trường hợp hai người chơi có cùng điểm số, người có ID cao hơn sẽ là người chơi 1, và người có ID thấp hơn sẽ là người chơi 2. Có thể có nhiều hàng cho một trận đấu.","external_knowledge":null}
{"instance_id":"local244","db":"music","question":"Tính thời lượng của mỗi bản nhạc, phân loại chúng thành ngắn, trung bình, hoặc dài, xuất thời gian tối thiểu và tối đa cho mỗi loại (tính bằng phút) và tổng doanh thu cho mỗi danh mục, group by danh mục.","external_knowledge":"music_length_type.md"}
{"instance_id":"local253","db":"education_business","question":"Sử dụng một bộ dữ liệu lương, nơi các giá trị lương cần được làm sạch bằng cách loại bỏ các ký tự không phải số và chuyển chúng sang kiểu số, hãy viết một truy vấn SQL chi tiết xác định top 5 công ty theo mức lương trung bình ở từng thành phố Mumbai, Pune, New Delhi và Hyderabad, sau đó so sánh mức lương trung bình của mỗi công ty ở những thành phố đó với mức lương trung bình quốc gia tổng thể. Kết quả cuối cùng nên hiển thị bốn cột: Location, Company Name, Average Salary in State, and Average Salary in Country, và liệt kê chỉ top 5 công ty ở mỗi vị trí được chỉ định.","external_knowledge":null}
{"instance_id":"local258","db":"IPL","question":"Tính tổng số lượt wicket mà mỗi bowler bắt được (loại trừ run-outs và các lần bị loại khác không thuộc bowler), tỷ lệ kinh tế của họ (tổng số run bị cho đi chia cho tổng số overs đã ném, chỉ tính các run được ghi khi đánh bóng và bỏ qua các run phụ như wides và no-balls), tỉ lệ strike (trung bình số bóng đã ném cho mỗi wicket được bắt), và thành tích bowling tốt nhất của họ trong một trận đấu duy nhất (trận đấu có số wicket do bowler bắt được nhiều nhất), được định dạng là \"wickets-runs\" trong đó runs là số run bị cho đi, không kể extras.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local259","db":"IPL","question":"Đối với mỗi người chơi, liệt kê ID của họ, tên, vai trò phổ biến nhất của họ trong tất cả các trận đấu, tay đánh bóng, kỹ năng bowling, tổng số chạy ghi được, tổng số trận đã chơi, tổng số lần bị loại, trung bình ghi chạy (tổng số chạy chia cho tổng số lần bị loại), điểm cao nhất trong một trận đấu, số trận đấu mà họ ghi được ít nhất 30 chạy, ít nhất 50 chạy và ít nhất 100 chạy, tổng số bóng đối mặt trong sự nghiệp, tỉ lệ ghi chạy (tổng số chạy chia cho tổng số bóng đối mặt, nhân với 100), tổng số wicket lấy được, tỉ lệ economy (trung bình số runs bị thua mỗi over), và hiệu suất bowling tốt nhất của họ trong một trận đấu (nhiều wickets nhất trong một trận đấu, được định dạng là \"wickets taken-runs given\", nơi hiệu suất tốt nhất là có nhiều wickets nhất, và nếu hòa thì số runs bị cho là ít nhất). Bỏ qua dữ liệu chạy thêm.","external_knowledge":"baseball_game_special_words_definition.md"}
{"instance_id":"local262","db":"stacking","question":"Vấn đề nào vượt quá tổng số lần chúng xuất hiện trong bảng giải pháp khi đếm toàn bộ các lần xuất hiện, qua các bước 1, 2 và 3, nơi mà bất kỳ mô hình không phải \"Stack\" có điểm kiểm tra tối đa thấp hơn so với điểm kiểm tra của mô hình \"Stack\" cho cùng bước và phiên bản?","external_knowledge":null}
{"instance_id":"local263","db":"stacking","question":"Xác định L1_model liên kết với mỗi model (được xác định bằng tên và phiên bản) xuất hiện nhiều nhất cho mỗi trạng thái ('strong' hoặc 'soft'), cùng với số lần nó xuất hiện. Một mô hình có trạng thái 'strong' nếu, đối với bất kỳ bước nào của nó, điểm kiểm tra tối đa giữa các mô hình không thuộc 'Stack' là nhỏ hơn điểm kiểm tra của mô hình 'Stack'. Nó có trạng thái 'soft' nếu điểm kiểm tra tối đa giữa các mô hình không thuộc 'Stack' bằng với điểm kiểm tra của mô hình 'Stack'. Đếm xem mỗi L1_model được liên kết với trạng thái 'strong' hoặc 'soft' trên toàn bộ các mô hình, và xác định L1_model nào có số lần xuất hiện cao nhất cho mỗi trạng thái.","external_knowledge":null}
{"instance_id":"local264","db":"stacking","question":"Nhóm mô hình nào (L1_model) xuất hiện nhiều nhất trên toàn bộ các bước và phiên bản khi so sánh các mô hình truyền thống với mô hình Stack, và tổng số lần xuất hiện của nó là bao nhiêu?","external_knowledge":null}
{"instance_id":"local269","db":"oracle_sql","question":"Trung bình tổng số lượng của tất cả các tổ hợp đóng gói cuối cùng, chỉ xét các mặt hàng ở cấp lá trong từng tổ hợp sau khi đã mở rộng đầy đủ mọi mối quan hệ đóng gói lồng nhau.","external_knowledge":null}
{"instance_id":"local270","db":"oracle_sql","question":"Những container đóng gói ở cấp độ cao nhất, nghĩa là những container không bị chứa trong bất kỳ container đóng gói nào khác, có bất kỳ mặt hàng nào mà tổng số lượng tích lũy qua tất cả các cấp lồng nhau trong hệ phân cấp vượt quá 500, và tên của cả hai container này cùng với các mặt hàng tương ứng là gì?","external_knowledge":null}
{"instance_id":"local272","db":"oracle_sql","question":"Đối với đơn hàng 423, xác định các mã sản phẩm, khu vực lưu kho và vị trí để lấy đúng số lượng cần cho từng dòng đơn hàng, sao cho tổng số lượng đã lấy cho mỗi sản phẩm khớp với tổng số lượng đặt hàng tích lũy mà không vượt quá tồn kho có sẵn ở kho 1. Tính toán số lượng cần lấy từ mỗi vị trí bằng cách ưu tiên tồn kho có ngày mua sớm hơn và số lượng nhỏ hơn, và đảm bảo việc lấy hàng tuân thủ trình tự và tổng số lượng tích lũy của các dòng đơn hàng đối với các sản phẩm có nhiều mục.","external_knowledge":null}
{"instance_id":"local273","db":"oracle_sql","question":"Tính tỷ lệ lấy hàng trung bình cho mỗi tên sản phẩm, sử dụng phương pháp FIFO (nhập trước, xuất trước) để chọn từ các vị trí tồn kho dựa trên ngày mua sớm nhất và số lượng có sẵn nhỏ nhất, đảm bảo số lượng lấy được phản ánh đúng phần giao thoa giữa số lượng yêu cầu của mỗi đơn hàng và số lượng tồn kho có sẵn, sau đó nhóm và sắp xếp kết quả theo tên sản phẩm?","external_knowledge":null}
{"instance_id":"local274","db":"oracle_sql","question":"Những sản phẩm nào đã được chọn cho đơn hàng 421, và trung bình số lượng đơn vị được lấy cho mỗi sản phẩm là bao nhiêu, theo phương pháp FIFO (Nhập trước, Xuất trước)?","external_knowledge":null}
{"instance_id":"local275","db":"oracle_sql","question":"Dựa trên dữ liệu bán hàng theo tháng bắt đầu từ tháng 1 năm 2016 và sử dụng trung bình động căn giữa để điều chỉnh theo mùa, những sản phẩm nào có tỷ lệ doanh số được điều chỉnh theo mùa luôn ở mức trên 2 cho mọi tháng trong năm 2017?","external_knowledge":"calculation_method.md"}
{"instance_id":"local277","db":"oracle_sql","question":"Doanh số dự báo trung bình hàng năm cho các sản phẩm 4160 và 7790 trong năm 2018 là bao nhiêu, sử dụng dữ liệu doanh số hàng tháng bắt đầu từ tháng 1 năm 2016 cho 36 tháng đầu tiên, áp dụng các điều chỉnh mùa vụ từ bước thời gian 7 đến 30, và sử dụng một phương pháp hồi quy có trọng số để ước lượng doanh số?","external_knowledge":"calculation_method.md"}
{"instance_id":"local279","db":"oracle_sql","question":"Sử dụng một mô hình điều chỉnh tồn kho hàng tháng có tính đệ quy bắt đầu từ mức tồn kho tháng 12 năm 2018, nơi chúng ta bổ sung một sản phẩm nếu tồn kho cuối kỳ của nó giảm xuống dưới mức tối thiểu được yêu cầu, xác định với từng sản phẩm tháng nào trong năm 2019 mà độ chênh lệch tuyệt đối giữa tồn kho cuối kỳ của nó và mức tối thiểu được yêu cầu là nhỏ nhất, và trả về product_id, tháng đó, và độ chênh lệch tuyệt đối.","external_knowledge":null}
{"instance_id":"local283","db":"EU_soccer","question":"Phân tích bộ dữ liệu các trận đấu bóng đá để xác định đội vô địch cho mỗi mùa giải trên mọi quốc gia và giải đấu, với quy ước: 3 điểm cho mỗi chiến thắng, 1 điểm cho mỗi trận hòa, và 0 điểm cho mỗi thất bại. Với mỗi mùa giải, trả về tên đội vô địch, giải đấu, quốc gia và tổng điểm tích lũy.","external_knowledge":null}
{"instance_id":"local284","db":"bank_sales_trading","question":"Đối với veg whsle data, bạn có thể tạo một bản tóm tắt về tỷ lệ mất mát của các mặt hàng của chúng ta không? Bao gồm tỷ lệ mất mát trung bình, và cũng phân loại số mặt hàng nằm ở dưới, ở trên, và nằm trong phạm vi một độ lệch chuẩn so với mức trung bình này.","external_knowledge":null}
{"instance_id":"local285","db":"bank_sales_trading","question":"Đối với dữ liệu veg whsle, bạn có thể phân tích hiệu suất tài chính của chúng ta theo các năm từ 2020 đến 2023 không? Tôi cần thông tin về giá sỉ trung bình, giá sỉ tối đa, giá sỉ tối thiểu, sự chênh lệch giá sỉ, tổng giá sỉ, tổng giá bán, tỷ lệ lỗ trung bình, tổng lỗ và lợi nhuận cho từng danh mục trong từng năm. Làm tròn mọi giá trị tính được ở hai chữ số thập phân.","external_knowledge":null}
{"instance_id":"local286","db":"electronic_sales","question":"Chuẩn bị một báo cáo hiệu suất toàn diện về các người bán của chúng ta, tập trung vào tổng doanh số, giá trung bình mỗi mặt hàng, điểm đánh giá trung bình và thời gian đóng gói. Đảm bảo báo cáo chỉ bao gồm những người bán đã bán được trên 100 sản phẩm và làm nổi bật tên danh mục sản phẩm bằng tiếng Anh có khối lượng bán hàng cao nhất.","external_knowledge":null}
{"instance_id":"local301","db":"bank_sales_trading","question":"Đối với dữ liệu doanh số theo tuần, tôi cần một phân tích về hiệu suất bán hàng của chúng ta ở quanh giữa tháng 6 cho các năm 2018, 2019 và 2020. Cụ thể, tính tỷ lệ phần trăm thay đổi doanh số giữa bốn tuần trước ngày June 15 và bốn tuần sau ngày June 15 cho từng năm.","external_knowledge":null}
{"instance_id":"local302","db":"bank_sales_trading","question":"Phân tích sự biến động trung bình theo phần trăm doanh số giữa 12 tuần trước và sau ngày 15 tháng 6 năm 2020, cho mỗi loại thuộc tính: khu vực, nền tảng, khung tuổi, nhân khẩu học và loại khách hàng. Đối với mỗi loại thuộc tính, tính toán sự biến động trung bình theo phần trăm của doanh số trên tất cả các giá trị thuộc tính của nó. Xác định loại thuộc tính có tác động tiêu cực lớn nhất lên doanh số và cung cấp giá trị biến động trung bình theo phần trăm của doanh số của loại đó.","external_knowledge":null}
{"instance_id":"local329","db":"log","question":"Có bao nhiêu phiên duy nhất đã ghé thăm trang /regist/input và sau đó trang /regist/confirm, theo đúng thứ tự đó?","external_knowledge":null}
{"instance_id":"local330","db":"log","question":"Sử dụng bảng nhật ký hoạt động, tính tổng số phiên người dùng duy nhất mà mỗi trang web xuất hiện dưới dạng một landing page (trang đầu tiên được truy cập trong một phiên dựa trên thời gian) hoặc một exit page (trang cuối cùng được truy cập trong một phiên dựa trên thời gian), hoặc cả hai. Đếm mỗi phiên chỉ một lần cho mỗi trang, ngay cả khi trang đó đóng vai trò là cả landing page và exit page cho phiên đó.","external_knowledge":null}
{"instance_id":"local331","db":"log","question":"Ba lượt truy cập trang thứ ba khác nhau nào được quan sát nhiều nhất ngay sau hai lượt truy cập liên tiếp vào trang '/detail', và mỗi lượt truy cập trang thứ ba đó xuất hiện bao nhiêu lần?","external_knowledge":null}
{"instance_id":"local358","db":"log","question":"Có bao nhiêu người dùng ở mỗi nhóm tuổi (20s, 30s, 40s, 50s và các nhóm khác)?","external_knowledge":null}
{"instance_id":"local360","db":"log","question":"Đối với mỗi phiên người dùng trong bảng nhật ký hoạt động, hãy xác định số lượng sự kiện xảy ra trước lần nhấp '/detail' đầu tiên hoặc trước chuyển đổi '/complete', chỉ tính các sự kiện có loại tìm kiếm không rỗng. Tìm các phiên có số lượng tối thiểu của các sự kiện trước nhấp hoặc trước chuyển đổi như vậy. Nếu có nhiều phiên có cùng số tối thiểu này, hãy đưa tất cả vào kết quả. Trả về mỗi phiên đủ điều kiện cùng với đường dẫn tương ứng và loại tìm kiếm.","external_knowledge":null}
{"instance_id":"local344","db":"f1","question":"Xem xét tất cả các cuộc đua có dữ liệu pit stop có sẵn, và tập trung vào những trường hợp khi một tay đua không ở phía sau một xe khác ở vòng trước nhưng ở phía sau ở vòng hiện tại (tính cả bỏ cuộc, lượt vào pit-stop, lượt ra pit-stop, và lượt xuất phát), có bao nhiêu lần mỗi loại vượt đã xảy ra trong Formula 1?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local336","db":"f1","question":"Trong năm vòng đầu tiên của cuộc đua, có bao nhiêu lần vượt ở mỗi hạng mục — bỏ cuộc, vào pit, vượt liên quan đến xuất phát, và các lượt vượt tiêu chuẩn trên đường đua?","external_knowledge":"f1_overtake.md"}
{"instance_id":"local335","db":"f1","question":"Trong các mùa giải Formula 1 kể từ năm 2001, chỉ xét những tay đua ghi điểm trong một mùa giải, năm nhà sản xuất nào đã có nhiều mùa giải nhất mà các tay đua của họ ghi tổng điểm thấp nhất so với tất cả các tay đua ghi điểm trong mùa giải đó?","external_knowledge":null}
{"instance_id":"local309","db":"f1","question":"Trong mỗi năm, tay đua nào và nhà chế tạo nào đã ghi được nhiều điểm nhất? Tôi muốn tên đầy đủ của mỗi tay đua.","external_knowledge":null}
{"instance_id":"local310","db":"f1","question":"Chỉ sử dụng dữ liệu từ bảng ‘results’, tìm ba năm mà tổng điểm tối đa mà bất kỳ tay đua nào kiếm được và tổng điểm tối đa mà bất kỳ nhà chế tạo nào kiếm được trong năm đó (cả hai được tính bằng tổng điểm từ bảng ‘results’) là nhỏ nhất, và liệt kê ba năm đó theo thứ tự tăng dần của tổng điểm.","external_knowledge":null}
{"instance_id":"local311","db":"f1","question":"Những nhà sản xuất nào có top 3 tổng điểm ghép từ tay đua tốt nhất của họ và đội đua của họ, và vào những năm nào họ đạt được chúng?","external_knowledge":null}
{"instance_id":"local354","db":"f1","question":"Trong số các tay đua Formula 1 thi đấu vào thập kỷ 1950, những tay đua nào đã hoàn thành một mùa giải trong thập kỷ đó với cùng một nhà sản xuất ở cả cuộc đua đầu tiên và cuộc đua cuối cùng mà họ tham gia, đồng thời cũng tham dự ít nhất hai vòng đua khác nhau trong mùa giải đó?","external_knowledge":null}
{"instance_id":"local355","db":"f1","question":"Tính giá trị trung bình tổng thể của lượt đầu tiên và lượt cuối cùng của các cuộc đua bị bỏ qua bởi các tay đua Formula 1 trên toàn bộ các năm. Chỉ bao gồm các tay đua bỏ lỡ ít hơn ba cuộc đua trong một năm nhất định và những người đã đổi đội giữa các lần xuất hiện ngay trước và sau thời gian nghỉ của họ (tức là constructor ID cho cuộc đua ngay trước lần bỏ lỡ đầu tiên của họ phải khác với constructor ID cho cuộc đua ngay sau lần bỏ lỡ cuối cùng của họ trong năm đó). Không ghép kết quả theo năm; trả lại chỉ các giá trị trung bình trên toàn bộ tập dữ liệu.","external_knowledge":null}
{"instance_id":"local356","db":"f1","question":"Liệt kê đầy đủ họ và tên của các tay đua đã bị vượt trên đường đua nhiều lần hơn so với số lần họ vượt người khác trên đường đua trong các vòng đua, loại trừ các thay đổi vị trí do pit stop (cả khi vào pit và ra pit), bỏ cuộc, hoặc các thay đổi vị trí diễn ra trong vòng đầu tiên của cuộc đua (được coi là các động thái khởi động).","external_knowledge":null}
{"instance_id":"sf001","db":"GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI","question":"Giả sử hôm nay là ngày 1 tháng 4 năm 2024, tôi muốn biết lượng tuyết rơi hàng ngày lớn hơn 6 inches cho mỗi mã bưu điện Hoa Kỳ trong tuần kết thúc sau hai tuần đầy đủ đầu tiên của năm trước. Hiển thị mã bưu điện, ngày và lượng tuyết rơi.","external_knowledge":null}
{"instance_id":"sf003","db":"GLOBAL_GOVERNMENT","question":"Đối với mỗi năm từ 2015 đến 2020, khu vực ZCTA (Zip Code Tabulation Area) của Census nào có tốc độ tăng trưởng dân số hàng năm cao thứ hai? Chỉ bao gồm các khu vực có ước tính dân số tối thiểu 25.000 người trong năm đó (dựa trên ước tính Khảo sát Cộng đồng Mỹ theo chu kỳ 5 năm). Với mỗi năm, hãy cung cấp mã bưu điện, chữ viết tắt tiểu bang, và tỷ lệ tăng trưởng hàng năm ở dạng phần trăm.","external_knowledge":null}
{"instance_id":"sf002","db":"FINANCE__ECONOMICS","question":"Tính đến ngày 31 tháng 12 năm 2022, liệt kê 10 ngân hàng hoạt động hàng đầu có tổng tài sản vượt quá 10 tỷ USD, được xếp hạng theo tỷ lệ cao nhất của tài sản chưa được bảo hiểm, trong đó tỷ lệ được tính bằng một trừ giá trị của biến '% Insured (Estimated)' từ các ước tính theo quý. Cung cấp tên của các ngân hàng này và tỷ lệ tài sản chưa được bảo hiểm tương ứng.","external_knowledge":null}
{"instance_id":"sf044","db":"FINANCE__ECONOMICS","question":"Phần trăm thay đổi của giá đóng cửa sau giờ giao dịch cho các công ty công nghệ Magnificent 7 từ ngày 1 tháng 1 năm 2024 đến ngày 30 tháng 6 năm 2024 là bao nhiêu?","external_knowledge":null}
{"instance_id":"sf006","db":"FINANCE__ECONOMICS","question":"Đối với mỗi tiểu bang ở Hoa Kỳ, hãy xác định số lượng thực thể chi nhánh tài chính đang hoạt động đã thay đổi như thế nào từ March 1, 2020 đến December 31, 2021. Một thực thể được coi là đang hoạt động vào một ngày cụ thể nếu ngày bắt đầu của nó nằm ở hoặc trước ngày đó và ngày kết thúc của nó là null hoặc nằm ở hoặc sau ngày đó. Đối với mỗi tiểu bang, tính số lượng thực thể hoạt động vào March 1, 2020, số lượng thực thể hoạt động vào December 31, 2021, và tỷ lệ phần trăm thay đổi giữa hai con số này.","external_knowledge":null}
{"instance_id":"sf008","db":"US_REAL_ESTATE","question":"Xác định sự biến động theo phần trăm của dòng thu nhập gộp và chỉ số giá nhà ở theo mục đích mua được điều chỉnh theo mùa cho khu vực đô thị Phoenix-Mesa-Scottsdale, AZ Metro Area từ January 1, 2023, đến December 31, 2023. Dòng thu nhập gộp đề cập đến tổng thu nhập chịu thuế đã được điều chỉnh từ tất cả các thực thể tài chính trong khu vực metro được chỉ định.","external_knowledge":null}
{"instance_id":"sf010","db":"US_REAL_ESTATE","question":"Những tỷ lệ tích lũy của các khoản thế chấp gần vỡ nợ ở California cho mỗi ngày được ghi nhận trong năm 2023, bao gồm những khoản quá hạn từ 90 đến 180 ngày, đang được ân hạn, hoặc đang trong quá trình tịch biên/phát mãi tài sản đảm bảo, phá sản, hoặc deed-in-lieu.","external_knowledge":null}
{"instance_id":"sf037","db":"US_REAL_ESTATE","question":"Làm thế nào để chúng ta tìm khoảng cách thẳng hàng ngắn nhất bằng dặm giữa mỗi cửa hàng 'The Home Depot' và vị trí gần nhất của nó 'Lowe's Home Improvement'? Sử dụng cơ sở dữ liệu US_REAL_ESTATE.CYBERSYN, ghép bảng point_of_interest_index với point_of_interest_addresses_relationships và us_addresses để lấy tọa độ địa lý. Đối với mỗi vị trí của 'The Home Depot' (được xác định bởi poi_id của nó), tính khoảng cách của nó tới tất cả các cửa hàng 'Lowe's Home Improvement' bằng các hàm ST_DISTANCE và ST_MAKEPOINT, chuyển đổi khoảng cách từ mét sang dặm (chia cho 1609), và trả về chỉ bản ghi có khoảng cách nhỏ nhất cho mỗi cửa hàng 'The Home Depot' bằng cách sử dụng QUALIFY với ROW_NUMBER().","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf012","db":"WEATHER__ENVIRONMENT","question":"Sử dụng dữ liệu từ FEMA National Flood Insurance Program Claim Index, cho mỗi năm từ 2010 đến 2019, tổng số tiền thiệt hại về xây dựng và tổng số tiền thiệt hại về nội dung được báo cáo dưới Chương trình Bảo hiểm Lũ lụt Quốc gia cho cộng đồng NFIP có tên 'City Of New York', được nhóm theo từng năm xảy ra thiệt hại?","external_knowledge":null}
{"instance_id":"sf018","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Xem xét tương tác của người dùng với các thông báo đẩy trong một khung giờ được chỉ định vào ngày 1 tháng 6 năm 2023.","temporal":"Yes","external_knowledge":"PushNotificationAnalysis.md"}
{"instance_id":"sf035","db":"BRAZE_USER_EVENT_DEMO_DATASET","question":"Có bao nhiêu người dùng duy nhất đã bắt đầu các phiên mỗi ngày trong từng nhóm ứng dụng từ June 1, 2023 đến June 7, 2023? Đồng thời hiển thị ID của nhóm ứng dụng và ngày bắt đầu của phiên.","external_knowledge":null}
{"instance_id":"sf029","db":"AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET","question":"Tạo một báo cáo bán hàng hàng ngày chi tiết cho từng sản phẩm trong 'Manufacturing' distributor_view, bao phủ 30 days tính đến February 6, 2022, bằng cách ghép dữ liệu từ sales, traffic, inventory và net PPM dựa trên date, ASIN, program, period và distributor_view. Báo cáo phải bao gồm tổng số đơn vị đặt hàng, doanh thu từ đặt hàng, giá bán trung bình, lượt xem nhanh, tỷ lệ chuyển đổi, số lượng đã vận chuyển, doanh thu từ vận chuyển, net PPM trung bình, OOS của sản phẩm có thể mua trung bình, tổng số đơn vị hiện có và giá trị, số lượng nhận được và giá trị, số lượng đơn đặt hàng đang mở, số lượng khách hàng đặt hàng chưa được phục vụ, và tỷ lệ xác nhận của nhà cung cấp, tỷ lệ lấp đầy khi nhận, tỷ lệ tiêu thụ và thời gian dẫn đầu của nhà cung cấp.","external_knowledge":null}
{"instance_id":"sf040","db":"US_ADDRESSES__POI","question":"Tìm 10 địa chỉ phía bắc nhất trong khu vực mã ZIP lớn nhất ở Florida. Các số địa chỉ, tên đường và loại của chúng là gì?","temporal":"Yes","external_knowledge":null}
{"instance_id":"sf009","db":"NETHERLANDS_OPEN_MAP_DATA","question":"Một công ty bất động sản cần một bản so sánh chi tiết đối chiếu song song các tòa nhà ở Amsterdam và Rotterdam. Họ yêu cầu một báo cáo cho thấy mỗi lớp và tiểu lớp của tòa nhà, với tổng diện tích (tính bằng mét vuông) và tổng số tòa nhà cho từng danh mục phân loại ở cả hai thành phố. Dữ liệu nên được sắp xếp theo lớp tòa nhà và tiểu lớp theo thứ tự tăng dần, với số liệu của Amsterdam và Rotterdam được trình bày trong các cột song song để tiện cho so sánh trực tiếp. Bạn có thể tạo báo cáo so sánh phân loại tòa nhà toàn diện này được không?","external_knowledge":null}
{"instance_id":"sf013","db":"NETHERLANDS_OPEN_MAP_DATA","question":"So sánh tổng chiều dài đường ở Amsterdam và Rotterdam bằng cách tạo một phân tích đối chiếu song song cho cả hai thành phố. Đối với mỗi tổ hợp của lớp đường và phân loại phụ, tính tổng chiều dài đường (tính bằng mét) cho các đoạn QUADKEY '12020210' và '12020211'. Trình bày kết quả với các cột: lớp, phân loại phụ, chiều dài đường ở Amsterdam và chiều dài đường ở Rotterdam.","external_knowledge":null}
{"instance_id":"sf041","db":"YES_ENERGY__SAMPLE_DATA","question":"Lập một báo cáo cho ERCOT vào October 1, 2022, kết hợp dữ liệu theo giờ về giá day-ahead và real-time từ node ID 10000697078, dự báo tải (datatypeid 19060) và tải thực tế, cùng với dự báo sản lượng gió (forecast datatypeid 9285, actual datatypeid 16) và sản lượng mặt trời (forecast datatypeid 662, actual datatypeid 650) từ object ID 10000712973. Báo cáo này nên bao gồm căn chỉnh múi giờ, phân loại đỉnh tải và tính toán tải ròng, cung cấp cái nhìn về động lực vận hành hàng ngày và hiệu quả.","temporal":"Yes","external_knowledge":"ERCOT_Daily_Market_Dynamics_Report.md"}
{"instance_id":"sf011","db":"CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE","question":"Xác định phân bổ dân số trong mỗi nhóm khối dân cư so với khu vực điều tra dân số của nó ở tiểu bang New York bằng dữ liệu ACS 2021. Bao gồm ID nhóm khối dân cư, giá trị điều tra dân số, mã khu vực điều tra theo tiểu bang/quận, dân số toàn khu vực điều tra, và tỷ lệ dân số của từng nhóm khối dân cư.","external_knowledge":null}
{"instance_id":"sf014","db":"CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE","question":"Mã ZIP của tiểu bang New York có số người đi làm vượt quá một giờ cao nhất theo dữ liệu ACS năm 2021? Bao gồm mã ZIP, tổng số người đi làm, chuẩn tham chiếu của tiểu bang cho khoảng thời gian này và dân số của tiểu bang.","external_knowledge":null}
