{
  "table_name": "docs_27",
  "table_fullname": "bigquery-public-data.ebi_chembl.docs_27",
  "column_names": [
    "id_documento",
    "revista",
    "ano",
    "volume",
    "edicao",
    "primeira_pagina",
    "ultima_pagina",
    "id_pubmed",
    "doi",
    "id_chembl",
    "titulo",
    "tipo_documento",
    "autores",
    "resumo",
    "id_patente",
    "ridx",
    "id_fonte"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "nested_column_names": [
    "id_documento",
    "revista",
    "ano",
    "volume",
    "edição",
    "primeira_página",
    "última_página",
    "id_pubmed",
    "doi",
    "id_chembl",
    "título",
    "tipo_documento",
    "autores",
    "resumo",
    "id_patente",
    "ridx",
    "id_fonte"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "description": [
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null
  ],
  "sample_rows": [
    {
      "id_documento": "69727",
      "revista": "Chem Cent J",
      "ano": "2012",
      "volume": "6",
      "edição": "28",
      "primeira_página": null,
      "última_página": null,
      "id_pubmed": "22483270",
      "doi": "10.1186/1752-153x-6-28",
      "id_chembl": "CHEMBL3046882",
      "título": "Synthesis and antibacterial activity against ralstonia solanacearum for novel hydrazone derivatives containing a pyridine moiety.",
      "tipo_documento": "PUBLICATION",
      "autores": "Wu J, Kang S, Song B, Hu D, He M, Jin L, Yang S.",
      "resumo": "BACKGROUND: Ralstonia solanacearum, one of the most important bacterial diseases on plants, is a devastating, soil-borne plant pathogen with a global distribution and an unusually wide host range. In order to discover new bioactive molecules and pesticides acting on tobacco bacterial wilt, we sought to combine the active structure of hydrazone and pyridine together to design and synthesize a series of novel hydrazone derivatives containing a pyridine moiety. RESULTS: A series of hydrazone derivatives containing a pyridine moiety were synthesized. Their structures were characterized by 1 H-NMR, 13 C-NMR, IR, and elemental analysis. The preliminary biological activity tests showed that compound 3e and 3g exhibited more than 80% activity against Ralstonia solanacearum at 500 mg/L, especially compound 3g displayed relatively good activity to reach 57.0% at 200 mg/L. CONCLUSION: A practical synthetic route to hydrazone derivatives containing a pyridine moiety by the reaction of intermediates 2 with different aldehydes in ethanol at room temperature using 2-chloronicotinic acid and 2-amino-5-chloro-3-methylbenzoic acid as start materials is presented. This study suggests that the hydrazone derivatives containing a substituted pyridine ring could inhibit the growth of Ralstonia solanacearum.",
      "id_patente": null,
      "ridx": "CLD0",
      "id_fonte": "1"
    },
    {
      "id_documento": "59326",
      "revista": "Drug Discovery Today",
      "ano": "2011",
      "volume": "16",
      "edição": "15-16",
      "primeira_página": "697",
      "última_página": "703",
      "id_pubmed": "21624500",
      "doi": "10.1016/j.drudis.2011.05.007",
      "id_chembl": "CHEMBL1909281",
      "título": "FDA-approved drug labeling for the study of drug-induced liver injury.",
      "tipo_documento": "PUBLICATION",
      "autores": "Chen M, Vijay V, Shi Q, Liu Z, Fang H, Tong W.",
      "resumo": "Drug-induced liver injury (DILI) is a leading cause of drugs failing during clinical trials and being withdrawn from the market. Comparative analysis of drugs based on their DILI potential is an effective approach to discover key DILI mechanisms and risk factors. However, assessing the DILI potential of a drug is a challenge with no existing consensus methods. We proposed a systematic classification scheme using FDA-approved drug labeling to assess the DILI potential of drugs, which yielded a benchmark dataset with 287 drugs representing a wide range of therapeutic categories and daily dosage amounts. The method is transparent and reproducible with a potential to serve as a common practice to study the DILI of marketed drugs for supporting drug discovery and biomarker development.",
      "id_patente": null,
      "ridx": "CLD0",
      "id_fonte": "1"
    },
    {
      "id_documento": "77450",
      "revista": "Gastroenterol Clin Biol",
      "ano": "2004",
      "volume": "28",
      "edição": "8-9",
      "primeira_página": "720",
      "última_página": "759",
      "id_pubmed": "15646539",
      "doi": "10.1016/s0399-8320(04)95062-2",
      "id_chembl": "CHEMBL3137667",
      "título": "[Drug-induced liver injury; fourteenth updated edition of the bibliographic database of liver injuries and related drugs].",
      "tipo_documento": "PUBLICATION",
      "autores": "Biour M, Ben Salem C, Chazouillères O, Grangé JD, Serfaty L, Poupon R.",
      "resumo": null,
      "id_patente": null,
      "ridx": "CLD0",
      "id_fonte": "1"
    },
    {
      "id_documento": "109533",
      "revista": "Bioorg Med Chem Lett",
      "ano": "2018",
      "volume": "28",
      "edição": "23-24",
      "primeira_página": "3798",
      "última_página": "3801",
      "id_pubmed": "30327145",
      "doi": "10.1016/j.bmcl.2018.09.020",
      "id_chembl": "CHEMBL4257568",
      "título": "Synthesis, hepatotoxic evaluation and antipyretic activity of nitrate ester analogs of the acetaminophen derivative SCP-1.",
      "tipo_documento": "PUBLICATION",
      "autores": "Das M, Bhattacharjee S, Fronczek FR, Bazan NG, Trudell ML.",
      "resumo": "A series of nitrate ester analogues of the acetaminophen derivative SCP-1 were prepared by triflic acid catalyzed O-acylation of SCP-1 with chloroalkanoyl chlorides followed by nitration with silver nitrate. The chloroesters and corresponding nitrate esters were obtained in high yields. Preliminary hepatotoxicity studies revealed nitrate esters 5b (MD-38) and 5c (MD-39) to be well tolerated by human hepatocytes and had little effect on the three cytochrome P450 enzymes tested (CYP3A4, CYP2E1 and CYP2D6). In addition, the nitrate ester 5c (MD-39) exhibited antipyretic activity similar to acetaminophen.",
      "id_patente": null,
      "ridx": "30327145",
      "id_fonte": "1"
    },
    {
      "id_documento": "109534",
      "revista": "Bioorg Med Chem Lett",
      "ano": "2018",
      "volume": "28",
      "edição": "23-24",
      "primeira_página": "3793",
      "última_página": "3797",
      "id_pubmed": "30327146",
      "doi": "10.1016/j.bmcl.2018.09.036",
      "id_chembl": "CHEMBL4257569",
      "título": "Novel KV7 ion channel openers for the treatment of epilepsy and implications for detrusor tissue contraction.",
      "tipo_documento": "PUBLICATION",
      "autores": "Seefeld MA, Lin H, Holenz J, Downie D, Donovan B, Fu T, Pasikanti K, Zhen W, Cato M, Chaudhary KW, Brady P, Bakshi T, Morrow D, Rajagopal S, Samanta SK, Madhyastha N, Kuppusamy BM, Dougherty RW, Bhamidipati R, Mohd Z, Higgins GA, Chapman M, Rouget C, Lluel P, Matsuoka Y.",
      "resumo": "Neuronal voltage-gated potassium channels, KV7s, are the molecular mediators of the M current and regulate membrane excitability in the central and peripheral neuronal systems. Herein, we report novel small molecule KV7 openers that demonstrate anti-seizure activities in electroshock and pentylenetetrazol-induced seizure models without influencing Rotarod readouts in mice. The anti-seizure activity was determined to be proportional to the unbound concentration in the brain. KV7 channels are also expressed in the bladder smooth muscle (detrusor) and activation of these channels may cause localized undesired effects. Therefore, the impact of individual KV7 isoforms was investigated in human detrusor tissue using a panel of KV7 openers with distinct activity profiles among KV7 isoforms. KCNQ4 and KCNQ5 mRNA were highly expressed in detrusor tissue, yet a compound that has significantly reduced activity on homomeric KV7.4 did not reduce detrusor contraction. This may suggest that the homomeric KV7.4 channel plays a less significant role in bladder contraction and further investigation is needed.",
      "id_patente": null,
      "ridx": "30327146",
      "id_fonte": "1"
    }
  ]
}