{
  "table_name": "TCGA_CDR",
  "table_fullname": "isb-cgc-bq.pancancer_atlas.TCGA_CDR",
  "column_names": [
    "CodeBarreParticipant",
    "Etude",
    "OS",
    "temps_OS",
    "DSS",
    "temps_DSS",
    "DFI",
    "temps_DFI",
    "PFI",
    "temps_PFI",
    "Redaction"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "STRING"
  ],
  "nested_column_names": [
    "CodeBarreParticipant",
    "Etude",
    "OS",
    "temps_OS",
    "DSS",
    "temps_DSS",
    "DFI",
    "temps_DFI",
    "PFI",
    "temps_PFI",
    "Redaction"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "INT64",
    "STRING"
  ],
  "description": [
    "Identifiant de code à barres TCGA pour le participant à l'étude, par exemple TCGA-02-0001",
    "Abréviation d'étude TCGA, par exemple LAML. Liste complète disponible à https://gdc.cancer.gov/resources-tcga-users/tcga-code-tables/tcga-study-abbreviations",
    "Événement de survie globale, 1 pour le décès d'une cause quelconque, 0 pour vivant",
    "Temps de survie globale en jours, last_contact_days_to ou death_days_to, selon ce qui est plus grand",
    "Événement de survie spécifique à la maladie, 1 pour le patient dont le statut vital était Mort et le statut de tumeur était AVEC TUMEUR. Si un patient est décédé de la maladie indiquée dans le champ de cause_of_death, le statut de DSS serait 1 pour le patient. 0 pour le patient dont le statut vital était Vivant ou dont le statut vital était Mort et le statut de tumeur était SANS TUMEUR. Cette définition n'est pas 100 % précise, mais c'est la meilleure que nous ayons pu faire avec cet ensemble de données. Techniquement, un patient pourrait avoir une tumeur mais être décédé dans un accident de voiture et être donc considéré à tort comme un événement.",
    "Temps de survie spécifique à la maladie en jours, last_contact_days_to ou death_days_to, selon ce qui est plus grand.",
    "Événement d'intervalle sans maladie, 1 pour le patient ayant un nouvel événement de tumeur, qu'il s'agisse d'une récidive locale, d'une métastase à distance, d'une nouvelle tumeur primitive du cancer, y compris les cas avec un nouvel événement de tumeur dont le type est N/A. L'intervalle sans maladie a été défini par : premièrement, treatment_outcome_first_course est \"Rémission/Response complète\" ; si le type de tumeur n'a pas de \"treatment_outcome_first_course\", alors l'intervalle sans maladie a été défini par la valeur \"R0\" dans le champ de \"residual_tumor\" ; sinon, l'intervalle sans maladie a été défini par la valeur \"négative\" dans le champ de \"margin_status\". Si le type de tumeur n'avait aucun de ces champs, alors son DFI était NA. 0 pour les cas censurés sinon. Une nouvelle tumeur primitive dans un autre organe a été censurée ; les patients qui étaient morts avec une tumeur sans nouvel événement de tumeur ont été exclus ; les patients avec un stade IV ont également été exclus.",
    "Temps d'intervalle sans maladie en jours, new_tumor_event_dx_days_to pour les événements, ou pour les cas censurés, soit last_contact_days_to ou death_days_to, selon ce qui est applicable.",
    "Événement d'intervalle sans progression, 1 pour le patient ayant un nouvel événement de tumeur, qu'il s'agisse d'une progression de la maladie, d'une récidive locale, d'une métastase à distance, de nouvelles tumeurs primitives à tous les sites, ou décédé du cancer sans nouvel événement de tumeur, y compris les cas avec un nouvel événement de tumeur dont le type est N/A. 0 pour les cas censurés sinon.",
    "Temps d'intervalle sans progression en jours, pour les événements, soit new_tumor_event_dx_days_to ou death_days_to, selon ce qui est applicable ; ou pour les cas censurés, soit last_contact_days_to ou death_days_to, selon ce qui est applicable",
    "Pour indiquer si le cas est masqué."
  ],
  "sample_rows": [
    {
      "CodeBarreParticipant": "TCGA-BT-A20R",
      "Etude": "BLCA",
      "OS": 1,
      "temps_OS": 154,
      "DSS": null,
      "temps_DSS": 154,
      "DFI": null,
      "temps_DFI": null,
      "PFI": 0,
      "temps_PFI": 154,
      "Redaction": null
    },
    {
      "CodeBarreParticipant": "TCGA-06-0126",
      "Etude": "GBM",
      "OS": 1,
      "temps_OS": 211,
      "DSS": null,
      "temps_DSS": 211,
      "DFI": null,
      "temps_DFI": null,
      "PFI": 0,
      "temps_PFI": 211,
      "Redaction": null
    },
    {
      "CodeBarreParticipant": "TCGA-AB-2848",
      "Etude": "LAML",
      "OS": 1,
      "temps_OS": 455,
      "DSS": null,
      "temps_DSS": null,
      "DFI": null,
      "temps_DFI": null,
      "PFI": null,
      "temps_PFI": null,
      "Redaction": null
    },
    {
      "CodeBarreParticipant": "TCGA-AB-2851",
      "Etude": "LAML",
      "OS": 1,
      "temps_OS": 242,
      "DSS": null,
      "temps_DSS": null,
      "DFI": null,
      "temps_DFI": null,
      "PFI": null,
      "temps_PFI": null,
      "Redaction": null
    },
    {
      "CodeBarreParticipant": "TCGA-AB-2870",
      "Etude": "LAML",
      "OS": 1,
      "temps_OS": 153,
      "DSS": null,
      "temps_DSS": null,
      "DFI": null,
      "temps_DFI": null,
      "PFI": null,
      "temps_PFI": null,
      "Redaction": null
    }
  ]
}