{
  "table_name": "PUBLICATION_MANIFEST_METADATA_CURRENT",
  "table_fullname": "HTAN_2.HTAN.PUBLICATION_MANIFEST_METADATA_CURRENT",
  "column_names": [
    "Centre_HTAN",
    "Lieu_de_Publication",
    "Licence",
    "Titre",
    "Auteur_Correspondant",
    "Lien_de_Soutien",
    "Type_de_Donnee",
    "Type_de_Contenu_de_Publication",
    "Outil",
    "Annee_de_Publication",
    "ID_du_Centre_HTAN",
    "ORCID_de_l_Auteur_Correspondant",
    "Description_du_Lien_de_Soutien",
    "ID_de_Subvention_HTAN",
    "ID_de_Manifeste",
    "entityId",
    "Id",
    "Resume_de_Publication",
    "Version_de_Manifeste",
    "ID_de_Fichier_de_Donnees_Parent_HTAN_Associe_a_la_Publication",
    "Composant",
    "Auteurs",
    "DOI",
    "ID_HTAN_Contenu_dans_la_Publication",
    "PMID"
  ],
  "column_types": [
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "NUMBER",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT"
  ],
  "description": [
    "Nom du centre HTAN, par exemple HTAN HTAPP",
    "Le nom du serveur de prépublication, de la revue ou de la conférence où le contenu a été présenté ou publié.",
    "Le type de licence applicable au contenu.",
    "Le titre du contenu présenté ou publié.",
    "Le(s) nom(s) de l'(des) auteur(s) correspondant(s) du contenu présenté ou publié. Si plusieurs auteurs correspondants, veuillez les lister dans l'ordre où ils apparaissent dans la liste des auteurs.",
    "Liens externes pertinents associés au contenu (par exemple, jeux de données externes utilisés pour la validation). Veuillez noter : Les liens de support et les descriptions de liens de support sont fournis par les auteurs et ne sont pas vérifiés par les NIH NCI ou le HTAN DCC. Ces informations et toutes les données liées ne doivent être partagées que par un individu (ou plusieurs) autorisé(s) conformément aux termes des accords et politiques de partage de données HTAN et/ou tout autre accord applicable. Validé comme URL",
    "Types de données associés au contenu. Remplissez « Autre type de données spécifié » si ce n'est pas dans la liste.",
    "Le type de contenu présenté ou publié.",
    "Des logiciels ou des outils de calcul ont-ils été générés pour ce contenu ?",
    "L'année où le contenu a été présenté ou publié (format AAAA).",
    "Liste des ID de centre HTAN associés au contenu présenté ou publié.",
    "L'(les) ORCiD(s) de l'(des) auteur(s) correspondant(s) du contenu présenté ou publié. Doit être une URL ORCiD valide commençant par https://orcid.org/ suivie d'un identifiant de 16 chiffres en groupes de 4 séparés par des tirets (par exemple https://orcid.org/0000-0002-1825-0097). Si plusieurs auteurs correspondants, veuillez lister les ORCiD dans l'ordre où les auteurs apparaissent dans la liste des auteurs.",
    "Description des liens externes pertinents associés à la publication (par exemple, un jeu de données de souris externe utilisé pour la validation). Veuillez noter : Les liens de support et les descriptions de liens de support sont fournis par les auteurs et ne sont pas vérifiés par les NIH NCI ou le HTAN DCC. Ces informations et toutes les données liées ne doivent être partagées que par un individu (ou plusieurs) autorisé(s) conformément aux termes des accords et politiques de partage de données HTAN et/ou tout autre accord applicable.",
    "Numéro(s) de subvention HTAN (c'est-à-dire format CA------) associé(s) au contenu présenté ou publié.",
    "ID Synapse du manifeste contenant l'annotation de fichier",
    "ID Synapse de l'entité",
    "Identifiant unique de l'entité, par exemple a96059eb-81af-4b24-ae50-9242c0d8f819",
    "Le résumé ou la description courte du contenu présenté ou publié.",
    "Dernière version du manifeste de métadonnées",
    "Identifiant(s) de fichier de données HTAN des fichiers associés au contenu présenté ou publié. Doivent être des listes séparées par des virgules.",
    "Catégorie de métadonnées (par exemple, Diagnostic, Biospecimen, scRNA-seq Niveau 1, etc.) ; fournir la même pour tous les éléments/lignes.",
    "Les nom(s) de l'(des) auteur(s) du contenu présenté ou publié, dans l'ordre où ils apparaissent.",
    "L'identifiant numérique d'objet (DOI) du contenu sous la forme https://www.doi.org/{doi} pour se conformer aux directives d'affichage CrossRef DOI.",
    "Les ID HTAN sont utilisés dans la publication.",
    "L'identifiant PubMed associé à la publication (applicable aux manuscrits publiés). Fournir sous la forme d'une URL de la forme https://pubmed.ncbi.nlm.nih.gov/{pmid}"
  ],
  "sample_rows": []
}