{
  "table_name": "PUBLICATION_MANIFEST_METADATA_CURRENT",
  "table_fullname": "HTAN_2.HTAN.PUBLICATION_MANIFEST_METADATA_CURRENT",
  "column_names": [
    "HTAN_Zentrum",
    "Veröffentlichungsort",
    "Lizenz",
    "Titel",
    "Korrespondierender_Autor",
    "Unterstützender_Link",
    "Daten_Typ",
    "Veröffentlichungsinhaltstyp",
    "Werkzeug",
    "Veröffentlichungsjahr",
    "HTAN_Zentrum_ID",
    "Korrespondierender_Autor_ORCID",
    "Beschreibung_des_unterstützenden_Links",
    "HTAN_Grant_ID",
    "Manifest_ID",
    "EntitätId",
    "Id",
    "Veröffentlichungsabstrakt",
    "Manifestversion",
    "Veröffentlichung_assoziiertes_HTAN_Eltern_Daten_Datei_ID",
    "Komponente",
    "Autoren",
    "DOI",
    "Veröffentlichung_enthält_HTAN_ID",
    "PMID"
  ],
  "column_types": [
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "NUMBER",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT",
    "TEXT"
  ],
  "description": [
    "Name des HTAN-Zentrums, z. B. HTAN HTAPP",
    "Der Name des Preprint-Servers, der Zeitschrift oder der Konferenz, auf der der Inhalt präsentiert oder veröffentlicht wurde.",
    "Der Typ der Lizenz, die auf den Inhalt anwendbar ist.",
    "Der Titel des präsentierten oder veröffentlichten Inhalts.",
    "Der Name(n) des (der) entsprechenden Autor(s) des präsentierten oder veröffentlichten Inhalts. Wenn mehr als ein entsprechender Autor, bitte in der Reihenfolge auflisten, in der sie in der Autorenliste erscheinen.",
    "Relevante externe Links, die mit dem Inhalt verbunden sind (z. B. externe Datensätze, die für die Validierung verwendet werden). Bitte beachten Sie: Supporting Links und Supporting Link Descriptions werden von den Autoren bereitgestellt und nicht von der NIH NCI oder der HTAN DCC verifiziert. Diese Informationen und alle verknüpften Daten sollten nur von autorisierten Personen(s) in Übereinstimmung mit den Bedingungen der HTAN-Datenteilungsvereinbarungen und -richtlinien und/oder anderen anwendbaren Vereinbarungen(s) geteilt werden. Validiert als URL",
    "Arten von Daten, die mit dem Inhalt verbunden sind. Füllen Sie \"Andere Datenart angegeben\", wenn diese nicht in der Liste enthalten ist.",
    "Der Typ des präsentierten oder veröffentlichten Inhalts.",
    "Wurden für diesen Inhalt Software oder computergestützte Werkzeuge generiert?",
    "Das Jahr, in dem der Inhalt präsentiert oder veröffentlicht wurde (Format JJJJ).",
    "Liste der HTAN-Zentrum-ID(s), die mit dem präsentierten oder veröffentlichten Inhalt verbunden sind.",
    "Die ORCiD(s) des (der) entsprechenden Autor(s) des präsentierten oder veröffentlichten Inhalts. Sollte eine gültige ORCiD-URL sein, die mit https://orcid.org/ beginnt, gefolgt von einem 16-stelligen Identifikator in durch Bindestriche getrennten Gruppen von 4 (z. B. https://orcid.org/0000-0002-1825-0097). Wenn mehr als ein entsprechender Autor, bitte ORCiDs in der Reihenfolge auflisten, in der die Autoren in der Autorenliste erscheinen.",
    "Beschreibung relevanter externer Links im Zusammenhang mit der Veröffentlichung (z. B. ein externer Mausdatensatz, der für die Validierung verwendet wird). Bitte beachten Sie: Supporting Links und Supporting Link Descriptions werden von den Autoren bereitgestellt und nicht von der NIH NCI oder der HTAN DCC verifiziert. Diese Informationen und alle verknüpften Daten sollten nur von autorisierten Personen(s) in Übereinstimmung mit den Bedingungen der HTAN-Datenteilungsvereinbarungen und -richtlinien und/oder anderen anwendbaren Vereinbarungen(s) geteilt werden.",
    "HTAN-Gewährnummern(s) (z. B. CA-------Format), die mit dem präsentierten oder veröffentlichten Inhalt verbunden sind.",
    "Synapse-ID der Manifest-Datei, die die Dateiannotation enthält",
    "Synapse-ID der Entität",
    "Eindeutiger Identifikator der Entität, z. B. a96059eb-81af-4b24-ae50-9242c0d8f819",
    "Das Abstract oder die kurze Beschreibung des präsentierten oder veröffentlichten Inhalts.",
    "Aktuellste Version des Metadaten-Manifests",
    "HTAN-Datendatei-Identifikator(s) der Dateien, die mit dem präsentierten oder veröffentlichten Inhalt verbunden sind. Sollte eine kommagetrennte Liste sein.",
    "Kategorie der Metadaten (z. B. Diagnose, Biospecimen, scRNA-seq Level 1 usw.); bitte dieselbe für alle Elemente/Zeilen angeben.",
    "Die Namen der Autor(s) des präsentierten oder veröffentlichten Inhalts, in der Reihenfolge, in der sie erscheinen.",
    "Der digitale Objekt-Identifikator (DOI) des Inhalts in der Form https://www.doi.org/{doi}, um den CrossRef-DOI-Anzeigerichtlinien zu entsprechen.",
    "HTAN-IDs werden in der Veröffentlichung verwendet.",
    "Der PubMed-Identifikator, der der Veröffentlichung zugeordnet ist (anwendbar auf veröffentlichte Manuskripte). Bitte als URL der Form https://pubmed.ncbi.nlm.nih.gov/{pmid} angeben"
  ],
  "sample_rows": []
}