{
  "table_name": "hpsa_dental_health",
  "table_fullname": "bigquery-public-data.sdoh_hrsa_shortage_areas.hpsa_dental_health",
  "column_names": [
    "Quellenkennung",
    "Quellenname",
    "Statuscode",
    "Statusbeschreibung",
    "Typencode",
    "Typbeschreibung",
    "Adresse",
    "Stadt",
    "StaatAbkürzung",
    "Postleitzahl",
    "Mangelniveau",
    "Zuordnungsdatum",
    "Zuordnungsaktualisierungsdatum",
    "Zuordnungsbevölkerung",
    "SchätzungsweiseUnversorgteBevölkerung",
    "SchätzungsweiseVersorgteBevölkerung",
    "FormalesVerhältnis",
    "GesamtVollzeitäquivalenteKliniker",
    "MetropolregionIndikatorCode",
    "MetropolregionIndikatorBeschreibung",
    "AnbieterVerhältnisZiel",
    "Bevölkerungsarmutsanteil",
    "HPSAWert",
    "HPSAMangel",
    "DisziplinKlassenNummer",
    "DisziplinKlassenbeschreibung",
    "QuellenkennungKomponente",
    "QuellennameKomponente",
    "KomponentenStatusCode",
    "KomponentenStatusBeschreibung",
    "KomponentenTypCode",
    "KomponentenTypBeschreibung",
    "KomponentenStaatAbkürzung",
    "KomponentenPostleitzahl",
    "KomponentenZuordnungsdatum",
    "KomponentenZuordnungsdatumString",
    "KomponentenZuordnungsaktualisierung",
    "GeografieKennung",
    "KreisFIPS",
    "Kreisname",
    "StaatKreisFIPS",
    "StaatFIPS",
    "StaatAbkürzung2",
    "StaatName",
    "Hauptstaatsname",
    "HauptstaatsFIPS",
    "HHSRegionName",
    "USAMexikoGrenzkreis",
    "USAMexikoGrenzabstand100km",
    "DatenlagerDatensatzErstellungsdatum",
    "DatenlagerDatensatzErstellungsdatumText",
    "HPSAName",
    "HPSAKomponentenName",
    "Zuordnungsunterbrechung",
    "GeokodierungPrimäresX",
    "GeokodierungPrimäresY",
    "HPSABevölkerungTypCode",
    "HPSABevölkerungTypBeschreibung",
    "HPSABewohnendeZivileBevölkerung",
    "OrtsnameMitStaatAbkürzung",
    "GemeinsamePostleitzahl",
    "GemeinsamerKreisName",
    "GemeinsameStaatKreisFIPS",
    "GemeinsameStaatAbkürzung",
    "GemeinsamerStaatName",
    "GemeinsamerStaatFIPS",
    "GemeinschaftsRegionName",
    "HPSARueckgezogenDatum",
    "HPSARueckgezogenDatumString",
    "AnbieterTyp",
    "LaendlicherStatusCode",
    "LaendlicherStatusBeschreibung",
    "HPSAZuordnungsBevoelkerungsTypBeschreibung",
    "BHCMISOrganisationsID"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "DATE",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "INT64",
    "FLOAT64",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "nested_column_names": [
    "Quellidentifikator",
    "Quellenname",
    "Statuscode",
    "Statusbeschreibung",
    "Typcode",
    "Typbeschreibung",
    "Adresse",
    "Stadt",
    "Bundeslandkürzel",
    "Postleitzahl",
    "Mangelsgrad",
    "Zuordnungsdatum",
    "Zuordnungsaktualisierungsdatum",
    "Zuordnungsbevölkerung",
    "UnterversorgteBevölkerung",
    "GeschätzteVersorgteBevölkerung",
    "FormellesVerhältnis",
    "GesamtVollzeitäquivalenteKliniker",
    "MetropolregionIndikatorCode",
    "MetropolregionIndikatorbeschreibung",
    "AnbieterVerhältnisZiel",
    "BevölkerungsanteilUnterArmutsgrenze",
    "HPSAScore",
    "HPSAMangel",
    "DisziplinKlassenNummer",
    "DisziplinKlassenbeschreibung",
    "KomponentenquelleID",
    "Komponentenquellename",
    "KomponentenStatusCode",
    "KomponentenStatusbeschreibung",
    "KomponentenTypCode",
    "KomponentenTypbeschreibung",
    "KomponentenStaatKuerzel",
    "KomponentenPostleitzahl",
    "KomponentenZuordnungsdatum",
    "KomponentenZuordnungsdatumsString",
    "KomponentenZuordnungsaktualisierungsdatum",
    "GeographieID",
    "KreisFIPS",
    "Kreisname",
    "BundeslandKreisFIPS",
    "BundeslandFIPS",
    "StaatKuerzel2",
    "Staatsname",
    "Hauptstaatsname",
    "HauptstaatsFIPS",
    "PrimäreHHSRegionName",
    "GrenzbezirkUSAMexiko",
    "GrenzgebietUSAMexiko100km",
    "DWHDatensatzErstellungsdatum",
    "DWHDatensatzErstellungsdatumsText",
    "HPSAName",
    "HPSAKomponentenname",
    "Zuordnungsunterbrechung",
    "GeokodierungPrimäresX",
    "GeokodierungPrimäresY",
    "HPSAPopulationsartCode",
    "HPSAPopulationsartBeschreibung",
    "HPSABewohnerBevölkerung",
    "GemeinsamerStadtnameMitStaatKuerzel",
    "GemeinsamePostleitzahl",
    "GemeinsamerKreisname",
    "GemeinsamesBundeslandKreisFIPS",
    "GemeinsamesStaatsKuerzel",
    "GemeinsamerStaatsname",
    "GemeinsamerStaatsFIPS",
    "RegionenName",
    "HPSARuecknahmedatum",
    "HPSARuecknahmedatumString",
    "Anbietertyp",
    "LaendlicherStatusCode",
    "LaendlicherStatusBeschreibung",
    "HPSAZuordnungsBevoelkerungstypBeschreibung",
    "BHCMISOrganisationsID"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "DATE",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "INT64",
    "FLOAT64",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "description": [
    "Primärer Bezeichner für eine Health Professional Shortage Area (HPSA) als vollständige Einheit im Quellsystem.",
    "Der Name der Health Professional Shortage Area (HPSA). Dieses Datenelement stammt direkt aus dem Quellsystem in der neuesten Datenaktualisierung. Weitere Informationen zu HPSA finden Sie auf der Website http://www.hrsa.gov/shortage/.",
    "Ein Zeichen, das den aktuellen Status der HPSA-Bezeichnung kennzeichnet.",
    "Textuelle Beschreibung des aktuellen Status der HPSA-Bezeichnung.",
    "Geografie- oder Einrichtungstyp-Code, der die HPSA kennzeichnet.",
    "Textuelle Beschreibung des HPSA-Typs.",
    "Standardisierte Version der Straßenadresse einer HPSA-Einrichtung.",
    "Standardisierte Version des Stadtnamens, in dem sich eine HPSA-Einrichtung befindet.",
    "USPS-Code des Bundesstaats, in dem sich die HPSA-Entität befindet.",
    "USPS ZIP-Code. Im Kontext der HPSA-Daten gilt dieses Feld nur für Einrichtungen.",
    "Ausmaß des Mangels an Fachkräften in der HPSA basierend auf dem Verhältnis von Bevölkerung zu Anbieter.",
    "Datum, an dem die HPSA ursprünglich als Mangelgebiet festgelegt wurde.",
    "Datum der letzten Aktualisierung der HPSA-Informationen im Quellsystem.",
    "Anzahl der Personen, die von HRSA, Bureau of Health Workforce (BHW), Division of Policy and Shortage Designation (DPSD) als von der HPSA betroffen identifiziert wurden.",
    "Geschätzte unterversorgte Bevölkerung, die von den Vollzeitäquivalenten (FTE) Gesundheitsdienstleistern innerhalb einer HPSA bedient wird.",
    "Geschätzte Gesamtbevölkerung, die von den Vollzeitäquivalenten (FTE) Gesundheitsdienstleistern innerhalb einer HPSA bedient wird.",
    "Verhältnis der HPSA-Bestimmungspopulation zu HPSA-Anbietern in Verhältnisform (z. B. 3500:1), wobei die Bevölkerung und die Bezeichnung derselben Fachdisziplin angehören (z. B. Primärversorgung, Zahnmedizin und Psychische Gesundheit).",
    "Anzahl der Fachkräfte, die ambulante Patientenversorgung in der HPSA leisten, ausgedrückt als Vollzeitäquivalente (FTE).",
    "Ein einzelnes Zeichen, das angibt, ob eine HPSA als Metropolregion, Nicht-Metropolregion oder Grenzgebiet gilt.",
    "Beschreibung, ob eine HPSA metropolitan, nicht-metropolitan oder Grenzgebiet ist.",
    "Zielgröße des HPSA-Verhältnisses Provider, das die Zielbevölkerung pro Anbieter (Arzt) für die HPSA in einer Disziplinenklasse angibt. Bundesvorschriften legen fest, dass ein Gebiet, um als unterversorgt zu gelten, ein Bevölkerungs-zu-Anbieter-Verhältnis eines bestimmten Schwellenwerts haben muss. Für Primärmedizinische Versorgung muss das Verhältnis Bevölkerung zu Anbieter mindestens 3.500 zu 1 betragen (3.000 zu 1, wenn es ungewöhnlich hohe Bedürfnisse in der Gemeinschaft gibt). Für Zahnmedizin muss das Verhältnis mindestens 5.000 zu 1 betragen (4.000 zu 1 in Hochbedarf-Gemeinschaften). Für Psychische Gesundheit muss das Verhältnis Bevölkerung zu Psychiater 30.000 zu 1 betragen (20.000 zu 1 in Hochbedarf-Gemeinschaften). Weitere Informationen zu Health Professional Shortage Areas (HPSA) finden Sie auf der Website http://www.hrsa.gov/shortage/.",
    "Prozentsatz der Bevölkerung in der HPSA, die unter dem US-Föderalen Armutsniveau (USFPL) liegt.",
    "HPSA-Score, entwickelt vom NHSC, zur Festlegung von Prioritäten bei der Zuweisung von Klinikern. Die Scores reichen von 0 bis 26, wobei höhere Scores höhere Priorität bedeuten.",
    "Anzahl der Vollzeitäquivalente (FTE) Fachkräfte, die in der HPSA benötigt werden, damit sie das Bevölkerungs-zu-Fachkräfte-Zielverhältnis erreicht. Das Zielverhältnis wird durch die Art (Disziplin) der HPSA bestimmt.",
    "Ein-Zeichen-Code, der vom HRSA Data Warehouse (HDW) verwendet wird, um die Discipline Class-Identifikationsnummer (ID) Werte zu kennzeichnen, die mit gesundheitsbezogenen Fachklassen verbunden sind.",
    "HPSA-Disziplinenklasse-Beschreibung. HPSA-Disziplinen können als Primary Care, Dental Health oder Mental Health aufgeführt sein.",
    "Identifikationsnummer, die eine HPSA-Komponente mit ihrer übergeordneten HPSA verbindet.",
    "Name, der der HPSA-Komponente gemäß der neuesten Datenaktualisierung zugewiesen wurde.",
    "Ein Zeichen, das den Bezeichnungsstatus für den Komponentenanteil der HPSA angibt.",
    "Beschreibung des HPSA-Komponentenstatus, die die englischsprachige Erweiterung des HPSA-Komponentenstatus-Codes ist. Diese Textbeschreibung identifiziert den aktuellen Status der HPSA-Komponente und kann sich während der Lebensdauer der HPSA ändern.",
    "Geografie- oder Einrichtungstyp-Code, der die HPSA-Komponente kennzeichnet.",
    "HPSA-Komponenten-Typbeschreibung, die in Worten die Art der HPSA für die Komponente angibt.",
    "USPS zwei Buchstaben-Code für einen US-Bundesstaat oder US-Territorium, der mit dem Landkreis oder Landkreis-Äquivalent verbunden ist, in dem sich die HPSA-Komponente befindet.",
    "USPS Zone Improvement Plan (ZIP), der mit einer HPSA-Komponente verbunden ist.",
    "Datum, an dem die HPSA als Mangelgebiet festgelegt wurde, wie in der neuesten Datenaktualisierung aus den Quelldaten dargestellt.",
    "Datum, an dem die Health Professional Shortage Area (HPSA) als Mangelgebiet festgelegt wurde, wie in der neuesten Datenaktualisierung aus den Quelldaten dargestellt und als Textzeichenfolge gespeichert.",
    "Datum, an dem die HPSA-Komponente zuletzt aktualisiert wurde, wie in der neuesten HPSA-Quelldatenaktualisierung dargestellt.",
    "HPSA-Geografiekode, die das spezifische geografische Gebiet (County, MCD oder Census Tract) identifiziert, das mit der HPSA verbunden ist.",
    "Numerische Zeichenfolge, die vom National Institute of Standards and Technology (NIST) den Landkreisen und/oder Landkreis-Äquivalenten für die Staaten, den District of Columbia und US-Territorien zugewiesen wird.",
    "Name des Landkreises oder Landkreis-Äquivalents, in dem sich die zugehörige Adresse befindet, als Textzeichenfolge angezeigt.",
    "Verkettung (Kombination) der Federal Information Processing Standard (FIPS)-Staat- und Landkreis-Codes.",
    "Staatlicher FIPS-Code, der die zweistellige numerische Zeichenfolge identifiziert, die von NIST an Staaten, den District of Columbia und US-Territorien vergeben wird.",
    "USPS zwei Buchstaben-Code für einen US-Bundesstaat oder US-Territorium, der mit dem Ort verbunden ist, an dem sich eine Entität befindet.",
    "Name des Staates oder Territoriums.",
    "Formeller, offizieller Name eines US-Bundesstaates oder US-Territoriums, der mit dem Standort oder der Adresse der Entität (Datensatz) verbunden ist. Im Hinblick auf eine Health Professional Shortage Area (HPSA) oder eine Medically Underserved Area/Population (MUA/P) kann das physische Landgebiet der Entität Staatsgrenzen überschreiten, was bedeutet, dass eine HPSA oder MUA/P aus Komponenten oder Teilen von einem oder mehreren Staaten bestehen kann. Daher ist der primäre Staat für eines dieser Gebiete der Staat, der mit dem übergeordneten oder Primärdatensatz verbunden ist. Außerdem wird der Primärstaat für die Aggregation von Zählungen und Summen auf Staatsebene verwendet.",
    "Staatlicher FIPS-Code, der die zweistellige numerische Zeichenfolge identifiziert, die von NIST an Staaten, den District of Columbia und US-Territorien vergeben wird.",
    "Formeller Name der US-Behörde Department of Health and Human Services (HHS) Region, die mit dem Standort oder der Adresse der Entität verbunden ist. Bezüglich einer HPSA oder MUA/P kann das physische Landgebiet der Entität Grenzübergreifend sein, was bedeutet, dass eine HPSA oder MUA/P aus Komponenten oder Teilen von einem oder mehreren Staaten bestehen kann. Daher ist der primäre Staat für eine dieser Bereiche der Staat, der mit dem übergeordneten oder Primärdatensatz verbunden ist. Außerdem wird der Primärstaat zur Aggregation von Zählungen und Summen auf Staatsebene verwendet.",
    "Hinweis darauf, ob ein Landkreis oder ein Teil eines Landkreises in US-Bundesländern aufgeführt ist, die von der U.S.-Mexico Border Health Commission als Border Health Initiative-Zone definiert wurden. Bei Landkreisen im zusammenhängenden US kann dieser Dateneintrag vom Wert des U.S.-Mexico Border 100 Kilometer-Indikators abweichen, da drei Landkreise in Arizona teilweise innerhalb des definierten 100-Kilometer-Grenzbereichs fallen, aber nicht in der Liste der Landkreise aufgeführt sind, die von der U.S.-Mexico Border Health Commission als Zone of Interest definiert wurden.",
    "Hinweis darauf, ob irgendein Teil des genannten geografischen Gebiets innerhalb von 100 Kilometern der US-Mexiko-Grenze liegt. Das HRSA Data Warehouse erzeugt diesen Wert durch Geoverarbeitung gegen die 100-Kilometer-US-Mexiko-Grenzregion, wie sie vom HRSA Office of Rural Health Policy, Border Health Program definiert ist.",
    "Datum, an dem die Daten vom HRSA Data Warehouse verarbeitet wurden.",
    "Datum, an dem die Daten vom HRSA Data Warehouse verarbeitet wurden.",
    "Titel-Case-Format, benutzerfreundlicher Name, der durch Dekodieren des direkt aus dem Quellsystem stammenden HPSA-Namens erzeugt wird.",
    "Name der HPSA-Komponente, wie im Quellsystem identifiziert. Für Gebiet-HPSAs kann eine Komponente ein Landkreis, Census Tract oder Minor Civil Division (MCD) sein.",
    "Hinweis, ob die HPSA oder MUA/P seit dem ursprünglichen Bezeichnungsdatum kontinuierlich festgelegt ist.",
    "Primärer Längengrad in Dezimalgraden (x-Koordinate) einer Entität basierend auf ihrer Adresse.",
    "Primäre Breitengrad in Dezimalgraden (y-Koordinate) einer Entität basierend auf ihrer Adresse.",
    "Code des Bevölkerungstyps in einer designierten HPSA.",
    "Beschreibung des Bevölkerungstyps, die die HPSA kennzeichnet.",
    "Bevölkerungstypbeschreibung für die HPSA.",
    "Stadtname, in dem sich die Entität physisch befindet.",
    "Postleitzahl der Adresse einer Entität. Für HRSA Data Warehouse ist dieser Wert eine fünfstellige USPS ZIP-Code.",
    "HDW-Kombination des vollständigen Landkreisnamens und der Staatsabkürzung.",
    "Kombination der FIPS-Codes von Staat und Landkreis.",
    "USPS zwei Buchstaben-Code für einen US-Bundesstaat oder US-Territorium, der mit dem Ort verbunden ist, an dem sich eine Entität befindet.",
    "Name des Staates oder Territoriums.",
    "Staatlicher FIPS-Code, der die zweistellige numerische Zeichenfolge identifiziert, die von NIST an Staaten, den District of Columbia und US-Territorien vergeben wird.",
    "Formeller Name der Region des U.S. Department of Health and Human Services (HHS), die mit dem Standort oder der Adresse der Entität verbunden ist.",
    "Datum, an dem der Bezeichnungsstatus von \"designated\" auf \"withdrawn\" geändert wurde.",
    "Datum, an dem der Bezeichnungsstatus von \"designated\" auf \"withdrawn\" geändert wurde.",
    "Typ der in den FTE-Berechnungen für die angegebene HPSA-Bezeichnung verwendeten Mental-Health-Anbieter.",
    "Statuscode, der den ländlichen Status einer Entität (z. B. einer Einrichtung oder eines geografischen Gebiets) angibt.",
    "Beschreibung des ländlichen Status der Entität (z. B. einer Einrichtung oder eines geografischen Gebiets).",
    "Dieses Attribut repräsentiert die Bevölkerungsbeschreibung der HPSA-Bezeichnung.",
    "Organisationsquellenidentifikationsnummer aus dem HRSA, Bureau of Primary Health Care (BPHC) Health Center Management Information System (BHCMIS)."
  ],
  "sample_rows": [
    {
      "Quellidentifikator": "6409994016",
      "Quellenname": "Carl Albert Indian Hospital",
      "Statuscode": "W",
      "Statusbeschreibung": "Withdrawn",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "1001 N Country Club Rd",
      "Stadt": "Ada",
      "Bundeslandkürzel": "OK",
      "Postleitzahl": "74820-2847",
      "Mangelsgrad": null,
      "Zuordnungsdatum": "2002-10-26",
      "Zuordnungsaktualisierungsdatum": "2012-02-14",
      "Zuordnungsbevölkerung": null,
      "UnterversorgteBevölkerung": null,
      "GeschätzteVersorgteBevölkerung": null,
      "FormellesVerhältnis": null,
      "GesamtVollzeitäquivalenteKliniker": null,
      "MetropolregionIndikatorCode": "N",
      "MetropolregionIndikatorbeschreibung": "Non-Metropolitan",
      "AnbieterVerhältnisZiel": null,
      "BevölkerungsanteilUnterArmutsgrenze": null,
      "HPSAScore": 0,
      "HPSAMangel": 0.0,
      "DisziplinKlassenNummer": 6,
      "DisziplinKlassenbeschreibung": "Dental Health",
      "KomponentenquelleID": "6409994016",
      "Komponentenquellename": "Carl Albert Indian Hospital",
      "KomponentenStatusCode": "0",
      "KomponentenStatusbeschreibung": "Unknown",
      "KomponentenTypCode": "UNK",
      "KomponentenTypbeschreibung": "Unknown",
      "KomponentenStaatKuerzel": null,
      "KomponentenPostleitzahl": null,
      "KomponentenZuordnungsdatum": "NaT",
      "KomponentenZuordnungsdatumsString": null,
      "KomponentenZuordnungsaktualisierungsdatum": "NaT",
      "GeographieID": "POINT",
      "KreisFIPS": 123,
      "Kreisname": "Pontotoc",
      "BundeslandKreisFIPS": "40123",
      "BundeslandFIPS": "40",
      "StaatKuerzel2": "OK",
      "Staatsname": "Oklahoma",
      "Hauptstaatsname": "Oklahoma",
      "HauptstaatsFIPS": 40,
      "PrimäreHHSRegionName": "Region VI",
      "GrenzbezirkUSAMexiko": "N",
      "GrenzgebietUSAMexiko100km": "N",
      "DWHDatensatzErstellungsdatum": "2019-12-17",
      "DWHDatensatzErstellungsdatumsText": "12/17/2019",
      "HPSAName": "Carl Albert Indian Hospital",
      "HPSAKomponentenname": "Carl Albert Indian Hospital",
      "Zuordnungsunterbrechung": "N",
      "GeokodierungPrimäresX": -96.65242646,
      "GeokodierungPrimäresY": 34.78636863,
      "HPSAPopulationsartCode": null,
      "HPSAPopulationsartBeschreibung": null,
      "HPSABewohnerBevölkerung": null,
      "GemeinsamerStadtnameMitStaatKuerzel": "Ada",
      "GemeinsamePostleitzahl": 74820,
      "GemeinsamerKreisname": "Pontotoc County, OK",
      "GemeinsamesBundeslandKreisFIPS": "40123",
      "GemeinsamesStaatsKuerzel": "OK",
      "GemeinsamerStaatsname": "Oklahoma",
      "GemeinsamerStaatsFIPS": "40",
      "RegionenName": "Region VI",
      "HPSARuecknahmedatum": "NaT",
      "HPSARuecknahmedatumString": null,
      "Anbietertyp": null,
      "LaendlicherStatusCode": "R",
      "LaendlicherStatusBeschreibung": "Rural",
      "HPSAZuordnungsBevoelkerungstypBeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "BHCMISOrganisationsID": null
    },
    {
      "Quellidentifikator": "6319993124",
      "Quellenname": "Winnebago PHS Indian Hospital",
      "Statuscode": "W",
      "Statusbeschreibung": "Withdrawn",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "PO BOX Hh",
      "Stadt": "Winnebago",
      "Bundeslandkürzel": "NE",
      "Postleitzahl": "68071-0767",
      "Mangelsgrad": null,
      "Zuordnungsdatum": "2002-10-26",
      "Zuordnungsaktualisierungsdatum": "2014-05-02",
      "Zuordnungsbevölkerung": null,
      "UnterversorgteBevölkerung": null,
      "GeschätzteVersorgteBevölkerung": null,
      "FormellesVerhältnis": null,
      "GesamtVollzeitäquivalenteKliniker": null,
      "MetropolregionIndikatorCode": "N",
      "MetropolregionIndikatorbeschreibung": "Non-Metropolitan",
      "AnbieterVerhältnisZiel": null,
      "BevölkerungsanteilUnterArmutsgrenze": null,
      "HPSAScore": 19,
      "HPSAMangel": 0.0,
      "DisziplinKlassenNummer": 6,
      "DisziplinKlassenbeschreibung": "Dental Health",
      "KomponentenquelleID": "6319993124",
      "Komponentenquellename": "Winnebago PHS Indian Hospital",
      "KomponentenStatusCode": "0",
      "KomponentenStatusbeschreibung": "Unknown",
      "KomponentenTypCode": "UNK",
      "KomponentenTypbeschreibung": "Unknown",
      "KomponentenStaatKuerzel": null,
      "KomponentenPostleitzahl": null,
      "KomponentenZuordnungsdatum": "NaT",
      "KomponentenZuordnungsdatumsString": null,
      "KomponentenZuordnungsaktualisierungsdatum": "NaT",
      "GeographieID": "POINT",
      "KreisFIPS": 173,
      "Kreisname": "Thurston",
      "BundeslandKreisFIPS": "31173",
      "BundeslandFIPS": "31",
      "StaatKuerzel2": "NE",
      "Staatsname": "Nebraska",
      "Hauptstaatsname": "Nebraska",
      "HauptstaatsFIPS": 31,
      "PrimäreHHSRegionName": "Region VII",
      "GrenzbezirkUSAMexiko": "N",
      "GrenzgebietUSAMexiko100km": "N",
      "DWHDatensatzErstellungsdatum": "2019-12-17",
      "DWHDatensatzErstellungsdatumsText": "12/17/2019",
      "HPSAName": "Winnebago PHS Indian Hospital",
      "HPSAKomponentenname": "Winnebago PHS Indian Hospital",
      "Zuordnungsunterbrechung": "N",
      "GeokodierungPrimäresX": -96.48542149,
      "GeokodierungPrimäresY": 42.236709,
      "HPSAPopulationsartCode": null,
      "HPSAPopulationsartBeschreibung": null,
      "HPSABewohnerBevölkerung": null,
      "GemeinsamerStadtnameMitStaatKuerzel": "Winnebago",
      "GemeinsamePostleitzahl": 68071,
      "GemeinsamerKreisname": "Thurston County, NE",
      "GemeinsamesBundeslandKreisFIPS": "31173",
      "GemeinsamesStaatsKuerzel": "NE",
      "GemeinsamerStaatsname": "Nebraska",
      "GemeinsamerStaatsFIPS": "31",
      "RegionenName": "Region VII",
      "HPSARuecknahmedatum": "NaT",
      "HPSARuecknahmedatumString": null,
      "Anbietertyp": null,
      "LaendlicherStatusCode": "R",
      "LaendlicherStatusBeschreibung": "Rural",
      "HPSAZuordnungsBevoelkerungstypBeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "BHCMISOrganisationsID": null
    },
    {
      "Quellidentifikator": "6089990849",
      "Quellenname": "Southern Colorado Ute Services Unit-Fed",
      "Statuscode": "W",
      "Statusbeschreibung": "Withdrawn",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "Weeminuche Dr",
      "Stadt": "Ignacio",
      "Bundeslandkürzel": "CO",
      "Postleitzahl": "81137",
      "Mangelsgrad": null,
      "Zuordnungsdatum": "2002-10-26",
      "Zuordnungsaktualisierungsdatum": "2011-06-14",
      "Zuordnungsbevölkerung": null,
      "UnterversorgteBevölkerung": null,
      "GeschätzteVersorgteBevölkerung": null,
      "FormellesVerhältnis": null,
      "GesamtVollzeitäquivalenteKliniker": null,
      "MetropolregionIndikatorCode": "N",
      "MetropolregionIndikatorbeschreibung": "Non-Metropolitan",
      "AnbieterVerhältnisZiel": null,
      "BevölkerungsanteilUnterArmutsgrenze": null,
      "HPSAScore": 0,
      "HPSAMangel": 0.0,
      "DisziplinKlassenNummer": 6,
      "DisziplinKlassenbeschreibung": "Dental Health",
      "KomponentenquelleID": "6089990849",
      "Komponentenquellename": "Southern Colorado Ute Services Unit-Fed",
      "KomponentenStatusCode": "0",
      "KomponentenStatusbeschreibung": "Unknown",
      "KomponentenTypCode": "UNK",
      "KomponentenTypbeschreibung": "Unknown",
      "KomponentenStaatKuerzel": null,
      "KomponentenPostleitzahl": null,
      "KomponentenZuordnungsdatum": "NaT",
      "KomponentenZuordnungsdatumsString": null,
      "KomponentenZuordnungsaktualisierungsdatum": "NaT",
      "GeographieID": "POINT",
      "KreisFIPS": 67,
      "Kreisname": "La Plata",
      "BundeslandKreisFIPS": "8067",
      "BundeslandFIPS": "8",
      "StaatKuerzel2": "CO",
      "Staatsname": "Colorado",
      "Hauptstaatsname": "Colorado",
      "HauptstaatsFIPS": 8,
      "PrimäreHHSRegionName": "Region VIII",
      "GrenzbezirkUSAMexiko": "N",
      "GrenzgebietUSAMexiko100km": "N",
      "DWHDatensatzErstellungsdatum": "2019-12-17",
      "DWHDatensatzErstellungsdatumsText": "12/17/2019",
      "HPSAName": "Southern Colorado Ute Services Unit-Federal",
      "HPSAKomponentenname": "Southern Colorado Ute Services Unit-Federal",
      "Zuordnungsunterbrechung": "N",
      "GeokodierungPrimäresX": -107.6359702,
      "GeokodierungPrimäresY": 37.13120099,
      "HPSAPopulationsartCode": null,
      "HPSAPopulationsartBeschreibung": null,
      "HPSABewohnerBevölkerung": null,
      "GemeinsamerStadtnameMitStaatKuerzel": "Ignacio",
      "GemeinsamePostleitzahl": 81137,
      "GemeinsamerKreisname": "La Plata County, CO",
      "GemeinsamesBundeslandKreisFIPS": "8067",
      "GemeinsamesStaatsKuerzel": "CO",
      "GemeinsamerStaatsname": "Colorado",
      "GemeinsamerStaatsFIPS": "8",
      "RegionenName": "Region VIII",
      "HPSARuecknahmedatum": "NaT",
      "HPSARuecknahmedatumString": null,
      "Anbietertyp": null,
      "LaendlicherStatusCode": "R",
      "LaendlicherStatusBeschreibung": "Rural",
      "HPSAZuordnungsBevoelkerungstypBeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "BHCMISOrganisationsID": null
    },
    {
      "Quellidentifikator": "60499904B5",
      "Quellenname": "Phx Area Office Two Renaissance Square",
      "Statuscode": "W",
      "Statusbeschreibung": "Withdrawn",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "100 N 1st St",
      "Stadt": "Phoenix",
      "Bundeslandkürzel": "AZ",
      "Postleitzahl": "85004",
      "Mangelsgrad": null,
      "Zuordnungsdatum": "2005-12-05",
      "Zuordnungsaktualisierungsdatum": "2016-06-11",
      "Zuordnungsbevölkerung": null,
      "UnterversorgteBevölkerung": null,
      "GeschätzteVersorgteBevölkerung": null,
      "FormellesVerhältnis": null,
      "GesamtVollzeitäquivalenteKliniker": null,
      "MetropolregionIndikatorCode": "M",
      "MetropolregionIndikatorbeschreibung": "Metropolitan",
      "AnbieterVerhältnisZiel": null,
      "BevölkerungsanteilUnterArmutsgrenze": null,
      "HPSAScore": 0,
      "HPSAMangel": 0.0,
      "DisziplinKlassenNummer": 6,
      "DisziplinKlassenbeschreibung": "Dental Health",
      "KomponentenquelleID": "60499904B5",
      "Komponentenquellename": "Phx Area Office Two Renaissance Square",
      "KomponentenStatusCode": "0",
      "KomponentenStatusbeschreibung": "Unknown",
      "KomponentenTypCode": "UNK",
      "KomponentenTypbeschreibung": "Unknown",
      "KomponentenStaatKuerzel": null,
      "KomponentenPostleitzahl": null,
      "KomponentenZuordnungsdatum": "NaT",
      "KomponentenZuordnungsdatumsString": null,
      "KomponentenZuordnungsaktualisierungsdatum": "NaT",
      "GeographieID": "POINT",
      "KreisFIPS": 13,
      "Kreisname": "Maricopa",
      "BundeslandKreisFIPS": "4013",
      "BundeslandFIPS": "4",
      "StaatKuerzel2": "AZ",
      "Staatsname": "Arizona",
      "Hauptstaatsname": "Arizona",
      "HauptstaatsFIPS": 4,
      "PrimäreHHSRegionName": "Region IX",
      "GrenzbezirkUSAMexiko": "N",
      "GrenzgebietUSAMexiko100km": "N",
      "DWHDatensatzErstellungsdatum": "2019-12-17",
      "DWHDatensatzErstellungsdatumsText": "12/17/2019",
      "HPSAName": "Phx Area Office Two Renaissance Square",
      "HPSAKomponentenname": "Phx Area Office Two Renaissance Square",
      "Zuordnungsunterbrechung": "N",
      "GeokodierungPrimäresX": -112.07259,
      "GeokodierungPrimäresY": 33.44999,
      "HPSAPopulationsartCode": null,
      "HPSAPopulationsartBeschreibung": null,
      "HPSABewohnerBevölkerung": null,
      "GemeinsamerStadtnameMitStaatKuerzel": "Phoenix",
      "GemeinsamePostleitzahl": 85004,
      "GemeinsamerKreisname": "Maricopa County, AZ",
      "GemeinsamesBundeslandKreisFIPS": "4013",
      "GemeinsamesStaatsKuerzel": "AZ",
      "GemeinsamerStaatsname": "Arizona",
      "GemeinsamerStaatsFIPS": "4",
      "RegionenName": "Region IX",
      "HPSARuecknahmedatum": "NaT",
      "HPSARuecknahmedatumString": null,
      "Anbietertyp": null,
      "LaendlicherStatusCode": "N",
      "LaendlicherStatusBeschreibung": "Non-Rural",
      "HPSAZuordnungsBevoelkerungstypBeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "BHCMISOrganisationsID": null
    },
    {
      "Quellidentifikator": "6569995629",
      "Quellenname": "Ft. Washakie PHS Indian Health Center",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "PO BOX 128",
      "Stadt": "Fort Washakie",
      "Bundeslandkürzel": "WY",
      "Postleitzahl": "82514-0128",
      "Mangelsgrad": null,
      "Zuordnungsdatum": "2006-03-01",
      "Zuordnungsaktualisierungsdatum": "2006-03-01",
      "Zuordnungsbevölkerung": null,
      "UnterversorgteBevölkerung": null,
      "GeschätzteVersorgteBevölkerung": null,
      "FormellesVerhältnis": null,
      "GesamtVollzeitäquivalenteKliniker": null,
      "MetropolregionIndikatorCode": "N",
      "MetropolregionIndikatorbeschreibung": "Non-Metropolitan",
      "AnbieterVerhältnisZiel": null,
      "BevölkerungsanteilUnterArmutsgrenze": null,
      "HPSAScore": 16,
      "HPSAMangel": 0.0,
      "DisziplinKlassenNummer": 6,
      "DisziplinKlassenbeschreibung": "Dental Health",
      "KomponentenquelleID": "6569995629",
      "Komponentenquellename": "Ft. Washakie PHS Indian Health Center",
      "KomponentenStatusCode": "0",
      "KomponentenStatusbeschreibung": "Unknown",
      "KomponentenTypCode": "UNK",
      "KomponentenTypbeschreibung": "Unknown",
      "KomponentenStaatKuerzel": null,
      "KomponentenPostleitzahl": null,
      "KomponentenZuordnungsdatum": "NaT",
      "KomponentenZuordnungsdatumsString": null,
      "KomponentenZuordnungsaktualisierungsdatum": "NaT",
      "GeographieID": "POINT",
      "KreisFIPS": 13,
      "Kreisname": "Fremont",
      "BundeslandKreisFIPS": "56013",
      "BundeslandFIPS": "56",
      "StaatKuerzel2": "WY",
      "Staatsname": "Wyoming",
      "Hauptstaatsname": "Wyoming",
      "HauptstaatsFIPS": 56,
      "PrimäreHHSRegionName": "Region VIII",
      "GrenzbezirkUSAMexiko": "N",
      "GrenzgebietUSAMexiko100km": "N",
      "DWHDatensatzErstellungsdatum": "2019-12-17",
      "DWHDatensatzErstellungsdatumsText": "12/17/2019",
      "HPSAName": "Ft. Washakie PHS Indian Health Center",
      "HPSAKomponentenname": "Ft. Washakie PHS Indian Health Center",
      "Zuordnungsunterbrechung": "N",
      "GeokodierungPrimäresX": -108.874268,
      "GeokodierungPrimäresY": 42.998532,
      "HPSAPopulationsartCode": null,
      "HPSAPopulationsartBeschreibung": null,
      "HPSABewohnerBevölkerung": null,
      "GemeinsamerStadtnameMitStaatKuerzel": "Fort Washakie",
      "GemeinsamePostleitzahl": 82514,
      "GemeinsamerKreisname": "Fremont County, WY",
      "GemeinsamesBundeslandKreisFIPS": "56013",
      "GemeinsamesStaatsKuerzel": "WY",
      "GemeinsamerStaatsname": "Wyoming",
      "GemeinsamerStaatsFIPS": "56",
      "RegionenName": "Region VIII",
      "HPSARuecknahmedatum": "NaT",
      "HPSARuecknahmedatumString": null,
      "Anbietertyp": null,
      "LaendlicherStatusCode": "R",
      "LaendlicherStatusBeschreibung": "Rural",
      "HPSAZuordnungsBevoelkerungstypBeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "BHCMISOrganisationsID": null
    }
  ]
}