{
  "table_name": "hpsa_primary_care",
  "table_fullname": "bigquery-public-data.sdoh_hrsa_shortage_areas.hpsa_primary_care",
  "column_names": [
    "Quellen-ID",
    "Quellenname",
    "Statuscode",
    "Statusbeschreibung",
    "Typcode",
    "Typbeschreibung",
    "Adresse",
    "Stadt",
    "Staat-Abkürzung",
    "Postleitzahl",
    "Mangelgrad",
    "Zuordnungsdatum",
    "Letzte Zuordnungsaktualisierung",
    "Bezeichnete Bevölkerung",
    "Geschätzte unterversorgte Bevölkerung",
    "Geschätzte versorgte Bevölkerung",
    "Formales Verhältnis",
    "Gesamt-Vollzeitäquivalente der Kliniker",
    "Metropolregion-Indikator-Code",
    "Metropolregion-Indikatorbeschreibung",
    "Anbieter-Verhältnisziel",
    "Bevölkerungsanteil unterhalb der Armutsgrenze",
    "HPSA-Punktzahl",
    "HPSA-Knappheit",
    "Fachklassennummer",
    "Fachklassenbeschreibung",
    "Komponentenquelle-ID",
    "Name der Komponentenquelle",
    "Komponenten-Statuscode",
    "Komponenten-Statusbeschreibung",
    "Komponenten-Typ-Code",
    "Komponenten-Typbeschreibung",
    "Komponenten-Staat-Abkürzung",
    "Komponenten-Postleitzahl",
    "Komponenten-Bezeichnungsdatum",
    "Komponenten-Bezeichnungsdatum-Text",
    "Komponenten-letzte-Bezeichnungsaktualisierung",
    "Geografie-ID",
    "Kreis-FIPS-Code",
    "Kreisname",
    "Staat-Kreis-FIPS",
    "Bundesstaat-FIPS",
    "Staat-Abkürzung 2",
    "Staatenname",
    "Primär-Staatsname",
    "Primär-Staats-FIPS",
    "Primäre-HHS-Region-Name",
    "US-Mexiko-Grenz-Kreis",
    "US-Mexiko-Grenze-100km",
    "DWH-Erstellungsdatum",
    "DWH-Erstellungsdatum-Text",
    "HPSA-Name",
    "HPSA-Komponentenname",
    "Bezeichnungsunterbrechung",
    "Geokodierung-Haupt-X",
    "Geokodierung-Haupt-Y",
    "HPSA-Bevölkerungstyp-Code",
    "HPSA-Bevölkerungstyp-Beschreibung",
    "HPSA-Zivilbevölkerung",
    "Stadtname mit Staatsabkürzung",
    "Gemeinsame Postleitzahl",
    "Kreisname",
    "Staat-Kreis-FIPS",
    "Gemeinsame-Staat-Abkürzung",
    "Gemeinsamer Staatsname",
    "Gemeinsame-Staats-FIPS",
    "Regionsname",
    "Rückzugsdatum",
    "Rückzugsdatums-Text",
    "Anbietertyp",
    "Ländlicher Status-Code",
    "Ländlicher Statusbeschreibung",
    "HPSA-Bevölkerungstyp-Beschreibung",
    "Organisations-ID"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "DATE",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "INT64",
    "FLOAT64",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "nested_column_names": [
    "Quell-ID",
    "Quellenname",
    "Statuscode",
    "Statusbeschreibung",
    "Typcode",
    "Typbeschreibung",
    "Adresse",
    "Stadt",
    "Staat-Abkürzung",
    "Postleitzahl",
    "Mangelgrad",
    "Bezeichnungsdatum",
    "Letzte Bezeichnungsaktualisierung",
    "Bevölkerung der Bezeichnung",
    "Geschätzte unterversorgte Bevölkerung",
    "Geschätzte versorgte Bevölkerung",
    "Verhältnis",
    "Gesamt-Vollzeitäquivalente der Kliniker",
    "Metropolitan-Indikator-Code",
    "Metropolitan-Indikator-Beschreibung",
    "Anbieter-Verhältnisziel",
    "Bevölkerungsanteil unterhalb der Armutsgrenze",
    "HPSA-Punktzahl",
    "HPSA-Knappheit",
    "Fachklassen-Nummer",
    "Fachklassenbeschreibung",
    "Quell-ID der Komponente",
    "Quellname der Komponente",
    "Statuscode der Komponente",
    "Komponentenstatusbeschreibung",
    "Typcode der Komponente",
    "Komponenten-Typbeschreibung",
    "Komponenten-Staat-Abkürzung",
    "Komponenten-Postleitzahl",
    "Bezeichnungsdatum der Komponente",
    "Bezeichnungsdatum-Text der Komponente",
    "Letzte Bezeichnungsaktualisierung der Komponente",
    "Geografie-ID",
    "Kreis-FIPS-Code",
    "Kreisname",
    "Staat-Kreis-FIPS",
    "Staat-FIPS",
    "Staat-Abkürzung_2",
    "Staatsname",
    "Hauptstaatsname",
    "Hauptstaats-FIPS",
    "Primäre HHS-Regionsname",
    "US-Mexiko-Grenz-Kreis",
    "US-Mexiko-Grenzgebiet 100 km",
    "Erstellungsdatum des Data-Warehouse-Datensatzes",
    "Erstellungsdatum-Text des Data-Warehouse-Datensatzes",
    "HPSA-Name",
    "Name der HPSA-Komponente",
    "Bezeichnungsunterbrechung",
    "Geokodierung Primäres X",
    "Geokodierung Primäres Y",
    "HPSA-Bevölkerungsart-Code",
    "HPSA-Bevölkerungsart-Beschreibung",
    "HPSA-Zivile Bevölkerung",
    "Gemeindename mit Staat-Abkürzung",
    "Gemeinsame Postleitzahl",
    "Gemeinsamer Kreisname",
    "Gemeinsamer Staat-Kreis-FIPS",
    "Gemeinsame Staatsabkürzung",
    "Gemeinsamer Staatsname",
    "Gemeinsamer Staats-FIPS",
    "Regionsname",
    "HPSA-Rückzugsdatum",
    "HPSA-Rückzugsdatum-Text",
    "Anbietertyp",
    "Ländlicher Status-Code",
    "Beschreibung des ländlichen Status",
    "Beschreibung des HPSA-Bevölkerungstyps",
    "BHCMIS-Organisations-ID"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "DATE",
    "INT64",
    "INT64",
    "INT64",
    "STRING",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "INT64",
    "FLOAT64",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "INT64",
    "STRING",
    "INT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING"
  ],
  "description": [
    "Primärer Bezeichner für ein Health Professional Shortage Area (HPSA) als vollständige Einheit im Quellsystem der Daten.",
    "Der Name des Health Professional Shortage Area (HPSA). Dieses Datenelement stammt direkt aus dem Quellsystem in der neuesten Datenaktualisierung. Für weitere Informationen zum HPSA verweisen Sie auf die Website http://www.hrsa.gov/shortage/.",
    "Ein Zeichen-Bezeichner, der den aktuellen Status der HPSA-Bezeichnung kennzeichnet. Für weitere Informationen zu Health Professional Shortage Areas (HPSA) verweisen Sie auf die Website http://www.hrsa.gov/shortage/.",
    "Textuelle Beschreibung des aktuellen Status der HPSA-Bezeichnung.",
    "Geografie- oder Einrichtungstypcode, der die Health Professional Shortage Area (HPSA) charakterisiert.",
    "Textuelle Beschreibung des HPSA-Typs.",
    "Standardisierte Version der Straßenadresse einer HPSA-Einrichtung.",
    "Standardisierte Version des Stadtnamens, in dem sich eine Health Professional Shortage Area (HPSA)-Einrichtung befindet.",
    "USPS-Code des Bundesstaats, in dem sich die Health Professional Shortage Area (HPSA)-Einheit befindet.",
    "Health Professional Shortage Area (HPSA) USPS Zone Improvement Plan (ZIP) Code. Im Kontext der HPSA-Daten gilt dieses Feld nur für Einrichtungen.",
    "Ausmaß des Fachkräftemangels bei Gesundheitsdienstleistern im HPSA basierend auf dem Verhältnis Bevölkerung zu Anbieter.",
    "Datum, an dem das Health Professional Shortage Area (HPSA) ursprünglich als Engpassgebiet ausgewiesen wurde.",
    "Datum, an dem die HPSA-Informationen zuletzt im Quellsystem aktualisiert wurden.",
    "Anzahl der Personen, die von HRSA, Bureau of Health Workforce (BHW), Division of Policy and Shortage Designation (DPSD) als von der Health Professional Shortage Area (HPSA) betroffen identifiziert wurden.",
    "Geschätzte unterversorgte Bevölkerung, die von den Vollzeitäquivalenten (FTE) der Gesundheitsdienstleister innerhalb einer Health Professional Shortage Area (HPSA) bedient wird.",
    "Geschätzte Gesamtbevölkerung, die von den Vollzeitäquivalenten (FTE) Gesundheitsdienstleistern innerhalb einer Health Professional Shortage Area (HPSA) bedient wird.",
    "Verhältnis der HPSA-Bevölkerungszahl zur HPSA-Anbieter-FTE, angezeigt im Verhältnisformat (z. B. 3500:1), wobei Bevölkerung und Bezeichnung derselben Disziplinenklasse angehören (z. B. Primary Care, Dental Care und Mental Health).",
    "Anzahl der Praktiker, die ambulante Patientenversorgung in der Health Professional Shortage Area (HPSA) leisten, ausgedrückt als Vollzeitäquivalente (FTE).",
    "Ein einzelnes Zeichen, das angibt, ob eine Health Professional Shortage Area (HPSA) als Metropolitan-, Nicht-Metropolitan- oder Randgebiet gilt.",
    "Beschreibung, die angibt, ob eine Health Professional Shortage Area (HPSA) metropolitan, Nicht-Metropolitan oder Randgebietscharakter hat.",
    "Zielwert des Provider-Verhältnisses im HPSA, das die Zielbevölkerung pro Anbieter (Arzt) für die HPSA in einer Disziplinklasse festlegt. Federal regulations stipulate that, in order to be considered as having a shortage of providers, an area must have a population-to-provider ratio of a certain threshold. For primary medical care, the population to provider ratio must be at least 3,500 to 1 (3,000 to 1 if there are unusually high needs in the community). For dental, the ratio must be at least 5,000 to 1 (4,000 to 1 in high-need communities). For mental health, the area must have a population to psychiatrist ratio of 30,000 to 1 (20,000 to 1 in high-need communities). For further information about Health Professional Shortage Areas (HPSA) refer to the http://www.hrsa.gov/shortage/ website.",
    "Prozentsatz der Bevölkerung in der Health Professional Shortage Area (HPSA), die unter dem US-Föderalen Armutsniveau (USFPL) lebt.",
    "HPSA-Score, entwickelt vom National Health Service Corps (NHSC) zur Festlegung von Prioritäten bei der Zuweisung von Klinikerinnen/Klinikern. Die Scores reichen von 0 bis 26, wobei eine höhere Punktzahl eine höhere Priorität anzeigt.",
    "Anzahl der benötigten Vollzeitäquivalente (FTE) von Praktikern in der Health Professional Shortage Area (HPSA), damit das Bevölkerungs-zu-Anbieter-Zielverhältnis erreicht wird. Das Zielverhältnis wird durch die Art (Disziplin) der HPSA bestimmt.",
    "Ein einzelnes Zeichen, das vom HRSA Data Warehouse (HDW) verwendet wird, um die Identifikationsnummer der Disziplinenklasse zu kennzeichnen, die mit gesundheitsbezogenen Fachklassen verbunden ist.",
    "Beschreibung der HPSA-Disziplinenklasse. HPSA-Disziplinen können als Primary Care, Dental Health oder Mental Health aufgeführt sein.",
    "Identifikationsnummer, die eine Health Professional Shortage Area (HPSA)-Komponente mit ihrem „Eltern“-HPSA verbindet.",
    "Name der HPSA-Komponente, wie in der neuesten Datenaktualisierung identifiziert.",
    "Ein einzelnes Zeichen, das den Bezeichnungsstatus des Komponentenanteils der Health Professional Shortage Areas (HPSA) angibt.",
    "Beschreibung des HPSA-Komponentenstatus, das die englische Ausweitung des HPSA-Komponentenstatuscodes ist. Diese Textbeschreibung identifiziert den aktuellen Status der HPSA-Komponente und kann sich im Laufe der Lebensdauer des HPSA ändern.",
    "Geografie- oder Einrichtungstypcode, der die HPSA-Komponente charakterisiert.",
    "Beschreibung des HPSA-Komponenten-Typs, der in Worten den Typ der HPSA für die Komponente angibt.",
    "USPS-Zweibuchstabiger Code für einen US-Bundesstaat oder US-Territorium, der mit dem Landkreis bzw. Äquivalent des Ortes verbunden ist, an dem sich die HPSA-Komponente befindet.",
    "USPS Zone Improvement Plan (ZIP), der mit einer HPSA-Komponente verbunden ist.",
    "Datum, an dem die HPSA in der neuesten Datenaktualisierung aus den Quelldaten als Engpassgebiet ausgewiesen wurde. Weitere Informationen zu Health Professional Shortage Areas (HPSA) finden Sie auf der Website http://www.hrsa.gov/shortage/.",
    "Datum, an dem die Health Professional Shortage Area (HPSA) als Engpassgebiet festgelegt wurde, wie in der neuesten Datenaktualisierung aus den Quelldaten dargestellt und als Textzeichenfolge gespeichert.",
    "Datum, an dem die HPSA-Komponente zuletzt aktualisiert wurde, wie in der neuesten HPSA-Quellendatenaktualisierung dargestellt. Weitere Informationen zu Health Professional Shortage Areas (HPSA) verweisen Sie auf http://www.hrsa.gov/shortage/.",
    "HPSA-Geografiecode, der das spezifische geografische Gebiet (County, Minor Civil Division (MCD) oder Census Tract) identifiziert, das mit der HPSA verbunden ist.",
    "Numerische Zeichenfolge, die vom National Institute of Standards and Technology (NIST) den Counties bzw. County-Äquivalenten für die Bundesstaaten, den District of Columbia und US-Territorien zugewiesen wird.",
    "Name des Countys bzw. County-Äquivalents, in dem sich die zugehörige Adresse befindet, als Textzeichenfolge angezeigt.",
    "Verkettung (Kombination) der Federal Information Processing Standard (FIPS) Bundesstaat- und Counties-Codes.",
    "Bundesstaats-FIPS-Code, der die zwei numerischen Zeichenfolgen identifiziert, die vom National Institute of Standards and Technology (NIST) Staaten, dem District of Columbia und US-Territorien zugewiesen sind.",
    "USPS-Zweibuchstabiger Code für einen US-Bundesstaat oder US-Territorium, der mit einem Ort verbunden ist, an dem sich eine Einrichtung befindet.",
    "Name des Bundesstaates oder Territoriums.",
    "Formeller, offizieller Name des US-Bundesstaates oder US-Territoriums, der mit dem Standort oder der Adresse der Einrichtung verbunden ist (Datensatz). In Bezug auf ein Health Professional Shortage Area (HPSA) oder ein Medically Underserved Area/Population (MUA/P) kann das physische Landgebiet der Einrichtung Grenzübergreifend sein, was bedeutet, dass eine HPSA oder MUA/P aus Komponenten oder Teilen von einem oder mehreren Staaten bestehen kann. Daher ist der primäre Staat für eines dieser Gebiete der Staat, der mit dem Eltern- oder Primärdatensatz verbunden ist. Der primäre Staat wird außerdem verwendet, um Zählungen und Summen auf Staatsebene zu aggregieren.",
    "Bundesstaats-FIPS-Code, der die zwei numerischen Zeichenfolgen identifiziert, die vom National Institute of Standards and Technology (NIST) Staaten, dem District of Columbia und US-Territorien zugewiesen sind.",
    "Formeller Name für die Region des U.S. Department of Health and Human Services (HHS), die mit dem Standort oder der Adresse der Einrichtung verbunden ist. In Bezug auf ein HPSA oder MUA/P kann das physische Landgebiet der Einrichtung Grenzübergreifend sein, was bedeutet, dass eine HPSA oder MUA/P aus Komponenten oder Teilen von einem oder mehreren Staaten bestehen kann. Daher ist der primäre Staat für eines dieser Gebiete der Staat, der mit dem Eltern- oder Primärdatensatz verbunden ist. Der primäre Staat wird außerdem verwendet, um Zählungen und Summen auf Staatsebene zu aggregieren.",
    "Angabe, ob ein Landkreis oder ein Teil eines Landkreises in US-Landkreisen aufgeführt ist, die von der U.S.-Mexico Border Health Commission als Border Health Initiative-Zone definiert wurden. Für Landkreise im zusammenhängenden US kann dieser Dateneintrag vom Wert des U.S.-Mexico Border 100 Kilometer-Indikators abweichen, da drei Landkreise in Arizona teilweise innerhalb des definierten 100-Kilometer-Grenzgebiets fallen, aber nicht in der Liste der Landkreise aufgeführt sind, die von der U.S.-Mexico Border Health Commission als Gebiet von Interesse identifiziert wurden.",
    "Angabe, ob irgendein Teil der geografischen Einheit innerhalb von 100 Kilometern der U.S.-Mexico-Grenze liegt. Das HRSA Data Warehouse generiert diesen Wert durch Geoprocessing gegen das 100-Kilometer-US-Mexico-Grenzgebiet gemäß HRSA Office of Rural Health Policy, Border Health Program.",
    "Datum, an dem die Daten vom HRSA Data Warehouse verarbeitet wurden.",
    "Datum, an dem die Daten vom HRSA Data Warehouse verarbeitet wurden.",
    "Titel-Großbuchstaben-Format, benutzerfreundlicher Name, der durch Dekodieren des direkt aus dem Quellsystem stammenden HPSA-Namens erzeugt wird.",
    "Name der HPSA-Komponente, wie im Quellsystem identifiziert. Für Area-HPSAs kann eine Komponente ein County, Census Tract oder Minor Civil Division (MCD) sein.",
    "Angabe, ob die HPSA oder MUA/P kontinuierlich seit dem ursprünglichen Bezeichnungsdatum festgelegt ist.",
    "Primärer Längengrad in Dezimalgrad (x-Koordinate) einer Einrichtung basierend auf ihrer Adresse.",
    "Primärer Breitengrad in Dezimalgrad (y-Koordinate) einer Einrichtung basierend auf ihrer Adresse.",
    "Code des Bevölkerungs-Typs in einer bezeichneten Health Professional Shortage Area (HPSA).",
    "Bevölkerungstyp-Beschreibung, die die Health Professional Shortage Area (HPSA) charakterisiert.",
    "Bevölkerungstyp-Beschreibung für die Health Professional Shortage Area (HPSA).",
    "Stadtname, in dem die Einrichtung physisch lokalisiert ist.",
    "Postleitzahl, die mit einer Einrichtungadresse verbunden ist. Für HRSA Data Warehouse gilt dieser Wert als fünfstellige U.S. Postal Service (USPS) Zone Improvement Plan (ZIP) Code.",
    "HDW-Verkettung des vollständigen County-Namens und der Staatsabkürzung.",
    "Kombination der Bundesstaat- und County-FIPS-Codes.",
    "USPS-Zweibuchstabiger Code für einen US-Bundesstaat oder US-Territorium, der mit einem Ort verbunden ist, an dem sich eine Einrichtung befindet.",
    "Name des Bundesstaates oder Territoriums.",
    "Bundesstaats-FIPS-Code, der die zwei numerischen Zeichenfolgen identifiziert, die vom National Institute of Standards and Technology (NIST) Staaten, dem District of Columbia und US-Territorien zugewiesen sind.",
    "Formeller Name der Region des U.S. Department of Health and Human Services (HHS), die mit dem Standort oder der Adresse der Einrichtung verbunden ist.",
    "Datum, an dem der Bezeichnungsstatus von designated auf withdrawn geändert wurde.",
    "Datum, an dem der Bezeichnungsstatus von designated auf withdrawn geändert wurde.",
    "Art der Mental-Health-Anbieter, die in den Vollzeitäquivalenten (FTE) Berechnungen für die angegebene HPSA-Bezeichnung verwendet wird.",
    "Statuscode, der den ländlichen Status einer Einrichtung (z. B. einer Einrichtung oder eines geografischen Gebiets) angibt.",
    "Beschreibung des ländlichen Status der Einrichtung (z. B. einer Einrichtung oder eines geografischen Gebiets).",
    "Dieses Attribut repräsentiert die Bevölkerungs-Typ-Bezeichnung der HPSA-Bezeichnung.",
    "Organisationsquellennummer aus dem HRSA, Bureau of Primary Health Care (BPHC) Health Center Management Information System (BHCMIS)."
  ],
  "sample_rows": [
    {
      "Quell-ID": "1569995651",
      "Quellenname": "Ft. Washakie PHS Indian Health Center",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "PO BOX 128",
      "Stadt": "Fort Washakie",
      "Staat-Abkürzung": "WY",
      "Postleitzahl": "82514-0128",
      "Mangelgrad": null,
      "Bezeichnungsdatum": "2006-03-01",
      "Letzte Bezeichnungsaktualisierung": "2011-07-27",
      "Bevölkerung der Bezeichnung": null,
      "Geschätzte unterversorgte Bevölkerung": null,
      "Geschätzte versorgte Bevölkerung": null,
      "Verhältnis": null,
      "Gesamt-Vollzeitäquivalente der Kliniker": null,
      "Metropolitan-Indikator-Code": "N",
      "Metropolitan-Indikator-Beschreibung": "Non-Metropolitan",
      "Anbieter-Verhältnisziel": null,
      "Bevölkerungsanteil unterhalb der Armutsgrenze": null,
      "HPSA-Punktzahl": 16,
      "HPSA-Knappheit": 0.0,
      "Fachklassen-Nummer": 1,
      "Fachklassenbeschreibung": "Primary Care",
      "Quell-ID der Komponente": "1569995651",
      "Quellname der Komponente": "Ft. Washakie PHS Indian Health Center",
      "Statuscode der Komponente": "0",
      "Komponentenstatusbeschreibung": "Unknown",
      "Typcode der Komponente": "UNK",
      "Komponenten-Typbeschreibung": "Unknown",
      "Komponenten-Staat-Abkürzung": null,
      "Komponenten-Postleitzahl": null,
      "Bezeichnungsdatum der Komponente": "NaT",
      "Bezeichnungsdatum-Text der Komponente": null,
      "Letzte Bezeichnungsaktualisierung der Komponente": "NaT",
      "Geografie-ID": "POINT",
      "Kreis-FIPS-Code": 13,
      "Kreisname": "Fremont",
      "Staat-Kreis-FIPS": "56013",
      "Staat-FIPS": "56",
      "Staat-Abkürzung_2": "WY",
      "Staatsname": "Wyoming",
      "Hauptstaatsname": "Wyoming",
      "Hauptstaats-FIPS": 56,
      "Primäre HHS-Regionsname": "Region VIII",
      "US-Mexiko-Grenz-Kreis": "N",
      "US-Mexiko-Grenzgebiet 100 km": "N",
      "Erstellungsdatum des Data-Warehouse-Datensatzes": "2019-12-16",
      "Erstellungsdatum-Text des Data-Warehouse-Datensatzes": "2019-12-16",
      "HPSA-Name": "Ft. Washakie PHS Indian Health Center",
      "Name der HPSA-Komponente": "Ft. Washakie PHS Indian Health Center",
      "Bezeichnungsunterbrechung": "N",
      "Geokodierung Primäres X": -108.874268,
      "Geokodierung Primäres Y": 42.998532,
      "HPSA-Bevölkerungsart-Code": null,
      "HPSA-Bevölkerungsart-Beschreibung": null,
      "HPSA-Zivile Bevölkerung": null,
      "Gemeindename mit Staat-Abkürzung": "Fort Washakie",
      "Gemeinsame Postleitzahl": 82514,
      "Gemeinsamer Kreisname": "Fremont County, WY",
      "Gemeinsamer Staat-Kreis-FIPS": "56013",
      "Gemeinsame Staatsabkürzung": "WY",
      "Gemeinsamer Staatsname": "Wyoming",
      "Gemeinsamer Staats-FIPS": "56",
      "Regionsname": "Region VIII",
      "HPSA-Rückzugsdatum": "NaT",
      "HPSA-Rückzugsdatum-Text": null,
      "Anbietertyp": null,
      "Ländlicher Status-Code": "R",
      "Beschreibung des ländlichen Status": "Rural",
      "Beschreibung des HPSA-Bevölkerungstyps": "Indian, Tribal and Urban Indian Organizations",
      "BHCMIS-Organisations-ID": null
    },
    {
      "Quell-ID": "1469994698",
      "Quellenname": "McLaughlin PHS Indian Medical/Dental Clinic",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "611 2nd Ave E",
      "Stadt": "Mc Laughlin",
      "Staat-Abkürzung": "SD",
      "Postleitzahl": "57642",
      "Mangelgrad": null,
      "Bezeichnungsdatum": "2009-08-01",
      "Letzte Bezeichnungsaktualisierung": "2011-06-27",
      "Bevölkerung der Bezeichnung": null,
      "Geschätzte unterversorgte Bevölkerung": null,
      "Geschätzte versorgte Bevölkerung": null,
      "Verhältnis": null,
      "Gesamt-Vollzeitäquivalente der Kliniker": null,
      "Metropolitan-Indikator-Code": "N",
      "Metropolitan-Indikator-Beschreibung": "Non-Metropolitan",
      "Anbieter-Verhältnisziel": null,
      "Bevölkerungsanteil unterhalb der Armutsgrenze": null,
      "HPSA-Punktzahl": 17,
      "HPSA-Knappheit": 0.0,
      "Fachklassen-Nummer": 1,
      "Fachklassenbeschreibung": "Primary Care",
      "Quell-ID der Komponente": "1469994698",
      "Quellname der Komponente": "McLaughlin PHS Indian Medical/Dental Clinic",
      "Statuscode der Komponente": "0",
      "Komponentenstatusbeschreibung": "Unknown",
      "Typcode der Komponente": "UNK",
      "Komponenten-Typbeschreibung": "Unknown",
      "Komponenten-Staat-Abkürzung": null,
      "Komponenten-Postleitzahl": null,
      "Bezeichnungsdatum der Komponente": "NaT",
      "Bezeichnungsdatum-Text der Komponente": null,
      "Letzte Bezeichnungsaktualisierung der Komponente": "NaT",
      "Geografie-ID": "POINT",
      "Kreis-FIPS-Code": 31,
      "Kreisname": "Corson",
      "Staat-Kreis-FIPS": "46031",
      "Staat-FIPS": "46",
      "Staat-Abkürzung_2": "SD",
      "Staatsname": "South Dakota",
      "Hauptstaatsname": "South Dakota",
      "Hauptstaats-FIPS": 46,
      "Primäre HHS-Regionsname": "Region VIII",
      "US-Mexiko-Grenz-Kreis": "N",
      "US-Mexiko-Grenzgebiet 100 km": "N",
      "Erstellungsdatum des Data-Warehouse-Datensatzes": "2019-12-16",
      "Erstellungsdatum-Text des Data-Warehouse-Datensatzes": "2019-12-16",
      "HPSA-Name": "McLaughlin PHS Indian Medical/Dental Clinic",
      "Name der HPSA-Komponente": "McLaughlin PHS Indian Medical/Dental Clinic",
      "Bezeichnungsunterbrechung": "N",
      "Geokodierung Primäres X": -100.8078118,
      "Geokodierung Primäres Y": 45.8105513,
      "HPSA-Bevölkerungsart-Code": null,
      "HPSA-Bevölkerungsart-Beschreibung": null,
      "HPSA-Zivile Bevölkerung": null,
      "Gemeindename mit Staat-Abkürzung": "Mc Laughlin",
      "Gemeinsame Postleitzahl": 57642,
      "Gemeinsamer Kreisname": "Corson County, SD",
      "Gemeinsamer Staat-Kreis-FIPS": "46031",
      "Gemeinsame Staatsabkürzung": "SD",
      "Gemeinsamer Staatsname": "South Dakota",
      "Gemeinsamer Staats-FIPS": "46",
      "Regionsname": "Region VIII",
      "HPSA-Rückzugsdatum": "NaT",
      "HPSA-Rückzugsdatum-Text": null,
      "Anbietertyp": null,
      "Ländlicher Status-Code": "R",
      "Beschreibung des ländlichen Status": "Rural",
      "Beschreibung des HPSA-Bevölkerungstyps": "Indian, Tribal and Urban Indian Organizations",
      "BHCMIS-Organisations-ID": null
    },
    {
      "Quell-ID": "1469994687",
      "Quellenname": "Wagner PHS Indian Hospital",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "110 Washington Ave NW",
      "Stadt": "Wagner",
      "Staat-Abkürzung": "SD",
      "Postleitzahl": "57380",
      "Mangelgrad": null,
      "Bezeichnungsdatum": "2002-10-26",
      "Letzte Bezeichnungsaktualisierung": "2002-10-26",
      "Bevölkerung der Bezeichnung": null,
      "Geschätzte unterversorgte Bevölkerung": null,
      "Geschätzte versorgte Bevölkerung": null,
      "Verhältnis": null,
      "Gesamt-Vollzeitäquivalente der Kliniker": null,
      "Metropolitan-Indikator-Code": "N",
      "Metropolitan-Indikator-Beschreibung": "Non-Metropolitan",
      "Anbieter-Verhältnisziel": null,
      "Bevölkerungsanteil unterhalb der Armutsgrenze": null,
      "HPSA-Punktzahl": 18,
      "HPSA-Knappheit": 0.0,
      "Fachklassen-Nummer": 1,
      "Fachklassenbeschreibung": "Primary Care",
      "Quell-ID der Komponente": "1469994687",
      "Quellname der Komponente": "Wagner PHS Indian Hospital",
      "Statuscode der Komponente": "0",
      "Komponentenstatusbeschreibung": "Unknown",
      "Typcode der Komponente": "UNK",
      "Komponenten-Typbeschreibung": "Unknown",
      "Komponenten-Staat-Abkürzung": null,
      "Komponenten-Postleitzahl": null,
      "Bezeichnungsdatum der Komponente": "NaT",
      "Bezeichnungsdatum-Text der Komponente": null,
      "Letzte Bezeichnungsaktualisierung der Komponente": "NaT",
      "Geografie-ID": "POINT",
      "Kreis-FIPS-Code": 23,
      "Kreisname": "Charles Mix",
      "Staat-Kreis-FIPS": "46023",
      "Staat-FIPS": "46",
      "Staat-Abkürzung_2": "SD",
      "Staatsname": "South Dakota",
      "Hauptstaatsname": "South Dakota",
      "Hauptstaats-FIPS": 46,
      "Primäre HHS-Regionsname": "Region VIII",
      "US-Mexiko-Grenz-Kreis": "N",
      "US-Mexiko-Grenzgebiet 100 km": "N",
      "Erstellungsdatum des Data-Warehouse-Datensatzes": "2019-12-16",
      "Erstellungsdatum-Text des Data-Warehouse-Datensatzes": "2019-12-16",
      "HPSA-Name": "Wagner PHS Indian Hospital",
      "Name der HPSA-Komponente": "Wagner PHS Indian Hospital",
      "Bezeichnungsunterbrechung": "N",
      "Geokodierung Primäres X": -98.29762274,
      "Geokodierung Primäres Y": 43.08182503,
      "HPSA-Bevölkerungsart-Code": null,
      "HPSA-Bevölkerungsart-Beschreibung": null,
      "HPSA-Zivile Bevölkerung": null,
      "Gemeindename mit Staat-Abkürzung": "Wagner",
      "Gemeinsame Postleitzahl": 57380,
      "Gemeinsamer Kreisname": "Charles Mix County, SD",
      "Gemeinsamer Staat-Kreis-FIPS": "46023",
      "Gemeinsame Staatsabkürzung": "SD",
      "Gemeinsamer Staatsname": "South Dakota",
      "Gemeinsamer Staats-FIPS": "46",
      "Regionsname": "Region VIII",
      "HPSA-Rückzugsdatum": "NaT",
      "HPSA-Rückzugsdatum-Text": null,
      "Anbietertyp": null,
      "Ländlicher Status-Code": "R",
      "Beschreibung des ländlichen Status": "Rural",
      "Beschreibung des HPSA-Bevölkerungstyps": "Indian, Tribal and Urban Indian Organizations",
      "BHCMIS-Organisations-ID": null
    },
    {
      "Quell-ID": "141999413V",
      "Quellenname": "Portland Area Office",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "1220 SW 3rd Ave Ste 476",
      "Stadt": "Portland",
      "Staat-Abkürzung": "OR",
      "Postleitzahl": "97204-2825",
      "Mangelgrad": null,
      "Bezeichnungsdatum": "2007-12-01",
      "Letzte Bezeichnungsaktualisierung": "2007-12-01",
      "Bevölkerung der Bezeichnung": null,
      "Geschätzte unterversorgte Bevölkerung": null,
      "Geschätzte versorgte Bevölkerung": null,
      "Verhältnis": null,
      "Gesamt-Vollzeitäquivalente der Kliniker": null,
      "Metropolitan-Indikator-Code": "M",
      "Metropolitan-Indikator-Beschreibung": "Metropolitan",
      "Anbieter-Verhältnisziel": null,
      "Bevölkerungsanteil unterhalb der Armutsgrenze": null,
      "HPSA-Punktzahl": 0,
      "HPSA-Knappheit": 0.0,
      "Fachklassen-Nummer": 1,
      "Fachklassenbeschreibung": "Primary Care",
      "Quell-ID der Komponente": "141999413V",
      "Quellname der Komponente": "Portland Area Office",
      "Statuscode der Komponente": "0",
      "Komponentenstatusbeschreibung": "Unknown",
      "Typcode der Komponente": "UNK",
      "Komponenten-Typbeschreibung": "Unknown",
      "Komponenten-Staat-Abkürzung": null,
      "Komponenten-Postleitzahl": null,
      "Bezeichnungsdatum der Komponente": "NaT",
      "Bezeichnungsdatum-Text der Komponente": null,
      "Letzte Bezeichnungsaktualisierung der Komponente": "NaT",
      "Geografie-ID": "POINT",
      "Kreis-FIPS-Code": 51,
      "Kreisname": "Multnomah",
      "Staat-Kreis-FIPS": "41051",
      "Staat-FIPS": "41",
      "Staat-Abkürzung_2": "OR",
      "Staatsname": "Oregon",
      "Hauptstaatsname": "Oregon",
      "Hauptstaats-FIPS": 41,
      "Primäre HHS-Regionsname": "Region X",
      "US-Mexiko-Grenz-Kreis": "N",
      "US-Mexiko-Grenzgebiet 100 km": "N",
      "Erstellungsdatum des Data-Warehouse-Datensatzes": "2019-12-16",
      "Erstellungsdatum-Text des Data-Warehouse-Datensatzes": "2019-12-16",
      "HPSA-Name": "Portland Area Office",
      "Name der HPSA-Komponente": "Portland Area Office",
      "Bezeichnungsunterbrechung": "N",
      "Geokodierung Primäres X": -122.677522,
      "Geokodierung Primäres Y": 45.51458007,
      "HPSA-Bevölkerungsart-Code": null,
      "HPSA-Bevölkerungsart-Beschreibung": null,
      "HPSA-Zivile Bevölkerung": null,
      "Gemeindename mit Staat-Abkürzung": "Portland",
      "Gemeinsame Postleitzahl": 97204,
      "Gemeinsamer Kreisname": "Multnomah County, OR",
      "Gemeinsamer Staat-Kreis-FIPS": "41051",
      "Gemeinsame Staatsabkürzung": "OR",
      "Gemeinsamer Staatsname": "Oregon",
      "Gemeinsamer Staats-FIPS": "41",
      "Regionsname": "Region X",
      "HPSA-Rückzugsdatum": "NaT",
      "HPSA-Rückzugsdatum-Text": null,
      "Anbietertyp": null,
      "Ländlicher Status-Code": "N",
      "Beschreibung des ländlichen Status": "Non-Rural",
      "Beschreibung des HPSA-Bevölkerungstyps": "Indian, Tribal and Urban Indian Organizations",
      "BHCMIS-Organisations-ID": null
    },
    {
      "Quell-ID": "14099940N2",
      "Quellenname": "Shawnee Health Center",
      "Statuscode": "D",
      "Statusbeschreibung": "Designated",
      "Typcode": "IHS",
      "Typbeschreibung": "Indian, Tribal and Urban Indian Organizations",
      "Adresse": "2307 Gordon Cooper Dr",
      "Stadt": "Shawnee",
      "Staat-Abkürzung": "OK",
      "Postleitzahl": "74801-9007",
      "Mangelgrad": null,
      "Bezeichnungsdatum": "2002-10-26",
      "Letzte Bezeichnungsaktualisierung": "2011-08-02",
      "Bevölkerung der Bezeichnung": 1,
      "Geschätzte unterversorgte Bevölkerung": null,
      "Geschätzte versorgte Bevölkerung": null,
      "Verhältnis": null,
      "Gesamt-Vollzeitäquivalente der Kliniker": null,
      "Metropolitan-Indikator-Code": "M",
      "Metropolitan-Indikator-Beschreibung": "Metropolitan",
      "Anbieter-Verhältnisziel": null,
      "Bevölkerungsanteil unterhalb der Armutsgrenze": null,
      "HPSA-Punktzahl": 9,
      "HPSA-Knappheit": 0.0,
      "Fachklassen-Nummer": 1,
      "Fachklassenbeschreibung": "Primary Care",
      "Quell-ID der Komponente": "14099940N2",
      "Quellname der Komponente": "Shawnee Health Center",
      "Statuscode der Komponente": "0",
      "Komponentenstatusbeschreibung": "Unknown",
      "Typcode der Komponente": "UNK",
      "Komponenten-Typbeschreibung": "Unknown",
      "Komponenten-Staat-Abkürzung": null,
      "Komponenten-Postleitzahl": null,
      "Bezeichnungsdatum der Komponente": "NaT",
      "Bezeichnungsdatum-Text der Komponente": null,
      "Letzte Bezeichnungsaktualisierung der Komponente": "NaT",
      "Geografie-ID": "POINT",
      "Kreis-FIPS-Code": 125,
      "Kreisname": "Pottawatomie",
      "Staat-Kreis-FIPS": "40125",
      "Staat-FIPS": "40",
      "Staat-Abkürzung_2": "OK",
      "Staatsname": "Oklahoma",
      "Hauptstaatsname": "Oklahoma",
      "Hauptstaats-FIPS": 40,
      "Primäre HHS-Regionsname": "Region VI",
      "US-Mexiko-Grenz-Kreis": "N",
      "US-Mexiko-Grenzgebiet 100 km": "N",
      "Erstellungsdatum des Data-Warehouse-Datensatzes": "2019-12-16",
      "Erstellungsdatum-Text des Data-Warehouse-Datensatzes": "2019-12-16",
      "HPSA-Name": "Shawnee Health Center",
      "Name der HPSA-Komponente": "Shawnee Health Center",
      "Bezeichnungsunterbrechung": "N",
      "Geokodierung Primäres X": -96.92613002,
      "Geokodierung Primäres Y": 35.29191891,
      "HPSA-Bevölkerungsart-Code": null,
      "HPSA-Bevölkerungsart-Beschreibung": null,
      "HPSA-Zivile Bevölkerung": null,
      "Gemeindename mit Staat-Abkürzung": "Shawnee",
      "Gemeinsame Postleitzahl": 74801,
      "Gemeinsamer Kreisname": "Pottawatomie County, OK",
      "Gemeinsamer Staat-Kreis-FIPS": "40125",
      "Gemeinsame Staatsabkürzung": "OK",
      "Gemeinsamer Staatsname": "Oklahoma",
      "Gemeinsamer Staats-FIPS": "40",
      "Regionsname": "Region VI",
      "HPSA-Rückzugsdatum": "NaT",
      "HPSA-Rückzugsdatum-Text": null,
      "Anbietertyp": null,
      "Ländlicher Status-Code": "R",
      "Beschreibung des ländlichen Status": "Rural",
      "Beschreibung des HPSA-Bevölkerungstyps": "Indian, Tribal and Urban Indian Organizations",
      "BHCMIS-Organisations-ID": null
    }
  ]
}