{
  "table_name": "PLACES_DISTRICT_OF_COLUMBIA",
  "table_fullname": "GEO_OPENSTREETMAP_CENSUS_PLACES.GEO_US_CENSUS_PLACES.PLACES_DISTRICT_OF_COLUMBIA",
  "column_names": [
    "hauptstadt_msa",
    "ort_gnis_code",
    "interner_punkt_geom",
    "interner_punkt_lon",
    "funktioneller_status",
    "lsad_code",
    "wasserfläche_meter",
    "interner_punkt_lat",
    "ort_fips_code",
    "landfläche_meter",
    "name_lsad",
    "ort_name",
    "bundesland_fips_code",
    "ort_geom",
    "ort_id",
    "hauptstadt_ne",
    "fips_klassencode"
  ],
  "column_types": [
    "BOOLEAN",
    "TEXT",
    "BINARY",
    "FLOAT",
    "TEXT",
    "TEXT",
    "NUMBER",
    "FLOAT",
    "TEXT",
    "NUMBER",
    "TEXT",
    "TEXT",
    "TEXT",
    "BINARY",
    "TEXT",
    "BOOLEAN",
    "TEXT"
  ],
  "description": [
    "Gibt an, ob ein Ort die Hauptstadt für ein metropolitanes oder mikropolitanes statistisches Gebiet ist. Die Polygone, die metropolitanes und mikropolitanes statistisches Gebiet definieren, sind in `bigquery-public-data.geo_us_boundaries.us_msa` verfügbar",
    "Aktueller GNIS-Code des Ortes",
    "Geografische Darstellung des internen Punktes des Staates, der der Punkt ist, der am nächsten zum geografischen Zentrum des Staates liegt",
    "Längengrad des internen Punktes des Ortes, der der Punkt ist, der am nächsten zum geografischen Zentrum des Ortes liegt",
    "Aktueller Funktionsstatuscode. Eine vollständige Liste der möglichen Ergebnisse kann unter https://www.census.gov/geo/reference/funcstat.html gefunden werden",
    "Aktueller rechtlicher/statistischer Gebietsbeschreibungsscode für jeden Ort. Dies hilft, Census-Designated-Places (CDPs) von eingegliederten Orten zu unterscheiden, die rechtliche Einheiten sind, sowie andere Unterschiede. Census-LSAD-Codes und ihre Beschreibungen können in `bigquery-public-data.census_lsad_codes.lsad_codes` gefunden werden",
    "Fläche des Ortes, die aus Wasser besteht, in Quadratmetern",
    "Breitengrad des internen Punktes des Ortes, der der Punkt ist, der am nächsten zum geografischen Zentrum des Ortes liegt",
    "Fünfstelliger FIPS-Code für den angegebenen Ort",
    "Fläche des Ortes, die aus Land besteht, in Quadratmetern",
    "Aktueller Name und die übersetzte rechtliche/statistische Gebietsbeschreibung für den Ort",
    "Vollständiger Textname des Ortes",
    "Zweistelliger FIPS-Code, der jeden Staat eindeutig identifiziert. Staatennamen und ihre entsprechenden FIPS-Codes sind als BigQuery-Public-Dataset verfügbar: `bigquery-public-data.census_fips_codes.states_2016`",
    "Geografische Darstellung des Polygons, das den Umfang jedes Ortes definiert. Diese Spalte sollte als GEO-Spalte für die Visualisierung in BigQuery Geo Viz verwendet werden",
    "Eindeutiger Identifikator für jeden Ort. Dies ist eine Kombination des aktuellen Staat-FIPS-Codes und des Ort-FIPS-Codes",
    "Gibt an, ob ein Ort die Hauptstadt für ein New-England-Stadt- und Stadtgebiet ist",
    "Aktueller FIPS-Klassencode"
  ],
  "sample_rows": []
}