{
  "sample_rows": [
    {
      "ID_DE_FIL_DE_COMMERCE": "UK-aHR0cHM6Ly93d3cuY29udHJhY3RzZmluZGVyLnNlcnZpY2UuZ292LnVrL05vdGljZS9mZjlkNDkzNi0xMzNkLTQyYzktYmYwYi1jYTdkNDkyM2ZmMDA",
      "TITRE_DE_FIL_DE_COMMERCE": "263_25 Total Cleaning Service Solutions",
      "DESCRIPTION_DE_FIL_DE_COMMERCE": "The framework intends to provide a national solution that offers customers a range of cleaning services including general cleaning, deep and specialist cleaning, and decontamination systems and services. The framework is split into the following Lots:\r\n\r\n• Lot 1 - General Cleaning Services\r\n• Lot 2 - Deep and Specialist Cleaning Services\r\n• Lot 3A - Hydrogen Peroxide Vapour (HPV) Decontamination Systems\r\n• Lot 3B - Ultraviolet-C (UVC) Decontamination Systems\r\n• Lot 3C - Hydrogen Peroxide Vapour (HPV) Decontamination Services\r\n• Lot 3D - Ultraviolet-C (UVC) Decontamination Services\r\n\r\nLots 1, 2, 3C and 3D will be awarded on a regional basis. Lots 3A and 3B will be awarded on a national basis.\r\n\r\nThe framework agreement has the option to extend for up to a further 24 months. The total estimated value stated includes the option period.\r\n\r\nESPO shall monitor the financial stability of the awarded Suppliers during the period of the Framework Agreement by reference to credit ratings agency reports. ESPO shall obtain a credit score for the Supplier on or before the Framework Start Date as a base score.\r\n\r\nTo tender:\r\n(a) Go to https://www.eastmidstenders.org/; (b) Register (if not already registered on ProContract); (c) Search for tender opportunity '263_25' (via \"View Opportunities\" from the 'EastMidsTenders' Portal); (d) Express an interest; (e) Download the tender documents (from the ProContract Activity summary screen, once an Expression of interest has been completed).\r\n\r\nAdditional information: As a Central Purchasing Body as defined in the Public Contracts Regulations 2015, the Framework Agreement is open for use by Public Bodies (defined at https://www.espo.org/amfile/file/download/file/9608/) that also fall into one of the following classifications of user throughout all administrative regions of the UK: Local Authorities; Educational Establishments (including Academies); Central Government Departments and Agencies; Police, Fire & Rescue and Coastguard Emergency Services; NHS and HSC Bodies, including Ambulance Services; Registered Charities; Registered Social Landlords; The Corporate Office of the House of Lords, The Corporate Officer of the House of Commons; or any public body established by or under the Scotland Act 1998 or any Act of the Scottish Parliament. Details of the classification of end user establishments and geographical areas are available at: https://www.espo.org/legal.\r\n\r\nESPO has established a commercial trading company, ESPO Trading Limited, whose target clients are third sector organisations such as national and local charities, public sector mutual organisations and other organisations involved in the delivery of services to or for the public sector. The successful Supplier may be asked to enter into an additional separate framework agreement (the Second Framework) with ESPO Trading Limited on materially similar terms to that found in the tender pack to be entered into by ESPO itself.\r\n\r\nAny Second Framework agreement will be a purely commercial agreement and will, for the avoidance of doubt, not be governed by the Public Contract Regulations 2015 or other public procurement legislation. ESPO Trading Limited may enter into the second framework agreement with the successful supplier and make it available to third sector clients who themselves are not required to follow the Public Contracts Regulations 2015 or other public procurement legislation. Accordingly, this is provided for bidders information only.\r\n\r\nAn eAuction process may be used to award subsequent call off contracts following the reopening of competition among the parties to the Framework Agreement.",
      "URL_DE_FIL_DE_COMMERCE": "https://www.contractsfinder.service.gov.uk/Notice/ff9d4936-133d-42c9-bf0b-ca7d4923ff00",
      "DATE_DE_DEBUT_DE_CONTRAT": "2025-01-01",
      "DATE_DE_FIN_DE_CONTRAT": "2026-12-31",
      "DATE_DE_DEBUT_D_APPEL_D_OFFRES": null,
      "DATE_DE_FIN_D_APPEL_D_OFFRES": "2024-10-08",
      "DATE_DE_PUBLICATION": "2024-08-27",
      "ID_GEO_PAYS": "country/GBR"
    },
    {
      "ID_DE_FIL_DE_COMMERCE": "UK-aHR0cHM6Ly93d3cuY29udHJhY3RzZmluZGVyLnNlcnZpY2UuZ292LnVrL05vdGljZS8xOGVjMjk0MC0wY2Q3LTRhM2UtOGVjMy05OTQyYjNhOTg2MmQ",
      "TITRE_DE_FIL_DE_COMMERCE": "Broadland Development Services Homes for the Future Framework",
      "DESCRIPTION_DE_FIL_DE_COMMERCE": "Text to be corrected in the original notice:\r\n        Place of text to be modified: Section 2.1 - contractors are to be aware that information provided in Section II 2.4) Description of Procurement for Lot 1 is also applicable for Lot 2.\r\n        Instead of: Non Applicable\r\n        Read: Bidders are to read the current content in II.2.4 for Lot 1 which is also applicable to Lot 2.\r\n        Place of text to be modified: Section 2.1 - contractors are to be aware that information provided in Section II 2.4) Description of Procurement for Lot 1 is also applicable for Lot 3.\r\n        Instead of: Non Applicable\r\n        Read: Bidders are to read the current content in II.2.4 for Lot 1 which is also applicable to Lot 3.\r\n        Other additional information: The basis on which the market engagement exercise is carried out is as follows: BDS is requesting feedback and whilst the views from the market sector are important, BDS may choose not to consider or implement any or all of the suggestions made through this process. If beneficial, BDS may also undertake further related market engagement in the future as refinement of the approach continues. All information provided on BDS's current thinking as part of the market engagement exercise (including th\r\n        This notice is published to advertise a pre-procurement engagement being conducted by Broadland Development Services (BDS) - the development arm of Broadland Housing Association (BHA), a registered provider of Social Housing and Broadland St Benedicts Limited. This procurement is for a Main Contractor Framework and will be used to facilitate mini-competition (and by exception direct award) tender exercises amongst framework contractors for planned developments over an (up to) 5-year period. All framework projects will focus on place making, low operation / net zero carbon and biodiversity - to create sustainable communities. There is anticipated to be 10 projects to be procured under this framework. The majority of projects will be a construction value in the region £5m to £15m and be in Norfolk and North-Suffolk, UK. BDS are keen to hear from Contractor of all experience levels and those who share BDS values, so an appropriate ITT can be developed aligned to the skills and capabilities of the market. Broadland Development Services (BDS) is the development arm of Broadland Housing Association (BHA), a registered provider of Social Housing. BHA was formed in 1963 and built the first scheme, at Shipfield in Norwich, in 1967. Today, BHA provide more than 5,500 quality homes across Norfolk and north Suffolk. New developments are operationally low carbon to reduce residents bills and provide a sustainable place for communities and nature to thrive. BDS are the contracting authority under Regulation 2 of the Public Contracts Regulations 2015 (\"PCR 2015\"). The Framework will be available for use by BDS and external clients where BDS provide a Development Agency function. BDS is seeking expressions of interest and feedback from interested parties in respect of a forthcoming p",
      "URL_DE_FIL_DE_COMMERCE": "https://www.contractsfinder.service.gov.uk/Notice/18ec2940-0cd7-4a3e-8ec3-9942b3a9862d",
      "DATE_DE_DEBUT_DE_CONTRAT": "2025-05-01",
      "DATE_DE_FIN_DE_CONTRAT": "2030-04-30",
      "DATE_DE_DEBUT_D_APPEL_D_OFFRES": null,
      "DATE_DE_FIN_D_APPEL_D_OFFRES": "2024-09-16",
      "DATE_DE_PUBLICATION": "2024-08-22",
      "ID_GEO_PAYS": "country/GBR"
    },
    {
      "ID_DE_FIL_DE_COMMERCE": "UK-aHR0cHM6Ly93d3cuY29udHJhY3RzZmluZGVyLnNlcnZpY2UuZ292LnVrL05vdGljZS8yYWE5M2QxNS1iMWQxLTQ5OWYtYjZhMS00NzNlNmEyNjQ4ZmU",
      "TITRE_DE_FIL_DE_COMMERCE": "Biowaste training - Aerobic and anaerobic treatment",
      "DESCRIPTION_DE_FIL_DE_COMMERCE": "Biowaste training - Aerobic and anaerobic treatment",
      "URL_DE_FIL_DE_COMMERCE": "https://www.contractsfinder.service.gov.uk/Notice/2aa93d15-b1d1-499f-b6a1-473e6a2648fe",
      "DATE_DE_DEBUT_DE_CONTRAT": "2024-10-23",
      "DATE_DE_FIN_DE_CONTRAT": "2027-10-22",
      "DATE_DE_DEBUT_D_APPEL_D_OFFRES": null,
      "DATE_DE_FIN_D_APPEL_D_OFFRES": "2024-09-23",
      "DATE_DE_PUBLICATION": "2024-08-15",
      "ID_GEO_PAYS": "country/GBR"
    },
    {
      "ID_DE_FIL_DE_COMMERCE": "UK-aHR0cHM6Ly93d3cuY29udHJhY3RzZmluZGVyLnNlcnZpY2UuZ292LnVrL05vdGljZS82YWI4YzNlZS0yMmEwLTQwZjUtOGMxOC0yODhkNjdiMzQ1ODU",
      "TITRE_DE_FIL_DE_COMMERCE": "PS093c-23 Property Rationalisation Civic Offices",
      "DESCRIPTION_DE_FIL_DE_COMMERCE": "Equans, on behalf of North East Lincolnshire Council (NELC) are seeking the services of a suitably qualified contractor to carry out minor demolition works and reinstatement of an element of the historic facade. Restoration works to include masonry brickwork, ashlar stonework and reinstatement and repair of historic ironwork. Other works include hard and soft landscaping, fencing, minor internal alterations and associated mechanical and electrical works including the installation of a new wireless fire alarm system.",
      "URL_DE_FIL_DE_COMMERCE": "https://www.contractsfinder.service.gov.uk/Notice/6ab8c3ee-22a0-40f5-8c18-288d67b34585",
      "DATE_DE_DEBUT_DE_CONTRAT": "2024-10-21",
      "DATE_DE_FIN_DE_CONTRAT": "2025-01-27",
      "DATE_DE_DEBUT_D_APPEL_D_OFFRES": null,
      "DATE_DE_FIN_D_APPEL_D_OFFRES": "2024-08-29",
      "DATE_DE_PUBLICATION": "2024-07-23",
      "ID_GEO_PAYS": "country/GBR"
    },
    {
      "ID_DE_FIL_DE_COMMERCE": "UK-aHR0cHM6Ly93d3cuY29udHJhY3RzZmluZGVyLnNlcnZpY2UuZ292LnVrL05vdGljZS8wMjhhMDE2OC05MGE3LTQ3NmEtODdkOS1hNTE1ZWMzN2U4OTI",
      "TITRE_DE_FIL_DE_COMMERCE": "NOE CPC Total Waste Management Services III",
      "DESCRIPTION_DE_FIL_DE_COMMERCE": "This framework agreement is split into 11 Lots covering the main waste services contracted by the NHS and wider public sector bodies. It aims to provide a compliant route to market for contracting authorities for a safe, sustainable, and efficient waste management service covering:\r\nLot 1A - General/Domestic Waste (Hazardous & Non-Hazardous)\r\nLot 1B - Food Waste\r\nLot 1C - WEEE Waste\r\nLot 2A - Healthcare Offensive Waste\r\nLot 2B - Healthcare Alternative Treatment\r\nLot 2C - Healthcare High Temperature Incineration\r\nLot 3 - Reusable Sharps & Related Waste\r\nLot 4 - Washroom Waste\r\nLot 5A - Confidential Shredding\r\nLot 5B - Secure IT (WEEE) Recycling & Recovery\r\nLot 5C - Uniforms & Textiles\r\n\r\nAdditional information: \r\nTo express interest and participate in the tender, please register and apply via Atamis e-sourcing portal https://health-family.force.com/s/Welcome.\r\n\r\nShould Tenderers have any queries, or having problems using the portal, they should contact Helpdesk at:\r\n\r\nPhone: 0800 9956035\r\n\r\nE-mail: support-health@atamis.co.uk",
      "URL_DE_FIL_DE_COMMERCE": "https://www.contractsfinder.service.gov.uk/Notice/028a0168-90a7-476a-87d9-a515ec37e892",
      "DATE_DE_DEBUT_DE_CONTRAT": "2025-01-17",
      "DATE_DE_FIN_DE_CONTRAT": "2029-01-16",
      "DATE_DE_DEBUT_D_APPEL_D_OFFRES": null,
      "DATE_DE_FIN_D_APPEL_D_OFFRES": "2024-09-10",
      "DATE_DE_PUBLICATION": "2024-07-22",
      "ID_GEO_PAYS": "country/GBR"
    }
  ],
  "table_name": "INTERNATIONAL_TRADE_ADMINISTRATION_TRADE_LEADS_INDEX",
  "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.INTERNATIONAL_TRADE_ADMINISTRATION_TRADE_LEADS_INDEX",
  "column_names": [
    "ID_DE_FIL_DE_COMMERCE",
    "DATE_DE_FIN_DE_CONTRAT",
    "DESCRIPTION_DE_FIL_DE_COMMERCE",
    "DATE_DE_DEBUT_DE_CONTRAT",
    "DATE_DE_FIN_D_APPEL_D_OFFRES",
    "DATE_DE_DEBUT_D_APPEL_D_OFFRES",
    "URL_DE_FIL_DE_COMMERCE",
    "DATE_DE_PUBLICATION",
    "TITRE_DE_FIL_DE_COMMERCE",
    "ID_GEO_PAYS"
  ],
  "column_types": [
    "TEXT",
    "DATE",
    "TEXT",
    "DATE",
    "DATE",
    "DATE",
    "TEXT",
    "DATE",
    "TEXT",
    "TEXT"
  ],
  "description": [
    "Identifiant unique de l'Administration du commerce international (ITA) pour spécifier un lead.",
    "Date à laquelle le contrat se termine, lorsque tous les services ou biens doivent être livrés et les travaux achevés.",
    "Texte en forme longue qui spécifie les détails du lead.",
    "Date à laquelle le contrat commence et les travaux associés au contrat doivent commencer.",
    "Date à laquelle le processus d'appel d'offres se termine.",
    "Date à laquelle les offres commencent à être acceptées.",
    "URL vers les détails du lead.",
    "Date à laquelle le lead a été rendu public ou annoncé aux enchérisseurs potentiels par l'Administration du commerce international (ITA).",
    "Titre qui identifie un lead.",
    "Identifiant géographique unique pour le pays associé au contrat."
  ]
}