{
  "table_name": "hap_hourly_summary",
  "table_fullname": "bigquery-public-data.epa_historical_air_quality.hap_hourly_summary",
  "column_names": [
    "Staatscode",
    "Kreiscode",
    "Standortnummer",
    "Parametercode",
    "Ansprechpartner",
    "Breitengrad",
    "Längengrad",
    "Datum",
    "Parametername",
    "Ortsdatum",
    "Ortszeit",
    "GMT-Datum",
    "GMT-Uhrzeit",
    "Probenmessung",
    "Maßeinheiten",
    "Nachweisgrenze",
    "Unsicherheit",
    "Qualifikator",
    "Verfahrenstyp",
    "Verfahrenkodex",
    "Verfahrensname",
    "Staatsname",
    "Kreisname",
    "Letzte Änderung"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "FLOAT64",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE"
  ],
  "nested_column_names": [
    "Staatencode",
    "Kreiscode",
    "Standortnummer",
    "Parametercode",
    "Ansprechpartner",
    "Breitengrad",
    "Längengrad",
    "Datum",
    "Parametername",
    "Ortsdatum",
    "Ortszeit",
    "GMTDatum",
    "GMTZeit",
    "Probenmessung",
    "Maßeinheiten",
    "Nachweisgrenze",
    "Unsicherheit",
    "Qualifizierer",
    "Verfahrenstyp",
    "VerfahrenCode",
    "Verfahrenname",
    "Staatsname",
    "Kreisname",
    "Änderungsdatum"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "FLOAT64",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE"
  ],
  "description": [
    "Der FIPS-Code des Bundesstaates, in dem sich die Messstelle befindet.",
    "Der FIPS-Code des Landkreises, in dem sich die Messstelle befindet.",
    "Eine eindeutige Nummer innerhalb des Landkreises, die die Messstelle identifiziert.",
    "Der AQS-Code, der dem vom Monitor gemessenen Parameter entspricht.",
    "Dies ist der “Parameter Occurrence Code”, der verwendet wird, um verschiedene Instrumente zu unterscheiden, die denselben Parameter am selben Standort messen.",
    "Der geografische Breitengrad der Messstelle nördlich des Äquators, gemessen in Dezimalgraden.",
    "Der geografische Längengrad der Messstelle östlich des Nullmeridians, gemessen in Dezimalgraden.",
    "Das Datum, das mit den Breitengrad- und Längengradmessungen verknüpft ist.",
    "Der Name oder die Beschreibung, die in AQS dem vom Monitor gemessenen Parameter zugewiesen wird. Parameter können Schadstoffe oder Nicht-Schadstoffe sein.",
    "Das Kalenderdatum der Zusammenfassung. Alle täglichen Zusammenfassungen beziehen sich auf den lokalen Standardtag (Mitternacht bis Mitternacht) an der Messstelle.",
    "Die Uhrzeit, zu der die Probenahme im 24-Stunden-Format in der lokalen Standardzeit begann.",
    "Das Kalenderdatum der Probe in Greenwich Mean Time.",
    "Die Uhrzeit, zu der die Probenahme im 24-Stunden-Format in Greenwich Mean Time begann.",
    "Der gemessene Wert in den Standard-Einheiten des Parameters.",
    "Die Maßeinheit des Parameters. QAD liefert Daten stets in den Standardeinheiten des Parameters zurück. Einsender dürfen Daten in beliebigen Einheiten melden, und die EPA wandelt sie in eine Standardeinheit um, damit wir die Daten in Berechnungen verwenden können.",
    "Die Nachweisgrenze der Methode. Die minimale Probenkonzentration, die für das Messgerät und die Methode nachweisbar ist. Hinweis: Falls Proben unter diesem Grenzwert gemeldet werden, können sie durch 1/2 des MDL ersetzt worden sein.",
    "Die gesamte Messunsicherheit, die mit einer gemeldeten Messung verbunden ist, wie von der meldenden Behörde angegeben.",
    "Probenwerte können Qualifikatoren enthalten, die angeben, warum sie fehlen oder ungewöhnlich sind. Arten von Qualifikatoren sind: Nullwerte, außergewöhnliches Ereignis, natürliche Ereignisse und Qualitätssicherung. Der jeweils höchste Qualifikator, falls vorhanden, wird in diesem Feld beschrieben.",
    "Ein Hinweis darauf, ob die zur Datenerhebung verwendete Methode ein FRM (Federal Reference Method), äquivalent zu einem FRM, eine genehmigte regionale Methode oder keines davon (non-federal reference method) ist.",
    "Ein internes Systemkennzeichen, das die Methode (Prozesse, Ausrüstung und Protokolle) angibt, die bei der Erhebung und Messung der Probe verwendet wurde. Der Methodenname steht in der nächsten Spalte.",
    "Eine kurze Beschreibung der Prozesse, Ausrüstung und Protokolle, die bei der Erhebung und Messung der Probe verwendet wurden.",
    "Der Name des Bundesstaates, in dem sich die Messstelle befindet.",
    "Der Name des Landkreises, in dem sich die Messstelle befindet.",
    "Das Datum, an dem zuletzt numerische Werte in diesem Datensatz im AQS-Datensystem aktualisiert wurden."
  ],
  "sample_rows": []
}