{
  "table_name": "pm25_nonfrm_hourly_summary",
  "table_fullname": "bigquery-public-data.epa_historical_air_quality.pm25_nonfrm_hourly_summary",
  "column_names": [
    "Staatscode",
    "Kreiscode",
    "Standortnummer",
    "Parametercode",
    "Ansprechpartner",
    "Breitengrad",
    "Längengrad",
    "Datum",
    "Parametername",
    "Lokales Datum",
    "Lokale Zeit",
    "GMT-Datum",
    "GMT-Zeit",
    "Probenmessung",
    "Maßeinheiten",
    "Nachweisgrenze",
    "Unsicherheit",
    "Qualifizierer",
    "Verfahrenstyp",
    "Verfahren-Code",
    "Verfahrenname",
    "Staatsname",
    "Kreisname",
    "Datum der letzten Änderung"
  ],
  "column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "FLOAT64",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE"
  ],
  "nested_column_names": [
    "Staatencode",
    "Kreiscode",
    "Standortnummer",
    "Parametercode",
    "Ansprechpartner",
    "Breitengrad",
    "Längengrad",
    "Datum",
    "Parametername",
    "Lokales Datum",
    "Ortszeit",
    "GMT Datum",
    "GMT Zeit",
    "Probenmessung",
    "Maßeinheiten",
    "Nachweisgrenze",
    "Unsicherheit",
    "Qualifikator",
    "Verfahrenstyp",
    "Verfahrencode",
    "Verfahrenname",
    "Staatname",
    "Kreisname",
    "Letztes Änderungsdatum"
  ],
  "nested_column_types": [
    "STRING",
    "STRING",
    "STRING",
    "INT64",
    "INT64",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "DATE",
    "STRING",
    "DATE",
    "STRING",
    "FLOAT64",
    "STRING",
    "FLOAT64",
    "FLOAT64",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "STRING",
    "DATE"
  ],
  "description": [
    "Der FIPS-Code des Bundesstaates, in dem sich der Monitor befindet.",
    "Der FIPS-Code des Landkreises, in dem sich der Monitor befindet.",
    "Eine eindeutige Nummer innerhalb des Landkreises, die die Messstelle kennzeichnet.",
    "Der AQS-Code, der dem vom Monitor gemessenen Parameter entspricht.",
    "Dies ist der \"Parameter Occurrence Code\", der verwendet wird, um verschiedene Instrumente zu unterscheiden, die denselben Parameter am selben Standort messen.",
    "Der geographische Breitengrad des Messstandorts nördlich des Äquators, gemessen in Dezimalgrad.",
    "Der geographische Längengrad des Messstandorts östlich des Nullmeridians, gemessen in Dezimalgraden.",
    "Das Datum, das mit den Breitengrad- und Längengradmessungen verknüpft ist.",
    "Der in AQS dem vom Monitor gemessenen Parameter zugewiesene Name oder die Beschreibung. Parameter können Schadstoffe oder Nicht-Schadstoffe sein.",
    "Das Kalenderdatum der Zusammenfassung. Alle täglichen Zusammenfassungen beziehen sich auf den lokalen Standardtag (Mitternacht bis Mitternacht) am Messort.",
    "Die Uhrzeit, zu der die Probenahme in der lokalen Standardzeit im 24-Stunden-Format begann.",
    "Das Kalenderdatum der Probe in Greenwich Mean Time.",
    "Die Uhrzeit, zu der die Probenahme im 24-Stunden-Format in Greenwich Mean Time begann.",
    "Der gemessene Wert in den Standardeinheiten für den Parameter.",
    "Die Maßeinheit des Parameters. QAD gibt Daten stets in den Standardeinheiten des Parameters zurück. Einreicher dürfen Daten in jeder Einheit melden, und EPA wandelt sie in eine Standardeinheit um, damit wir die Daten in Berechnungen verwenden können.",
    "Die Nachweisgrenze der Methode. Die minimale nachweisbare Konzentration, die für den Monitor und die Methode nachweisbar ist. Hinweis: Falls Proben unter diesem Niveau gemeldet werden, wurden sie möglicherweise durch 1/2 der MDL ersetzt.",
    "Die mit einer gemeldeten Messung verbundene Gesamtmessunsicherheit, wie von der meldenden Behörde angegeben.",
    "Probenwerte können Qualifizierer enthalten, die angeben, warum sie fehlen oder ungewöhnlich sind. Typen von Qualifizierern sind: Nulldaten, außergewöhnliches Ereignis, natürliche Ereignisse und Qualitätssicherung. Der höchste Rang des Qualifizierers, falls vorhanden, wird in diesem Feld beschrieben.",
    "Ein Hinweis darauf, ob die zur Datenerhebung verwendete Methode eine föderale Referenzmethode (FRM) ist, äquivalent zu einer FRM, eine genehmigte regionale Methode oder keine der oben genannten (nicht-föderale Referenzmethode).",
    "Ein internes Systemcode, der die Methode (Prozesse, Ausrüstung und Protokolle) bezeichnet, die bei der Erhebung und Messung der Probe verwendet wurde. Der Methodenname befindet sich in der nächsten Spalte.",
    "Eine kurze Beschreibung der bei der Probenentnahme und Messung der Probe verwendeten Prozesse, Geräte und Protokolle.",
    "Der Name des Bundesstaates, in dem sich die Messstelle befindet.",
    "Der Name des Landkreises, in dem sich die Messstelle befindet.",
    "Das Datum der letzten Aktualisierung aller numerischen Werte in diesem Datensatz im AQS-Datensystem."
  ],
  "sample_rows": []
}